{"recipe_name":"Apple and toffee crumble pie ","author":"Tom Kerridge","programme":"Tom Kerridge's Proper Pub Food","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/apple_and_toffee_crumble_76635_16x9.jpg","method":"To make the toffee, line a tray with baking parchment and grease it with oil.  In a pan, bring 125ml\/4fl oz water to the boil with the dark brown sugar.  When the sugar is dissolved, remove from the heat and add the cream of tartar, golden syrup and black treacle. Return to the heat and cook until it reaches 140C\/284F on a sugar thermometer. (This will take a while, but be patient and don’t leave it unattended - it can burn very easily!) Once it reaches 140C\/284F, pour the mixture straight into the lined tin and leave to cool. For the pastry, preheat the oven to 150C\/300F\/Gas 2. Cream together the butter and sugar in an electric mixer. Add the egg yolk and then the sifted flour. Mix to combine but do not over work. Wrap the pastry in cling film and leave to rest in the fridge for an hour. After resting, roll out the pastry on a lightly floured work surface to about 5mm\/¼in thick. Line a 20cm\/8in tart ring with the pastry and gently push into the base. Line with cling film and fill with baking beans or rice (NB: Not every type of cling film is suitable for using with all foods. Check the description on the packaging to see what foods and what temperatures it can be used with. If unsure, use tin foil or baking paper instead). Place in the fridge for an hour to rest again.  Bake in the preheated oven for 35 minutes, then remove the baking beans and cling film and bake for another 5-10 minutes, or until cooked all the way through and a light golden-brown colour. Remove from the oven and set aside to cool. For the filling, place the butter, sugar and orange zest in a pan. Heat until the butter and sugar are melted. Add the bramley apples and the cinnamon and cook until the apple is very soft and turning into a purée.  Add the eating apples and cook for a further 1-2 minutes, then remove from the heat. Pour the mixture into a colander or sieve to remove any excess liquid. Discard the cinnamon stick and leave the apples to cool.  For the crumble topping, preheat the oven to 180C\/350F\/Gas 4.  Mix the plain flour, caster sugar, ground almonds, flakes almonds and butter together with your hands, using your fingertips to rub the dry ingredients into the butter. Place this mixture on a baking tray and bake for approximately 20 minutes, or until golden-brown and crumbly. Stir the crumble every five minutes so that it cooks evenly. Remove from the oven and leave to cool. To assemble the pie, spoon the apple mixture into the cooked pastry case. Break the toffee into chunks and place a few over the top of the apple (you will not need all the toffee). Completely cover the apple mixture with the toasted crumble and the dot a few more pieces of toffee on top.  Bake in the oven at 180C\/350F\/Gas 4 for 10-12 minutes, or until the filling is bubbling and the toffee has melted.  Serve with custard, crème fraîche, ice cream or clotted cream….or all four! ","ingredients":" oil, for greasing,  450g\/1lb soft dark brown sugar,  5g\/¼oz cream of tartar,  100g\/3½oz golden syrup,  130g\/4½oz black treacle,  225g\/8oz butter,  115g\/4oz sugar,  1 free-range egg yolk,  400g\/14oz flour, sifted,  100g\/3½oz butter,  100g\/3½oz sugar,  1 orange, zest only,  4 bramley apples, peeled and diced,  1 cinnamon stick,  4 eating apples (such as Cox or Royal Gala), peeled and diced ,  200g\/7oz plain flour,  100g\/3½oz caster sugar,  35g\/1¼oz ground almonds,  10g\/¼oz flaked almonds,  80g\/2½oz butter, softened,  custard, crème fraîche, ice cream or clotted cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/apple_and_toffee_crumble_76635"}