{"recipe_name":"Surf and turf with wilted spinach, watercress and a mustard sauce","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Crack the lobster claws, extracting the meat in one whole piece if possible. Cut the tail in half lengthways, lift the meat out, and reserve both the meat and shell. Season the steak with salt and freshly ground black pepper. Heat a frying pan until hot, add a little of the butter and the oil and fry the steak on each side for 2-3 minutes (for medium), basting with the butter as it cooks. Remove the pan from the heat and set aside to rest for 2-3 minutes, turn the meat over and rest for a further 2-3 minutes. Meanwhile heat some of the butter in a second pan and warm the lobster meat through, basting with the pan juices. Season with salt, freshly ground black pepper and lemon juice. Heat a frying pan until hot, add the remaining butter and oil and fry the spinach and watercress until just wilted. For the sauce, melt the butter in a saucepan and fry the shallot for 2-3 minutes, or until just softened. Add the wine and cook until the volume of the liquid has reduced by half. Add the cream and reduce by half again. Stir in the grain mustard, tomatoes and chives and warm through. Season to taste with salt and freshly ground black pepper. To serve, arrange the lobster shells on a plate and place the lobster meat inside the shells. Place the fillet steak alongside and the lobster claw on top. Finally, add some spinach and watercress and drizzle over the sauce. ","ingredients":" 2 x 500g\/1lbs 2oz cooked lobsters,  4 x 175g\/6oz fillet steaks,  75g\/3oz butter,  2 tbsp olive oil,  1 lemon, juice only,  250g\/9oz spinach,  250g\/9oz watercress, leaves picked,  50g\/2oz butter,  2 shallots, finely diced,  150ml\/5fl oz white wine,  300ml\/10fl oz double cream,  2 tbsp grain mustard,  2 tomatoes, skinned, deseeded, chopped,  2 tbsp chives, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/surf_and_turf_with_46844"}