{"recipe_name":"Boxty with mackerel","author":"Donal Skehan","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the boxty, put the colcannon (or mash), grated potato and flour in a bowl and mix until combined. Stir in the milk, little by little, until you have a wet dropping consistency. Season with salt and pepper. Heat a frying pan over a medium–high heat. Add a little butter and oil, when the butter begins to foam, spoon heaped tablespoons of the mixture into the frying pan and fry for 3–4 minutes on each side until golden-brown. Remove and place on a warm plate lined with kitchen paper. Repeat with the remaining mixture. Keep the pancakes warm in a low oven, if necessary. For the mackerel, coat the mackerel fillets with a little oil and garlic.  Season with salt and pepper. Heat a frying pan over a high heat and add a splash of oil and the butter. When the butter is foaming, add the mackerel skin-side down and fry for 3–4 minutes until the skin is crisp and the flesh is opaque.  Meanwhile, make the salad. Place the lettuce leaves in a large bowl. Mix the oil, vinegar and mustard in a small bowl. Season with salt and pepper and pour over the leaves. Toss to coat.   Serve the mackerel with the potato pancakes. Finish with a little dill over the pancakes and a squeeze of lemon juice on the fish. ","ingredients":" 250g\/9oz colcannon or mashed potato,  250g\/9oz potatoes (such as Rooster), peeled and grated,  100g\/3½oz plain flour,  125ml\/4fl oz milk,  knob of butter,  rapeseed oil, for frying,  sea salt and freshly ground black pepper,  4 small mackerel, gutted and butterflied or filleted,  2–3 tbsp olive oil ,  3 garlic cloves, finely chopped,  knob of butter,  dill, chopped, to garnish,  1 lemon, juice only, to serve,  ½ head frissee lettuce, inner leaves removed,  3 tbsp olive oil,  1 tbsp white wine vinegar,  1 tsp Dijon mustard","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/boxty_colcannon_pancakes_13555"}