{"recipe_name":"Swahili chicken and papaya salad","author":"Mike Robinson","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Cut the chicken breasts into long strips, squeeze on some lime juice and leave to marinate for a few minutes.  Then grind together the dry ingredients and rub into the chicken strips.  Griddle on both sides for five minutes until scorched and golden.  To make the Swahili sauce, place the lemon grass, ginger, garlic, shallots, chillies, garam masala and turmeric in a heavy-based saucepan and fry until the shallots soften. Next, add the coconut milk and plum tomatoes, season and leave to simmer for five minutes. Next toss together the raw papaya and red onion slices and whisk together the lime juice, olive oil and sweet chilli sauce to make a dressing.  Serve the griddled chicken in a mound, with the Swahili sauce drizzled over the top, and your papaya and red onion salad on the side. Garnish with coriander leaves. ","ingredients":" 4 chicken breasts, each cut into three long strips,  1 tsp crushed black peppercorns,  pinch of cayenne pepper,  1 tsp ground cinnamon,  1 tsp ground ginger,  1 tsp chilli,  1 tsp turmeric,  1 tsp coriander seeds,  1 tsp ground cumin,  1 lime, juice only,  2 tbsp olive oil,  1 lemon grass stalk ,  2.5cm\/1in fresh ginger, chopped,  2 large garlic cloves, crushed,  2 shallots, finely chopped,  2 red chillies, chopped,  1 tsp garam masala,  1 tsp ground turmeric,  400ml\/14fl oz coconut milk,  1 tin of chopped tomatoes ,  1 tbsp of coriander leaves,  1 papaya, peeled and sliced lengthways,  1 red onion, peeled and sliced,  1 lime, juice only ,  olive oil,  dash of sweet chilli sauce.,  rice to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/swahilichickenandpap_71266"}