{"recipe_name":"Boxty with crisp streaky bacon and maple syrup","author":"The Hairy Bikers","programme":"The Hairy Bikers' Food Tour of Britain","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Wrap the grated potato in a clean tea towel and wring well to get rid of any excess liquid.  Transfer the grated potato to a mixing bowl, add the cold mashed potato and mix until well combined. Add the flour and baking powder to the potato mixture and mix until well combined. Stir in the melted butter and season, to taste, with salt and freshly ground black pepper.  Add the milk, a little at a time, to the potato mixture, beating after each addition until the milk has been fully incorporated into the mixture. When all of the milk has been incorporated into the potato mixture, it should resemble a thick, heavy batter. If the mixture is too sticky, add more milk as necessary. Set aside. Meanwhile, heat the oil in a large non-stick frying pan over a medium to high heat. Add the bacon rashers and fry for 6-8 minutes, or until crisp and golden-brown on both sides. Remove from the pan and set aside to drain on kitchen paper.  Add spoonfuls of the boxty batter into the same oil that the bacon was cooked in, leaving enough space around each spoonful for the mixture to spread. Fry the boxties on a medium to high heat for 3-4 minutes on each side, or until the boxties are golden-brown and the grated potato is cooked through. Remove the boxties from the pan using a slotted spoon, set aside to drain on kitchen paper and keep warm. Repeat the process with the remaining boxty mixture.  To serve, divide the boxties equally among four to six serving plates. Place two rashers of crisp streaky bacon alongside each. Drizzle over the maple syrup. ","ingredients":" 500g\/1lb 2oz potato, peeled, grated,  500g\/1lb 2oz cold mashed potato,  420g\/15oz plain flour,  1 heaped tsp baking powder,  1-2 tbsp melted butter,  salt and freshly ground black pepper,  200ml\/7fl oz milk,  1-2 tbsp olive oil,  8-12 rashers smoked streaky bacon,  maple syrup, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/boxtywithcrispstreak_91836"}