{"recipe_name":"Braciole in tomato sauce with green salad and oranges with cracked pepper","author":"Adriana Trigiani","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato sauce, place the puréed tomatoes, tomato paste and water into a large saucepan over a medium heat and bring the mixture to a simmer. Add the garlic salt, freshly ground black pepper and olive oil and stir well. Add the mixed dried Italian herbs and stir well once more. Meanwhile, heat the olive oil a frying pan until hot, then add the pork bone. Season well with the salt and fry, turning occasionally, until browned all over. Add the pork bone to the tomato sauce and cook for 3-4 hours over a very low heat. Remove the pork bone from the sauce and discard. For the braciole, place the steak pieces between two sheets of cling film onto a strong work surface. Using a meat mallet or a rolling pin, pound the steaks to tenderise and flatten out. Place the parsley and the basil into a mini-food processor and blend together to a rough paste. Spread the herb mixture onto the meat. Mix together the breadcrumbs and the chopped garlic in a bowl. Place the breadcrumb mixture onto the meat, pressing it into the herb paste. Add the parmesan and salt and pepper on top of the bread-crumb mixture. Roll the meat pieces up, tuck in the ends, and secure with cooks' string. Heat the olive oil in a frying pan until hot and add the rolled meat pieces. Cook for a minute on each side, until just becoming golden-brown all over. Transfer the meat to the saucepan of tomato sauce, stir in and allow to simmer gently for 45-60 minutes, or until the meat is tender. To serve, remove the meat from the pan and place on a chopping board. Remove the string and allow the meat to rest for about five minutes, then cut the meat into 5cm\/2in thick slices. For the salad, peel the oranges and slice into 5mm\/¼in thick rounds. Remove any pips. Place the oranges on a plate and drizzle with oil and season, to taste, with freshly ground black pepper. Whisk the olive oil and balsamic vinegar together in a large clean bowl. Add the green salad leaves and mix well to coat. To serve, place several slices of the braciole onto plates. Pour a drizzle of tomato sauce over each. Place 2-3 orange slices alongside and top with the dressed salad leaves. ","ingredients":" 1kg\/2lb 2oz tomatoes, puréed in a food processor,  175g\/6oz tomato paste,  425ml\/15fl oz water,  1 tsp garlic salt,  1 tsp freshly ground black pepper,  1 tbsp olive oil,  1 tbsp mixed dried Italian herbs,  110g-175g\/4oz-6oz pork bone with a little meat left on,  ¼ tsp salt, or to taste,  900g\/2lb rump steak, 5mm\/¼in thick, cut into four slices,  1 large bunch flatleaf parsley, roughly chopped,  1 small bunch basil leaves, roughly chopped,  150g\/5oz dried breadcrumbs,  3 tbsp garlic, finely chopped,  150g\/5oz parmesan, freshly grated,  75ml\/3fl oz olive oil,  3 large oranges,  3 tbsp olive oil,  freshly ground black pepper,  2 tbsp extra virgin olive oil,  1 tbsp balsamic vinegar,  large handful mixed green leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bracioleintomatosauc_85462"}