{"recipe_name":"Sweet and sour chicken with egg-fried rice","author":"Cyrus Todiwala","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First prepare the chicken, shred it thinly into 3–4mm thick pieces and place in a bowl (this is easier if you semi-freeze the chicken breast first). Alternatively, cut the chicken into 1cm\/½in cubes. Heat the oil in a large wok. Mix the rest of the chicken ingredients with the chicken until the chicken is well coated with batter. When oil is hot, fry the chicken on a very high heat in batches to prevent the pieces clumping together. This will only take a minute or so if using cubes of chicken, even less if using shredded. Place the cooked chicken on a plate lined with kitchen paper and set aside. To make the sauce, heat the oil in a saucepan. When hot, add the spring onions, peppers, carrot and ginger, keeping the heat high and stirring slowly. When the peppers start to brown, mix in the cucumber and pineapple, then add the stock. Mix the cornflour with a little water to make a paste. When the stock boils, add the sugar, vinegar, tomato purée, onions and tomatoes. Once the liquid comes to the boil, gently pour in the cornflour batter and stir continuously until the liquid thickens. Check the seasoning again and remove from the heat. Add the coriander leaves, if using. For the rice, heat a wok and once hot add the oil. Add the rice and cook for 1–2 minutes. Add the eggs and soy sauce and cook for a further 3–4 minutes or until the rice is piping hot. Finish with salt and pepper, but remember not too much salt as the soy sauce will season the dish. To serve, mix the chicken into the sauce. Pile rice into a small bowl and turn out onto each serving plate to make a neat mound of rice. Arrange the curry around the outside and serve immediately. ","ingredients":" 800g\/1lb 12oz chicken breast, skin removed  ,  sunflower oil, for frying,  1 heaped tsp salt,  1½ tsp white ground pepper,  1–2 tbsp fresh ginger juice,  1–2 tbsp cider or rice wine vinegar,  2-3 tbsp cornflour,  2–3 tbsp potato starch,  2 free-range eggs, depending on the batter you might need more,  2 tbsp oil,  2-3 spring onions, sliced diagonally,  1-2 green peppers, cut into small squares,  1 small carrot, thinly sliced diagonally,  1 tbsp fiely chopped fresh root ginger,  ½ cucumber, cored, halved and sliced diagonally                                                          ,  2 slices canned pineapple, cut into pieces,  400ml\/14fl oz chicken stock,  3 tbsp cornflour,  2-3 tbsp caster sugar,  100ml\/3½fl oz cider or rice vinegar,  2 tbsp tomato purée,  1–2 onions, cut into small squares,  1–2 firm tomatoes, pulp removed and flesh cut into small squares,  handful fresh coriander leaves (optional),  salt and freshly ground black pepper,  2 tbsp oil,  400g\/14oz cooked and cooled basmati rice,  3 free-range eggs, beaten,  2 tbsp light soy sauce,  4 spring onions, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweet_and_sour_chicken_54545"}