{"recipe_name":"Sweet and sour pork","author":"Brian Turner","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a bowl, mix the pork with the dry sherry, soy sauce, sesame oil, five-spice and pinch of salt. Leave to marinade in the fridge for 20 minutes. Fill a deep-fat fryer or a large, deep, heavy-bottomed pan half full with vegetable oil. Heat to 180C (until a breadcrumb sizzles and goes brown when dropped into the oil.). (CAUTION: Hot oil can be dangerous. Don't leave unattended.) In a shallow dish, mix the egg with 2 tablespoons cornflour. Put the remaining cornflour in a separate dish. Dip the pork into the dry cornflour, shake off excess, then coat in the egg batter.  Carefully lower into the hot oil. Take care not to fry too many at once. When golden-brown remove and drain on kitchen paper. For the sauce, put the stock, soy sauce, sesame oil, vinegar and ketchup in a pan and bring to the boil. Add the peppers and spring onions, simmer for 2 minutes. Mix the cornflour with the orange juice and add to the pan to thicken the sauce. Bring to the boil then simmer until thickened. Add the pork, mix well for one minute. For the seaweed, deep-fry the shredded leaves for 1-2 minutes until bright green and crispy. Drain on a plate with kitchen roll and season with sugar and salt. To serve, place the sweet and sour pork in a shallow serving dish with the crispy seaweed on the top and the rice in a separate serving bowl. ","ingredients":" 450g\/1lb pork fillet, cut into 2cm\/他in cubes,  1 tbsp dry sherry,  1 tbsp light soy sauce,  1 tbsp sesame oil,  pinch Chinese five-spice,  vegetable oil, for deep-frying,  1 egg, beaten,  4 tbsp cornflour,  150ml\/5fl oz chicken stock,  1 tbsp dark soy sauce,  1 tbsp sesame seed oil,  1 tbsp cider vinegar,  2 tbsp tomato ketchup,  1 red pepper, cut into 2cm\/他in cubes,  1 green pepper, cut into 2cm\/他in cubes,  4 spring onions, cut into 2cm\/他in sticks,  1 tbsp cornflour,  1 tbsp orange juice,  salt and freshly ground pepper,  2 bok choi, stalks removed, leaves finely shredded,  1 tsp sugar,  1 tsp salt,  cooked basmati rice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweet_and_sour_pork_17770"}