{"recipe_name":"Sweet and sour pork and pineapple with rice omelette","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02ffr58.jpg","method":"For the pork, put the pork into a bowl and add the light soy sauce, rice wine or sherry, sesame oil and cornflour. Mix well to cover the pork in the marinade, then set aside. Heat the oil in a wok over a high heat. When the oil starts to smoke, add the garlic and stir-fry for 10 seconds, or until golden brown but not burned. Add the marinated pork, reserving the marinade in the bowl, and continue to stir-fry for 2-3 minutes. Add the pineapple, sugar, reserved marinade, three-quarters of the spring onions, and the dark soy sauce and continue to stir-fry for a further 2-3 minutes. Add the coriander, stir well and remove the wok from the heat.  Meanwhile, for the rice omelette, whisk together the eggs and sesame oil in a bowl. Heat the oil in a separate wok or large frying pan over a high heat. When the pan is hot, pour away the oil so that only a light coating remains in the wok. Pour the egg mixture into the pan and swirl the pan so that the mixture forms a thin omelette. When the eggs have just set, sprinkle the cooked rice over the omelette and cook for one minute. Carefully fold the edges of the omelette over the rice to cover, then transfer the omelette to a warm plate and cover with a clean tea towel to allow the rice to finish heating through. To serve, slice the omelette, divide the slices equally among four serving plates, then spoon the pork alongside. Garnish with the remaining spring onions. ","ingredients":" 1 x 600g\/1lb 5oz pork fillet, cut into thin slices,  2 tbsp light soy sauce,  2 tbsp Shaoxing rice wine or dry sherry,  1 tbsp sesame oil,  1 tbsp cornflour,  1 tbsp groundnut oil,  3 large garlic cloves, roughly chopped,  225g\/8oz fresh or tinned pineapple in juice, cut into chunks,  2 tsp caster sugar,  5 spring onions, trimmed, finely chopped,  1 tbsp dark soy sauce,  2 tbsp chopped fresh coriander leaves,  3 free-range eggs, lightly beaten,  2 tsp sesame oil,  1 tsp groundnut or vegetable oil,  200g\/7oz cooked long-grain rice, chilled (preferably overnight)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweet_and_sour_pork_and_29670"}