{"recipe_name":"Sweet and sour salmon with mussels and clams","author":"Gennaro Contaldo","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Blanch the fennel, pepper and carrots in a large pan of boiling water for three minutes.  Remove, drain and set aside.   In a frying pan, heat some olive oil and gently fry the garlic and chilli. Add the olives, capers and the blanched vegetables and fry for a further couple of minutes.  Add the sugar and vinegar and cook until slightly caramelised.  Remove from heat and set aside.   Season the salmon fillet on the skin side, place a few thyme sprigs onto the skin and drizzle with a little olive.  In a hot non-stick frying pan, seal the salmon on each side for about 2-3 minutes leaving the middle slightly raw, or cooked to your liking.   For the mussels and clams, discard any mussels or clams that have broken shells and discard any open ones that do not close when given a sharp tap.  Heat a large saucepan and add the oil. Once hot, add the garlic and chilli and cook until softened.  Add the mussels, clams, parsley and wine and season with salt and pepper. Place a lid on top and cook until the mussels and clams have opened up. Discard any that do not open. Drain the shellfish reserving the cooking liquid. Set the shellfish aside and keep warm. Bring the shellfish cooking liquid to a boil then simmer until reduced to a sauce consistency. To serve, arrange the vegetables on serving plates with the salmon on top skin-side up. Place the shellfish around and pour over the reduced cooking liquid. Finish with a drizzle of olive oil.   ","ingredients":" 1 fennel bulb, cut into quarters,  1 red pepper, cut into thick slices,  1 large carrot, peeled and cut into thick slices,  2 tbsp olive oil,  2 garlic cloves,  1 red chilli, slit lengthways,  6 black olives, pitted, in half,  1 tbsp capers,  1 tbsp sugar,  5 tbsp white wine vinegar,  4 x 200g\/7oz salmon fillets, skin on, pin boned,  4 sprigs fresh thyme,  250g\/9oz mussels, beards removed, washed under cold running water,  250g\/9oz clams, washed under cold running water,  3 tbsp olive oil,  1 garlic clove, thinly sliced,  ½ red chilli, chopped,  1 tbsp finely chopped fresh parsley,  150ml\/5fl oz white wine,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweet_and_sour_salmon_49760"}