{"recipe_name":"Sweet potato novelty 'guitar' cake","author":"Christine Wallace","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Makes 1 large cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Grease the cakes tins with vegetable oil and line with baking parchment. Preheat the oven to 170C\/340F\/Gas 4. For the sweet potato cakes, mix the pineapple and sultanas together in bowl. In a separate large bowl, combine the flour, brown sugar, bicarbonate of soda, cinnamon, nutmeg and salt. Stir in the sweet potato. Add the oil, eggs and the vanilla essence to the pineapple and sultanas. Tip into the flour mix and stir until well combined. Divide the mixture between the prepared tins and bake the 30cm\/12in cake for 50-55 minutes and the 25cm\/10in cake for approximately 40-45 minutes, or until the cake is springy to the touch and shrinking slightly from the sides of the tin. (Test the cake by inserting a skewer into the centre. If the skewer comes out clean, the cake is ready.) For the marshmallow fondant icing, mix the marshmallows with one tablespoon of water and heat in a microwave in short bursts until melted and swollen (it will take approximately 1-2 minutes). Remove from the microwave and stir thoroughly with an oiled spoon (to stop them sticking) until you have a smooth consistency.  Add the orange food colouring to the melted marshmallows and mix to combine.  Add approximately one-third of the icing sugar to the orange mixture and mix thoroughly to a smooth but firm consistency suitable for rolling (add a little extra icing sugar if the mix is too wet).  Dust the work surface with icing sugar and tip out the orange marshmallow mixture. Lightly oil your hands and knead in three-quarters of the remaining icing sugar until fully incorporated, smooth and no longer sticky (this will take approximately 10 minutes). Wrap in cling film and chill in the fridge until ready to use. For the passionfruit buttercream, beat the margarine until soft and smooth. Stir in the icing sugar and passionfruit juice until smooth. Transfer to the fridge to chill until ready to use. For the royal icing, lightly whisk the egg white in a bowl and beat in the icing sugar. Whisk until thick and the right consistency for piping. Set aside in a cool place until ready to use. When the cakes are cooked, remove them from the oven and set aside to cool for five minutes before removing them from the tins and placing on wire racks to cool completely. To decorate, cut the large cake into the shape of a guitar body. Slice in half horizontally and spread one layer with passionfruit buttercream. Place the other layer on top and cover the whole cake with a thin layer of buttercream, taking care to make it as smooth as possible as this will give a better finish when the marshmallow fondant is applied later.  Cut the smaller cake in half to make two rectangles, one slightly narrower than the other. Use the narrower piece to make the neck of the guitar and the other for the headstock. Slice each piece horizontally and sandwich with the buttercream before covering with a smooth crumb coat of buttercream.  Arrange all the cake pieces on the presentation board to form the guitar. Lightly dust the work surface with icing sugar and roll out the orange marshmallow fondant into a piece large enough to cover the cake with some excess to trim. Use the rolling pin to help you lift the icing onto the cake. Dust your clean, dry hands in a little icing sugar and begin to press the icing evenly across the top of the cake, pushing out any air bubbles. Run the icing carefully down and around the sides of the cake and trim any excess icing. If you have any air bubbles, prick them with a pin to remove the air and smooth them using your fingers. Divide the ready-to-roll fondant icing into three parts and colour one third brown and another third silver. Leave the remainder white. Roll out and trim the brown marshmallow fondant into a long rectangle to make the fretboard. Brush the neck of the guitar with a little water to help the fondant stick and carefully lift the brown fondant into place. Use the white and silver fondant to make the other elements of the guitar (bridge, pick ups, pickguard, machine heads etc) and stick them to the cake using a little water.  Spoon the royal icing into a piping bag fitted with a small plain nozzle. Draw thin lines across and down the neck of the guitar to represent frets and strings. Decorate the guitar with silver balls, if using. ","ingredients":" 3¼ x 435g\/15½oz tins crushed pineapple, drained                       ,  375g\/13oz sultanas ,  750g\/1lb 10oz self-raising flour ,  455g\/1lb¼oz light brown sugar ,  3½ tsp bicarbonate of soda ,  3½ tsp ground cinnamon ,  3½ tsp ground nutmeg ,  1¼ tsp salt ,  550g\/1lb 4oz sweet potato, peeled and grated                                          ,  455ml\/16fl oz vegetable oil, plus extra for greasing and kneading,  13 free-range eggs ,  6½ tsp vanilla essence ,  300g\/10½oz white marshmallows,  few drops orange food colouring,  600g\/1lb 5oz icing sugar,  55g\/2oz margarine ,  280g\/10oz icing sugar,  3 passionfruit, strained juice only,  1 free-range egg white ,  225g\/8oz icing sugar, sifted,  500g\/1lb 2oz ready-to-roll fondant icing,  few drops brown food colouring,  silver food colouring, optional,  edible silver balls, optional","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweet_potato_novelty_02785"}