{"recipe_name":"Sweetbread popcorn with frosted Worcestershire sauce","author":"Pascal Aussignac","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the frosted Worcestershire sauce, mix 400ml\/14fl oz water with the Worcestershire sauce and treacle and season to taste. Put in the freezer for at least 4 hours. When you are ready to serve, scrape it with a spoon to create granite ice.  For the sweetbreads, rinse the sweetbreads under running cold water for 10 minutes and then place in a bowl, cover with water and place in the fridge for at least 3 hours or ideally overnight.  In a pot place the milk and rosemary, season well with salt and bring to a simmer. Strain the sweetbreads and add them to the simmering milk, let the milk come to a simmer again and remove from the heat. Let the sweetbreads cool down in the milk and then strain them. Remove the excess fat and the thin layer of skin around them and cut into small pieces, not bigger than 1cm\/½in. (You can set aside in the fridge at this stage until you are ready to make the popcorn.) For the popcorn, in a large lidded pan add enough vegetable oil to cover the bottom of the pan and add the corn kernels, cover with a lid and put on a high heat. When you can hear the corn kernels popping, reduce the heat and shake the pan to make sure most of the kernels will pop. Give them another minute, remove from the heat and let them sit for 5 minutes. Remove them from the pot and crush roughly in a food processor. Tip into a bowl. Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C (use a thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended) Put the plain flour in a bowl and season with a pinch of salt. For the tempura batter, mix the tempura flour with the sparkling water in a bowl until forms a smooth runny paste. Pass the sweetbread pieces through seasoned flour, then through the tempura batter and finally coat them in the crispy popcorn. Deep-fry until golden-brown, season with salt and serve with some frosted Worcester on the side.  ","ingredients":" 200ml\/7fl oz Worcestershire sauce ,  15g\/½oz black treacle,  500g\/1lb 2oz lamb sweetbreads ,  1 litre\/1¾ pints milk,  1 sprig rosemary ,  vegetable oil, for deep-frying,  100g\/3½oz corn kernels,  75g\/2½oz plain flour,  100g\/3½oz tempura flour  ,  120ml\/4fl oz sparkling water,  salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweetbread_popcorn_with_22550"}