{"recipe_name":"Apple and Wensleydale pie","author":"Paul Hollywood","programme":"Paul Hollywood's Pies & Puds","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/apple_and_wensleydale_16189_16x9.jpg","method":"To make the pastry, put the flour in a bowl. Add the butter and rub it in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl. Using a table knife, work in just enough cold water (about 75ml\/2½fl oz) to bring the pastry together. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap the pastry in cling film and rest in the fridge for about 30 minutes. Preheat the oven to 200C\/400F\/Gas 6. Lightly butter a baking tin, about 26x20cm\/10½x8in and 3cm\/1¼in deep. For the filling, peel, quarter and core all the apples. Slice into a large bowl and mix them together. Once the dough has rested, cut it into two pieces, roughly one-third and two-thirds of the total. Lightly dust a work surface with flour. Roll out the larger piece of pastry so it’s a good centimetre larger all round than the tin. Line the base and sides of the tin with the pastry, leaving the excess hanging over the sides. Lay a third of the apple slices in the pastry-lined tin and sprinkle with a third of the sugar. Repeat with the remaining apple and sugar. Now scatter the crumbled cheese evenly over the fruit. Roll out the remaining pastry to make a lid. Brush the edges of the pastry in the tin with milk then put the pastry lid on top. Seal the edges with your fingertips and trim off the excess pastry neatly. Brush the pastry with milk and sprinkle over a little sugar. Make two slits in the top to allow steam to escape. Bake for 30-35 minutes, or until the crust is golden-brown. Leave for at least 15 minutes before slicing. The pie is delicious hot or cold and needs no accompaniment. ","ingredients":" 350g\/12oz plain flour,  175g\/6oz cold unsalted butter, cut into roughly 1cm cubes, plus extra for greasing,  500g\/1lb 2oz cooking apples,  500g\/1lb 2oz eating apples,  100g\/3½oz caster sugar,  125g\/4½oz Wensleydale cheese, crumbled,  a little milk,  about 1 tbsp caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/apple_and_wensleydale_16189"}