{"recipe_name":"Sweet filo pastry layers with balsamic strawberries and caramelised bananas","author":"Richard Phillips","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the sweet filo layers, lay one of the pastry sheets out flat onto a work surface, brush with some of the melted butter and sprinkle with half of the sugar.  Lay the other pastry sheet on top of the first one, and cut the pastry layers into two rectangles, then place them onto a baking sheet.  Brush the top of the pastry with more melted butter, and sprinkle the remaining sugar over it. Bake in the oven for 2-4 minutes, or until golden-brown and crisp.  For the balsamic strawberries, mix the strawberries together in a bowl with the icing sugar and balsamic vinegar. Set aside to soak for 10-15 minutes.  For the banana toffee mousse, place two tablespoons of the toffee sauce and the banana half into a food processor and blend until smooth. Fold this mixture into the whipped cream, and then gently fold in the egg whites. For the caramelised bananas, place the banana slices onto a baking sheet and sprinkle them with the sugar.  Using a kitchen blow torch, heat the sugar until it turns golden-brown. Alternatively, place the baking sheet under a very hot grill for 2-3 minutes, or until golden-brown. To serve, spoon some of the marinated strawberries into the centre of a serving plate and lay the pastry square on top of them. Put two spoonfuls of the mousse on top, followed by more strawberries, and then the other pastry layer. Put the remaining icing sugar into a sieve and shake it over the pastry stack. To finish, arrange the caramelised banana slices on top. ","ingredients":" 2 sheets ready-rolled filo pastry,  55g\/2oz melted butter,  2 tbsp caster sugar,  125g\/4½oz strawberries, chopped,  1 tbsp icing sugar,  2 tbsp balsamic vinegar,  3 tbsp ready-made toffee sauce,  ½ banana,  100ml\/3½fl oz double cream, whipped until soft peaks form when the whisk is removed,  2 free-range egg whites, whisked until soft peaks form when the whisk is removed,  1 banana, peeled and sliced diagonally,  1 tbsp caster sugar,  icing sugar for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweetfilopastrylayer_89349"}