{"recipe_name":"Braised chicken turbigo","author":"Brian Turner","programme":"A Taste of Britain","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat oven to 180C\/350F\/Gas 4. Cut the chicken into eight pieces (two breasts, legs, and thighs), season with salt and pepper and set aside.  Chop up the remaining carcass and wings, put into a pan with the chicken stock. Simmer for 20 minutes. Meanwhile, heat one tablespoon of oil in a casserole dish and add 30g\/1oz of butter. Place the chicken breasts into the pan skin-side down, fry until golden-brown, then remove from the pan and set aside. Place the leg pieces in the casserole and leave to cook for five minutes, then remove. Add the chipolatas, brown and remove. Add the mushrooms to the pan to brown, then add the white wine and cook to reduce the volume by half. Return the chicken and chipolatas to the casserole and strain in the chicken stock. Cover with the lid and transfer to the oven for 25-30 minutes, or until cooked. Remove the chicken, chipolatas and mushrooms from the pan and place in a serving dish. Add the tomatoes and black pudding offcuts to the stock. Simmer until the sauce is reduced in volume by two-thirds. Stir in 55g\/2oz butter and season with salt and pepper, to taste. Meanwhile, heat a little oil in a frying pan and fry the rounds of black pudding until cooked, then transfer to the serving dish with the chicken. Cut the bread into four heart-shaped pieces or circles with a cookie cutter. Heat the remaining oil and butter in the frying pan and fry until golden-brown on one side. Dip the ends in the sauce, then in the chopped parsley. Pour the sauce over the dish. Sprinkle the celery leaves on top, lay the croutons on top and serve. ","ingredients":" 1 x 3kg\/6½lb chicken,  285ml\/½ pint chicken stock,  2 tbsp vegetable oil,  110g\/4oz butter,  12 chipolatas,  170g\/6oz button mushrooms, halved,  1 glass dry white wine,  4 tomatoes, skinned and chopped, seeds removed,  4 x 70g\/2½oz slices black pudding, cut into rounds with a pastry cutter, offcuts roughly chopped,  2 slices white bread,  1 tbsp chopped parsley,  celery leaves from the central stalks, chopped,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_chicken_turbigo_17260"}