{"recipe_name":"Braised lamb, red lentil stew and parsley salad","author":"Glynn Purnell","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb, preheat the oven to 220C\/425F\/Gas 7. Heat a casserole dish until hot, then add the oil and lamb and brown on all sides. Remove from dish and place to one side. Add all the vegetables and the rosemary. Sauté until golden-brown then add the ras el hanout and cook for 30 seconds. Add the wine and cook until reduced by half. Place the lamb back in the dish and cover with lamb stock. Place the lid on the dish and put it in the oven for 2½ hours. Check half way through and add more stock if required. When cooked, remove the lamb from the dish. Strain the stock through a fine sieve into a pan. Return to the heat and cook it until the stock has reduced by half, then set aside. For the lentils, heat a sauté pan until hot, add the oil, onion, garlic and carrot and sweat for a couple of minutes until just softened. Add the lentils and enough stock to half cover then bring to a simmer. Cook over a gentle heat, adding stock until the lentils are cooked to a sauce consistency, not too dry. Season with salt and black pepper then stir in the chopped parsley. For the parsley salad, place the shallots in a bowl and pour over the vinegar. Add the olive oil, anchovies and capers, mix well then season. Pour the mixture over the parsley and mix to combine. To serve, blow torch the lamb until browned then place on a plate. Cover with red lentil stew and serve with parsley salad. ","ingredients":" 1 tbsp olive oil,  4 lamb shanks (or lamb elbows),  1 onion, chopped,  3 garlic cloves, crushed,  1 stick of celery, chopped,  1 carrot, chopped,  3 stalks of rosemary,  1 tbsp ras-el-hanout,  200ml\/7floz red wine,  1½ litre\/2½ pints lamb stock,  1 tbsp olive oil,  ½ onion, diced,  2 garlic cloves, peeled and chopped,  ½ carrot, diced,  200g\/7oz red lentils,  lamb stock (from above),  salt and freshly ground black pepper,  1 tbsp chopped parsley,  1 shallot, cut into rings,  2 tbsp white wine vinegar,  110ml\/4floz light olive oil,  8 fillets of anchovies,  1 tbsp capers,  salt and freshly ground black pepper,  1 small bunch of parsley (leaves only)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_elbow_of_lamb_04295"}