{"recipe_name":"Sweet potato gumbo with cornbread muffins","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/sweetpotatogumbowith_91317_16x9.jpg","method":"For the cornbread muffins, preheat the oven to 180C\/350F\/Gas 4. In a bowl, mix together the polenta, baking powder, bicarbonate of soda and flour until well combined. Add the milk, beaten eggs and creamed corn and mix until well combined. Add the chillies and stir to combine.  Spoon the cornbread batter mixture into the wells of a 12-hole muffin tin. Bake in the oven for 18-20 minutes, or until risen and cooked through. Meanwhile, for the sweet potato gumbo, heat the oil in a pan over a medium heat. Add the onion, celery, chillies and garlic and fry for 4-5 minutes, or until softened.  Mix together the salt, dried thyme, cayenne pepper, dried oregano, white pepper and bay leaf until well combined. Add to the pan and stir well to coat the vegetables. Continue to fry for 2-3 minutes, stirring regularly, until the spices are fragrant. Add the beef or vegetable stock, chopped tomatoes, and okra and bring the mixture to the boil. Add the sweet potato cubes and shredded cabbage and continue to cook for 12-15 minutes, or until the sweet potato is tender.  To serve, spoon the gumbo into the centre of each of six serving plates. Butter the cornbread muffins and place one or two alongside each serving. ","ingredients":" 225g\/8oz polenta,  2 tsp baking powder,  pinch bicarbonate of soda,  115g\/4oz plain flour,  125ml\/4½fl oz milk ,  2 free-range eggs, beaten,  300g\/10½oz canned creamed corn,  2 birds'-eye chillies, finely chopped,  2 tbsp vegetable oil,  1 red onion, peeled, finely chopped,  2 celery stalks, trimmed, finely chopped ,  2 red chillies, finely chopped ,  2 garlic cloves, peeled, finely chopped ,  1 tsp salt,  1 tsp dried thyme,  1 tsp cayenne pepper,  1 tsp dried oregano,  1 tsp white pepper,  1 bay leaf,  150ml\/5½fl oz vegetable stock,  440g\/1lb canned chopped tomatoes,  24 ladies' fingers (okra),  400g\/14oz sweet potato, peeled, cut into cubes,  100g\/3½oz cabbage, very finely shredded ,  100g\/3½oz butter, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweetpotatogumbowith_91317"}