{"recipe_name":"Sweet potato rosti with chilli mushrooms and watercress pesto","author":"Gino D'Acampo","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rösti, place the grated potato, free-range egg, salt and freshly ground black pepper, flour and fresh parsley into a bowl and mix together.  Heat the oil in a small frying pan and place a lightly greased chefs' ring on top.  Fill the chefs' ring with the potato mixture and flatten the top.  Cook the rösti mix for four minutes, turn over and slide the chefs' ring off the rösti. Cook for another four minutes or until golden-brown on both sides and cooked through. Remove the rösti from the pan and drain on kitchen paper.  Heat a little more oil in the pan, add the mushrooms, garlic and chilli flakes and cook for three minutes. Season with salt and freshly ground black pepper and then set aside. For the pesto, place the fresh watercress, extra virgin olive oil, garlic, salt and freshly ground black pepper into a clean food processor and blend until smooth. To serve, place the rösti onto a clean plate, place the mushrooms on top of the rösti.  Then pour the pesto round the side of the plate. Garnish with fresh chives. ","ingredients":" 1 sweet potato, peeled, grated and drained of water,  1 free-range egg,  salt and freshly ground black pepper,  1 tbsp plain flour,  1 tbsp fresh parsley,  1 tbsp olive oil,  1 tbsp olive oil,  1 large flat mushroom, sliced,  1 clove garlic, chopped,  pinch chilli flakes,  salt and freshly ground black pepper,  50g\/1¾oz fresh watercress, finely chopped,  2 tbsp extra virgin olive oil,  1 clove garlic, chopped,  salt and freshly ground black pepper,  1 sprig fresh chives, to garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweetpotatorostiwith_84595"}