{"recipe_name":"Sweet potato tagine with lemon couscous","author":"James Martin","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tagine, heat a large, deep frying pan with a lid until hot. Add the olive oil, onions and garlic and cook for 2-3 minutes. Add all of the spices and fry for one minute. Add the sweet potatoes and stir well. Add all the remaining ingredients, except the coriander, stir well and bring the mixture to a simmer. Chop the coriander stalks, reserving the leaves for later, and add the stalks to the pan. Reduce the heat, cover with a lid, and simmer for 15-20 minutes, or until the sweet potato is just tender.  For the couscous, place the couscous into a heatproof bowl and pour over enough boiling water to cover the couscous by 1.5cm\/½in.  Add the olive oil, preserved lemon and lemon juice and a pinch of salt. Stir well, then cover with cling film and set aside for 3-5 minutes, or until all the liquid has been absorbed. Remove the cling film and fluff the couscous up with a fork. Season, to taste, with salt and freshly ground black pepper. To serve, spoon some couscous onto each plate. Spoon the tagine onto the couscous and sprinkle over the reserved coriander leaves. ","ingredients":" 2 tbsp olive oil,  1 onion, thickly sliced,  2 garlic cloves, finely chopped,  1 tsp ras-el-hanout,  ½ tsp ground cinnamon,  ½ tsp ground ginger,  ½ tsp smoked sweet paprika,  ½ tsp ground cumin,  ¼ tsp freshly ground black pepper,  1kg\/2lb 4oz sweet potatoes, peeled and cut into large chunks,  1 x 400g\/14oz can chopped tomatoes,  2 tbsp honey,  ½ tsp saffron,  200ml\/7fl oz water,  40g\/1½oz preserved lemons, finely chopped,  125g\/4½oz dried apricots, halved,  110g\/4oz green olives, stones removed,  40g\/1½oz whole almonds,  1 small bunch coriander,  200g\/7oz couscous,  2 tbsp extra virgin olive oil,  10g\/½oz preserved lemons, rinsed, drained, pulp removed, flesh finely chopped,  ½ lemon, juice only,  2 tbsp chopped fresh coriander leaves, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sweetpotatotaginewit_89764"}