{"recipe_name":"Braised fennel with butter and parmesan","author":"Simon Hopkinson","programme":"The Good Cook","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/braised_fennel_with_81864_16x9.jpg","method":"Preheat the oven to 170C\/325F\/Gas 3. Melt the butter in a casserole dish over a low heat. Place the fennel into the butter cut-side down, and scatter around the trimmings. Season with salt and freshly ground black pepper and increase the heat.  Add the vermouth and pastis. Cover with a sheet of foil loosely pressed down on the vegetables, and put the lid on top. Place into the oven to cook for 30 minutes. Remove the dish from the oven and turn over the fennel. Return to the oven and cook for a further 30 minutes, or until very tender when poked with a small, sharp knife.  Preheat the grill to high.  Remove the fennel from the dish. Place in a warmed shallow oven-proof dish cut-side up, cover with foil and place in the oven while you make the sauce.  Pour the trimmings and cooking juices through a fine sieve suspended over a small pan. Warm through and add 45g\/1½oz of the parmesan. Blend with a hand blender until smooth and creamy (about the consistency of pouring cream). Pour the mixture over the fennel and sprinkle with the remaining cheese. Place under the grill and cook until the surface is pale golden-brown and slightly bubbling around the edges.  Serve with extra parmesan for sprinkling over.  ","ingredients":" 750g\/1½lb fennel bulbs, trimmed, halved, trimmings reserved,  50g\/1¾oz butter ,  salt and freshly ground black pepper,  3 tbsp dry vermouth,  splash pastis (optional, alternatively add more dry vermouth),  60g\/2oz parmesan (or similar vegetarian hard cheese), grated, plus extra for serving","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_fennel_with_81864"}