{"recipe_name":"Braised Jacob’s Ladder, kohlrabi, mustard cream and crisp shallots","author":"Matt Gillan","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 100C\/200F\/Gas ¼.  For the braising liquor and Jacob’s Ladder, mix all the ingredients except the ribs together in an ovenproof dish which will snugly fit the ribs. Add the ribs and coat in the braising liquor.  Cover the dish with aluminium foil and cook for 6-7 hours, or until the meat can be removed from the bone easily. Remove from the oven and allow to cool slightly. Remove the meat from the bone and place in a frying pan.  Add enough of the braising liquor to come a quarter of the way up the ribs. Place on a medium heat and cook until the volume of liquid has reduced to a thick sauce. Ensure the meat is coated well with the sauce. Keep warm For the crisp shallots, melt the butter in a heavy-bottomed pan over a high heat. Add the shallots and stir constantly.  When the shallot starts to colour, remove it from the pan and strain through a sieve. Season with onion salt and drain on kitchen roll. For the mustard cream, whisk the cream until soft peaks form when the whisk is removed. Add the mustard and a pinch of salt. Mix well, being careful not to over whip the cream, then transfer to the fridge. For the kohlrabi, mix the vinegar and oil together until emulsified. Put the kohlrabi in a bowl and coat generously with the vinaigrette.Set aside for 10 minutes to soften. To serve, divide the meat between four serving plates. Scatter the crisp shallots over the meat and place a spoonful of mustard cream and the kohlrabi alongside. Garnish with a few rocket leaves and finely grated parmesan. ","ingredients":" 1 litre\/1¾ pints cola,  150g\/5fl oz dark soy sauce ,  70g\/2½oz barbecue sauce,  150g\/5½oz tomato ketchup,  50ml\/2fl oz Worcestershire sauce,  1 pink grapefruit, juice only,  2 Jacob’s Ladder short ribs, cut into individual ribs,  250g\/9oz unsalted butter, diced,  1 large banana shallot, peel and finely slice,  pinch onion salt,  250g\/9oz double cream,  25g\/1oz wholegrain mustard,  salt, to taste,  100g\/3½oz raspberry vinegar,  200g\/7oz light olive oil,  1 small kohlrabi, peeled and thinly sliced,  salt,  1 bunch rocket leaves,  50g\/1¾oz parmesan cheese, grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_jacobs_ladder_31819"}