{"recipe_name":"Tablier de sapeur (crumbed tripe)","author":"Stephane Reynaud","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tablier de sapeur, put the tripe into a large saucepan with the carrots, brown onion, leek, celery and the bouquet garni. Cover with water and cook for 3-4 hours, or until the tripe is soft. Drain.  Discard the stock and vegetables and slice the tripe into long, thin strips. Pat dry with paper towels and cut into six evenly-sized rectangular pieces.  For the crumb, line a baking tray with baking paper. Whisk the eggs with the sunflower oil in a shallow bowl. Finely chop the crackers in a food processor to a fine crumb and transfer to another shallow bowl. Dip the tripe in the eggs, then in the breadcrumbs. Arrange these crumbed tabliers (‘aprons’) on the lined baking tray.  Heat the butter in a large frying pan set over a medium heat until melted. Add the spring onions and crumbed tripe. Cook the ‘aprons’ for three minutes on each side, or until browned. Sprinkle with sea salt and serve. For the sauce gribiche, mix the cornichons, shallot and capers together with the mayonnaise in a small bowl. Stir in the lemon juice. Serve the hot tripe with steamed potatoes and the sauce gribiche. ","ingredients":" 1kg\/2lb 4oz rumen tripe, bleached and ready to cook (ask your butcher),  4 carrots, peeled,  3 brown onions, thickly sliced,  1 leek, thickly sliced,  1 celery stalk,  bouquet garni ,  2 free-range eggs,  1 tbsp sunflower oil,  6 medium French toast crackers,  150g\/5½oz butter, chopped,  3 bulbs spring onions, thinly sliced,  fine sea salt ,  6 cornichons, finely chopped,  1 French shallot, finely chopped,  1 tsp capers,  100g\/3½oz mayonnaise ,  1 lemon, juice only,  new potatoes, steamed and dressed with a little butter, salt and pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tablier_de_sapeur_24442"}