{"recipe_name":"Braised Jacob’s Ladder beef with wild mushrooms and pancetta","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the braised beef preheat the oven to 160C\/325F\/Gas 3. Heat a large lidded casserole pot and add the oil. Once hot, add the beef pieces, two at a time, and fry all over to brown them. Remove from the pan and set aside. Add the pancetta and cook until crisp. Add the whole baby shallots and stir until they have colour on them. Add the garlic, rosemary and thyme and cook for two more minutes. Put all the beef back into the pan and add the red wine and heat until the volume of liquid has reduced by half. Add the tomatoes and jus and then cook in the preheated oven with the lid on for 2-3 hours, or until the meat is cooked to your liking. For the mash, place the potatoes in a pan of cold water and bring to the boil. Cook for 15-20 minutes, drain and then put them back into the pan warm.  Keep on the heat for a minute and mash the potato. Add the butter and cream and mash until smooth. To cook the baby carrots, place all the ingredients in a pan with 500ml\/18fl oz water and cook for 4-6 minutes, or until the carrots are cooked. When you are ready to serve, remove the casserole dish from the oven, take out the beef pieces and set aside. Heat the casserole on the hob with the lid off and reduce the liquid down in volume by half to a syrupy consistency. While the sauce is reducing, in a separate pan heat the butter and, once melted and hot, add the wild mushrooms and cook for 2-3 minutes and then sprinkle over the chopped parsley.  Add the mushrooms into the reduced sauce. Serve the Jacob’s Ladder beef pieces with the mushroom sauce, mashed potato and baby carrots. ","ingredients":" 4 tbsp olive oil,  4 Jacob’s Ladder (short rib) beef pieces,  300g\/10oz pancetta, cut into lardons,  400g\/14oz whole baby shallots,  3 garlic cloves, finely chopped,  2 sprigs rosemary,  2 sprigs thyme,  300ml\/10½fl oz red wine,  400g\/14oz chopped tomatoes,  600ml\/1 pint veal jus,  50g\/1¾oz butter,  400g\/14oz wild mushrooms,  2 tbsp chopped parsley,  500g\/1lb 2oz King Edward potatoes, peeled and cut into chunks,  100g\/3½oz butter,  200ml\/7fl oz double cream,  500g\/1lb 2oz bunches baby carrots,  50g\/1¾oz butter,  25g\/1oz sugar,  1 tsp salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_jacobs_ladder_51141"}