{"recipe_name":"Tagliatelle with squid and bottarga","author":"Theo Randall","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pasta, place the flour, egg and egg yolks into a food processor and pulse until well combined and the mixture comes together as a dough. Place the dough into a bowl, cover with cling film and place into the fridge to rest for 30 minutes. Cut the pasta dough in half and feed one of the pieces through a pasta machine according to the machine instructions, ending on the thinnest setting. Add the tagliatelle cutter to the pasta machine and pass the pasta through the machine to make thin strips. Repeat the process with the remaining dough, then dust the pasta with semolina flour, place onto a plate and refrigerate overnight or use immediately. For the sauce, bring a large saucepan of salted water to the boil, add the tagliatelle and sliced courgettes and return to the boil for two minutes. Heat a frying pan until medium hot, add the olive oil, tomatoes, garlic, squid and parsley cook gently for two minutes. Add the pasta and courgettes to the frying pan and stir together. Season with chilli, salt and freshly ground black pepper and scatter the bottarga on top. ","ingredients":" 200g\/7oz Italian '00' flour,  7 free-range eggs - 1 whole, 6 yolks only,  50g\/2oz fine semolina flour,  2 courgettes, finely sliced using a mandolin, and cut to the same size as the tagliatelle,  200g\/7oz fresh tagliatelle (made above),  2 tbsp olive oil,  8 datterini tomatoes, or other small tomatoes, peeled,  1 garlic clove, finely chopped,  200g\/7oz fresh squid, cleaned, scored, sliced as thick as the tagliatelle,  1 tsp chopped parsley,  1 pinch dried chilli,  salt and freshly ground black pepper,  20g\/¾oz bottarga, shaved","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tagliatelle_with_squid_09531"}