{"recipe_name":"Tail fillet of beef with blue cheese 'bonbons' ","author":"Glynn Purnell","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the shallot purée, melt 50g\/2oz of the butter in a pan until foaming, then add the shallots and gently fry for 2-3 minutes, or until softened but not coloured. Pour in the chicken stock and simmer for 1-2 minutes, then transfer to a food processor. Remove the thyme sprigs and blend until smooth. Pass through a fine sieve into a clean bowl and set aside.  For the blue cheese bonbons, crumble the blue cheese into the smooth potato. Add the splash of cream and beat together until smooth. Divide the mixture into 12 equal portions.  Dust each ball in the flour, then dip into the egg wash and roll in the breadcrumbs. Repeat the process twice.  Heat the sunflower or vegetable oil in a deep-fat fryer until it reaches 165C\/330F. Alternatively, half-fill a deep, heavy-based pan with the oil and heat until the required temperature, checking using a digital thermometer. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Fry the blue cheese bonbons, in batches, for 1-2 minutes, or until golden-brown all over. Be careful not to fry the bonbons for too long as they may burst in the hot oil. Remove with a slotted spoon and drain on kitchen paper. Keep warm.  Pre-heat the oven to 250C\/500F\/Gas 9.  For the tail fillet, place the tail fillets bone-side down in a roasting tin and roast for 10-15 minutes (for medium rare), or until cooked to your liking. Set aside to rest in a warm place for 15 minutes.  Place the roasting tin over a medium-high heat and add the butter. When melted, add the red wine and scrape up any browned bits from the bottom of the pan with a wooden spoon to deglaze. Simmer until the liquid has reduced to a thick syrup.  Add the beef stock and thyme and simmer until the liquid has reduced in volume by two-thirds. Pass the gravy through a fine sieve.  To serve, carve the fillet from the bone and season with salt and freshly ground black pepper. Spoon the shallot purée onto serving plates and arrange the beef slices on top. Place three blue cheese bonbons on each plate. Dress the rocket with olive oil, season with salt and freshly ground black pepper and arrange alongside the beef.  ","ingredients":" 50g\/2oz butter,  8 shallots, roughly chopped,  50ml\/2fl oz chicken stock,  2 sprigs fresh thyme,  50g\/2oz blue cheese,  5oz\/150g potatoes, peeled, boiled and passed through a potato ricer,  2 tsp double cream,  vegetable or sunflower oil, for deep-frying,  3oz\/200g plain flour,  2 free-range egg yolks,  100ml\/3½fl oz milk,  120g\/4oz breadcrumbs,  2 x 450g\/16oz beef tail fillets, on the bone ,  150g\/5oz butter,  300ml\/10½fl oz reduced beef stock,  100ml\/3½fl oz red wine,  salt and freshly ground black pepper,  150g\/5oz rocket,  olive oil, for drizzling ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tail_fillet_of_beef_with_25038"}