{"recipe_name":"Tamarind seared tuna steak with melon salad and zingy dressing","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salad, place the sliced melons in a vac-pac bag and seal in a vac-pac machine. Leave in the fridge overnight. For the tuna steak, brush the tuna with tamarind paste and leave to marinate for at least 1 hour. Meanwhile, for the salad, heat a large frying pan and add the chilled melon, cook on each side for 1-2 minutes. Cut into 2-3cm\/¾-1¼in pieces and place in a large bowl with the beans, sugar-snap peas, and mangetout. Set aside.  Heat a large griddle pan and lightly brush the tuna with the oil. Cook on the griddle for 6-8 minutes, depending on the size of the steaks and how you like your tuna cooked. Leave to rest, then thinly slice. For the dressing, put all the ingredients in a pestle and mortar and mix until smooth. To serve, toss the salad in the dressing. Put the salad on serving plates with the tuna alongside. Garnish with pomegranate seeds. ","ingredients":" ¼ watermelon, peeled and sliced,  ½ cantaloupe melon, peeled and sliced,  150g\/5½oz edamame beans, podded,  75g\/2½oz sugar-snap peas, thinly sliced,  75g\/2½oz mangetout, thinly sliced,  tuna steak (weighing approximately 500g\/1lb 2oz), cut into 4 pieces,  2 tbsp tamarind paste,  1 tbsp rapeseed oil,  1 red chilli, finely chopped,  2 garlic cloves, crushed,  2cm\/¾in piece root ginger, peeled and roughly chopped,  2 tbsp palm sugar (also known as jaggery),  6 tbsp soy sauce,  4 tbsp fish sauce,  2 tbsp finely chopped fresh mint leaves,  2 tbsp finely chopped fresh coriander leaves,  2 limes, juice only,  ½ pomegranate, seeds removed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tamarind_seared_tuna_97406"}