{"recipe_name":"Tandoori salmon with garlic, cumin and tomato potatoes and kachumber salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tandoori salmon, place all the spices in a medium bowl and mix with the oil and yoghurt. Smear half of the paste all over the fish and leave to marinate in the fridge for at least an hour. Reserve the remaining paste to make a sauce.  Meanwhile, place the potatoes in a large pan of salted water and cook for 6-7 minutes, or until just tender. Drain well.  Heat 3 tablespoons of the olive oil over a low heat. Add the smoked paprika, chilli, cumin and garlic. Cook for 1-2 minutes. Add the chopped tomatoes and cook for 2-3 minutes. Heat another frying pan and add the remaining oil, once hot add the potatoes and cook until golden-brown. Just before serving add the tomato mixture to the potatoes and heat through.  For the kachumber salad, place the tomato and onion in a large bowl with the salt and sugar. Mix the lemon juice and olive oil in a small bowl and pour over the tomatoes and onion along with the coriander and mint.  Once the salmon has marinated pre-heat the grill to medium heat. Place the salmon on a foil lined tray and grill for 3-4 minutes on each side. Place the reserved tandoori paste in a small saucepan and gently warm.  To serve, place a spoonful of salad alongside the grilled salmon and potatoes and spoon over the tandoori sauce. ","ingredients":" 1 tsp ground ginger,  1 tsp ground coriander,  1 tsp ground cumin,  ½ tsp paprika,  ½ tsp turmeric,  pinch nutmeg, grated,  2 cloves, ground,  1 cinnamon stick, crushed,  1 tsp cayenne pepper,  3 tbsp vegetable oil,  300ml\/10fl oz natural yoghurt,  4 darnes of salmon,  1kg\/2lb 4oz floury potatoes, such as Maris Piper or King Edwards, cut into 3cm\/1¼in cubes,  100ml\/3½fl oz olive oil, for shallow frying,  1 tsp smoked paprika,  1 red chilli, finely sliced,  ½ tsp cumin seeds,  2 garlic cloves, thinly sliced ,  400g tin of chopped tomatoes,  4 tomatoes, seeds removed, cut into 3mm\/⅛in cubes,  1 red onion, sliced,  ½ tsp salt,  1 tsp caster sugar,  1 lemon, juice only,  2 tbsp extra virgin olive oil,  1 tbsp finely chopped fresh coriander,  1 tbsp chopped fresh mint","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tandoori_salmon_with_39191"}