{"recipe_name":"Tandoori-style salmon with spiced tomato chutney","author":"Atul Kochhar","programme":"Food Poker","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the tandoori salmon, mix the vegetable oil with the gram flour in a saucepan over a low heat and keep stirring until it forms a paste. Cook for a further 1-2 minutes and then set aside to cool. Mix the dill, garlic, Greek yoghurt, cumin, garam masala, chilli powder, honey and lemon zest together and then stir in the gram flour mix. Spread over the salmon fillet and leave to marinate for ten minutes. Place on a baking sheet and bake for 7-8 minutes or until the salmon is cooked through. For the spiced tomato chutney, heat the vegetable oil in a sauté pan, add the black mustard seeds, sesame seeds and ginger and fry for one minute. Add the chopped tomatoes and white wine vinegar and cook for 2-3 minutes. Add the turmeric, garam masala and chilli powder and cook for 2-3 minutes. Add the honey, sugar and lemon zest, salt and freshly ground black pepper and cook for five minutes. Stir in the chopped dill and set aside. Place the cherry tomatoes (still on the vine) in a small roasting tray, drizzle with olive oil, salt and freshly ground black pepper and roast for ten minutes. To serve, spoon the spiced tomato chutney onto a serving plate and top with the tandoori salmon. Garnish with the roasted cherry tomatoes. ","ingredients":" 3 tbsp vegetable oil,  150g\/5½oz gram flour (also sold as besan or chickpea flour),  1 tbsp chopped fresh dill,  2 garlic cloves, peeled and finely chopped,  200ml\/7fl oz Greek yoghurt,  ½ tsp ground cumin,  ¼ tsp garam masala,  pinch chilli powder,  1 tsp clear honey,  1 lemon, zest only,  200g\/7oz skinless salmon fillet ,  1 tbsp vegetable oil,  1 tsp black mustard seeds,  1 tsp sesame seeds,  small knob root ginger, peeled and grated,  3 vine tomatoes, cut into quarters,  1 tbsp white wine vinegar,  ¼ tsp turmeric powder,  ¼ tsp garam masala,  pinch chilli powder,  1 tsp clear honey,  pinch caster sugar,  ½ lemon, zest only,  salt and freshly ground black pepper,  small handful fresh dill, finely chopped,  1 bunch fresh on-the-vine cherry tomatoes,  1 tbsp olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tandooristylesalmonw_87380"}