{"recipe_name":"Tandoori spiced pork chops with Savoy cabbage poriyal and apple and porcini salad","author":"Atul Kochhar","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the pork chops, place everything but the pork chops into a large bowl and whisk to combine. Add the pork chops and stir to coat. Set aside to marinate for 30 minutes in a cool place. Heat a griddle pan until hot. Place the pork chops into the pan and griddle on each side for two minutes. Transfer the chops to a baking sheet and place in the oven for 10-15 minutes, or until completely cooked through. Meanwhile, for the Savoy cabbage poriyal, heat a frying pan until hot and add the oil, mustard seeds, curry leaves and ginger. Stir until the mustard seeds pop, taking care as it may spit. Add the cabbage, turmeric and salt and fry gently for 10-15 minutes, or until the cabbage is wilted. Remove from the heat and stir in the freshly grated coconut, coriander leaves and lemon juice. For the salad, heat a frying pan until hot, add the oil and garlic and fry until light golden-brown. Add the coriander seeds and red chilli. Add the chopped apples and fry gently for a few minutes to colour lightly. Add the mushrooms and fry until lightly browned. Add the lemon juice and cider vinegar and season with salt and sugar, to taste. Remove from the heat and stir in the chopped parsley. To serve, place the cabbage poriyal in the centre of four serving plates and top with a pork chop. Scatter the apple and porcini salad around the plate and drizzle over the liquid left in the pan. Sprinkle the mixed cress on top of the salad and serve immediately. ","ingredients":" 1 tbsp finely chopped garlic,  1 tsp finely chopped green chillies,  1 tsp ground fennel seeds,  ½ tsp ground cinnamon,  1 sprig fresh rosemary, roughly chopped,  1 sprig fresh thyme, leaves only,  3 tbsp mustard oil (or 1 tbsp Dijon mustard),  salt and freshly ground black pepper,  100ml\/3½fl oz single cream,  50ml\/2fl oz double cream,  2 tbsp gram flour,  2 tbsp pastis,  generous pinch freshly grated nutmeg,  4 pork chops, trimmed and fat removed,  2 tbsp vegetable or groundnut oil,  1 tsp mustard seeds,  10 curry leaves,  1 tsp finely chopped fresh ginger,  300g\/10½oz Savoy cabbage, finely sliced,  ¼ tsp ground turmeric,  salt, to taste,  50g\/2oz freshly grated coconut,  1 tbsp chopped fresh coriander leaves,  ½ tbsp lemon juice,  3 tbsp olive oil,  ½ tsp chopped garlic,  ½ tsp coriander seeds, toasted and crushed lightly,  ¼ tsp crushed red chilli,  2 Granny Smith apples, cut into 2cm\/1in cubes,  100g\/3½oz fresh porcini mushrooms, cleaned and sliced,  1 tbsp lemon juice,  dash cider vinegar,  salt and sugar, to taste,  ½ tbsp finely chopped fresh parsley,  fresh coriander leaves,  Greek cress, celery cress and amaranth cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tandoorispicedporkch_88252"}