{"recipe_name":"Tandoori-style beef kebabs with coconut jus, Kashmiri pilau rice and garlic spinach","author":"Atul Kochhar","programme":"Put Your Money Where Your Mouth Is","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the kebabs, combine the rump steak, yoghurt, ginger, garlic, lemon juice and paprika in a large bowl. Cover and marinate for at least one hour in the fridge. Soak eight wooden skewers in cold water for at least ten minutes. Thread the meat and peppers alternately on the wooden skewers until all of the meat and peppers are used up. Set aside. For the coconut jus, heat half of the vegetable oil in a pan. Add the cardamom pods and the cloves and fry for 2-3 minutes. Add the chopped fresh tomatoes and the tinned tomatoes. Add the water, bring to the boil and simmer for about 40 minutes, or until the sauce has slightly thickened and the tomatoes have completely broken down. In a separate pan, heat the remaining oil and add the onions and the curry leaves. Cook for 4-5 minutes, or until the onions are softened and the curry leaves are aromatic. Turn up the heat, then add the beef bones and stir in the garam masala and cook for 5-6 minutes, stirring continually, or until the bones start to colour. Add the tomato mixture to the pan with the bones and mix well. Add enough water to just cover the top of the bones, then simmer for one hour, or until the mixture is thickened and aromatic. Pass the mixture through a fine sieve into a clean pan and discard the solids.  Add the coconut milk to the pan and bring to the boil, cooking for 10-15 minutes, or until the liquid has reduced by half. Keep warm. For the rice, heat the oil in a pan over a medium heat. Add the onions, cardamom pods, cumin and bay leaves and fry for 5-6 minutes, or until the onion is softened and the spices are aromatic. Drain the basmati rice and add to the pan. Stir until all the rice is coated and the spices are evenly distributed. Fry for 2-3 more minutes, then add the water and bring to the boil. Cover with a lid and cook for 10-12 minutes, or until the rice is tender and all of the water has been absorbed. Remove from the heat and set aside.  For the spinach, heat the oil in a pan until smoking. Add the garlic and fry for 2-3 minutes, or until softened. Squeeze out any excess moisture from the spinach, then add to the pan and stir until the spinach has wilted. For the kebabs, heat a griddle pan until smoking. Place the kebabs onto the griddle and cook for about 2-3 minutes on each side, or until cooked through and golden-brown all over. To serve, stir the grapes and chopped coriander into the cooked rice. Spoon onto serving plates and lay the kebabs alongside. Whisk the butter into the coconut jus, then drizzle around the plate. ","ingredients":" 1kg\/2lb 3oz rump steak, chopped into 2cm\/1in pieces,  570ml\/1 pint Greek-style yoghurt,  5cm\/2in piece fresh root ginger, peeled and finely grated,  6 cloves garlic, peeled and crushed to a paste,  1 lemon, juice only,  2 tbsp sweet paprika,  2 green peppers, seeds removed, chopped into 3cm\/1½in pieces,  2 red peppers, seeds removed, chopped into 3cm\/1½in pieces ,  4 tbsp vegetable oil,  1 tsp green cardamom pods, lightly crushed,  1 tsp whole cloves,  6 ripe tomatoes, chopped,  1 x 227g\/8oz tin chopped tomatoes,  300ml\/10½fl oz water,  1 onion, peeled and finely chopped,  10 curry leaves (available from some supermarkets and Asian grocers),  1 tbsp garam masala,  1kg\/2lb 3oz beef bones,  200ml\/7fl oz coconut milk,  50g\/2oz butter, cubed,  3 tbsp vegetable oil,  1 small onion, peeled, finely chopped,  1 tbsp green cardamom pods, lightly crushed,  1 tbsp cumin seeds,  2 bay leaves,  400g\/14oz basmati rice, washed and soaked for at least 30 minutes in cold water,  600ml\/1 pint 1½fl oz water,  1 bunch fresh coriander, roughly chopped,  10 seedless green grapes, halved,  10 seedless red grapes, halved,  2 tbsp vegetable oil,  2 cloves garlic, peeled and crushed to a paste,  400g\/14oz baby leaf spinach, blanched and refreshed in cold water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tandooristylebeefkeb_91376"}