{"recipe_name":"Braised ox cheek, pickled walnuts, smoked anchovy, glazed carrots and mash","author":"Adam Bennett","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Season the ox cheeks with salt and black pepper, cover and leave in the fridge for 24 hours until you are ready to cook. Preheat the oven to 160C\/325F\/Gas 3. Heat a heavy frying pan over a high heat, add the vegetable oil and sear the ox cheeks on all sides to colour. Transfer to a casserole dish. In the pan used to sear the ox cheeks, gently fry the vegetables and garlic until lightly caramelised. Add the wine and Madeira and cook until the volume of liquid is reduced by half. Add the passata and the beef stock. Bring to the boil and skim of any scum that rises to the surface. Add the thyme, bay, ceps, juniper berries, anchovies and two of the walnuts. Cover with a lid or aluminium foil, and cook in the preheated oven for 2-2½ hours, or until the meat is very tender. Remove from the oven, lift the cooked cheeks out onto a tray and cover with foil. Keep warm. Strain the cooking liquor into a clean pan and heat to reduce in volume until you have a good flavour and a sauce consistency. Keep the sauce warm until needed. For the glazed carrots, place the carrots in a single layer in shallow pan, add the butter, a pinch of salt and just enough carrot juice to cover. Bring to the boil, covered with a lid, and cook until tender – you may need to add a little water from time to time. When the carrots are just cooked remove the lid and reduce the cooking liquid until thick enough to glaze the carrots. Add a little lemon juice to taste.  For the mash, cut the potatoes into evenly-sized pieces, place in a pan with enough cold water to cover them and add a good pinch of salt. Bring to the boil, then reduce to a simmer for around 20 minutes or until tender. Drain well then return to the pan and dry fry over a low heat stirring for a few minutes. Mash the potatoes. While the potatoes are still hot, add the milk, cream and butter to your taste and mix to combine. Add salt if needed. To serve, divide the mash, ox cheek and carrots between four serving plates, warm the sauce adding the rest of the walnuts and the chopped parsley just before serving. Spoon the sauce over the cheeks. ","ingredients":" 4 ox cheeks, trimmed,  salt and freshly ground black pepper,  50ml\/2fl oz vegetable oil,  100g\/3½oz carrot, chopped,  100g\/3½oz onion, chopped,  50g\/1¾oz celery, chopped,  1 head of garlic, cut in half horizontally,  375ml\/13fl oz red wine,  150ml\/5fl oz Madeira,  100g\/3½oz passata,  1.5 litres\/2½ pints beef stock,  4 sprigs thyme,  4 bay leaves,  15g\/½oz dried ceps,  4 juniper berries, crushed,  4 smoked anchovy fillets,  3-4 pickled walnuts, chopped,  2 tbsp chopped flatleaf parsley,  300g\/11oz Chantenay carrots, cut in half lengthways,  75g\/2½oz butter,  salt,  100g\/3½oz carrot juice,  1 sprig tarragon,  squeeze of lemon juice,  1kg\/2lb 4oz Maris Piper or Yukon Gold potatoes,  150ml\/5fl oz hot milk,  150ml\/5fl oz hot cream,  250g\/9oz butter, diced, at room temperature","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_ox_cheek_pickled_28513"}