{"recipe_name":"Tartarus et caeli: heaven and hell cake","author":"John Whaite","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 16","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/300F\/Gas 2. Grease and line a 28cm\/11in cake tin.  For the ‘tartarus’ hell cake, beat the separated egg whites in a bowl until stiff.  In a large mixing bowl, mix the remaining ingredients for the hell cake together. When well combined, fold in the egg whites.  Pour the mixture into the prepared cake tin and bake for 1¼ hours.  Remove the cake from the oven and, once hot enough to handle, turn out, upside down, on a cake rack to cool.  For the ‘caeli’ heaven cake, grease and line 16 5cm\/2in diameter cake tins. Repeat the process for making the hell cake with the heaven cake ingredients, but pour the cake mixture evenly into the 16 moulds rather than one cake mould. Bake for 17 minutes. Remove from the oven, trim the cakes to make them exactly the same size, then turn them out upside down onto a cake rack to cool.  For the hell cake filling, make a ganache by placing the dark chocolate and cream into a bowl and heating in the microwave for 30 seconds at a time, until the chocolate has melted. Mix the cream well into the chocolate.  Set aside in a bowl. For the hell cake mirror glaze, soak the gelatine in cold water for five minutes until it softens.  Heat the sugar and 120ml\/4fl oz water in a pan until boiling. Add the golden syrup, cocoa and cream. Heat through, then strain the glaze through a sieve into a jug. Add the soaked gelatine to the strained glaze, stirring to make sure it’s evenly dissolved. Set aside until needed. For the meringue coating for the heaven cakes, place the egg whites, sugar, golden syrup and two tablespoons water in a bowl set over a pan of simmering water. Whisk the mixture for 7-8 minutes, or until stiff and glossy. Add the vanilla extract and mix in well. Set aside. Cut the cooled hell cake horizontally, to make two discs. Wrap each disc in cling film and place in the freezer  for 10 minutes to firm up and cool further. Place the lemon curd in a piping bag, with a small nozzle. With a small knife, cut a hole into the heaven cakes, to create space to pipe the curd into. Pipe the curd into the cakes. Cover the filled heaven cakes with the meringue (reserving a little of the meringue to hold the heaven cakes in place) and roll in the coconut.  Stack the heaven cakes on a 15cm\/6in cake board using straws to hold in place.  Remove the two hell cake discs from the freezer and spread one with one-third of the ganache and another with the cherry jam. Sandwich the cakes together. Using a palette knife, cover the outside of the cake with another third of the ganache.  Carefully place the coated hell cake in the freezer for 10 minutes to firm up.  Meanwhile, temper the chocolate for the chocolate shards. Chop the chocolate into equal sized pieces, and place half of it in a bowl set over a pan of simmering water. Allow to slowly melt. Once melted, take the bowl off the heat and add the remaining half of chopped chocolate. Mix into the melted chocolate until everything has melted and allow to cool to 30C\/86F (use a thermometer to measure this). Once it reaches temperature, it’s ready to use. Spread most of the tempered chocolate onto silicon paper and leave to cool completely - once cooled, it should snap into shards. Pour a few tablespoons of the chocolate mixture in a piping bag with a small nozzle and pipe ‘tartarus’ on the silicon paper - leave this too cool too.  Add another coating of ganache (using it all up) to the hell cake to get very straight sides, and return to the freezer for 15 minutes.  Remove the cake from the freezer, warm the glaze in a small pan and carefully pour the glaze over the hell cake and smooth.  Heat the glaze with a hairdryer so that it is very shiny and even.  Place the ‘tartarus’ piped chocolate nameplate on the cake.  Insert straws into the hell cake, to hold the heaven cakes in place.  Cut the straws off to a suitable height. Place the stack of heaven cakes onto the hell cake, secured with the straws.  Pipe swirls of meringue over the gap between the heaven and hell cakes, then toast the meringue with a chefs’ blow torch.  Finish the cake with shards of tempered chocolate around the edges.  Finally add gold leaf to the heaven cakes to decorate.  ","ingredients":" 9 free-range eggs, separated ,  60g\/2½oz cocoa powder,  230ml\/8fl oz hot water,  320g\/11oz plain flour,  450g\/1lb golden caster sugar,  1½ tsp bicarbonate of soda,  1½ tsp salt,  155ml\/5½oz sunflower oil ,  2½ tsp vanilla extract,  2 oranges, zest only,  285g\/10oz plain flour,  180ml\/6fl oz water,  1 tsp baking powder,  1½ tsp salt,  250g\/9oz golden caster sugar ,  120ml\/4fl oz sunflower oil,  2 unwaxed lemons, zest only,  6 free-range eggs, separated ,  1 tsp vanilla extract,  600g\/1lb 5oz dark chocolate ,  300g\/10½oz double cream,  200g\/7oz good quality cherry jam,  2 leaves gelatine ,  225g\/8oz sugar,  2 tbsp golden syrup ,  150g\/5½oz cocoa powder,  120ml\/4fl oz double cream ,  3 free-range eggs, whites only,  160g\/5¾oz caster sugar,  1 tsp golden syrup,  ½ tsp vanilla extract ,  200g\/7oz best quality lemon curd,  300g\/10½oz desiccated coconut ,  1 booklet (5 sheets) gold leaf, to decorate,  200g\/7oz dark chocolate ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tartarus_et_caeli_heaven_97253"}