{"recipe_name":"Tarragon stuffed crown of lamb with duchess potatoes","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01t1qbd.jpg","method":"For the duchess potatoes, preheat the oven to 200C\/400F\/Gas 6. Bake the potatoes in the oven for about 1-1¼ hours, or until tender when pierced by a knife. For the tarragon stuffed crown of lamb, put the onion in a food processor and pulse until very finely chopped.  Heat a frying pan until warm, add the butter and onions and gently fry for a few minutes. Add the mushrooms to the food processor and blend to a really fine purée, then add them to the frying pan. Turn the heat up to high and fry for 2-3 minutes, or until all the moisture from the mushrooms has been driven off. Tip into a bowl with the tarragon, breadcrumbs and mince. Season generously with salt and black pepper. Rub some butter over a sheet of aluminium foil. Place the foil on an oven tray, buttered side up. Tie the two racks of lamb together to form a circle and place onto the buttered foil. Spoon the stuffing into the centre, packing down well. Place in the oven (set to 200C\/400F\/Gas 6) for 50-60 minutes then remove and rest for 10 minutes. Meanwhile, for the duchess potatoes, remove the potatoes from the oven and, when cool enough to handle, scoop out the flesh and pass it through a fine sieve into a bowl. Beat to a smooth and fluffy purée then add the butter and egg yolks. Season with salt and pepper. Spoon into a piping bag then pipe little pyramids onto a baking tray and place in the oven for 5-10 minutes, or until golden-brown. To serve, carve the lamb and serve with the duchess potatoes.  ","ingredients":" 4 large baking potatoes,  25g\/1oz butter,  3 free-range egg yolks,  1 small onion,  25g\/1oz butter, plus extra for greasing,  300g\/10½oz button mushrooms,  1 small bunch picked tarragon, finely chopped,  50g\/1¾oz fresh white breadcrumbs,  75g\/2½oz lamb mince,  salt and freshly ground black pepper,  2 x 7-bone French trimmed racks of lamb","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tarragon_stuffed_crown_01121"}