{"recipe_name":"Tartiflette with bacon fat salad","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01sh1sn.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Place the whole potatoes in a large pan, cover with water and bring to the boil. Cook for 10 minutes. While cooking, heat a frying pan until medium-hot, add a knob of the butter, onion and thyme and gently fry for 5-8 minutes, or until softened, but not coloured. Drain the potatoes and, when they are cool enough to handle, scrape the skins off using a table knife and cut them into thick slices (about 5mm thick). Rub the cut side of the garlic all over the inside of an ovenproof dish, then smear on some butter. Place the sliced onions into the dish and spread out over the base, then lay six slices of bacon across the top. Lay the potatoes in concentric circles over the top, then place the cheese in the centre. Top with half the remaining butter and season with freshly ground black pepper and a touch of salt. Bake in the oven for 45 minutes, or until the potatoes are lovely and crisp around the edges and the cheese is totally melted. While the tartiflette is cooking, melt the remaining butter and chop the remaining slices of bacon into small pieces. Heat a frying pan, add the bacon and cook over a medium heat until the fat starts to render out, then turn the heat up and cook until crisp and browned. To make the dressing, whisk the Dijon mustard, vinegar and egg yolk together until pale then very slowly add the vegetable oil, whisking all the time until the mixture emulsifies. Pour the mixture into the hot fat from the bacon pan and whisk to combine. Season to taste with salt and pepper. Toss the crisp bacon with the salad leaves and toss with a little of the dressing. Remove the tartiflette from the oven and brush with a little melted butter. Serve in slices with the dressed salad. ","ingredients":" 1.5kg\/3lb 5oz medium sized, red-skinned potatoes, such as Désirée,  75g\/3oz butter, plus extra to serve,  1 large white onion, finely sliced,  1 tsp fresh thyme leaves,  1 bulb garlic, cut in half horizontally ,  10 thick slices smoked dry-cured streaky bacon,  1 x 250g\/9oz whole petit Reblochon cheese, rind removed,  1 tsp Dijon mustard,  1½ tbsp white wine vinegar,  1 free-range egg yolk,  2 tbsp vegetable oil,  100g\/3½oz mixed salad leaves,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tartiflette_and_bacon_21649"}