{"recipe_name":"T-bone steak with roasted tomato butter, wilted spinach and fat chips","author":"James Martin","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/355F\/Gas 4. For the roasted tomato butter, place the tomatoes on a baking sheet, cut-side up, and season with salt and freshly ground black pepper. Sprinkle over the thyme leaves and drizzle with the olive oil. Place in the oven and roast for 20 minutes. Turn the oven off and leave the tomatoes in the oven for 4-5 hours, or overnight, until semi-dried but still soft. Place the butter into a food processor and blend to soften. Add the roasted tomatoes and pulse until combined. Check the seasoning and add more salt and freshly ground black pepper, if necessary. Spoon the tomato butter along a piece of cling film. Wrap the cling film around the butter and roll up tightly to form a sausage shape, twisting at both ends to seal. Place in the fridge for at least an hour, until chilled and firm. For the steaks, season the steaks with salt and freshly ground black pepper. Heat a large frying pan until hot, add the oil, butter and the steaks. Fry the steaks for  4-5 minutes on both sides, depending on the thickness of the steaks, or until cooked to your liking. Remove from the pan and leave to rest on a warm plate for 5-10 minutes. Meanwhile, for the chips, heat a deep fat fryer to 150C. Cook the chips in batches for 2-3 minutes, until softened but not coloured. Remove with a slotted spoon and drain on kitchen paper. Increase the temperature of the deep fat fryer to 190C. Return the chips to the fryer, in batches, and cook until golden-brown and cooked through. Remove with a slotted spoon, drain on kitchen paper and season generously with salt and freshly ground black pepper. For the spinach, heat a frying pan until hot. Add the butter, oil and spinach and cook until the spinach has wilted. Season, to taste, with salt, freshly ground black pepper and freshly grated nutmeg. To serve, divide the chips between each of four serving plates. Spoon the spinach alongside and top with a steak. Unwrap the tomato butter and cut into thick slices. Place a slice on top of each steak and serve immediately. ","ingredients":" 6 tomatoes, halved and de-seeded,  3 sprigs thyme, leaves only,  2 tbsp olive oil,  250g\/9oz butter, softened,  salt and freshly ground black pepper,  4 T-bone steaks,  salt and freshly ground black pepper,  1 tbsp olive oil,  25g\/1oz butter,  3 large baking potatoes, peeled and cut into 1.5cm\/½in thick chips,  vegetable oil, for deep frying,  1 tbsp olive oil,  25g\/1oz butter,  250g\/9oz baby spinach leaves,  salt and freshly ground black pepper,  pinch freshly grated nutmeg, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tbonesteakwithroaste_89101"}