{"recipe_name":"Tea-smoked chicken with fried leek rings and whisky mango salsa","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to its highest setting and preheat the oven to 200C\/400F\/Gas 6. To cook the chicken, line a saucepan with foil and place on a medium heat. Place the loose tea on the foil and cover with the couscous. Rub the chicken breast with olive oil and season well. Place the chicken on the couscous in the pan and cover with the lid. Smoke for 5 minutes then remove. (CAUTION: tea-smoking generates a great deal of smoke. Make sure you cook in a well-ventilated place and open windows if you can.) Once the chicken is smoked, remove and cook under the grill for 4-5 minutes on each side until brown and thoroughly cooked through. To make the salsa, heat the olive oil in a frying pan. Add the mango and sauté for 1 minute. Add the whisky and chilli and carefully flambé. When the flames have died, add the garlic, white wine and cream and simmer very gently for a few minutes. To make the leek rings, heat the oil in a heavy-bottomed saucepan. The oil is ready when a breadcrumb dipped in will sizzle gently in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Dip the leek slices in the seasoned flour first, then into the milk and into the flour again. Deep fry the leeks until golden. Remove, drain on kitchen paper and sprinkle with salt. To serve, place the chicken on a warm plate with the leeks in a neat pile and drizzle over the salsa. ","ingredients":" 2 tea bags, opened,  200g\/7oz couscous, uncooked,  1 chicken breast,  1 tbsp olive oil,  salt and freshly ground black pepper,  1 tbsp olive oil,  ½ mango, chopped into cubes,  50ml\/2fl oz whisky,  ½ red chilli, deseeded and chopped,  ½ clove garlic, crushed,  50ml\/2fl oz white wine,  100ml\/3½fl oz double cream,  groundnut oil, for frying,  1 leek, sliced into 6cm\/2½-inch lengths,  100g\/3½oz flour, seasoned with salt and freshly ground black pepper,  100ml\/3½fl oz milk,  salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teasmokedchickenwith_80607"}