{"recipe_name":"Tea-smoked duck with noodle salad and sweet and sour plum sauce","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the duck, line a lidded wok with foil. Place the contents of the tea bags and the sugar onto the foil and place a wire rack on top. Place the wok on the heat, with the lid on. NB: Tea-smoking generates a lot of smoke. Be sure that you open the windows and get as much ventilation as you can. Season the duck breast with salt and freshly ground black pepper and rub with the spices. Remove the lid from the wok, place the duck breast on the rack and replace the lid. Cook for 12 minutes, until the duck is cooked through. Thinly slice the duck breasts. For the plum sauce, heat all the sauce ingredients together in a pan until the plums are soft.  Place the mixture into a mixing bowl and blend with a hand blender until smooth. For the noodle salad, mix all the salad ingredients together in a mixing bowl. For the noodle salad dressing, whisk all the dressing ingredients together in a mixing bowl. To serve, place the noodle salad onto a serving plate and drizzle over the dressing. Place the sliced duck on top of the salad and spoon the plum sauce over the duck. ","ingredients":" 3 tea bags, torn open,  50g\/1¾oz soft brown sugar,  1 duck breast, scored,  salt and freshly ground black pepper,  ½ tsp paprika,  ½ tsp curry powder,  1 tbsp olive oil,  1 chilli, chopped,  25g\/1oz dark chocolate, grated,  2 fresh plums, stoned and chopped,  1 tsp red wine vinegar,  1 tbsp soft brown sugar,  150g\/5¼oz cooked noodles,  1 tbsp sesame oil,  2 tbsp sesame seeds,  1 lime, juice only,  1 tbsp olive oil,  1 courgette, finely sliced,  1 tsp ginger, peeled and grated ,  handful each fresh parsley, coriander, chives,  1 tbsp olive oil,  2 tbsp sesame oil,  6 tbsp soy sauce,  handful fresh coriander, chopped,  ½ chilli, chopped,  1 lime, juice and zest,  1 tsp ginger, peeled and grated ,  1 tbsp clear honey,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teasmokedduckwithnoo_85844"}