{"recipe_name":"Tea-smoked duck with sweet potato and soy mash and crisp onion rings","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tea-smoked duck, preheat the oven to 180C\/350F\/Gas 4.  Line the base of a wok with a double layer of aluminium foil and place the tea leaves and soft brown sugar on top. Place a trivet on top, cover with a lid and heat until smoking. Place the duck breast on the trivet, cover the wok and smoke the duck for 12 minutes. Remove from the wok, place on a baking sheet and roast in the oven until just still pink in the middle. (NB: tea-smoking generates a great deal of smoke. Be certain to work in a well-ventilated area.) For the mash, place the chopped sweet potato into a pan of boiling salted water and cook until tender. Drain well and then pass through a ricer or mash with a potato masher. Add the soy sauce, lime juice, salt and freshly ground black pepper and mix well. For the onion rings, pour the vegetable oil into a large saucepan and heat until a small cube of bread turns golden in 30 seconds. (CAUTION: Do not leave hot oil unattended.) Dip the onion rings into the beaten egg and then into the flour and then carefully lower into the hot oil and fry until golden-brown. Remove with a slotted spoon and drain on kitchen paper. Season to taste with salt and freshly ground black pepper. To serve, pile the mash onto a serving plate, thinly slice the duck and place on top, and arrange the onion rings on top of the duck. ","ingredients":" 2 tea bags, outer casing removed,  4 tbsp soft brown sugar,  1 duck breast,  ½ sweet potato, peeled, chopped,  1 tbsp soy sauce,  1 lime, juice only,  salt and freshly ground black pepper,  300ml\/10½fl oz vegetable oil, for deep frying,  ½ red onion, peeled, cut into thick rings,  1 free-range egg, beaten,  3 tbsp plain flour,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teasmokedduckwithswe_88797"}