{"recipe_name":"Braised pig cheeks with mashed potato and Bramley apple sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/130C Fan\/Gas 2. Heat a large ovenproof dish on the hob, once hot add the olive oil. Fry the pigs cheeks in batches until they are golden-brown in colour, set aside. Add the shallot, carrots, celery and garlic and cook gently for 3-4 minutes. Add the bouquet garni and return the pig cheeks to the dish. Increase the heat and add the red wine. Cook until the liquid has reduced by half, then add the veal jus. Transfer the dish to the oven and cook for 2-2½ hours, or until the pig cheeks are tender. Remove from the oven and strain the liquid into a separate pot, keep the cheeks warm. Reduce the sauce by half and then gradually add the diced butter until you have a thick sauce. Put the cheeks in the sauce and warm through. Meanwhile, for the mashed potatoes, put the potatoes in a pan of salted water, bring to the boil. Then simmer for 15 minutes, or until tender. Drain and return the potatoes to the pan over the heat to remove any excess moisture. Mash well, add the butter and cream and beat to a smooth purée. Season with salt and pepper.  For the carrots, put the carrots, butter, sugar and 200ml\/7fl oz water in a lidded pan and bring to a simmer. Cover and cook gently for 4-5 minutes, or until the carrots are tender. Season with salt and pepper. For the Bramley apple sauce, put the apples, butter and 50ml\/2fl oz water in a lidded saucepan, cover and place over a medium heat. Cook until the apple has broken down, this should take about 4-5 minutes. Then beat with a spoon to form a purée, season with sugar and salt to taste. For the buttered kale, heat the butter in a frying pan. Add the kale leaves and 2 tablespoons of water and cook until wilted. To serve, put a spoonful of the mash potato in a serving bowl, place the pigs cheeks on top and spoon over the sauce. Serve the carrots, kale and apple sauce alongside. ","ingredients":" 3 tbsp olive oil,  12 pig cheeks, trimmed,  1 large banana shallot, finely chopped,  1 large carrot, finely chopped,  2 celery sticks, finely diced,  2 garlic cloves, finely diced,  1 bouquet garni,  200ml\/7fl oz red wine,  400ml\/14fl oz veal jus or beef stock,  2 tbsp red wine vinegar,  100g\/3½oz unsalted butter, diced,  1kg\/2lb 4oz fluffy potatoes, preferably King Edward, cut into chunks,  150g\/5½oz unsalted butter,  150ml\/5fl oz double cream,  salt and freshly ground black pepper,  4 small carrots, cut in half at an angle,  75g\/2¾oz butter,  2 tbsp caster sugar,  2 Bramley apples, peeled, cored and chopped,  50g\/1¾oz butter,  2-4 tbsp caster sugar, to taste,  50g\/1¾oz unsalted butter,  head of kale, leaves removed and roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_pig_cheeks_with_47819"}