{"recipe_name":"Tea-smoked trout with bashed chive potatoes and tomato salsa","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tea-smoked trout, place a piece of foil in the bottom of a wok. Place the rice, tea and sugar onto the foil and cover with a lid. Place over a medium heat for 3-4 minutes, or until the tea starts to smoke (CAUTION: tea-smoking generates a lot of smoke. Cook in a well ventilated area.) Place the trout fillets onto an oiled piece of foil in a steamer and set in the wok. Place a lid on the steamer and cook for 4-5 minutes, or until the trout is just cooked through and smoked. Meanwhile, for the bashed chive potatoes, place the potatoes into a pan, cover with water and bring to the boil. Simmer for ten minutes, or until just tender. Drain and return to the pan with the butter. Crush lightly with the back of a fork, season with salt and freshly ground black pepper and stir in the chives. For the tomato salsa, gently heat half the olive oil, the shallot, garlic and tomatoes in a pan for 1-2 minutes, or until just warmed through. Remove from the heat and add the remaining olive oil, the lemon juice, chives and tarragon. For the rocket salad, place the rocket and parsley into a bowl. Drizzle over the olive oil, season with salt and freshly ground black pepper and mix well. To serve, place two trout fillets onto each of two serving plates with the bashed chive potatoes and rocket salad. Drizzle over the tomato salsa. ","ingredients":" 100g\/4oz Thai jasmine rice,  4 tbsp jasmine tea,  6 tbsp demerara sugar,  2 whole trout, filleted,  oil, for greasing,  300g\/11oz new potatoes, scrubbed and cut into chunks,  50g\/2oz butter,  salt and freshly ground black pepper ,  handful fresh chives, roughly chopped,  50ml\/2fl oz extra virgin olive oil,  1 shallot, finely chopped,  1 garlic clove, finely chopped,  2 tomatoes, skins and seeds removed, chopped,  ½ lemon, juice only,  2 tbsp finely chopped fresh chives ,  1 tbsp finely chopped fresh tarragon,  large handful rocket,  2 tbsp flatleaf parsley, leaves only,  1 tbsp olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teasmokedtroutwithba_86659"}