{"recipe_name":"Tempura squid and prawns with coriander salsa","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01s2k8r.jpg","method":"Heat the oil in a deep heavy-bottomed pan until a breadcrumb sizzles and turns brown when dropped into it. Alternatively use a deep-fat fryer and heat to 180C\/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Put the squid and prawns into a bowl and mix them well with the soy sauce, Shaoxing rice wine (or dry sherry), sesame oil and the juice of one lime,  then set aside while you make the salsa. For the salsa, put half the herbs and all the other ingredients for the salsa into a small food processor and blend to a fine purée. To make the tempura batter, add the cornflour to the squid and prawns and mix well to coat – it will be very sticky. Carefully place the seafood into the fat in batches and fry for two minutes, or until just cooked through and crisp. Remove with a slotted spoon and drain on a plate lined with kitchen paper. To serve, put the fried tempura onto a platter then drizzle over the dressing, scatter over the reserved herbs and finish with the spring onions and chopped chilli. Cut the remaining lime into wedges and place alongside. ","ingredients":" oil, for deep-fat frying,  500g\/1lb 2oz squid, cleaned, cut into strips,  500g\/1lb 2oz raw king prawns, shelled,  2 tbsp light soy sauce,  2 tbsp Shaoxing rice wine or dry sherry,  2 tbsp sesame oil,  2 limes,  100g\/3½ oz cornflour,  3 spring onions, finely sliced,  1 long red chilli, roughly chopped,  1 small handful coriander leaves, roughly chopped,  1 small handful mint leaves, roughly chopped,  1 garlic clove, sliced,  1 long red chilli, sliced,  2 tbsp palm sugar,  1 tbsp fish sauce,  1 tbsp soy sauce,  1 tbsp sesame oil,  1 tbsp Shaoxing rice wine or dry sherry,  1 lime, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tempura_squid_and_prawns_97646"}