{"recipe_name":"Tea-smoked salmon with spinach and glazed carrots","author":"Richard Phillips","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tea-smoked salmon, place a large double piece of aluminium foil into the base of a wok. Tear open the tea bag and pour the leaves onto the foil, along with the oregano, rice, cumin, cardamom, coriander seeds and garlic. Cover with a lid, place over a low heat and leave to smoke for five minutes. (CAUTION: tea-smoking generates a lot of smoke. Cook in a well-ventilated area.) Remove the lid and place a steamer into the wok. Place the salmon into the steamer, cover and smoke for eight minutes. Heat the olive oil in a frying pan, add the chopped lemon and the smoked salmon fillet, skin-side down, and fry for 1-2 minutes on each side, or until cooked through. Add the butter and stir until melted. For the spinach, place the spinach into a pan and add the water, nutmeg, lemon juice and zest. Season, to taste, with salt and freshly ground black pepper and leave to wilt for 1-2 minutes. Drain off the excess water and set aside. For the glazed carrots, heat the butter in a saucepan and add the sugar, carrots and fish stock. Bring to the boil and cook for eight minutes, or until the carrots are just tender and glazed. For the red pepper coulis, heat the olive oil in a saucepan, add the onion and red pepper and fry over a gentle heat until softened. Add the milk, garlic, salt and freshly ground black pepper and boil for six minutes, or until the red pepper is tender. Allow to cool slightly, then pour into a blender and blend until smooth. To serve, spoon the spinach onto a serving plate and top with the salmon and the carrots. Spoon over the red pepper coulis and drizzle over the lemon butter juices from the salmon. ","ingredients":" 1 tea bag,  1 tsp dried oregano,  2 tbsp rice,  1 tsp cumin seeds,  2 cardamom pods, lightly crushed,  1 tsp coriander seeds,  3 garlic cloves, unpeeled,  200g\/7oz salmon fillet, skin scored with a sharp knife,  dash olive oil,  1 lemon, chopped,  25g\/1oz butter,  85g\/3oz baby spinach,  splash water,  ¼ tsp freshly grated nutmeg,  ½ lemon, juice and zest only,  salt and freshly ground black pepper ,  30g\/1oz butter,  pinch brown sugar,  100g\/3½oz baby carrots,  75ml\/2½fl oz fish stock,  dash olive oil,  ½ onion, finely chopped,  1 red pepper, chopped,  100ml\/3½fl oz milk,  1 garlic clove, chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teasmokedsalmonwiths_88580"}