{"recipe_name":"Tempura tiger prawns with velvety chilli and ginger-infused bisque","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the bisque, heat two tablespoons of vegetable oil in a large pan and fry the carrots, leek and celery for a few minutes to soften.  Add the chilli and ginger and stir in the tomato purée, thyme, bay and tarragon and continue to cook for 1-2 minutes.  Add the prawn shells and heads and cook in the pan until golden-brown. Add the fish bones and then pour in the cognac and white wine and stir to deglaze.  Pour in enough water to cover the bones, bring to the boil and then reduce the heat and allow to simmer gently for an hour.  Allow the bisque to cool slightly, then blend using a hand blender. Strain into a clean pan. Cook to reduce the volume of liquid for a further 30 minutes, or until reduced by a third.  Stir in the cream to taste and season to taste with salt and freshly ground black pepper.  To make the tempura, mix the flour, cornflour and salt in a large bowl. Gradually whisk in the sparkling water to form a smooth batter. Set aside for 20-30 minutes.  Heat a deep-fat fryer to 180C\/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Dip the prawns into the batter and then deep fry in the hot oil for 1-2 minutes, or until golden-brown and cooked through. To serve, arrange the prawns on serving plates and garnish with slices of spring onion. Spoon the bisque into a serving dishes alongside and serve scattered with chopped coriander.  ","ingredients":" vegetable oil, for frying,  2 carrots, chopped,  1 leek, chopped,  2 sticks celery, chopped,  1 red chilli, sliced,  5cm\/2in piece fresh root ginger, peeled and sliced,  2 tbsp tomato purée,  few sprigs fresh thyme,  2 bay leaves,  few sprigs fresh tarragon,  prawn shells and heads (reserved from prawns listed below),  1kg\/2lb 4oz fish bones, cleaned,  splash of cognac,  400ml\/14fl oz white wine,  400-600ml\/14-20fl oz cream (to taste),  salt and freshly ground black pepper,  100g\/3½oz plain flour,  50g\/1¾oz cornflour,  pinch salt,  sparkling water,  small handful ice ,  8 whole tiger prawns (peeled, shells and head reserved for the bisque, then butterflied),  vegetable oil, for deep-fat frying,  handful sliced spring onion, placed in a bowl of iced water to curl ,  chopped coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tempura_tiger_prawns_73225"}