{"recipe_name":"Teriyaki mushroom risotto with red mullet and lime leaf foam","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01t1q3c.jpg","method":"Prepare the mushrooms by brushing off any dirt, trimming the stems and tearing any large ones in half.  Pour the stock into a saucepan with the trimmings\/stalks from the mushrooms and warm through. Heat a large frying pan or sauté pan until medium-hot. Add a knob of butter, the shallots and garlic and gently fry for a couple of minutes before adding the rice. Stir well, then add the wine and cook until the liquid has been absorbed. Add a couple of ladlefuls of stock at a time, simmering between each addition until the rice has absorbed all the stock. Repeat until all the stock has been used and the rice is tender - it should take about 12-15 minutes. While the rice cooks, heat a non-stick frying pan until hot. Add the remaining butter and a tablespoon of olive oil, add the mushrooms and cook over a high heat until just golden-brown and tender. Add the mushrooms to the risotto and stir through, then stir in the teriyaki sauce, mascarpone and parmesan.  Pour the milk into a saucepan with the lime leaves and lecithin and bring just to a simmer. Blend with a stick blender to create a foam. Wipe the pan out, return it to the heat and add the last of the olive oil. Cook the red mullet skin-side down for a minute before turning over and cooking for another 30 seconds on the flesh side. Spoon the risotto into serving bowls, top with a fillet of red mullet, skin-side up, and finish with a spoonful of lime leaf foam. ","ingredients":" 250g\/9oz mixed oyster and shitake mushrooms,  600ml\/20fl oz chicken stock ,  25g\/1oz butter,  2 shallots, finely chopped,  2 garlic cloves, finely chopped,  100g\/3½oz risotto rice,  100ml\/3½fl oz white wine,  2 tbsp olive oil,  4 tbsp teriyaki sauce,  2 tbsp mascarpone,  2 tbsp freshly grated parmesan,  200ml\/7fl oz full-fat milk,  4 lime leaves, finely chopped,  1 tsp lecithin,  sea salt and freshly ground black pepper,  4 red mullet fillets","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teriyaki_mushroom_42335"}