{"recipe_name":"Teriyaki steak with Asian bean salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a frying pan until hot, add the rice wine, sake, mirin, soy sauce and caster sugar and bring the mixture to a simmer. Simmer for 1-2 minutes, or until the mixture has just thickened. Remove from the heat and leave to cool to room temperature. Put the steak in a shallow tray and pour over half of the teriyaki mixture, turn to coat the steak in the sauce. Place in the fridge to marinate for at least an hour. Pour the remaining teriyaki sauce into the serving bowl.  Heat a frying pan until hot, slice the steak and fry for 1-2 minutes. For the salad, put the ginger, garlic, chillies, coriander, mint, palm sugar, soy sauce, fish sauce and lime juice in a pestle and mortar. Pound until you have s smooth dressing. Put the French beans, mangetout, edamame beans, peas, onion and watercress in a large bowl and mix to combine. Just before serving add the dressing and stir. Place the steak on serving plates with the salad alongside and serve with the remaining teriyaki sauce.  ","ingredients":" 125ml\/4fl oz Shaoxing rice wine,  125ml\/4fl oz sake,  125ml\/4fl oz mirin,  125ml\/4fl oz soy sauce,  3 tbsp caster sugar,  4 x 150-200g\/5½-7oz pieces of fillet steak,  2 tbsp rapeseed oil,  5cm\/2in piece fresh root ginger, finely julienned,  2 garlic cloves, thinly sliced,  2 long red chillies, thinly sliced,  3 tbsp fresh coriander leaves,  3 tbsp fresh mint,  3 tbsp palm sugar,  2 tbsp soy sauce,  2 tsp fish sauce,  1 lime, juice only,  100g\/3½oz French beans, left whole,  100g\/3½oz mangetout, halved,  100g\/3½oz edamame beans, podded,  100g\/3½oz fresh peas, podded,  1 red onion, thinly sliced,  ½ bunch fresh watercress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teriyaki_steak_with_35460"}