{"recipe_name":"Teriyaki salmon with coriander salad and coriander mayo","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the teriyaki salmon, heat a frying pan until hot, add the rice wine, sake, mirin, soy sauce and caster sugar and bring the mixture to a simmer. Simmer for 1-2 minutes, or until the mixture has just thickened. Remove from the heat and allow to cool down to room temperature. Place the salmon into a shallow tray and pour over half of the teriyaki mixture, turn to coat the salmon in the sauce and then place in the fridge to marinate for at least an hour. Remove the salmon from the fridge, heat a frying pan until hot, then add the salmon, presentation side-down and fry for 1-2 minutes, then flip over. Pour over the remaining teriyaki sauce and use to glaze the salmon while it continues to cook for another 2-3 minutes, or until just cooked through. Remove the pan from the heat and rest the salmon for a couple of minutes. For the coriander salad, place the ginger, garlic, chillies, red peppers, bamboo shoots, cabbage, coriander leaves and cress into a bowl and toss together. Mix the palm sugar, soy and fish sauce and lime juice together until just combined, pour over the salad and toss to coat. Heat a separate wok with about 2.5cm\/1in of vegetable oil until just shimmering. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the lotus root and fry until just golden-brown and then drain immediately onto kitchen paper. Season with salt and a little black pepper. For the coriander mayo, bring a pan of water to the boil, add the coriander and cook for one minute. Drain and refresh in a bowl of iced water and then squeeze out the excess liquid. Place into a blender with the oil and blend until green and a fine purée. Place the egg yolks, vinegar, mustard, salt and lemon juice into a clean food processor. Blend to combine, then with the motor still running, gradually add the coriander oil. Continue until all the oil has been added and the mayonnaise has thickened. You may not need all the oil to achieve the correct consistency. Season with salt and black pepper. To serve, spoon the mayonnaise onto the plate and top with a pile of salad. Lay the teriyaki salmon on top and finish with a few lotus crisps. ","ingredients":" 125ml\/4fl oz Shaoxing rice wine,  125ml\/4fl oz sake,  125ml\/4fl oz mirin,  125ml\/4fl oz soy sauce,  3 tbsp caster sugar,  4 x 175g\/6oz salmon fillets, skinned and pin boned,  5cm\/2in piece fresh root ginger, peeled and finely julienned,  2 garlic cloves, finely sliced,  2 long red chillies, finely sliced,  2 red peppers, finely julienned,  1 small tin bamboo shoots, drained,  110g\/4oz Chinese cabbage, finely shredded,  3 tbsp fresh coriander leaves,  1 tbsp coriander cress,  3 tbsp palm sugar,  2 tbsp soy sauce,  2 tsp fish sauce,  1 lime, juice only,  vegetable oil, for deep frying,  12 very fine slices lotus root,  2 handfuls coriander, roughly chopped,  200ml\/7floz rapeseed or light olive oil,  2 free-range eggs, yolks only,  1 tsp white wine vinegar,  ½ tsp powdered mustard,  1 tsp salt ,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teriyaki_salmon_with_07180"}