{"recipe_name":"Teriyaki salmon with cabbage salad","author":"James Martin","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the teriyaki salmon, heat a frying pan until hot, add the rice wine, sake, mirin, soy sauce and caster sugar and bring the mixture to a simmer. Simmer for 1-2 minutes, or until the mixture has just thickened. Remove from the heat and allow to cool down to room temperature. Place the salmon into a shallow tray and pour over half the teriyaki, turn to coat the salmon in the sauce then place in the fridge to marinate for at least an hour. Remove the salmon from the fridge, heat a frying pan until hot, then add the salmon, presentation side down and sear for 1-2 minutes then flip over. Pour over the remaining teriyaki sauce and use to glaze the salmon whilst it continues to cook for another 2-3 minutes until just cooked through, glazing frequently. Remove the pan from the heat and rest the salmon for a couple of minutes. For the cabbage salad, bring a pan of salted water to the boil, add the shredded curly kale and blanch for two minutes then drain and refresh. Press dry then place in a bowl with the cucumber, mizuna, and mint leaves and chilli and toss lightly to combine. Whisk the lime juice, palm sugar, sesame oil and soy sauce together and season with a little salt and freshly ground black pepper. Drizzle over the salad and toss to combine.  To serve, pile the salad onto the plate and place the salmon alongside. Spoon over the extra teriyaki sauce. ","ingredients":" 125ml\/4fl oz Shaoxing rice wine,  125ml\/4fl oz sake,  125ml\/4fl oz mirin,  125ml\/4fl oz soy sauce,  3 tbsp caster sugar,  4 x 175g\/6oz salmon fillets, skinned and pin boned,  75g\/3oz curly kale, picked and shredded,  ½ cucumber, peeled and finely sliced,  50g\/2oz mizuna leaves,  4 tbsp shredded mint leaves,  1 red chilli, finely shredded,  2 limes, juice only,  1 tbsp palm sugar,  2 tbsp sesame oil,  1 tbsp soy sauce,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/teriyaki_salmon_with_25244"}