{"recipe_name":"Thai-style baked seabass with bok choi and a rice noodle salad","author":"Donal Skehan","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Whisk together the ginger, garlic, lime juice and fish sauce. Arrange the bok choi on a large sheet of baking parchment and add the seabass to one side along with some spring onion and chilli. Spoon the garlic and fish sauce mixture over the fish. Fold the parchment paper over the fish and seal the corners with metal paper clips. Place on a baking tray and cook in the oven for about 20-30 minutes. For the rice noddle salad, soak the noodles in a bowl of boiling water according to the packet instructions until they are tender. Drain the noodles, rinse under cold water and set aside. For the dressing, whisk together the lime juice and caster sugar in a large mixing bowl until the sugar has dissolved. Add the fish sauce, chilli and garlic and mix through. Then add the noodles, lettuce, vegetables, peanuts and fresh herbs. Mix to combine. Serve the sea bass straight to the table, allowing your guests to tear open the paper to reveal the steaming sea bass. Serve the noodles alongside. ","ingredients":" 5cm\/2in fresh ginger, peeled and very finely chopped,  2 garlic cloves, crushed,  1 lime, juice only,  3 tbsp Thai fish sauce (nam pla),  4 baby bok choi, shredded,  1 large sea bass, gutted and cleaned,  6 spring onions, finely chopped,  1 red chilli, seeds removed, thinly sliced,  250g\/9oz rice vermicelli noodles,  3 Baby Gem lettuce, leaves separated,  2 large carrots, thinly sliced,  ½ cucumber, peeled lengthways into ribbons,  6 spring onions, trimmed and finely chopped,  60g\/2¼oz salted roasted peanuts, roughly chopped,  large handful coriander leaves,  large handful mint leaves,  large handful basil leaves,  1 lime, juice only,  1 tbsp caster sugar,  3 tbsp Thai fish sauce (nam pla),  1 red chilli, seeds removed, thinly sliced,  1 garlic clove, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai-style_baked_seabass_00022"}