{"recipe_name":"Slow-cooked squid and chorizo stew","author":"Raymond Blanc","programme":"Raymond Blanc: How to Cook Well","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/braised_squid_with_35655_16x9.jpg","method":"For the paste, in a medium frying pan over a medium heat, heat the olive oil and fry the onions, garlic, herbs, salt, pepper and smoked paprika for about seven minutes, or until lightly golden-brown.  Add the tomato purée and cook for three minutes, stirring frequently. Add the chopped tomatoes and cook for five minutes, or until they have broken down. Add the remaining ingredients and bring to a simmer. Cover with a lid, but leaving a small gap for steam to escape and reduce the heat to minimum – just a few bubbles. Cook for one hour. Taste and adjust the seasoning with more salt and pepper if necessary. To finish the dish and serve, flash fry the squid rings for one minute in a hot frying pan until golden-brown and just cooked through. Arrange the stew on a large dish or four large plates. Sprinkle with parsley and spoon over the sauce. Top with flash-fried squid pieces and micro leaves. ","ingredients":" 1 tbsp extra virgin olive oil,  2 onions (about 300g\/10½oz), cut into 10 wedges ,  2 garlic cloves, sliced,  2 bay leaf,  1 sprig thyme,  2 pinch salt,  2 pinches ground black pepper,  1 pinch cayenne pepper,  2 tsp smoked paprika,  45g\/1½oz tomato purée ,  400g\/14oz canned chopped plum tomatoes,  200g\/7oz white wine, boiled for 30 seconds,  400g\/14oz squid, skin and quill removed, scored and cut in to 5cm\/2in pieces,  200g\/7oz cooking chorizo, cut in to 3cm\/1¼in pieces,  300g\/10½oz new potatoes, halved,  100g\/3½oz squid, cleaned, cut into rings ,  chopped flatleaf parsley,  micro leaves ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_squid_with_35655"}