{"recipe_name":"Thai-style chicken and cucumber salad","author":"Tom Parker Bowles","programme":"The Hairy Bikers' Cook Off","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"2","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02bzmls.jpg","method":"Place the chicken into a bowl and pour over half of the Thai fish sauce, the juice of one lime and the Korean chilli paste. Mix until well combined, then chill in the fridge for at least two hours, to marinate. Cover all of the cucumber with the remaining fish sauce, the rice wine vinegar, the juice of half a lime and all of the chopped chillies. Mix well and set aside for two hours, to marinate.  Add the broccoli, spring onions and shallots to the marinated chicken and marinate for a further 30 minutes.  Place the marinated cucumber mixture into a sieve placed over a bowl. Strain and reserve the marinating liquid.  Heat a frying pan or heavy-based wok over a high heat. When the pan is hot, add the marinated chicken mixture and stir-fry until cooked through. Add the cooked chicken and vegetables to the marinated cucumber mixture. Add the chopped herbs and mix until well combined.  Taste the mixture and add tablespoonfuls of the reserved marinade, to taste, if necessary. Squeeze over the remaining lime juice and taste again.  Divide the salad between two serving plates and serve. ","ingredients":" 2 chicken breasts, skin removed, finely diced,  75ml\/3fl oz Thai fish sauce (nam pla),  2 limes, juice only,  1 tbsp gochujang (a Korean fermented chilli paste available from Asian supermarkets),  4 cucumbers, 3 shaved into ribbons using a potato peeler, 1 cut into 7.5cm\/3in batons,  75ml\/3fl oz Japanese rice wine vinegar,  8 birds’-eye chillies, chopped,  ½ head of broccoli, florets sliced into thin slices,  5 spring onions, sliced into 1.5cm\/½in slices on the diagonal,  6 shallots, preferably Thai, chopped ,  handful fresh mint leaves, chopped,  handful fresh coriander, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai-style_cucumber_08091"}