{"recipe_name":"Thai-style crab cakes with quick chilli jam","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Makes 12 crab cakes","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p017fcdk.jpg","method":"For the chilli jam dipping sauce, put the sugar, vinegar and 100ml\/3½fl oz water in a small saucepan and gently heat until the sugar dissolves, stirring constantly. Add the chilli, garlic and ginger and bring to the boil. Cook for three minutes. Remove from the heat and pour into two heatproof serving bowls. It will thicken as it cools. (Any leftover chilli jam can be covered and kept in the fridge for up to two weeks.) To make the crab cakes, put the crab meat, prawns, curry paste, cornflour and a couple of really good pinches of flaked sea salt and a few twists of ground black pepper into a food processor. Blend until well combined. You may need to remove the lid and push the mixture down a couple of times with a rubber spatula. Don’t allow the mixture to become too thin or smooth or it will be difficult to shape into crab cakes. Remove the blade and transfer the mixture to a large bowl. Stir in the spring onions and coriander until evenly mixed. Sprinkle a small tray or platter with the extra tablespoon of cornflour. Wet your hands under the cold tap to stop the crab cakes from sticking. Take a small handful of the mixture – about the size of a golfball. Roll into a neat ball then flatten until around 1.5cm\/¾in thick and 6cm\/2½in in diameter. Place on the cornflour-dusted tray. Continue rolling and flattening the mixture until you have made 12 crab cakes. Pour the oil into a large non-stick frying pan and place over a medium heat. When the oil is hot, add six of the crab cakes and cook for two minutes on each side or until lightly browned and cooked throughout. Transfer to a warmed plate while the rest are cooked. Divide the crab cakes between two large plates or small platters. Add a dish of the chilli jam to each one and garnish with lime wedges and sprigs of fresh coriander to serve. ","ingredients":" 225g\/8oz jam sugar with added pectin,  3 tbsp red wine vinegar,  2-3 long red chillies, seeds removed, finely chopped,  2 garlic cloves, finely chopped,  15g\/½oz chunk fresh root ginger, finely chopped,  100g\/3½oz white crabmeat ,  100g\/3½oz brown crabmeat ,  200g\/7oz raw peeled king prawns (or other peeled raw prawns),  1 tbsp Thai green curry paste,  1 tbsp cornflour, plus 1 tbsp extra for dusting,  6 spring onions, finely sliced,  25g\/1oz fresh coriander, leaves finely chopped,  6 tbsp sunflower oil, for frying,  flaked sea salt,  freshly ground black pepper,  lime wedges and fresh coriander, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai-style_crab_cakes_03454"}