{"recipe_name":"Terrine of Capricorn goats' cheese, apples and celery and a salad of  toasted walnuts and raisins","author":"Michael Caines","programme":"Great British Menu","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First put the raisins to soak in the wine for 24 hours. To make the terrine, place the 300g\/10½oz goats' cheese in a food processor and blend until smooth. Blend in the yoghurt, then remove from the processor and place in a bowl.  Heat the cream until hot but not boiling. Gently squeeze the softened gelatine dry, then add to the hot cream and stir until melted. Cool slightly, then whisk this into the yoghurt and goats' cheese mixture. Add the celery and apple, and season with a little salt and freshly ground white pepper. Line a terrine mould or small loaf tin with clingfilm (or you can use individual moulds), then fill halfway with the cheese and yoghurt mixture, spreading it evenly into the corners. Place the 100g\/3½oz goats' cheese log down the middle. Top with the remaining cheese and yoghurt mixture, smoothing the surface flat. Tap the terrine on the work surface to ensure there are no air pockets. Cover and leave to set in the fridge for one hour.  For the walnut vinaigrette, mix all the ingredients for the vinaigrette together, with salt and freshly ground black pepper to taste, and place in a bottle or plastic pourer. Before using the vinaigrette, shake it well.   Now make the salad. To prepare the walnuts, put them in a small pan and cover with a mixture of half water and half milk. Bring to the boil, then remove from the heat and leave to soak for a few minutes. Drain and peel off the thin brown skins, using a small paring knife. Toast the walnuts in a dry pan, then set aside. Drain some of the raisins from the wine and place in a bowl with some of the walnuts. Add the apple and a little of the vinaigrette and toss to coat.  Combine the salad leaves with the remaining drained raisins and toasted walnuts in another bowl and dress with the vinaigrette.  Turn the terrine out of the mould and slice using a hot knife. To assemble, place the terrine at one end of each plate (ideally use long or oval plates). Pile the salad at the other end of the plate. Put the raisins and walnuts into the middle and place the apple batons on top, or sprinkle them around the terrine. ","ingredients":" 40g\/1½oz raisins ,  100ml\/3½fl oz Down St Mary sparkling wine, or other sparkling wine ,  300g\/10½oz  Capricorn goats' cheese, or other similar mild but mature goats' cheese that is not too soft,  200g\/7oz plain Greek yoghurt ,  200ml\/7fl oz whipping or double cream,  4 gelatine leaves, soaked in cold water for at least 10 minutes ,  60g\/2½oz celery, finely chopped ,  60g\/2½oz apple, finely chopped ,  salt and freshly ground white pepper,  100g\/3½oz plain goats' cheese log, cut into long lengths ,  100ml\/3½fl oz walnut oil,  75ml\/3fl oz groundnut oil ,  50ml\/2fl oz Champagne vinegar or white wine vinegar ,  salt and freshly ground black pepper,  80g\/3oz walnut halves,  milk,  1 Cox's apple, peeled and sliced and cut into thin batons and placed in acidulated water to prevent browning,  mixed salad leaves, including wild rocket, chervil, red chard, frisée and oakleaf","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/terrineofcapricorngo_81701"}