{"recipe_name":"Terrine of ham hock with piccalilli and toasted spelt bread with English mustard butter","author":"Galton Blackiston","programme":"Great British Menu","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Make the piccalilli well ahead as it improves with keeping. Combine the vinegar, sugar, horseradish, thyme, bay leaf and half of the chilli in a non-reactive saucepan. Heat gently until the sugar has dissolved, then bring to the boil. Simmer gently for a couple of minutes. Set aside to cool, then strain and set aside.  Meanwhile, cut all the vegetables into small cubes (the onions can either be left whole or cut into halves or quarters). Pour 2 litres\/3½ pints of water into a large bowl and stir in the salt. Immerse all the vegetables in the salted water and leave to soak overnight. The next morning, rinse the vegetables and drain well, then place in a large bowl. Put the remaining chilli, the cornflour, turmeric and mustard in a bowl and mix to a runny paste with about 150ml\/¼ pint of the cold strained vinegar. Bring the rest of the strained vinegar to the boil in a clean non-reactive saucepan over a moderate heat, then stir in the paste mixture. Cook for 2-3 minutes, stirring, until thickened.  Pour the hot mixture over the vegetables and mix thoroughly. Fill five sterilised 450g\/1lb jam jars with the piccalilli. When cool, cover and seal. (The piccalilli will keep for up to a month in a cool place. Keep in the fridge once opened. It's good to make plenty, as it goes well with lots of snacks.) To make the terrine, put the ham hocks and pig's trotters in a large stockpot and cover with cold water. Bring to the boil and boil steadily for ten minutes, skimming off any scum from the surface. Remove the hocks and trotters, and discard the water. Return the hocks and trotters to the cleaned pan. Add the bouquet garni, coriander seeds, peppercorns and shallots. Pour in the wine and vinegar, and add enough cold water to just cover the ingredients. Bring to the boil, then simmer very gently (no need to cover the pan) for a minimum of two hours or until the hocks are tender and the meat flakes easily.  Leave the hocks and trotters to cool in the liquid for about an hour. Remove the hocks, cover with cling film and set aside. Discard the trotters.  Strain the cooking liquid through a muslin-lined sieve into a clean pan. Place the pan on a high heat and bring the liquid to a rapid boil. Boil to reduce down to 650ml\/1 pint, then pass it once again through a sieve lined with a clean piece of muslin into a jug. Set aside. Line a 1.5-litre\/2¾-pint terrine with a double layer of cling film, leaving some cling film draping over the sides.  Peel the skin off the hocks, then shred the meat into nuggets. Place in a large bowl with the capers, gherkins and parsley. Mix well. Taste and season with pepper (add salt only if really necessary). Pile the mixture into the lined terrine and press down firmly. Slowly pour in the reduced liquid, adding just enough to cover the meat. As you pour, tap the terrine dish on a hard surface to ensure the liquid is spread throughout the terrine. Cover with the overhanging cling film and chill in the fridge overnight. To make the spelt bread, put the flour, salt, mustard powder, butter, chopped walnuts and sultanas (if using) in the bowl of a food mixer. Using the dough hook, mix thoroughly.  Combine the yeast and sugar in a bowl, mixing with your fingertips so that the yeast breaks down and becomes smooth and almost liquid. Mix in four tablespoons each of the warm milk and water and the egg. With the mixer running, slowly pour the yeast mixture into the flour to make quite a soft dough (it will become firmer on kneading), adding a little more warm liquid if needed. Allow the machine to knead the dough for 5-8 minutes or until it comes away from the sides of the bowl and does not stick to your fingers. Remove the bowl from the mixer and cover with a damp tea towel. Leave in a warm place to rise for 1-1½ hours or until the dough has doubled in volume.  Line a large baking tray with greaseproof paper. Turn the dough out onto a lightly floured surface and knead well with the palm of your hand, then shape the dough into a plump rectangle. Place it on the baking tray and leave in a warm place for 45 minutes (no need to cover) to prove and double in size again.  Preheat the oven to 220C\/390F\/Gas 7. Bake the bread for 20-25 minutes or until golden and it sounds hollow when you tap your knuckles on the top. Cool on a wire rack.  For the mustard butter, beat together the butter and mustard powder in a bowl until thoroughly mixed. Taste and season with salt and freshly ground black pepper. Press into small pots and place in the fridge until firm. The terrine is best eaten at room temperature. Serve it sliced, with the piccalilli, slices of toasted spelt bread and English mustard butter. ","ingredients":" 600ml\/1 pint white wine vinegar,  250g\/9oz caster sugar,  50g\/2oz freshly grated horseradish root (or creamed horseradish sauce),  2-3 sprigs thyme,  1 bay leaf,  2 large red chillies, deseeded and chopped,  300g\/10oz red peppers, deseeded,  200g\/7oz yellow peppers, deseeded,  200g\/7oz cucumber, peeled and deseeded,  200g\/7oz courgettes,  200g\/7oz fennel bulb,  200g\/7oz celery sticks,  200g\/7oz button or pickling onions,  50g\/2oz salt,  40g\/1¾oz cornflour,  2 tbsp ground turmeric,  6 tbsp Dijon mustard ,  3 x 1.2kg\/2lb 12oz unsmoked ham hocks,on the bone ,  2 pig's trotters, split lengthways,  bouquet garni (2 bay leaves, few sprigs of thyme, 2 sprigs of parsley and few optional sprigs of tarragon tied together),  1 tsp coriander seeds,  1 tsp black peppercorns,  2 shallots, chopped,  1 bottle (75cl) dry white wine,  4 tbsp white wine vinegar,  2 tbsp small capers, rinsed and drained,  50g\/2oz gherkins, rinsed and chopped,  generous handful of parsley, finely chopped,  salt and freshly ground black pepper,  350g\/12oz Letheringsett Mill spelt flour (or similar spelt flour), sifted,  1 tsp salt,  1 tsp English mustard powder,  40g\/1¾oz soft salted butter,  50g\/2oz chopped walnuts ,  25g\/1oz sultanas (optional) ,  10g\/½oz fresh yeast (available from bakers and from some supermarkets),  1 tsp caster sugar,  4-5 tbsp lukewarm milk ,  4-5 tbsp lukewarm water ,  1 free-range egg, beaten,  50g\/2oz very soft unsalted butter,  1 heaped tsp English mustard powder,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/terrineofhamhockwith_85947"}