{"recipe_name":"Thai beef stir fry","author":"The Hairy Bikers","programme":"The Hairy Bikers' Asian Adventure","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sauce, put the coriander roots, garlic and chillies into a pestle and mortar and crush lightly. Add the remaining ingredients for the sauce to the mortar and give it a good grind to infuse the flavours. Put into a serving bowl or dipping bowls. For the beef, in the same pestle and mortar (don't worry about washing it up), put the chillies, garlic cloves and sea salt. Grind until you have a paste. Heat a wok with three tablespoons of vegetable oil, add the chopped shallots and fry for 3-4 minutes. Turn down the heat and then add the pounded chilli and garlic paste until slightly brown (about one minute), stirring continuously on a low heat so that the garlic doesn’t burn. Turn the heat up and add the beef and red peppers, and cook until the beef is nearly cooked - this will only take 4-5 minutes. In the meantime while the beef is cooking, heat a medium frying pan with two tablespoons of vegetable oil.  Fry four eggs until crisp on the outside, but the yolks are still runny  Add the fish sauce, oyster sauce, soy sauce and palm sugar and a good handful of basil leaves and fold through the cooked beef. Divide into onto suitable serving bowls and serve with the rice and sauce on the side. ","ingredients":" 4 coriander roots, chopped,  4 garlic cloves ,  5 chillies, finely chopped (seeds optional),  1 tbsp oyster sauce,  1 tbsp rice wine vinegar,  2 tbsp soy sauce,  2 tbsp Thai fish sauce,  ½ lime, juice only,  4 birds’-eye chillies, chopped,  4 garlic cloves, roughly chopped,  ½ tsp coarse sea salt ,  vegetable oil, for frying,  10 Thai shallots, finely sliced,  700g\/1lb 9oz beef (either sirloin or rib), coarsely chopped (as if making a steak tartar - you can ask your butcher to coarsely mince it),  1 small red pepper, finely diced,  4 free-range eggs ,  2 tbsp Thai fish sauce ,  1 tbsp oyster sauce,  2 tbsp soy sauce,  1½ tbsp palm sugar,  a good handful of Thai basil and a smaller handful of holy basil (optional),  freshly cooked rice, for serving","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_beef_stir_fry_28048"}