{"recipe_name":"Thai crab risotto with lemongrass and kaffir lime","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 2-3","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01slbyp.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. To make a stock, place half of the crab shell in a saucepan. Add the chicken stock, lemongrass and one kaffir lime leaf and gently heat. Place the rest of the crab shell on a roasting tin with the red chilli, the roughly chopped shallot and tomato purée. Pour over all the vegetable oil, then place in the oven for 30 minutes.  Remove the crab from the oven, mix well then carefully strain the oil into a sterilised jar and set aside. Heat a large frying pan or sauté pan until medium-hot. Add the butter, the finely chopped shallot and the remaining kaffir lime leaf.  Add the rice and stir well to coat in the buttery mixture, then add the Thai green curry paste and wine and cook until the liquid has been absorbed and the rice is nearly dry. Strain the warm crab stock and add it to the rice a little at a time. Cook for 15-20 minutes, or until the rice is tender and most of the stock absorbed. When the rice is tender, stir in the chopped coriander, green chilli, cream and fold in the picked crab. Add the parmesan, mascarpone and the lime juice. Check the seasoning and add more salt and pepper as required. Spoon onto serving plates then scatter with a little coriander cress and finish with a drizzle of the crab oil. ","ingredients":" 1 crab shell, broken up,  300ml\/10fl oz chicken stock ,  1 lemongrass stalk, finely chopped,  2 kaffir lime leaves, finely shredded,  1 long red chilli, roughly chopped,  2 shallots, 1 roughly chopped, 1 finely chopped,  1 tbsp tomato purée ,  300ml\/10fl oz vegetable oil,  50g\/1¾oz butter,  75g\/3oz arborio rice,  1 tsp Thai green curry paste,  5 tbsp Muscat wine,  1 tbsp roughly chopped coriander,  1 green chilli, finely chopped,  50ml\/2fl oz double cream,  50g\/1¾oz picked brown crab meat,  110g\/4oz picked white crab meat ,  2 tbsp freshly grated parmesan,  1 tbsp mascarpone,  1 lime, juice only,  1 tbsp coriander cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_crab_risotto_with_18400"}