{"recipe_name":"Thai fish cakes with a honey and cucumber dip ","author":"The Hairy Bikers","programme":"The Hairy Bikers' Asian Adventure","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Makes 18-20","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/thai_fish_cakes_with_a_37638_16x9.jpg","method":"For the fish cakes, place the fish, fish sauce, red curry paste, lime leaf, galangal, lemongrass, coriander root, egg, palm sugar, beans, and lime juice in a food processor and blend to a paste. Alternatively this can be done in a pestle and mortar – pound the ingredients to a jelly-like paste. Remove and, with damp hands, take a piece about the size of a walnut. Roll it into a ball and then flatten it to a thin disc. Lay on a floured plate. Repeat until all the mixture has been used. Refrigerate until ready to cook. For the dip, beat together the vinegar, honey, two tablespoons of water, the lime juice and fish sauce. Taste and adjust the honey and lime juice to get it sweeter or sourer, however you want it. Add the cucumber, carrot, shallot and chilli. Leave for 30 minutes to an hour for the flavours to develop. Heat the groundnut oil in a frying pan and cook the fish cakes until golden-brown all over – this should take a couple of minutes on either side.  Serve on a banana leaf with the sauce in a dish to one side. Garnish with the lamb’s lettuce.  ","ingredients":" 500g\/1lb 2oz skinned and pin-boned halibut fillet, chopped ,  1 tbsp Thai fish sauce,  1 dessertspoon Thai red curry paste ,  1 kaffir lime leaf, finely sliced,  1 thumb-sized piece galangal, chopped finely,  1 stick lemongrass (the soft bit only), finely sliced,  1 coriander root and leaves, chopped ,  1 free-range egg,  1 tsp grated palm sugar,  50g\/1¾oz snake beans, sliced thinly (alternatively use French beans),  ½ lime, juice only,  plain flour, for dusting ,  3 tbsp groundnut oil, for shallow frying,  2 tbsp rice wine vinegar,  2 tbsp clear honey,  ½ lime, juice only,  1 tbsp Thai fish sauce,  100g\/3½oz cucumber, skinned, cored and diced,  50g\/1¾oz carrot, finely diced,  1 shallot, finely diced,  2 birds’-eye chillies, seeds removed (if liked), sliced thinly ,  banana leaves ,  lamb’s lettuce","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_fish_cakes_with_a_37638"}