{"recipe_name":"Braised steak with gravy","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/braised_steak_with_gravy_24508_16x9.jpg","method":"Preheat the oven to 170C\/325F\/Gas 3.  Trim off any hard fat from the beef and season on both sides with salt and lots of freshly ground black pepper.  Heat a tablespoon of the oil in a large non-stick frying pan. Fry the steaks, two at a time, over a medium-high heat for a couple of minutes on each side, or until nicely browned, then transfer to a large flameproof casserole dish. Add a little more oil to the pan if necessary. Return the pan to the hob and reduce the heat. Add the remaining oil and gently fry the onion for five minutes, or until softened and lightly browned, stirring regularly.  Stir in the garlic, cook for one more minute, then transfer the onion and garlic to the casserole dish.  Pour over the stock and add the tomato purée, thyme and bay leaf.  Bring to the boil, then cover the casserole and transfer carefully to the oven. Cook for 1¼-1½ hours, or until the beef is very tender. Mix the cornflour and mustard powder in a small bowl and stir in a tablespoon of cold water until smooth. Remove the lid from the casserole dish and stir in the cornflour mixture. Season to taste with salt and freshly ground black pepper. Place the casserole over a medium-high heat and simmer for 2-3 minutes, or until the gravy reduces and becomes thickened and glossy, stirring regularly.  Transfer the steaks to four warmed plates and spoon over the gravy. Serve with chips. ","ingredients":" 4 braising steaks (about 200g\/7oz each),  3 tbsp sunflower oil,  1 medium onion, halved and cut into 12 wedges,  1 garlic clove, crushed,  500ml\/18fl oz beef stock made with 1 beef stock cube, or 500ml\/18fl oz fresh beef stock,  1 tbsp tomato purée,  1 tbsp chopped fresh thyme, or ½ tsp dried thyme,  1 bay leaf,  1 tsp cornflour,  ½ tsp English mustard powder,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braised_steak_with_gravy_24508"}