{"recipe_name":"Thai coconut-chilli prawns","author":"The Hairy Bikers","programme":"Hairy Bikers Everyday Gourmets","prep_time":"overnight","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/thai_coconut-chilli_60337_16x9.jpg","method":"Blend the galangal, ginger, lemongrass, garlic, chilli, zest and juice of the limes, soy sauce, coriander roots and dried coconut in a food processor until well combined as a thick, rough paste. Transfer the paste to a resealable freezer bag and add the prawns. Seal the bag, removing as much air as possible as you do so, then massage the mixture into the prawns and set aside in the fridge to marinate for 1-2 hours, or overnight, if possible. Heat a frying pan over a medium heat. Using a potato peeler, shave the fresh coconut into the pan, then dry-roast the coconut shavings until lightly toasted.  Set aside. When the prawns have marinated, heat a griddle pan over a medium to high heat. When the pan is hot, shake any excess marinade from the prawns, then put them on the griddle, in batches if necessary, and grill for 2-3 minutes, or until pink and opaque. To serve, divide the coconut-chilli prawns equally among four serving plates. Sprinkle over the coriander leaves, coconut shavings and garnish with a wedge of lime.  ","ingredients":" 4cm\/1½in piece fresh galangal, peeled, chopped,  2.5cm\/1in piece fresh ginger, peeled, chopped,  2 stalks lemongrass, outer leaves removed, inner core chopped,  2 garlic cloves, peeled,  1 red chilli, stalk removed,  2 limes, zest and juice,  3 tbsp soy sauce,  small bunch fresh coriander, roots and leaves chopped separately,  1 x 100g\/3½oz block dried coconut,  24 large prawns, peeled, heads removed,  ½ fresh coconut, flesh only,  ½ lime, cut into wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_coconut-chilli_60337"}