{"recipe_name":"Thai chicken curry","author":"Mary Berry","programme":"Mary Berry's Foolproof Cooking","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/thai_chicken_curry_06763_16x9.jpg","method":"Cut the chicken breasts in half and then into long thin slices. Tip into a bowl and add 1 tablespoon of the Thai curry paste, season with salt and freshly ground black pepper and mix. Heat 1 tablespoon of the sunflower oil in a deep frying pan, add the chicken slices and fry over a high heat for 5 minutes until just cooked through – you may need to do this in batches. Transfer the cooked chicken slices to a plate. Add the remaining oil to the pan and fry the onions for 3 minutes. Cover with a lid, lower the heat and cook for another 10 minutes to soften. Increase the heat and add the ginger with the remaining Thai curry paste and fry for a minute. Sprinkle in the flour and blend in the coconut milk with the fish sauce and sugar, adding a little at a time. Stir the mixture and bring to the boil. Add the lemon grass and lime leaves and season with salt and freshly ground black pepper. Return the chicken to the pan, bring back up to the boil and then cover, reduce the heat and simmer for about 5 minutes, or until piping hot. Meanwhile, cook the sugar snap peas in boiling salted water for 2 minutes, drain and refresh in cold water. Remove the lemon grass and lime leaves from the curry and discard. Add the lime zest and juice, water chestnuts and sugar snap peas. Bring to the boil, then remove from the heat and serve with rice. ","ingredients":" 6 skinless and boneless chicken breasts,  3 tbsp Thai red curry paste,  3 tbsp sunflower oil,  2 onions, sliced,  4cm\/1½in knob of fresh root ginger, peeled and finely grated ,  1 tbsp plain flour,  2 x 400g tins full-fat coconut milk,  1 tbsp Thai fish sauce,  1 tbsp light muscovado sugar,  1 lemon grass stalk, bashed (see tip),  4 Kaffir lime leaves,  250g\/9oz sugar snap peas, cut in half lengthways,  ½ lime, zest and juice,  1 x 225g tin water chestnuts, drained, halved and quartered if large,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_chicken_curry_06763"}