{"recipe_name":"Apple charlotte","author":"Raymond Blanc","programme":"Kew on a Plate","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the caramelised apples, in a large sauté pan or frying pan over a medium–high heat, heat the sugar to a dark golden-brown caramel without stirring, then add the butter. The caramel will emulsify with the butter and the cold butter will also stop the cooking of the caramel. Add the apples and cook in the caramel for 5 minutes, with a lid on, until they soften but still hold their shape (the centre will still be a little raw). Remove from the heat. For the compôte, mix 50ml\/2fl oz of the apple juice with the sugar and pectin. Slide the chopped apple into a medium saucepan set over a medium heat. Add the remaining apple juice and cook for 10 minutes, covered with a lid, until the apples break down. Add the sugar\/pectin mix and vanilla purée or extract, stir and cook for a further 5 minutes to allow any moisture to evaporate. Remove from the heat. Preheat the oven to 210C\/190C Fan\/Gas 6½. To prepare the cake ring, lightly butter the inside of a 15x6cm\/6x2½in cake ring. Dip the ring in sugar so that the sugar coats the inside of the ring. Tap it lightly to ensure an even coating; tap off any excess. Lay out a 25cm\/10in square of aluminium foil, then cover it with the same size of parchment paper. Place the cake ring on top and roll up the foil and paper, so the foil holds tightly to the bottom of the ring – this will prevent any juices escaping. Place the ring on a baking tray. For the Charlotte, cut the slices of bread into 6cm\/2½in squares. Lightly spread both sides of the bread with the butter and fry in a large frying pan over a medium–high heat for 20–30 seconds on one side, until evenly golden-brown. Transfer the bread to a plate or tray then use it to line the inside of the ring, browned sides facing outwards and overlapping by 2cm\/¾in. Press to ensure they stick to the sides. To build, mix the caramelised apple into the compôte, then pour the mixture into the centre of the ring to fill the Charlotte. It will look too much and there will be a slight dome, but after cooking the apples will collapse under their own weight until they are level with the rim of the ring. Place the apple Charlotte in the oven for 30 minutes. Remove from the oven and leave to cool completely for a minimum of 3 hours. This will allow the pectin to set fully and firm up, which will also make the Charlotte easier to slice. Once cool, turn the Charlotte upside down by placing a large plate on top and flipping it over. Remove the foil and paper from the ring. You will need to heat the ring a little to lift it off smoothly; either use a blowtorch or place in an oven heated to 180C\/160C Fan\/Gas 4 for a minute, then ease it off gently. To serve, carefully cut the Charlotte into 6–8 pieces. This beautiful dessert can be served with vanilla ice cream or crème Chantilly. It’s also perfect with a glass of your best cider. ","ingredients":" 80g\/3oz caster sugar,  25g\/1oz unsalted butter, chilled,  500g\/1lb 2oz Cox’s Orange Pippin apples, peeled, cored and each cut into 8 wedges,  150ml\/5fl oz fresh apple juice,  10g caster sugar,  ½ tsp apple pectin,  250g\/9oz Blenheim Orange apples (about 5), peeled and chopped,  ½ tsp vanilla purée or good-quality vanilla extract,  50g\/1¾oz unsalted butter, softened,  50g\/1¾oz caster sugar,  200g\/7oz wholemeal bread, cut into 11 slices; each 5mm\/¼in thick ,  50g\/1¾oz unsalted butter, softened","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/apple_charlotte_08809"}