{"recipe_name":"Thai noodles with cinnamon and prawns","author":"Nigella Lawson","programme":"Simply Nigella","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/thai_noodles_with_72276_16x9.jpg","method":"On a high heat, heat the oil in a large wok. Add the garlic, ginger, star anise, cinnamon and the sliced leafy stems of celery, reserve the celery leaves for a garnish. Cook, stirring, for 1 minute. Stir in both soy sauces and leave to simmer for 30 seconds, then stir in the oyster sauce and ground pepper. Add 100ml\/3½fl oz cold water, followed by the chicken stock concentrate and the ketjap manis (or the mixture of dark soy sauce with soft brown sugar), stir until everything’s well combined and bring to the boil. Add the king prawns, immersing them in the liquid. Simmer until the prawns are cooked through. Finally, add the drained noodles and stir well – I find a couple of pasta forks, one in each hand, best for this – so that everything is combined, and most of the dark liquid is absorbed. Add the pinches of ground cinnamon and cloves, stir again, and if you’re not serving straight from the wok, pour into a serving bowl, and sprinkle with the reserved chopped celery leaves. ","ingredients":" 1 tbsp sunflower oil,  2 garlic cloves, roughly chopped,  3cm\/1¼in piece fresh root ginger, peeled and cut into fine matchsticks,  1 star anise,  ½ long or 1 short stick cinnamon, broken into shards,  2–3 leafy stems from the top of 1 stick celery, stems cut into short lengths, leaves roughly chopped,  1½ tbsp light soy sauce,  1 tbsp dark soy sauce,  1 tbsp oyster sauce,  ¼ tsp ground white pepper,  1 tsp chicken stock concentrate,  1 tbsp ketjap manis (or 1 tbsp dark soy sauce mixed with 1 tbsp soft dark brown sugar),  10 raw peeled king prawns, thawed if frozen,  80g\/2¾oz mung bean (glass) noodles or rice vermicelli, soaked and drained as per packet instructions,  fat pinch ground cinnamon,  fat pinch ground cloves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_noodles_with_72276"}