{"recipe_name":"Thai massaman chicken curry","author":"The Hairy Bikers","programme":"The Hairy Bikers and Lorraine Pascale: Cooking the Nation's Favourite Food","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the massaman curry paste, heat a small frying pan over a medium heat. When the pan is hot, add the cardamom seeds, cumin seeds and cloves and dry-fry for 1-2 minutes, or until fragrant.   Transfer the spices to a spice grinder or pestle and mortar and grind to a powder. Blend the ground spices with all of the remaining massaman curry paste ingredients in a food processor, until smooth and well combined. (Alternatively, pound the paste until smooth in a pestle and mortar.) Chill until needed, covered.   To make the chicken curry, heat the oil in a medium-sized, flameproof, lidded casserole. Add the onions and fry for 8-10 minutes, or until softened and light golden-brown. Increase the heat, push the onions to one side of the casserole, then add the chicken strips to the other side and fry for 2-3 minutes on all sides, or until sealed all over.  Add half of the massaman curry paste to the casserole (see tip). Stir well to coat the chicken and onions in the paste. Fry the mixture for 1-2 minutes, or until fragrant.  Add the potatoes, chillies, chicken stock, coconut milk, tomatoes, lime leaves, fish sauce, palm sugar and soy sauce to the casserole. Stir well and bring the mixture to the boil, then cover the casserole with the lid and reduce the heat until the mixture is simmering. Continue to simmer for 12-15 minutes, or until the chicken is cooked through (do not overcook the chicken as it will become dry). Season, to taste, with a little more fish sauce or some lime juice. Just before serving, stir in the basil leaves and half of the peanuts. To serve, spoon the Thai massaman curry into bowls and garnish with the extra Thai basil leaves, the sliced red chilli, and the remaining peanuts. Serve with steamed sticky rice. ","ingredients":" 6 cardamom pods, seeds only,  1 tsp cumin seeds,  5 cloves,  1½ star anise,  1 tsp whole white peppercorns,  ½ tsp ground cinnamon,  2 tsp dried chilli flakes,  2 tbsp groundnut oil,  25g\/1oz peanuts,  5 garlic cloves, peeled and roughly chopped,  5 lime leaves, finely sliced,  3.5cm\/1½in piece fresh galangal, peeled and roughly chopped,  2 sticks lemongrass, outer leaves removed, inner core finely chopped,  1 tsp shrimp paste,  2 tbsp fish sauce,  ½ tsp grated or ground nutmeg,  2 tbsp palm sugar,  2 tbsp cold water,  2 tbsp vegetable oil,  2 red onions, sliced,  500g\/1lb 2oz chicken breast, cut into 1.5cm\/½in strips,  1 large potato, peeled and cut into 1.5cm\/½in cubes,  2 bird’s-eye red chillies, cut almost in half lengthways (or more, to taste),  250ml\/9fl oz good-quality chicken stock, preferably homemade,  200ml\/7fl oz coconut milk,  2 tomatoes, skins removed, flesh roughly chopped,  6 lime leaves,  2 tbsp fish sauce,  1½ tbsp palm sugar,  2 tbsp soy sauce,  1 lime, juice only,  small handful sweet Thai basil (or normal basil), plus extra sprigs to serve,  25g\/1oz roasted peanuts, roughly chopped,  steamed sticky rice,  1 large red chilli, sliced diagonally","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_massaman_chicken_82428"}