{"recipe_name":"Thai massaman prawn curry with Jersey Royal potatoes","author":"The Hairy Bikers","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the curry paste, in a small, dry frying pan toast the cardamom, cumin seeds, cloves and star anise. Tip into a small blender or spice grinder, or pestle and mortar, and work to a powder. Add all the other ingredients along with 2 tablespoons water and blend to a paste. Set aside. For the curry, heat the oil in a large frying pan and cook the onions for a few minutes until soft and golden-brown. Add half the curry paste and cook for a minute or so. Add the potatoes, slashed bird’s-eye chillies, stock, coconut milk, chopped tomatoes, lime leaves, palm sugar, soy sauce and fish sauce. Simmer for about 15 minutes until the potatoes are tender and the wonderful flavours have developed. Add the prawns and cook for a couple of minutes until cooked just through.  Check the seasoning, add a little more fish sauce if necessary, and stir in the lime juice and basil, keeping a few leaves back for garnish. Add half the chopped peanuts.  To serve, spoon into bowls and garnish with the reserved basil, peanuts and top it off with the red chilli. Serve with some steamed sticky rice. ","ingredients":" 6 cardamom pods, cracked and seeds reserved,  1 tsp cumin seeds,  5 cloves,  1½ star anise,  1 tsp white peppercorns,  ½ tsp ground cinnamon,  2 tsp dried chilli flakes,  2 tbsp groundnut oil,  5g peanuts,  5 garlic cloves, roughly chopped,  5 lime leaves, finely sliced,  30g\/1oz galangal, peeled and roughly chopped,  2 lemongrass stalks, peeled and finely chopped,  1 tsp dried shrimp paste,  2 tbsp Thai fish sauce,  ½ tsp freshly grated nutmeg,  2 tbsp grated palm sugar,  2 tbsp groundnut oil,  2 red onions sliced,  250g\/9oz Jersey Royals, halved or quartered depending on size,  2 red bird’s-eye chillies, slashed,  250ml\/9fl oz chicken stock,  250ml\/9fl oz low-fat coconut milk,  2 tomatoes, skinned and finely chopped,  6 kaffir lime leaves,  1½ tsp grated palm sugar,  2 tbsp soy sauce,  2 tbsp Thai fish sauce, plus extra to taste,  500g\/1lb 2oz king prawns, veins removed,  1 lime, juice only,  handful of Thai basil,  25g\/1oz toasted peanuts, roughly chopped,  1 large red chilli, deseeded and sliced on an angle,  steamed sticky rice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_massaman_prawn_09170"}