{"recipe_name":"Thai prawn curry with noodles","author":"James Martin","programme":"Home Comforts at Christmas","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03c0jsj.jpg","method":"For the Thai red curry paste, blend all of the Thai red curry paste ingredients, including the soaking water, in a food processor to a smooth paste. Keep any spare paste in a sealed sterilised jar in the fridge for up to 1 week. For the prawn curry, heat the oil in a wok over a very high heat. Add 50g\/1¾oz of the curry paste and stir-fry for 1-2 minutes, or until just starting to darken in colour. Add the prawns, palm sugar, tamarind paste, water chestnuts, white pepper and coconut milk. Bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 10 minutes, or until thickened. Keep warm; season with the lime juice and garnish with some chopped coriander just before serving.  For the noodles, heat the oil in a wok over a very high heat. Add the chilli sauce, spring onions and red chilli and stir-fry for 1-2 minutes. Add the cooked noodles, peanuts, soy sauce, sesame oil and coriander and and stir-fry until heated through. Season, to taste, with lime juice. To serve, divide the noodles among four serving plates. Spoon over the prawn curry.  ","ingredients":" 2 large shallots, chopped,  5cm\/2in piece fresh root ginger, peeled, chopped,  2.5cm\/1in piece fresh galangal, peeled,chopped,  2 stems lemongrass, finely chopped,  2 garlic cloves, chopped,  small bunch coriander, roughly chopped, plus extra to serve,  3 dried, hot red chillies soaked in 75ml\/3fl oz warm water,  3 lime leaves, roughly chopped,  1 tbsp Thai fish sauce,  1 tbsp vegetable oil,  400g\/14oz raw tiger prawns, peeled and de-veined,  1 tbsp palm sugar,  1 tbsp tamarind paste,  1 x 225g\/8oz tin water chestnuts, drained and roughly chopped,  ¼ tsp freshly ground white pepper ,  400ml\/14fl oz coconut milk,  1 lime, juice only,  1 tbsp vegetable oil,  1 tbsp hot chilli sauce,  6 spring onions, finely sliced,  3 Thai red chillies, finely sliced,  200g\/7oz fine rice noodles, cooked according to packet instructions,  2 tbsp roasted salted peanuts, crushed,  1 tbsp light soy sauce,  1 tbsp toasted sesame oil,  3 tbsp chopped fresh coriander,  1 lime, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_prawn_curry_with_09136"}