{"recipe_name":"Thai lamb salad with spicy dressing","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/thai_lamb_salad_with_26133_16x9.jpg","method":"Blend the chopped chilli, garlic, ginger and palm sugar to a fine paste in a food processor. Add the soy and fish sauces and blend again. Taste and adjust the seasoning if necessary. Heat a frying pan over a medium to high heat. Add the lamb slices and fry for 2-3 minutes, or until crisp on one side. Add half of the chilli-and-ginger dressing and continue to cook until the lamb slices are coated in it and it is heated through. Remove the sticky lamb from the pan and set aside. In a bowl, mix together the cucumber, peas, sugarsnap peas, beansprouts, spring onions, mint leaves and coriander until well combined. Add enough of the remaining dressing to coat the ingredients, then gradually drizzle in the lime juice, tasting regularly. Add the pea shoots and mix well. To serve, divide the salad equally among four serving plates. Top each serving with some of the lamb. Drizzle over a little more of the dressing, then sprinkle with the finely sliced chilli and serve immediately. ","ingredients":" 2 red chillies, 1 chopped, 1 finely sliced (for garnish),  4 garlic cloves, crushed,  90g\/3¼oz root ginger, roughly chopped,  2 tbsp palm sugar (or light brown sugar),  6 tbsp soy sauce,  4 tbsp fish sauce,  300g\/10½oz cooked leftover lamb, fat left on, cut into thick slices,  ½ cucumber, cut in half lengthways, thinly sliced on the diagonal,  100g\/3½oz fresh peas,  100g\/3½oz sugarsnap peas, sliced lengthways,  75g\/3oz beansprouts,  6 spring onions, trimmed, sliced on the diagonal,  3 tbsp roughly chopped fresh mint leaves,  small handful coriander sprigs,  2 limes, juice only,  25g\/1oz pea shoots","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_lamb_salad_with_26133"}