{"recipe_name":"Thai roast chicken with sesame noodles and pak choi","author":"James Tanner","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Thai roast chicken, preheat the oven to 190C\/350F\/Gas 5.  Blend the chillies, creamed coconut, lime zest, lime juice and coriander in a food processor to a smooth paste. Carefully push some of the paste between the skin and flesh of the chicken breasts, making sure it is evenly distributed. Score the chicken thighs twice with a sharp knife right down to the bone. Carefully rub the remaining paste into the cuts and all over the chicken thighs. Lay the lime slices on the bottom of a roasting tray and sit the chicken on top. Cover with aluminium foil and roast in the oven for 40 minutes. Remove the aluminium foil, baste the chicken with any juices that have collected in the bottom of the tray and return to the oven for a further 30-40 minutes, basting occasionally, or until the chicken is cooked through. Remove the chicken from the oven and set aside to rest in a warm place for five minutes.   Meanwhile, for the sesame noodles, cook the noodles according to the packet instructions. Drain well. Mix the cooked noodles, sesame seeds, sesame oil and spring onions together in a bowl. Set aside. For the garlic pak choi, heat the oil in a frying pan over a medium heat. Fry the garlic and sugar for one minute, until the sugar has caramelised. Add the pak choi, cut-sides down, then pour in the chicken stock and fish sauce and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then cover the pan with a circle of greaseproof paper (a cartouche) and simmer for 3-4 minutes, or until the pak choi is tender. To serve, carve the chicken. Place one pak choi half into each of four serving bowls. Twist portions of the noodles around a fork and place them in the middle of the serving bowls. Top with the some of the chicken and the remaining pak choi halves, then drizzle with any juices from the roasting tray. Garnish with the coriander sprigs. ","ingredients":" 2 red chillies, halved, seeds removed,  150g\/5¼oz creamed coconut,  4 limes, zest and juice of 2 limes, remaining 2 limes sliced,  handful fresh coriander,  1 x 1.5kg\/3lbs 5oz whole chicken, preferably free-range,  350g\/12½oz fresh egg noodles,  1 tbsp sesame seeds, toasted,  1 tbsp sesame oil,  2 spring onions, sliced,  1 tbsp vegetable oil,  2 garlic cloves, crushed ,  pinch sugar,  4 heads pak choi, halved, cores removed,  570ml\/1 pint chicken stock,  2 tsp Thai fish sauce (nam pla),  4 sprigs fresh coriander, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_roast_chicken_with_58724"}