{"recipe_name":"Thai coconut mussels","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Thai coconut mussels, crush the garlic, galangal, lemongrass, lime leaves, shallots, palm sugar, fish sauce and vegetable oil in a pestle and mortar to a paste. Heat a lidded wok over a high heat and fry the paste for 1-2 minutes, or until fragrant. Add the mussels and coconut milk, cover with a lid and bring to the boil. Reduce the heat and simmer for 2-3 minutes, or until the mussels have opened. (Discard any mussels with shells that have not completely opened.) Meanwhile, for the straw fries, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat the oil in a deep fat fryer to 190C. Carefully lower the julienned potatoes into the hot oil, and fry for 3-4 minutes, or until crisp and golden-brown. Remove from the oil and set aside to drain on kitchen paper. Season, to taste, with salt and freshly ground black pepper. (You may need to do this in batches.) To serve stir the lime juice, coriander, Thai basil and mint intto the mussels. Spoon the mussels into each of 4 serving bowls and spoon the chips alongside. ","ingredients":" 2 garlic cloves, peeled, roughly chopped,  5cm\/2in piece galangal, or ginger, peeled, chopped,  2 stalks lemongrass ,  2 fresh lime leaves, roughly chopped,  4 shallots, preferably Thai, peeled, chopped,  1 tbsp palm sugar,  1 tbsp fish sauce,  1 tbsp vegetable oil,  1kg\/3lb 3oz mussels, beards removed, cleaned (discard any mussels that do not close tightly when tapped gently),  400ml\/14fl oz coconut milk,  1 lime, juice only,  1 tbsp chopped fresh coriander,  1 tbsp chopped fresh Thai holy basil,  1 tbsp chopped fresh mint,  vegetable oil, for deep frying,  3 large baking potatoes, peeled, julienned,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thaicoconutmussels_93907"}