{"recipe_name":"Thai tofu Panang Yorkshires","author":"Rav","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 18","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/thai_tofu_panang_99782_16x9.jpg","method":"Preheat the oven to 245C\/225C Fan\/Gas 9.  For the curry paste, put all the ingredients in a food processor and blend until smooth. If the paste is very thick, add a little water and blend again. For the tofu, heat the peanut oil in a wok or a large frying pan over a high heat, add the tofu and stir-fry for 10 minutes, turning, or until browned. Add the peppers and continue to stir-fry. Add the curry paste and cook for 2-3 minutes. Pour in the coconut milk, fish sauce and lime juice. Simmer for 15-20 minutes, or until most of the liquid has evaporated, then set aside. For the Yorkshire puddings, add a teaspoon of vegetable oil to each hole of a muffin tin. (You have enough batter for 18 small Yorkshire puddings.) Preheat in the oven for 10 minutes, or until the oil is smoking hot.   Meanwhile, in a large bowl, mix the flour, sea salt, black pepper, smoked paprika, chilli powder and cumin powder together until well combined.  In a separate bowl lightly whisk the milk and eggs. Add to the flour mixture and whisk until smooth. Set aside to rest in the fridge for at least a few minutes or ideally half an hour. Carefully remove the hot tins from the oven and using a measuring jug pour the batter evenly into each hole. Bake for 12 minutes, or until golden-brown and risen. Remove from oven and cool in the tins for few minutes, then remove and place onto a wire rack to cool further. To assemble, put the Yorkshire puddings on a serving platter. If necessary, gently push down in the middle of the Yorkshire to create a dip. Spoon a generous amount of the tofu mixture into them. Top each one with a Thai basil or coriander leaf. Arrange the lime wedges around the serving platter and serve.       ","ingredients":" 2 large onions, roughly chopped,  5cm\/2in piece galangal, peeled and grated ,  2 bird’s-eye chillies,  4 garlic cloves,  3 kaffir lime leaves,  1½ tbsp dark soy sauce,  3 tbsp fish sauce ,  1½ tbsp Thai shrimp paste,  6 tbsp tomato purée,  2 tbsp smoked paprika,  1½ tbsp ground cumin ,  1½ tbsp ground coriander ,  1 tsp turmeric ,  ½ tsp ground cloves,  ½ tsp nutmeg,  1 tbsp light brown sugar (firmly packed)   ,  2 tbsp peanut oil,  600g\/1lb 5oz extra-firm tofu, cubed,  ½ red pepper, quartered and thinly sliced,  ½ green pepper, quartered and thinly sliced  ,  500ml\/18fl oz coconut milk,  2 tbsp fish sauce ,  1 lime, juice only ,  6 tbsp vegetable oil,  200g\/7oz plain flour,  ½ tsp sea salt,  ½ tsp ground black pepper,  ½ tsp smoked paprika ,  ¼ tsp red chilli powder,  ¼ tsp cumin powder,  200ml\/7fl oz full-fat milk,  4 medium eggs (only 200g\/7oz needed) ,  handful Thai basil or coriander leaves,  3 limes, cut into wedges ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thai_tofu_panang_99782"}