{"recipe_name":"Thai fishcakes served with Thai cucumber salad","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/thaifishcakesservedw_73733_16x9.jpg","method":"Cut the fish into small pieces. Place the pepper, chillies, coriander, spring onions, garlic, lemongrass and fish sauce into a food processor and blend to a paste.  Add the fish pieces to the paste and blend well. Mix to a smooth paste adding coconut milk and egg. Place the mixture in a bowl. Slice the beans finely into 3mm (1\/8in) and stir into fish paste. Chill in refrigerator overnight or for at least two hours. Half-fill a heavy-based frying pan with oil and heat over a medium to high heat. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Shape the chilled paste into small patties with the help of a spoon. Carefully lower the fish patties into the hot oil, in batches (the oil should reach halfway up the sides of the patties). Fry until crisp and brown, turning once during cooking. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining fish patties. For the salad, cut the cucumber in to 5mm (¼in) slices  Dissolve the sugar in the vinegar and toss the cucumber slices in it. Fold in the chilli, shallot and coriander. Sprinkle with the peanuts and fish sauce just before serving. ","ingredients":" 500g\/1lb 2oz fish fillets (whiting, pollock, coley, etc),  ½ red pepper, chopped,  2 red chillies, chopped,  2 tbsp coriander ,  3 spring onions, finely chopped,  2 cloves garlic, chopped,  1 stalk lemongrass, tender part only, chopped,  1 tbsp fish sauce,  125ml\/4fl oz coconut milk,  1 whole egg,  125g\/4½oz green beans ,  vegetable oil ,  2 cucumbers peeled, halved lengthways and de-seeded,  35g\/1¼oz caster sugar,  50ml\/2fl oz rice vinegar,  2 hot chillies, finely diced,  2 shallots, finely diced,  2 tbsp chopped coriander leaves,  40g\/1½oz roasted peanuts, chopped,  ½ tbsp nam pla (fish sauce)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thaifishcakesservedw_73733"}