{"recipe_name":"Thai green chicken curry with crisp carrot strips","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the curry paste, place all of the curry paste ingredients, except the spinach, into a food processor and blend to a smooth a paste. Pour the paste into a frying pan over a medium heat and fry for 3-4 minutes to bring out the flavours and fragrances of the paste. Add the spinach and fry for one minute, until wilted down. For the chicken, place all of the chicken ingredients into a bowl, stir well,  then leave to marinate for ten minutes. Heat a griddle pan until smoking, then add the chicken and griddle for 5-7 minutes each side, or until completely cooked through. (Check that the juices run clear when pierced with a skewer at its thickest point.) For the crisp carrot strips, heat the vegetable oil in a deep, heavy-bottomed saucepan, until a breadcrumb sizzles and turns golden in 30 seconds when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the carrots and deep-fry for 5-6 minutes, or until turning golden and crisp. Carefully remove with a slotted spoon and drain on kitchen paper. Sprinkle the carrot strips with salt to taste. To serve, pour the curry paste sauce into the centre of a plate. Place the chicken on top and place with a handful of crisp carrot strips on top. ","ingredients":" 5cm piece root ginger, chopped,  25g\/1oz fresh coconut,  pinch chilli flakes,  1 lime, zest and juice only,  3 cloves garlic,  large handful fresh coriander,  2 tbsp coconut water,  75g\/2½oz fresh spinach,  1 lime, juice only,  pinch dried chilli flakes,  2 tsp soy sauce,  1 tbsp olive oil,  ½ garlic clove, chopped,  2 tsp honey,  1 chicken breast,  500ml\/18fl oz hot vegetable oil, for deep frying,  2 carrots, cut into long thin strips, dried on kitchen paper,  salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thaigreenchickencurr_84582"}