{"recipe_name":"Simple Thai noodle soup","author":"Nigel Slater","programme":"Nigel Slater's Simple Suppers","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/thaiinspirednoodleso_92377_16x9.jpg","method":"Blend the ginger, chilli, lemongrass, garlic and coriander in a food processor until quite finely chopped, adding a little vegetable oil if the paste is too dry. Add the paste to a large shallow pan and cook for a few minutes to release the aromas, stirring frequently. Roughly crush some coriander seeds with a pestle and mortar and add to the paste with a pinch or two of turmeric and the vegetable stock and simmer for a few minutes.  Meanwhile, pour some boiling water over the rice noodles in a bowl and let them sit until they have softened, about 4-5 minutes, then drain and set aside.  To soften the heat of the sauce, add the coconut milk to the pan and bring back to the boil. Reduce the heat and simmer for a few minutes while you devein the prawns by cutting along the back of the prawn with a small sharp knife and removing the black 'thread' using the point of the knife. Add the prawns to the pan and cook for 2-3 minutes, or until pink and tender, finishing off with splashes of Thai fish sauce, to taste, and more chopped fresh coriander, to your taste. To serve, divide the drained noodles between two bowls and ladle over the aromatic soup with the prawns and serve straightaway. Chicken, scallops or mushrooms are a great alternative to the prawns. ","ingredients":" 1 good knob fresh root ginger, peeled and roughly chopped,  1-2 red chillies, seeds removed (optional), roughly chopped,  1-2 stalks lemongrass, tough outer layers removed, roughly chopped,  2-3 garlic cloves, peeled ,  1 handful fresh coriander, a few sprigs reserved and chopped,  a glug or two vegetable oil,  1 tbsp coriander seeds,  1-2 pinches ground turmeric,  small jug vegetable stock ,  a couple of handfuls rice noodles,  1 x 400ml\/14fl oz can coconut milk,  1 large handful raw, peeled tiger prawns (the shells and heads can be reserved for making stock in another recipe),  a few splashes Thai fish sauce, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thaiinspirednoodleso_92377"}