{"recipe_name":"Thai-style chicken curry","author":"Jean-Christophe Novelli","programme":"Take on the Takeaway","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rice, place the rice and the lime halves into a large saucepan and pour in the boiling water. Leave to soak for 4-5 minutes to allow the rice to soften. Place the pan over a medium heat and bring to a boil. Reduce the heat and simmer for five minutes, until most of the water has been absorbed. Remove from the heat and keep the pan covered to allow the rice to steam. For the chicken, place the chicken pieces into a bowl. Add the lime juice and the sugar and mix together well. Leave to marinate for at least 2-3 minutes, longer if you can. Add the cumin seeds, turmeric, vegetable oil, fish sauce and one of the sliced chillies. Grate in the lemongrass and mix well. Heat a non-stick frying pan over a medium heat. Add the chicken mixture. Cook for 10-12 minutes, stirring regularly until the chicken is completely cooked (no pink should remain in the chicken when it's cut into. If it's still pink, cook for longer). For the sauce, place the ginger, onion, garlic and coriander stalks into a clean bowl and mix well. Heat the oil in a frying pan over a medium heat, then add the onion, ginger, garlic and coriander mixture. Fry until the onions are softened but not coloured. Season with salt and freshly ground black pepper and the teaspoon of sugar. Pour in the coconut milk and bring to the boil. Reduce the heat and simmer gently for 2-3 minutes. Return the chicken pan to the heat. Add a ladleful of the coconut sauce mixture to the chicken mixture and cook to reheat the chicken. Add the chopped coriander leaves and the remaining sliced red chilli to the chicken. If you want a smooth sauce, strain the sauce through a sieve into a clean bowl and discard the solid ingredients. Otherwise, you can leave the unstrained sauce as it is. To serve, divide the rice between two plates and place half of the chicken alongside. Spoon some of the sauce over each pile of rice, spoon extra sauce over the chicken and serve. ","ingredients":" 100g\/3½oz Thai jasmine rice,  1 lime, cut in half,  250ml\/8¾fl oz boiling water,  4 boneless, skinless chicken thighs or 2 skinless chicken breasts, cut into bite-sized pieces,  1 lime, juice only,  1 tbsp sugar,  ¼tsp cumin seeds,  1 tsp ground turmeric,  1 tbsp vegetable oil,  1 tbsp fish sauce,  2 red chillies, seeds removed, finely sliced,  2.5cm\/1in piece fresh lemongrass,  small bunch coriander, leaves only, chopped,  2 tbsp finely chopped fresh ginger,  1 onion, peeled and chopped,  1 clove garlic, peeled and finely chopped,  small bunch fresh coriander, stalks only, finely chopped,  1 tbsp vegetable oil,  salt and freshly ground black pepper,  1 tsp sugar,  1 x 400ml\/14fl oz can reduced-fat coconut milk, contents stirred","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thaistylechickencurr_86976"}