{"recipe_name":"Thai-style mushroom broth with crisp noodles, roasted pak choi and chargrilled Romero pepper","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the broth, place the lemongrass, lime zest, garlic, half of the coriander, red pepper, chilli flakes and vegetable oil into a food processor and blend to a smooth paste. Heat a little vegetable oil in a pan over a medium heat. Add the spice paste and fry for one minute. Add the wine and lime juice and fry for one minute. Add the cream, mushrooms and water and boil for 5-6 minutes. Add the remaining chopped fresh coriander leaves, stir well, then spoon the broth into two bowls. For the crisp noodles, heat the vegetable oil in a deep, heavy-based pan and heat until a small cube of bread sizzles and turns golden-brown in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully add the rice noodles and leave for 30 seconds to one minute, or until puffed up and crisp. Remove with a slotted spoon and drain on kitchen paper. For the roasted pak choi, place the pak choi onto a baking sheet, drizzle with olive oil and season with salt and freshly ground black pepper. Place into the oven and roast for 5-6 minutes. For the chargrilled Romero pepper, place the pepper onto a baking sheet, drizzle with olive oil and season with salt and freshly ground black pepper. Place into the oven and roast for 8-10 minutes, or until softened and slightly blackened all over. To serve, place a small handful of the crisp noodles on top of each bowl of soup. Garnish each bowl with roasted pak choi and chargrilled Romero pepper. ","ingredients":" 1 stick lemongrass, outer leaves removed, chopped,  1 lime, zest and juice,  2 garlic cloves, chopped,  large handful fresh coriander leaves, chopped,  ¼ red pepper, chopped,  pinch chilli flakes,  1 tbsp vegetable oil, plus extra for frying,  2 tbsp white wine,  125ml\/4fl oz double cream,  100g\/3½oz mixed oriental mushrooms, chopped,  200ml\/7fl oz boiling water,  300ml\/½ pint vegetable oil,  200g\/7oz rice noodles,  2 pak choi, halved,  dash olive oil,  salt and freshly ground black pepper,  ½ Romero pepper,  dash olive oil,  salt and freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thaistylemushroombro_88292"}