{"recipe_name":"Thai-style fish parcels","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the chopped ginger, lime leaves, chillies and lemongrass into a bowl. Pour over the coconut milk, lime juice and fish sauce and mix until well combined. Add the fish fillets and mix with the marinade mixture until completely coated. Set aside to marinate for at least two hours. When the fish has marinated, preheat the oven to 180C\/350F\/Gas 4. Lay four large sheets of baking parchment onto a work surface. Lift one marinated fish fillet from the marinade mixture and shake off any excess liquid. Place it into the centre of one of the sheets of baking parchment. Repeat the process with the remaining three fish fillets.   Strain the marinade mixture over a bowl. Spoon the pieces of chilli, lemongrass, ginger and lime leaf over the fish fillets and set aside the liquid collected in the bowl. Bring the edges of each piece of baking parchment up around the fish and fold over to seal. Place the four baking parchment parcels onto a baking tray and transfer to the oven. Bake for 15-20 minutes.  Meanwhile, bring the reserved marinade liquid to the boil in a pan. Continue to boil for 3-4 minutes, or until the sauce has thickened slightly. To serve, unwrap the baking parchment parcels and transfer each cooked fish fillet to a serving plate. Spoon the jasmine rice alongside. Spoon over the sauce. ","ingredients":" 2.5cm\/1in piece fresh ginger, peeled, chopped,  4 lime leaves, finely chopped,  3 red chillies, finely chopped,  2 lemongrass stalks, hard outer part removed, soft inner part finely chopped,  440ml\/15½fl oz canned coconut milk,  1 lime, juice only,  1 tbsp fish sauce,  4 x 150g\/6oz white fish fillets (such as cod, haddock, whiting or pollack), skin removed,  200g\/7oz jasmine rice, cooked according to packet instructions, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thaistylefishparcels_91471"}