{"recipe_name":"The perfect Christmas turkey","author":"Raymond Blanc","programme":"Christmas Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/the_perfect_roast_turkey_01155_16x9.jpg","method":"Remove the turkey from the fridge and bring to room temperature - this will take at least an hour. When you are ready to cook, preheat the oven to 230C\/220C fan\/Gas 8.  Heat the rapeseed oil in a large, heavy-based roasting tray on the stove top. Add the chopped turkey wings and neck and fry for 8-10 minutes, turning the pieces over every 2-3 minutes, or until evenly browned all over. Meanwhile, in a small bowl, soften the butter with the back of a dessert spoon, then season  with the salt and freshly ground white pepper. Using a pastry brush or your hands, smear the seasoned butter all over the turkey. Add any remaining butter to the roasting tray once the chopped wings and neck have browned. Place the turkey on top of the wing and neck pieces, then roast in the oven for 30 minutes.  Remove the turkey from the oven and baste all over with the cooking juices. Reduce the oven temperature to 160C\/150C fan\/Gas 3. Pour the water into the roasting tray, then return the turkey to the oven and continue to cook for a further 1 hour, basting the bird with the cooking juices every 20 minutes (do this quickly to prevent the heat escaping from the oven). At the end of the cooking time, test that the turkey is cooked through by inserting a skewer or roasting fork into the thickest part of its thigh; if the juices run clear, the meat is cooked. Alternatively, use a meat thermometer; if cooked, the temperature should be 74°C or above. If the turkey is not fully cooked, return it to the oven for a further 20 minutes or until the juices run clear. Remove the turkey from the oven and transfer the bird to a large, deep-sided tray, reserving the roasting tray the turkey was cooked in along with the cooking juices. Set the turkey aside to rest for a minimum of 30 minutes and up to 1½ hours. While the turkey is resting, cook your roast potatoes and vegetable dishes.  When you’re almost ready to serve the meal, return the roasting tray used to cook the turkey to the stove top. Bring the cooking juices to the boil over a medium heat, scraping up any burned bits from the bottom of the tray using a wooden spoon.  Collect the juices released by the turkey as it was resting and add them to the gravy. Season, to taste, with salt and freshly ground black pepper, if needed. Reduce the heat until the gravy is simmering, then stir in the dissolved arrowroot and cook until the gravy has thickened. Strain the gravy through a fine sieve into a warmed jug. Keep warm. To serve, bring the turkey to the table and carve into slices. Serve with the roast potatoes and vegetables. Pour over the gravy. ","ingredients":" 20ml\/¾fl oz rapeseed oil,  1 x 5kg\/11lb good-quality free-range turkey, preferably organically reared, wishbone removed (ask your butcher to remove the wings and neck and chop them into 2.5cm\/1in pieces to use in the dish),  40g\/1½oz unsalted butter, softened to room temperature,  2 pinches sea salt flakes,  2 pinches freshly ground white pepper,  200ml\/7fl oz water,  salt and freshly ground black pepper,  1-2 tsp ground arrowroot (depending on how thick you like your gravy), dissolved in 1 tbsp cold water,  roast potatoes and steamed seasonal vegetables, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/the_perfect_roast_turkey_01155"}