{"recipe_name":"The perfect baked potato","author":"Jo' Pratt","programme":null,"prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/theperfectbakedpotat_67837_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Wash the potatoes well, dry them and prick several times with a fork. Pour some olive oil into your hands and rub over the potatoes, then scatter over some sea salt which should stick to the oil. Place directly on the shelf in the oven and bake for 1¼-1½ hours, depending on the size of the potato. When cooked, the potato should be golden-brown and crisp on the outside and give a little when squeezed. Serve split open with lots of salted butter or try one of the fillings below. For the gratinated smoked trout filling, preheat the grill to medium-high. Split the baked potatoes in half and scoop out most of the fluffy flesh with a fork into a bowl. Flake in the trout and add the parsley or chives, three-quarters of the cheese, the horseradish or mustard and butter and stir with the potato flesh until just combined. Season, to taste, with salt and freshly ground black pepper. Spoon back into the potato skins, sit on a baking sheet and scatter over the remaining cheese. Grill until the cheese is bubbling and pale golden-brown. For the curried cream cheese topping, mix together all of the curried cream cheese ingredients and season, to taste, with salt and pepper. Split open the cooked potatoes and spoon the cheese mixture on top: it will melt and ooze into the hot, steaming potato.  ","ingredients":" 2 fat, floury potatoes (Maris Piper, King Edward or Marfona are all good bakers),  olive oil,  flaked sea salt,  2 smoked mackerel or trout fillets,  1 tbsp chopped fresh parsley or chives,  2 handfuls grated mature cheddar cheese,  1 tsp hot horseradish sauce or English mustard,  2 large knobs of butter,  sea salt and freshly ground black pepper,  150g\/5oz cream cheese,  1 tbsp medium curry paste,  4 spring onions or ½ small red onion, chopped,  2.5cm\/1in piece cucumber, chopped into dice,  1-2 ripe tomatoes, chopped,  small handful chopped fresh mint or coriander leaves,  good squeeze of lemon or lime juice,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/theperfectbakedpotat_67837"}