{"recipe_name":"Three cheese pizza with a rocket and parmesan salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 450F\/220C\/Gas 7. For the pizza dough, place the flours, salt, sugar and yeast into a large bowl and stir. Make a well in the centre of the flour and pour in 650ml\/1 pint 2fl oz of water and the oil, gradually mixing in the flour to form a soft dough. Tip out and knead on an oiled work surface for about 10 minutes or until the dough is smooth and elastic. Place it into a bowl, cover and leave to rise for two hours. Place a heavy baking tray or pizza stone on the top shelf of the oven to heat. When the dough has proved, remove it from the bowl and knead for a few minutes, then divide into 6-8 pieces depending on how many pizzas you want to make. Allow to rest for five minutes, then stretch each piece over your hands to form a disc about 5mm\/¼in thick. Place the circles of dough onto upturned floured baking trays or a pizza peel if you have one. For the topping, put the tinned tomatoes into a food processor and blend to a purée. Spoon the tomato purée thinly over the pizzas, scatter over the cheeses then drizzle over the oil. Season with sea salt and freshly ground black pepper. Slide a pizza off the baking tray directly onto the heated baking tray or pizza stone in the oven and cook for 5 -10 minutes, or until golden-brown and crisp. Repeat to cook the remaining pizzas. For the rocket and parmesan salad, place the rocket in a bowl. Pour the oil and balsamic vinegar into a small bowl and whisk. Toss the rocket in the dressing and mix in the parmesan just before serving. To serve, scatter the basil leaves over the pizza and drizzle with a little more olive oil. Serve with the salad. ","ingredients":" 800g\/1¾lb '00' flour,  200g\/7oz semolina flour, plus extra for dusting,  1 tsp salt,  1 tbsp caster sugar,  14g\/½oz dried yeast,  4 tbsp extra virgin olive oil,  2 x 400g\/14oz tins San Marzano tomatoes,  200g\/7oz mozzarella cheese,  150g\/5½oz dolcelatte cheese,  100g\/3½oz pecorino cheese (or a similar vegetarian hard cheese),  3 tbsp olive oil,  sea salt and freshly ground black pepper,  handful basil leaves,  2 bunches rocket,  75g\/2½oz parmesan cheese, shaved (or a similar vegetarian hard cheese),  3 tbsp olive oil,  1 tbsp balsamic vinegar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/three_cheese_pizza_with_11842"}