{"recipe_name":"Three easy dips for kids","author":"Jo Ingleby","programme":null,"prep_time":"less than 30 mins","cooking_time":"no cooking required","serves":"Makes 3 dips","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/three_easy_dips_for_kids_08808_16x9.jpg","method":"Kid’s job: For the beany dip, place the chickpeas or beans into a bowl or a food processor. Blend or mash with a fork or masher (or the end of a rolling pin!) until the beans are a rough paste. Some beans will mash more easily than others. You can leave them chunky or keep going until they are smooth. Add the crushed garlic and tahini (if using) and mix well. To get the right “dippable” consistency add a teaspoon each of water, olive oil and lemon juice and mix well. Keep adding water, oil and lemon until the dip is the texture and taste you want. Add a little salt and pepper, to taste. Kid’s job: For the cucumber yoghurt dip, grate the cucumber with a rotary grater or box grater (a grown up should supervise this). Add to a bowl with the yoghurt, lemon juice, olive oil. Add any herbs if you like, chopped with scissors. Stir well and then taste- add more lemon or seasoning as needed. Kid’s job: For the fruity salsa, carefully chop the cherry tomatoes or big tomatoes into small pieces using a salad knife (a grown up should supervise this) stir the chopped tomatoes together with the chopped spring onions, cucumber, mango and sweetcorn. Mix in any chopped herbs you want to add, with a teaspoon of olive oil and have a taste. You may want to add a squeeze of lemon or a pinch of sugar. Serve the dips with crusty bread, strips of pitta bread for dipping or use as a topping for wraps and sandwiches. ","ingredients":" 1 x 400g tin chickpeas, butter beans, pinto or borlotti beans (no added salt), rinsed and drained,  1 tbsp tahini (optional – for making hummus),  ½ garlic clove, crushed,  1 tsp olive oil,  1 tsp lemon juice, plus extra, to taste,  salt and pepper, to taste,  ½ cucumber,  150ml\/5fl oz plain yoghurt (or a dairy-free alternative) ,  1 tsp lemon juice,  small bunch fresh herbs such as mint, coriander or parsley (optional),  10 cherry tomatoes (or 3 larger tomatoes),  1-2 spring onions, chopped finely with scissors,  ½ cucumber, chopped ,  ½ mango, peel removed by an adult, chopped ,  handful of sweetcorn (fresh, tinned or frozen and defrosted) ,  small bunch herbs, such as mint, coriander or parsley, chopped (optional),  1 tsp olive oil ,  squeeze lemon juice","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/three_easy_dips_for_kids_08808"}