{"recipe_name":"Thyme meringue, lemon curd, celery sorbet and celeriac","author":"Lisa Allen","programme":"Spring Kitchen with Tom Kerridge","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the celeriac crisps, preheat a deep-fat fryer to 150C\/300F (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Fry the celeriac slices until golden-brown, then remove and drain on kitchen paper. Place the crisps into a dehydrator for 8-10 hours, or until dry. For the lemon and celery sorbet, put all the ingredients in a thermo mix or blender with 500ml\/18fl oz water. Blend until smooth, then pass through a fine sieve. Transfer to an ice cream maker and churn according to manufacturer’s instructions.   For the salt baked celeriac, preheat the oven to 180C\/350F\/Gas 4. Mix together the salt and egg white until combined and holding together. Place the celeriac on a baking tray lined with parchment paper and encase in the salt mixture. Bake for 1½ hours, or until the celeriac is soft. Set aside to cool. Once cooled, remove the salt and peel away the skin of the celeriac. Cut the celeriac into 1cm\/½in cubes. Put the elderflower cordial and glucose into a saucepan and boil until a syrup forms. Pour the elderflower syrup over the chopped celeriac. Set aside. For the celery and apple juice, place all the ingredients into a pan and bring to the boil. Remove from the heat, cover with cling film and leave to infuse for 20 minutes. Pass through a sieve and place in the fridge to cool completely. For the thyme meringue, preheat the oven to 120C\/250F\/Gas ½ and cover a baking tray with baking parchment. In a clean metal bowl, whisk the egg whites, half the sugar, water and vinegar together using an electric whisk until stiff, shiny peaks form when the whisk is removed. Gradually add the remaining sugar a bit at the time whisking between each addition. When all the sugar is added, continue whisking for 3-4 minutes, or until the meringue is stiff and glossy and stands up in peaks when the whisk is removed. Finally fold in the thyme and spoon the meringue into a piping bag. Pipe four peaks onto the lined baking tray and bake in the oven for 20 minutes, or until crisp. For the lemon curd, combine the lemon juice, sugar and eggs in a heatproof bowl suspended over a pan of simmering water (do not allow the bowl to touch the water).  Whisk together until a smooth emulsion forms. Strain through a fine sieve and cool in a bowl set over iced water. To serve, fill a piping bag with semi whipped cream. In the centre of each bowl, place a spoonful of lemon curd. Cut the meringues in half horizontally and place the bottom halves in the centre of the bowls. Pipe the cream on top of the meringue. Spike pieces of the leftover meringue into the cream randomly. Sprinkle with thyme. Place the celeriac crisps on top, randomly scatter the diced celeriac and finish with the cold celery and a spoonful of sorbet. ","ingredients":" ½ celeriac, peeled, thinly sliced on a mandoline ,  250g\/9oz lemon juice ,  50g\/1¾oz glucose,  113g\/4oz celery, chopped,  250g\/9oz sugar,  300g\/10½oz fine sea salt,  1 large free-range egg white,  1 celeriac ,  150g\/5½oz glucose,  100ml\/3½fl oz elderflower cordial,  250ml\/9fl oz apple juice ,  50ml\/2fl oz elderflower cordial,  3 sticks celery, peeled and chopped,  60g\/2¼oz egg whites ,  120g\/4½oz caster sugar,  ½ tsp warm water,  ½ tsp white wine vinegar,  ½ tsp fresh thyme, finely chopped,  125g\/4½oz lemon juice,  125g\/4½oz sugar,  125g\/4½oz free-range eggs (about two large eggs),  iced water ,  cream, semi-whipped,  1 tbsp chopped thyme ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/thyme_meringue_lemon_43248"}