{"recipe_name":"Tiger prawns, red pepper sauce and a yoghurt dressing","author":"Jason Atherton","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put all the sauce ingredients, except the prawns, in a saucepan, cook gently until the shallots are soft then bring to the boil. Transfer the mixture to a blender and blend until smooth. Pass the sauce through a sieve into a bowl. Marinade the prawns in the sauce for 10 minutes. For the dressing, combine the yoghurt, 125ml\/4fl oz cold water, garlic, shallot, vinegar, lemon juice, parsley, chives and mint. Whisk in the olive oil and season with salt, to taste.  To cook the prawns, heat a flat griddle pan until very hot. Push the prawns onto two skewers and cook on each side for 3–4 minutes. Meanwhile for the salad, place the greens, radishes and fennel in ice-cold water for a few minutes to crisp up. Remove, drain and pat dry.  Combine in a salad bowl and spoon the dressing down the sides. Toss the salad using your hands, pulling the dressing off the sides of the bowl as you do. Season with salt and pepper.  Serve the prawns on top of the salad. ","ingredients":" 300g\/10½oz shallots, sliced,  300g\/\/10½oz roasted red peppers from a jar, sliced,  70g\/2½oz garlic, thinly sliced ,  ½ tsp cayenne pepper,  100ml\/3½fl oz olive oil,  8 large tiger prawns ,  250g\/9oz fat-free Greek-style yoghurt,  2 garlic cloves, crushed or finely chopped,  1 large shallot, very finely chopped,  2 tbsp white wine vinegar,  2 tbsp lemon juice,  2 tbsp freshly chopped flatleaf parsley,  2 tbsp chopped fresh chives,  1 tbsp chopped fresh mint,  5 tbsp extra virgin olive oil,  sea salt flakes,  5 generous handfuls mixed green leaves,  5 radishes, thinly sliced,  1 fennel bulb, thinly sliced,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tiger_prawns_red_pepper_43041"}