{"recipe_name":"Tiramisu ice cream cake with chocolate sauce","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ice cream cake, pour the espresso coffee and Marsala wine into a bowl. Dip half of the sponge fingers into the coffee and wine mixture (do this quickly so they don't disintegrate). Arrange the soaked sponge fingers in a layer at the bottom of a square freezable dish. Place the coffee and vanilla ice creams into two separate bowls. Beat each with a wooden spoon until soft, smooth and spreadable. Spread the coffee ice cream over the soaked sponge fingers.  Dip the remaining sponge fingers in the coffee and wine mixture, as before, then spread over the softened vanilla ice cream. Dust the surface of the ice cream cake all over with cocoa powder. Place in the freezer to chill for 20 minutes. Meanwhile, for the chocolate sauce, bring a little water to a simmer in a pan. Suspend a heatproof bowl over the pan (do not allow the base of the bowl to touch the water). Add the plain chocolate pieces and double cream to the bowl and stir until all of the chocolate pieces have melted and the mixture is completely smooth and well combined.  Add the butter and stir until it has melted and the mixture is glossy. Keep warm. To serve, place a square of the chilled tiramisu ice cream cake into the centre of each of four serving plates. Sprinkle over the grated plain chocolate and drizzle over the hot chocolate sauce. ","ingredients":" 200ml\/7fl oz espresso coffee,  75ml\/2¾fl oz Marsala wine,  250g\/9oz ready-made sponge fingers,  200g\/7oz ready-made coffee ice cream,  200g\/7oz ready-made vanilla ice cream,  cocoa powder, for dusting ,  65g\/2oz plain chocolate, minimum 70 per cent cocoa solids, broken into pieces,  65ml\/2fl oz double cream,  ½ tbsp unsalted butter,  75g\/2½oz plain chocolate, grated, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tiramisuicecreamcake_91472"}