{"recipe_name":"Braised lemon and honey chicken with feta salad","author":"Bill Granger","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, heat a large frying pan over high heat, add the oil and chicken and cook for five minutes until golden.   Remove and set aside. Reduce the heat to medium-high, add the onion and cook for one minute. Add the garlic and cook for one minute. Return the chicken to the pan with the lemon, chicken stock and honey, reduce the heat, cover the pan and simmer for 20 minutes or until the chicken is cooked through. Lift out the chicken and put on a baking tray. Increase the heat under the sauce, and simmer, uncovered for another 15 minutes to thicken. Place the chicken under a hot grill for five minutes until crisp.   Arrange the chicken on a platter, drizzle with the sauce and sprinkle with oregano. For the salad, gently mix together the chickpeas, feta, parsley, cucumber, green pepper and olives in a large bowl.  Whisk the olive oil and lemon juice and season with salt and pepper. Toss the dressing with the salad.  Serve. ","ingredients":" 1 tbsp olive oil,  1.6 kg\/3lb 8oz chicken, cut into 8 pieces,  1 red onion, sliced,  12 garlic cloves, peeled but left whole,  1 lemon, cut into chunks,  175ml\/6fl oz chicken stock,  125g\/4½ oz honey,  small handful fresh oregano leaves,  400g\/14oz tin chickpeas, rinsed and drained,  150g\/5oz feta cheese, crumbled,  small handful fresh flatleaf parsley,  2 Lebanese cucumbers, chopped,  1 green pepper, core and seeds removed, chopped,  50g\/2oz black olives, pitted and halved ,  3 tbsp olive oil,  1 tbsp lemon juice,  sea salt,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braisedchickenwithle_83777"}