{"recipe_name":"Toffee apple and pecan pudding","author":"Mary Berry","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Makes 1 large pudding","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the toffee sauce, place all the ingredients, except the nuts, into a saucepan. Stir over the heat until melted, then boil for two minutes. Set aside to cool. For the sponge, cream the butter and sugar in a mixing bowl with a hand-held electric mixer until pale and fluffy. Add half of the beaten eggs and beat well, then add the remaining eggs plus a heaped tablespoon of the flour. Beat until smooth. Using a metal spoon, fold in the remaining flour until combined. Fold in the apples. Spoon half the toffee sauce into a buttered 1¾pt\/1L pudding basin, and scatter over half the pecans. Spoon the apple sponge into the basin and level the surface with the back of a spoon.  Cut a disc of non-stick baking parchment to neatly fit the top of the sponge. Cut a square of foil to make a lid for the basin, butter it and fold a pleat along the centre. Top the sponge with the baking paper circle and cover the basin with the foil lid tightly. Place a jam jar lid into a deep saucepan and set the covered pudding basin on top. Pour boiling water into the saucepan so that it reaches halfway up the sides of the basin. Cover the saucepan and bring to the boil. Reduce the heat to a simmer and leave to cook for 2½ hours or until the sponge is golden-brown, risen and springy to the touch. Remove the foil lid and baking parchment. Loosen the sides of the pudding from the basin and invert it onto a serving plate with a lip. Heat the remaining toffee sauce in a pan. Spoon a little over the sponge and serve the rest alongside with the remaining nuts.  ","ingredients":" 300ml\/10½fl oz double cream,  75g\/2½ oz butter, softened,  100g\/3½oz light brown muscovado sugar,  1 tsp vanilla extract,  75g\/2½oz pecan nuts, roughly chopped ,  125g\/4½oz butter, softened, plus extra for greasing,  125g\/4½oz light brown muscovado sugar,  2 large free-range eggs, beaten,  125g\/4½oz self-raising flour,  250g\/9oz Bramley apples, peeled and diced","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/toffee_apple_and_pecan_23669"}