{"recipe_name":"Braised fillet of turbot","author":"Raymond Blanc","programme":"Series 1","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the vegetable garnish, place the julienned cucumber into a large bowl. Sprinkle over the salt and mix together until the salt coats the cucumber evenly.  Spread the salted, julienned cucumber out onto a baking tray and chill in the freezer for 2 hours, or until solid. When solid, rinse well with cold water to remove the salt. Meanwhile, for the turbot, preheat the oven to 190C\/375F\/Gas 5. Heat 20g\/¾oz of the butter and all of the salt, white pepper and lemon juice in a small, non-reactive saucepan until melted. Brush the turbot and scallops all over with the melted lemon and butter mixture, then chill in the fridge until needed. Heat the remaining 20g\/¾oz of the butter in an ovenproof frying pan over a medium heat. Add the shallots and water and fry for 2-3 minutes, or until softened but not coloured. Add the sliced mushrooms and fry for a further 2-3 minutes. Pour in the wine and bring the mixture to the boil. Boil for 10-15 seconds. Push the shallot and mushrooms into the centre of the frying pan so that the liquid accumulates at the edges. Submerge the reserved fish trimmings into the liquid at the edges of the pan. Place the turbot fillets on top of the pile of shallot and mushrooms, then bring the liquid to the boil and cover the pan with a lid. Transfer the pan to the oven and cook for 6-8 minutes.  Remove the pan from the oven, arrange the scallops on top of the turbot, then re-cover the pan and return to the oven for a further 2-3 minutes, or until the scallops are just cooked through. Strain the liquid from the pan through a fine sieve into a clean saucepan. Leave the fish in the pan. Cover the pan with a lid and set aside to rest for 4-5 minutes, or until the turbot is just cooked through. For the vegetable garnish, when the cucumber has solidified and been rinsed free of salt, heat the butter in a frying pan over a medium heat. When the butter is foaming, add the cucumber and fry for 1-2 minutes, or until wilted. For the sauce, heat the strained cooking liquid over a high heat until warmed through, then whisk in the butter. Add the girolle mushrooms, wakame seaweed, wilted cucumber, tomatoes, chervil, chives and microleaves. Squeeze over the lemon juice. Mix well and heat through for 1-2 minutes. To serve, place a handful of spinach leaves into the centre of each of 4 serving plates. Place one steamed turbot fillet and two scallop halves on top of each portion of spinach. Spoon the wakame seaweed, wilted cucumber, tomatoes and girolle mushrooms over and around the fish. Drizzle over the sauce, then sprinkle over more of the herbs. ","ingredients":" ½ cucumber (cut lengthways), peeled, seeds scooped out with a spoon, julienned using a mandoline,  ½ tsp sea salt,  20g\/¾oz unsalted butter,  40g\/1½oz unsalted butter,  1 pinch sea salt,  1 pinch freshly ground white pepper,  ½ lemon, juice only,  4 x 150g\/5oz turbot fillets, trimmings reserved,  4 scallops, cleaned and trimmed, roes removed, each cut in half horizontally to form two thinner scallops,  50g\/2oz sliced shallot,  80ml\/3fl oz water,  120g\/4¼oz button mushrooms, washed, sliced,  120ml\/4¼fl oz dry aromatic white wine, such as Gewürtztraminer,  200ml\/7fl oz strained cooking liquid (from the turbot),  40g\/1½oz butter ,  80g\/3oz girolle mushrooms, halved lengthways,  100g\/3½oz wakame seaweed (available at specialist Japanese supermarkets),  200g\/7oz ripe tomatoes, cut into quarters, seeds removed, flesh finely diced,  2 tbsp chopped fresh chervil, plus extra to serve,  2 tbsp chopped fresh chives, plus extra to serve,  2 tbsp chopped fresh micro herbs, plus extra to serve,  ¼ lemon, juice only,  200g\/7oz young spinach leaves, washed, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braisedfilletofturbo_93671"}