{"recipe_name":"Toasted coconut and lime roti","author":"Sarah Jane Willis","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Toast the coconut in a dry frying pan over a medium heat until golden brown and set aside to cool.  Sift the flour and salt into a large bowl. Add the toasted coconut and the lime zest then drizzle over the vegetable oil.  Add 150ml\/5fl oz water and combine to make a soft dough.   Tip the dough out onto a lightly floured surface and knead for approximately five minutes.  Cover and rest the dough for 20 minutes. Divide the dough into six equally sized balls. Flatten the dough balls in your hand, turning them round as you do so, to make disks.  Using a rolling pin, roll each one out as thinly as possible. Brush the bottom third of the roti with a little bit of vegetable oil and fold it up until it meets the middle, then fold the top down.  Turn the dough a quarter turn round and fold in the same way.  Repeat with the remaining five roti and then set aside until ready to cook. Put a frying pan on a medium\/high heat and add a little oil. Roll out one of the roti thinly and fry in the pan until it puffs up and has golden brown patches. Flip over and repeat on the other side.  When all the roti are cooked, stack them up and place inside a tea towel.  Wrap the towel in a large piece of foil.  Seal the foil so that it traps the heat and moisture inside and keep in a warm place until ready to use. ","ingredients":" 60g\/2¼oz sweetened coconut (available online or, alternatively, add sugar to desiccated coconut),  225g\/8oz self-raising flour, plus extra for dusting,  ½ tsp sea salt,  ½ lime, zest only,  1 tbsp vegetable oil, plus extra for folding and cooking","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/toasted_coconut_and_lime_30529"}