{"recipe_name":"Toffee apple upside-down cake","author":"John Whaite","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 12 slices","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Grease 23cm\/9in square baking tin with butter and line it with greaseproof paper. Preheat the oven to 180C\/350F\/Gas 4.  For the topping, put a pan over a high heat. Add the sugar and three tablespoons of water and cook until it the sugar melts and turns amber – do not stir at any point. Remove from the heat and carefully pour the toffee into the lined baking tin, taking care to cover the base completely. Place the apple wedges in three rows on top of the toffee and sprinkle with a third of the orange zest. Add the cranberries in any gaps between the rows of apple.  For the cake, beat the butter, the remaining orange zest and sugar until pale and fluffy. Sift together the flour and bicarbonate of soda and add a tablespoon of this to the butter mix along with one egg. Mix until combined and repeat the process until all the flour and eggs have been used. Stir in the milk and a few drops of vanilla. Pour into cake tin and gently smooth with a spatula. Bake for 40-50 minutes or until a skewer inserted into the centre comes out clean. Using oven gloves, place a cooling rack over the tin and quickly flip over, taking care not to burn yourself on any hot caramel that may leak from the tin. Remove from the tin and set aside to cool completely. For the caramel crown, in a pan set over a high heat add the sugar and two tablespoons of water and cook until a caramel forms, never stirring. Place the base of a clean cake tin on a heatproof mat. Drizzle over spoonfuls of the caramel to make a pattern. Allow to dry, and then gently remove and place on top of the cake. ","ingredients":" butter, for greasing,  200g\/7oz caster sugar ,  3 large Granny Smith apples, peeled, cored and sliced in 1cm\/½in wedges,  1 large orange, zest only,  75g\/2½oz dried cranberries,  225g\/8oz salted butter, softened ,  225g\/8oz golden caster sugar ,  225g\/8oz self-raising flour,  ½ tsp bicarbonate of soda ,  4 free-range eggs, at room temperature,  60ml\/4 tbsp whole milk,  ½ tsp vanilla extract,  200g\/7oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/toffee_apple_upside_down_02328"}