{"recipe_name":"Tofu cooked in banana leaves","author":"Vegan Society","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the vegetable oil in a pan and fry the tofu slices for 2-3 minutes on both sides, or until golden-brown. Set aside and drain on kitchen paper. Return the pan to the heat and fry the aubergine for 3-4 minutes,or until golden-brown, then add the pepper and spring onions, stirring well. Cook for a further 2-3 minutes, or until the vegetables are tender.  Bring the coconut milk to the boil in a heavy-based pan, then reduce the heat. Add the rice flour and stir until the mixture is thickened.  Add the tofu and vegetables to the coconut milk mixture and stir well, then add all of the remaining ingredients to the pan (except for the banana leaves) and season, to taste, with salt and freshly ground black pepper.  Spoon some of the mixture into the middle of a banana leaf. Roll it up tightly then seal both ends with a  wooden skewer. Repeat with the remaining banana leaves and tofu mixture. Place the banana leaf parcels into a steamer and cook for 15-20 minutes. Transfer to a hot grill just before serving, cooking for 2-3 minutes on each side to brown slightly. ","ingredients":" 1-2 tbsp vegetable oil,  500g\/1lb 2oz firm tofu, thickly sliced,  1 small aubergine, chopped ,  1 red pepper, seeds removed, chopped,  2 spring onions, chopped,  100g\/3½oz  coconut milk,  200g\/7oz rice flour,  1 large chilli, seeds removed, finely chopped,  3 cloves garlic, finely chopped,  1 lemongrass stalk, tough outer leaves removed, chopped,  2 shallots, peeled, finely chopped,  6 fresh basil leaves,  salt and freshly ground black pepper,  banana leaves, for wrapping (substitute aluminium foil if unavailable)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tofuwithbananaleaf_2408"}