{"recipe_name":"Braised lamb shanks with pearl barley and root vegetables","author":"Paul Rankin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/325F\/Gas 3.   Heat the oil in a large frying pan over high heat. Add the lamb shanks and fry, turning occasionally, until golden-brown on all sides. Transfer the lamb shanks to a large flameproof casserole or ovenproof pan with a lid, and add the barley, stock or water, herbs, and salt. Cover tightly with foil and then with the lid, and cook in the oven for 1½ hours. Remove the casserole from the oven, add the vegetables and a little more water if needed. Season, to taste, with salt and freshly ground black pepper, then re-cover the casserole, and return it to the oven for another hour. Remove the casserole from the oven and check that the lamb is moist and almost falling off the bone. If you think that it's not quite ready, return it to the oven for another 15 minutes and check again. Transfer the lamb shanks from the cooking pot to a warmed serving platter and cover with kitchen foil while you finish the braised vegetables. Place the casserole over a medium heat and bring the liquid to the boil. Reduce the heat and simmer. Add more water if required to provide a nice gravy. Add the blanched parsley leaves and season, to taste, with salt and freshly ground black pepper. To serve, ladle the braised vegetables onto warmed plates and place a shank on top of each portion. ","ingredients":" 1 tbsp vegetable oil,  4 lamb shanks, trimmed of any excess fat,  2 tbsp pearl barley,  300ml\/10fl oz lamb stock (or water),  1 fresh thyme sprig,  ½ tsp dried thyme,  1 sprig fresh parsley,  1 tsp salt,  150g\/6oz carrots, roughly chopped,  1 large leek, cut into eight equal pieces,  4 small potatoes, peeled, quartered,  2 small onions, quartered,  salt and freshly ground black pepper ,  4 heaped tbsp flatleaf parsley leaves, blanched and refreshed in cold water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braisedlambshankswit_88343"}