{"recipe_name":"Tomato and mozzarella tarts with rocket pesto","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rough puff pastry, place the flour in a mound on a clean work surface and make a deep well in the centre using your fingers. Place the butter cubes and salt into the well and, using the fingertips of one hand, work the ingredients together, gradually drawing more flour into the well with the other hand. Work in the flour until the mixture is loosely but well combined and still with lumps of butter visible. Gradually add the iced water and mix until you have a rough dough. (You may not need all of the water. Take care not to overwork the mixture.) Roll the dough into a ball, wrap in cling film and chill for 20 minutes in the fridge. When the dough has chilled, roll it out on a lightly-floured work surface into a 40x20cm\/16x8in rectangle. Fold the rectangle into three and give it a quarter turn. Repeat the process, giving the folded pastry another quarter turn. Wrap the pastry in cling film and chill for a further 30 minutes. When the dough has chilled, roll it out, as before, onto a lightly-floured work surface into a 40x20cm\/16x8in rectangle. Fold the rectangle into three and give it a quarter turn. Repeat the process, as before, giving the folded pastry another quarter turn (making a total of four turns). Wrap the pastry in cling film and chill it for at least 30 minutes. For the rocket pesto, place all the ingredients in a blender and blend to a fine purée. For the tomato and mozzarella tarts, preheat the oven to 400F\/200C\/Gas 6. Roll the rough puff pastry out on a lightly-floured surface to a 2mm\/1\/8in thickness. Cut out six discs using a 12cm\/5in pastry cutter. Line a baking tray with baking parchment and brush with a little cold water. Transfer each of the pastry discs onto the tray using a palette knife. Place two teaspoons of pesto in the centre of each pastry circle, leaving a 1cm\/½in border. Place pieces of mozzarella on the top and put the tomatoes on top. Drizzle with olive oil and brush the pastry with egg yolk around the edges. Bake in the oven for 12-15 minutes, or until the pastry is golden-brown.  To serve, garnish the tarts with a little more pesto and some fresh basil leaves. ","ingredients":" 250g\/9oz plain flour, plus extra for dusting,  250g\/9oz very cold butter, cut into small cubes,  ½ tsp salt,  125ml\/4fl oz ice cold water,  110g\/4oz rocket leaves,  ½ garlic clove,  1 tbsp pine nuts, toasted,  8 tbsp olive oil,  275g\/9½oz puff pastry (from above),  200g\/7oz mozzarella, sliced,  150g\/5½oz fresh tomatoes, sliced,  25ml\/1fl oz olive oil,  1 free-range egg yolk, beaten,  handful fresh basil, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tomato_and_mozzarella_57847"}