{"recipe_name":"Tomato tart with herb oil, tapenade and watercress and tarragon salad","author":"John Torode","programme":"Celebrity MasterChef","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the relish, heat the olive oil in a saucepan and gently fry the shallot and garlic. Season with black pepper, salt and ground cumin. Add the white wine vinegar and simmer until the volume of liquid has reduced a little. Add the tomatoes, cover with a lid and simmer for 45-50 minutes, or until you have a thick relish consistency. For the tart, line a flat baking sheet with baking parchment. Cut out four 16cm\/6¼in rounds from the puff pastry sheets (use a 1 litre\/1¾ pint pudding bowl as a guide). Mark a 15mm\/¾in border in the pastry circles (use a 500ml\/18fl oz bowl as a guide).  Place the pastry on the prepared baking sheet and prick the centres with a fork. Spoon some of the cooked relish into the centre of the pastry circles. Arrange the slices of plum tomato on top and brush the border with beaten egg - making sure you don’t brush the cut edge as this will prevent the pastry rising. Bake in the oven for 20 minutes, until the pastry is risen and golden-brown. Meanwhile make the herb oil. In a pan, gently heat the garlic in the olive oil with the basil stalks and tarragon stalks. Remove from the heat after 10 minutes and season with salt and pepper. Place a small handful of the basil leaves, tarragon leaves and watercress leaves in a small food processor (reserve the rest for the salad). Pour over some boiling water to wilt the leaves. Drain the water from the food processor and blend the leaves to a paste. Pour in the herb-infused oil and blend again until smooth. Make a salad with the remaining watercress, basil and tarragon leaves. Season with salt. To make the tapenade, blend the olives, capers, anchovies, parsley, brandy and black pepper together in a small food processor. Loosen with a little olive oil and blend to make a paste. Serve the cooked tarts topped with a small quenelle of tapenade and some herb salad. Drizzle with the herb oil. ","ingredients":" 3 tbsp olive oil,  2 banana shallots, chopped,  1 large garlic clove, crushed,  1 tsp black pepper,  1 tsp salt,  2 heaped tsp ground cumin,  1 tbsp white wine vinegar,  5 really ripe tomatoes, halved,  2 sheets ready-rolled puff pastry,  8 plum tomatoes, thickly sliced,  1 free-range egg, beaten with a pinch of salt,  2 garlic cloves, crushed,  100ml\/3½fl oz olive oil,  small bunch fresh basil, leaves picked, stalks reserved ,  small bunch fresh tarragon, leaves picked, stalks reserved,  2 handfuls fresh watercress, leaves picked,  salt and black pepper,  200g\/7oz pitted Kalamata olives,  3 tbsp capers, rinsed,  15g\/½oz anchovies in oil (drained weight),  2 tbsp finely chopped flatleaf parsley,  25ml\/1oz brandy,  salt and black pepper,  drizzle of olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tomato_tart_with_herb_32067"}