{"recipe_name":"Braised lemongrass-skewered plaice with creamy tomato and tarragon sauce and spinach","author":"Daniel Galmiche","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. Season the plaice with salt and freshly ground black pepper, then roll up like cigars. Cut one of the lemongrass stalks lengthways into four to create skewers and push a skewer through each plaice roll to secure. Butter a small ovenproof dish and add the shallots and garlic. Blanch the tomatoes for one minute in boiling water, then remove the skins and cut into quarters. Reserve the skins. De-seed the tomatoes and place the seeds and skin into the buttered dish with the shallots and garlic. Cut the tomato quarters into very small cubes and set aside. Heat a frying pan until hot and add half the butter and all the plaice rolls. Cook for one minute on each side, until just golden-brown. Place the plaice rolls into the dish and pour over the white wine and fish stock. Cover the dish with kitchen foil and place into the oven to cook for 7-10 minutes, until the fish is just cooked through. Remove from the oven and remove the plaice from the dish and set aside in a warm place. Pour the cooking liquid from the dish through a sieve into a clean frying pan. Simmer until reduced in volume by half. Add the reserved tomato pieces, the whipped cream, tarragon and the remaining stalk of lemongrass and warm through. Season with salt and freshly ground black pepper. Heat a separate frying pan until hot. Add the remaining butter and all of the spinach and cook until the spinach has just wilted down. To serve, place a spoonful of spinach into the centre of each of two plates. Top each with two rolls of plaice and spoon over the sauce. ","ingredients":" 4 plaice fillets,  salt and freshly ground black pepper,  2 lemongrass stems,  2 shallots, chopped,  2 garlic cloves, lightly crushed,  2 tomatoes,  50g\/2oz butter,  110ml\/4fl oz white wine,  175ml\/6fl oz fish stock,  110ml\/4fl oz double cream, lightly whipped,  2 sprigs fresh tarragon, leaves only, roughly chopped,  300g\/10oz baby spinach","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braisedlemongrassske_89243"}