{"recipe_name":"Apple, cherry and marzipan pie ","author":"Ruby Tandoh","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the butter and flour in a large bowl and, using your fingertips, rub the butter into the flour until it resembles fine breadcrumbs.  Mix in the sugar and a pinch of salt.  Measure five tablespoons of water in a jug and slowly add it to the mixture until it comes together to form a dough (you may not need all the water). The dough should be firm but not crumbly.   Transfer the pastry to a lightly floured work surface and knead very briefly just to combine. Wrap in cling film and transfer to the fridge to chill for 20 minutes. Preheat the oven to 190C\/fan oven 170C\/375F\/Gas 5.  For the filling, in a large bowl combine the lemon zest, cinnamon, caster sugar and cornflour. Add the apples and toss to coat. Lightly flour a work surface and rolling pin. Remove the pastry from the fridge and set aside one-third for the pie lid.  Roll out the remaining pastry until it is big enough to generously fit the pie dish. Use the rolling pin to help you lift the pastry into the pie dish and gently press it into the sides, leaving any excess pastry overhanging the sides. Place in the freezer to chill for 10 minutes. Roll out the remaining pastry to form the pastry lid. Use any excess to form shapes to decorate the pie. Arrange a layer of apple slices in the pie dish and scatter with marzipan cubes and cherries.  Repeat in layers until the dish is nearly full at the edges and heaped in the centre. Place the pastry lid on top and crimp the edges to seal.  Make a hole in the centre to allow stream to escape. Place any decorative shapes on top and then glaze with beaten egg.  Bake in the preheated oven for 40-45 minutes, or until the pastry is golden-brown and crisp. Check after 25 minutes and, if necessary, cover with foil to prevent the pastry edges from burning. ","ingredients":" 225g\/8oz unsalted butter, in pieces,  430g\/15oz plain flour, plus extra for dusting,  50g\/1¾oz caster sugar,  pinch salt,  1 lemon, zest only,  pinch ground cinnamon ,  60g\/2¼oz caster sugar,  4 tbsp cornflour,  3 Braeburn apples, peeled, cored and cut into 1cm\/½in thick slices,  3 Cox apples, peeled, cored and cut into 1cm\/½in thick slices ,  200g\/7oz marzipan, cut into small cubes,  150g\/5½oz dried sour cherries ,  1 free-range egg, lightly beaten with a pinch of salt","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/apple_cherry_and_37920"}