{"recipe_name":"Basic braised mince","author":"Paul Merrett","programme":"Economy Gastronomy","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes 2 x 1kg\/2lb 4oz batches of mince","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/braisedmince_91963_16x9.jpg","method":"Heat half of the vegetable oil in a large pan over a high heat. Add the onions, garlic and herbs and fry for 3-4 minutes, or until softened and golden-brown. Turn off the heat and set the pan aside. Heat half a tablespoon of the remaining oil in a separate pan over a medium heat. Add a third of the beef mince and fry for 4-5 minutes, or until browned. Transfer the browned mince to the pan containing the onions, garlic and herbs. Repeat the process twice more with the remaining oil and the remaining batches of mince. (Overloading the pan will not speed things up because the pan will lose heat, so take your time.) Return the pan containing the cooked mince and vegetables to a medium heat. Add the tinned tomatoes and Worcestershire sauce and stir the mixture well to combine. Bring the mixture to a simmer. Meanwhile, crumble the stock cubes into a large heatproof jug and add 1 litre\/1¾ pints of boiling water. Stir until the stock cubes have dissolved. Add the stock to the beef and bring to a simmer. Simmer for 1 hour, uncovered, or until the volume of liquid has reduced slightly and the sauce has thickened. The braised mince can be eaten straightaway, served with rice or spaghetti. See the tips sections for other ways to use the mince.  ","ingredients":" 3 tbsp vegetable oil,  3 onions, chopped,  6 garlic cloves, chopped,  1 tsp chopped fresh thyme,  1 tsp chopped fresh rosemary,  1 kg\/2¼lb beef mince ,  400g tin chopped tomatoes,  1 tbsp Worcestershire sauce,  3 beef stock cubes","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/braisedmince_91963"}