{"recipe_name":"Tomato, mozzarella and basil pizza","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/tomatomozzarellaandb_87868_16x9.jpg","method":"For the base, sift the flour into a large bowl. In another bowl, mix the yeast with a little warm water until it begins to foam. Slowly add to the flour and mix to form a dough. If it's too sticky, add more flour. Cover the bowl with a clean cloth and leave to rest for five minutes. Add the salt to the dough, then turn out onto a lightly floured surface and knead for about ten minutes until smooth. Cover with a damp cloth and let it prove for 30 minutes.  Preheat the oven to its highest setting. Cut the dough in half and knead for a minute or so, making sure you really knock it back.  Press the dough out very thinly to make two circles about 40cm\/16in across, leaving the edges slightly thicker, like the edge of a plate. Place the dough circles onto floured baking sheets.  For the topping, season the tomatoes with salt and freshly ground black pepper and spread over each dough base (you probably won't need the whole tin). Sprinkle over the basil leaves, thyme leaves, if using, and mozzarella, season with salt and freshly ground black pepper and drizzle over some oil. Scatter over the olives, if using. Place the pizzas into the oven and bake for 8-10 minutes, or until the base is crisp and the cheese is bubbling. ","ingredients":" 500g\/1lb 2oz strong plain flour, plus extra for dusting ,  10g\/½oz fresh yeast,  2 tsp salt,  400g\/14oz can chopped tomatoes, well drained ,  salt and freshly ground black pepper,  small handful fresh basil leaves ,  small handful thyme leaves, optional,  200g\/7oz buffalo mozzarella cheese, torn up,  small handful pitted black olives, optional,  extra virgin olive oil, for drizzling","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tomatomozzarellaandb_87868"}