{"recipe_name":"Tomato salad with buffalo mozzarella","author":"Raymond Blanc","programme":null,"prep_time":"over 2 hours","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dried olives, preheat the oven to 100C\/210F or to its lowest possible setting. Place the olives on a baking tray and leave in the oven for 1-1½ hours, or until the olives are completely dried. Allow to cool, then finely chop and set aside. For the tomatoes, mix together all of the tomato ingredients in a bowl and set aside for one hour.  For the pesto, bring a medium pan of water to the boil, add the basil and blanch for 30 seconds. Drain and plunge the basil into iced water to stop the cooking process.  Drain the basil well, squeezing out any excess water, and place in a food blender with the remaining pesto ingredients. Blend to a fine purée, then taste and adjust the seasoning if necessary.  To serve, brush the black olive tapenade across the centre of a rectangular plate. Arrange the tomatoes across the tapenade strip, alternating with pieces of mozzarella and dried olives. Dot the plate with pesto and aged balsamic vinegar, then scatter over the croutons, slices of red onion and the micro herbs. ","ingredients":" 20 black Kalamata olives, stones removed,  400g\/14¼oz heritage tomatoes, cores removed, roughly chopped,  1 garlic clove, finely sliced,  2-3 fresh basil leaves, finely sliced,  2 tbsp extra virgin olive oil,  1 tsp white wine vinegar,  2 pinches sea salt,  1 small pinch freshly ground black pepper,  1 large bunch fresh basil ,  15g\/½oz pine nuts, toasted,  30g\/1oz parmesan cheese,  1 garlic clove,  100-125ml olive oil,  50g\/2oz black olive tapenade,  320g\/11oz buffalo mozzarella, roughly chopped,  2 tbsp aged balsamic vinegar,  8 small croutons,  1 red onion, halved and finely sliced,  4 tbsp fresh micro herbs","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tomatosaladwithbuffa_92966"}