{"recipe_name":"Tom kha soup","author":"Sophie Dahl","programme":"The Delicious Miss Dahl","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the paste, blend the paste ingredients in a food processor until smooth.  For the soup, heat the olive oil in a large saucepan and fry the paste over a medium heat for 2-3 minutes. Stir in the coconut milk and fish sauce. Pour in the boiling water, and crumble in the stock cube.  Add the prawns, and allow them to cook in the broth for 3-4 minutes, or until the prawns have turned pink and opaque. Add the mushrooms and sugar snap peas, and continue to cook for a further 2-3 minutes. Cook the soba noodles in a large pan of boiling water following pack instructions, then drain. To serve, add the lime juice to the soup and season, to taste, with salt and freshly ground black pepper. Divide the drained noodles between four bowls, and ladle over the soup. Garnish with thai basil leaves, shiso cress, the coriander leaves, and sliced chilli. Squeeze over a little more lime juice to taste. ","ingredients":" 5cm\/2in piece galangal or ginger, peeled, roughly chopped ,  2 garlic cloves, peeled,  1 stalk lemongrass, bruised,  small bunch fresh coriander, leaves chopped, roots reserved,  1-2 shallots, peeled, quartered ,  1 medium green chilli, seeds removed, roughly chopped,  3 fresh or 6 dried kaffir lime leaves ,  2 limes, zest only,  1 tbsp olive oil ,  1 litre\/1¾ pint boiling water,  1 chicken or vegetable stock cube ,  400ml\/14fl oz coconut milk ,  3 tbsp fish sauce ,  8 tiger or king prawns, shelled, de-veined,  handful enoki mushrooms ,  handful shimeji mushrooms,  4 shiitake mushrooms, chopped,  handful sugar snap peas ,  100g\/3½oz soba noodles,  1-2 limes, juice only, plus more to serve  ,  salt and freshly ground black pepper,  small handful thai basil leaves,  small handful shiso cress,  1 green chilli, sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tomkhasoup_93592"}