{"recipe_name":"Tortelli(less) di zucca","author":"Stephen Terry","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato sauce, heat a large saucepan and add the oil. Once hot, add the garlic and fry until golden-brown. Then add the chill, tomato passata and sea salt. Cook gently for 4-5 hours.  For the mustard fruit purée, place the mustard fruits and 30g\/1oz of the reserved syrup in a blender and blend until smooth. For the pumpkin, preheat the oven 160C\/140C Fan\/Gas 3. Rub the pumpkin wedges with 4 tablespoons olive oil, season with sea salt and place onto a non-stick baking tray. Cook for approximately 20 minutes. Test with a small knife at the thicker end of the pumpkin to feel it is cooked. There should be no resistance from the pumpkin. Leave to cool and then gently peel off the skin, which can be discarded. Heat a large lidded pan and add some olive oil. Once hot, add the shallots, chilli and garlic and cook until soft, then add the cavolo nero. Add 4 tablespoons water to the pan, a good pinch of sea salt and cover. Cook over a medium heat, stirring regularly, for approximately 20-25 minutes or until the cavolo nero is completely soft to the bite. Drain away any excess water and leave in the pan, covered. Reheat the pumpkin in the oven until hot. Remove and spread a thin layer of the puréed mustard fruits on the top of the pumpkin wedges followed by the lemon zest and sliced Parmesan to cover the whole surface. Place back in the oven to soften and slightly melt the cheese.  Heat a small saucepan and add enough oil to cover the base of the pan. Once hot, add the sage leaves and cook until crisp. Remove from the pan using a slotted spoon and drain on kitchen paper. Reheat the cavolo nero and the tomato sauce. Place the cavolo nero on the plates first then dab tomato sauce on and around it. Place the pumpkin on top. Crush two amaretti biscuits over the pumpkin and finish with the deep fried sage leaves. ","ingredients":" 125ml\/4fl oz olive oil,  13 garlic cloves, chopped ,  pinch dried chilli flakes ,  1 litre\/1¾ pint tomato passata,  2 tsp fine sea salt ,  70g\/2½oz mustard fruits, syrup reserved (available online and in some Italian delis),  1 large pumpkin, preferably Ironbark, cut into 3cm\/1¼in wedges,  olive oil,  3 shallots, finely chopped,  1 small red chilli, finely chopped,  2 garlic cloves, finely chopped,  250g\/9oz cavolo nero, washed and roughly chopped,  2 unwaxed lemons, finely grated zest only,  120g\/4¼oz Parmesan or Grana Padano Cheese, thinly sliced,  30 large sage leaves ,  12 amaretti biscuits ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tortelliless_di_zucca_63852"}