{"recipe_name":"Tortilla","author":"Let's Get Cooking","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the onion, pepper and mushrooms into a microwave-safe dish, cover with a lid or cling film, leaving a small area open, and cook on full power for four minutes. Meanwhile, peel the potatoes (or just scrub them if the skins are good) and slice. Take the dish out of the microwave, remove the vegetables and put to one side in a small bowl. Put the potatoes in the microwave-safe dish, cover with a lid or cling film, leaving a small area open, and cook on full power for six minutes. Allow to stand for two minutes, then check that the slices are soft. If they are not, cook on full power for another minute. Put the peas into a colander and pour some boiling water over them to soften them, then drain. Crack the eggs in a bowl, whisk well with the mustard and black pepper (if using) until frothy.  Mix the potatoes, vegetable mixture and peas together gently in the microwave-safe dish and pour over the eggs. Grate the cheese and sprinkle it into the dish over the egg. Cook on full power for two minutes, then remove the dish and stir the outside parts of the mixture into the centre and flatten with a spoon. Cook for another two minutes and repeat as in step 9. Cook for another two minutes and remove the dish from the microwave, cover with cling film and allow to stand for two minutes to finish cooking. If the egg is still a bit runny, cook for another minute on full power. Cut into wedges and serve with a tomato salad and crusty bread. ","ingredients":" 1 onion, finely chopped,  1 red or orange pepper, deseeded and cut into rings,  50g\/1¾oz mushrooms, finely sliced,  400g\/14oz potatoes,  50g\/1¾oz frozen peas,  4 large free-range eggs,  1 tsp grain mustard (optional),  black pepper (optional),  30g\/1oz low-fat mature Cheddar cheese,  crusty bread, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tortilla_28732"}