{"recipe_name":"Tortilla towers","author":"Paul Hollywood","programme":"Paul Hollywood's Bread","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/tortilla_towers_65545_16x9.jpg","method":"For the spicy shredded chicken, preheat the oven to 180C\/350F\/Gas 4. Add all the dry ingredients and the lime zest to a plastic food bag. Shake the bag so that all the spices are mixed together. Pat dry the chicken thighs using kitchen paper and then squeeze the lime juice over the chicken flesh. One by one place the chicken thighs into the bag and coat in the spice mix. The lime is for flavour, but also helps the spices mix stick.  Leave the chicken to marinate for about an hour. Remove the chicken from the bag, place the coated thighs in a roasting dish and cook for 35 minutes, or until cooked through. Meanwhile make the roasted tomato salsa. Preheat the grill to high. Place the tomatoes, red onion wedges, chillies and garlic onto a baking tray. Lightly brush with oil. Place under the hot grill and cook until the tomato skins are blackened, approximately 10 minutes.  Place all the charred ingredients into a food processor with the chipotle chilli, coriander and lime juice. Pulse until a chunky consistency is achieved. Season to taste with salt and freshly ground black pepper. Set aside until ready to serve. For the guacamole, cut the avocadoes in half and remove the stone. Remove the flesh from the skin and roughly chop.   Place in a bowl and lightly crush using a fork. Add the soured cream, lemon and lime juice and zest. Season to taste with salt and freshly ground black pepper and finish with a drizzle of olive oil. Set aside until ready to serve. For the spicy shredded chicken, once the chicken is cooked set aside to cool. When cool enough to handle, remove the meat from the bone and shred. To construct the tortilla towers, place a dollop of guacamole in the centre of each plate and place a tortilla on top.  Add a layer of guacamole, then chicken, salsa, soured cream and cheese. Add another tortilla and repeat again. Finish with sprig of coriander and a sprinkle of spring onions.  ","ingredients":" 2 tsp celery salt,  1 tbsp dried oregano,  1 tsp dried chilli flakes,  1 tsp garlic salt,  2 tsp ground cumin,  1 tsp smoked paprika,  2 limes, zest and juice only,  6 chicken thighs, skin removed,  6 tomatoes, halved,  1 large red onion, cut into wedges,  2 fat red or green chillies,  1 dried chipotle chilli,  4 garlic cloves, peeled,  1 small bunch coriander,  2 limes, juice only,  salt and pepper,  3 ripe avocados,  3 tbsp soured cream,  ½ lime, zest and juice,  ½ lemon, zest and juice  ,  1 tbsp olive oil,  salt and pepper,  12-18 corn tortillas or flour tortillas (3 per person),  soured cream, to taste,  200g\/7oz Monterey Jack or strong cheddar cheese, grated,  1 bunch spring onions, finely chopped,  1 bunch coriander, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tortilla_towers_65545"}