{"recipe_name":"Spanish omelette","author":"Delia Smith","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2-3","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/tortillaspanishomele_67957_16x9.jpg","method":"First some points to note. The size of the frying pan is important: a base measurement of 20cm\/8in diameter is about right for two to three people. If using a larger pan for more people, it should not be too heavy because you need to turn the omelette out using both hands. Use a non-stick pan if you don't have a well-seasoned frying pan. An enormous asset here is a flat saucepan lid or large plate that fits the pan. First of all, peel and cut the onion in half, then thinly slice each half and separate the layers into half-moon shapes. Now thinly pare the potatoes using a potato peeler and slice them into thin rounds - you have to work pretty quickly here because you don't want the slices to brown. When they are sliced, rub them in a clean tea cloth to get them as dry as possible. Next, heat 2 tablespoons of the olive oil in the frying pan and, when it's smoking hot, add the potatoes and onions. Toss them around in the oil to get a good coating, then turn the heat right down to its lowest setting, add a generous sprinkling of salt and pepper, put a lid on the frying pan and let the onions and potatoes cook gently for 20 minutes, or until tender. Turn them over halfway through and shake the pan from time to time, as they are not supposed to brown very much but just gently stew in the oil. Meanwhile, break the eggs into a large bowl and, using a fork, whisk them lightly - it's important not to overbeat them. Finally, add some seasoning. When the onions and potatoes are cooked, quickly transfer them to the eggs in the bowl. Put the frying pan back on the heat, add the rest of the oil and turn the heat back up to medium. Then mix the potato and eggs thoroughly before pouring the whole lot into the frying pan and turning the heat down to its lowest setting immediately. Now forget all about French omelettes and be patient, because it's going to take 20-25 minutes to cook slowly, uncovered.  Every now and then draw the edge in gently with a palette knife, as this will give it a lovely rounded edge. When there is virtually no liquid egg left on the surface of the omelette, turn it over to cook the other side. To do this, place a flat lid or plate over the pan, carefully invert both so that the omelette is on the lid or plate. Put the pan back on the heat and use the palette knife to gently ease the omelette back in. Give it about 2 minutes more, then turn the heat off and leave it for a further 5 minutes to settle. It should then be cooked through but still moist in the centre. Serve hot or cold, cut in wedges, with a salad and a glass of Rioja - it's brilliant. ","ingredients":" 1 medium onion, about 4 oz (110 g) ,  275g\/10oz small Desirée potatoes,  3 tablespoons olive oil ,  5 large eggs ,  salt and freshly milled black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tortillaspanishomele_67957"}