{"recipe_name":"Traditional roast partridge, with game crumbs, bread sauce, and roasted vegetables","author":"Matt Tebbutt","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the vegetables, preheat the oven to 200C\/180C Fan\/Gas 6. Place the vegetables into a large deep roasting tray. Drizzle with oil and season with salt and pepper. Mix to combine. Roast for an hour or until crispy on the outside and soft and in the middle. For the partridge, preheat the oven to 180C\/160C Fan\/Gas 4. Line a roasting tin with aluminium foil.  Lay the sage leaves on the breast of the partridge and lay a piece of bacon on top. Put in the prepared tin and roast for 15–20 minutes. For the game crumbs, heat the butter in a pan and once melted add the breadcrumbs and cook until toasted and golden-brown. Add the sherry. Cook until evaporated and finish with the fresh parsley. Set aside until ready to serve. For the bread sauce, stud the onion with the cloves and simmer in a small pan with the bay leaf, milk, peppercorns and butter for 15–20 minutes. Strain the liquid and return to the pan, add the breadcrumbs and season. Return to the heat and simmer for a further 10 minutes. Stir in the cream, if using, and keep warm until serving. To serve, cut the breasts off the partridges, or leave them whole, and serve with the vegetables, game crumbs and bread sauce. Garnish with fresh watercress. ","ingredients":" 200g\/7oz Chantenay carrots, peeled and left whole,  4 small parsnips, chopped,  1 small butternut squash, peeled, seeds removed and chopped,  4 tbsp olive oil,  salt and freshly ground black pepper,  2 whole partridge,  4 large leaves sage,  4 slices streaky bacon,  75g\/2½oz butter,  200g\/7oz fresh white bread crumbs,  2 tbsp medium dry sherry,  1 tbsp chopped fresh parsley,  1 large onion,  1 tbsp cloves,  1 bay leaf,  500ml\/18fl oz whole milk,  8 black peppercorns,  75g\/2½oz butter,  110g\/4oz freshly-made white breadcrumbs,  2 tbsp double cream, optional,  small bunch watercress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/traditional_roast_36962"}