{"recipe_name":"Tower of buttered prawn rostis with mustard soured cream","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the röstis, heat a heavy-based frying pan. Place the grated potato into a bowl and season well with salt and freshly ground black pepper. Divide into four portions. Place the oil and butter into the heated frying pan, then add the potato patties. Cook for 3-4 minutes on each side, pressing them down firmly with a fish slice, until cooked through and golden-brown. Meanwhile, for the prawns, heat another frying pan. Add the olive oil and tip in the prawns. Fry over a medium heat for about a minute, until the prawns have turned pink and are cooked though. Squeeze over the lime juice and sprinkle over the dill. Season, to taste, with salt and freshly ground black pepper and stir well. For the mustard soured cream, place the yoghurt in a small bowl with the cream, mustard, honey, lemon zest and olive oil. Season, to taste, with salt and freshly ground black pepper and stir well. For the herb salad, place the herbs into a bowl and drizzle over the vinegar and oil. Season, to taste, with salt and freshly ground black pepper and stir to coat the leaves. To serve, place one of the potato röstis onto a warmed plate and spoon some of the prawns on top. Drizzle over a little of the mustard soured cream. Repeat these layers until all of the ingredients have been used up. Garnish with the dressed herb salad and serve at once. ","ingredients":" 1 large potato, peeled and coarsely grated, juices squeezed out,  salt and freshly ground black pepper ,  2 tbsp olive oil,  knob of butter,  1 tbsp olive oil,  125g\/4½oz raw peeled tiger prawns, thawed if frozen,  ½ lime,  2 tsp chopped fresh dill,  salt and freshly ground black pepper ,  1 tbsp Greek-style yoghurt,  1 tbsp double cream,  1 tbsp wholegrain mustard,  1 tbsp clear honey,  ½ lemon, finely grated zest only,  1 tbsp olive oil,  salt and freshly ground black pepper,  handful fresh herbs, such as dill, chives, flatleaf parsley and basil,  ½ tsp balsamic vinegar,  1 tsp olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/towerofbutteredprawn_87813"}