{"recipe_name":"Traditional Yorkshire pudding","author":"Delia Smith","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/traditionalyorkshire_67345_16x9.jpg","method":"Pre-heat the oven to 220C\/425F\/Gas 7. Begin by placing a sieve over a large mixing bowl, then sift the flour in, holding the sieve up high to give the flour a good airing as it goes down into the bowl. Now, with the back of a tablespoon, make a well in the centre of the flour and break the eggs into it.  Add the salt and pepper. Now measure the milk and water into a measuring jug. Then begin to whisk the eggs wth an electric whisk and as you beat them the flour around the edges will be slowly incorporated. When the mixture beacomes stiff simply add the milk and water mixture gradually, keeping the whisk going. Stop and scrape the sides of the bowl with a spatula so that any lumps can be pushed down into the batter, then whisk again till all is smooth. Now the batter is ready for use and although it's been rumoured that batter left to stand is better, I have found no foundation for this - so just make it whenever is convenient. To cook the Yorkshire pudding, remove the meat from the oven (or if it's not ready place it on a lower shelf) and turn the oven up to the above temperature. Spoon two tablespoons of beef fat into the roasting tin and allow it to pre-heat in the oven. When the oven is up to temperature remove the tin, using an oven glove, and place it over direct heat (turned to medium). Then, when the fat begins to shimmer and smoke a little, pour in the batter. Tip it evenly all round and then place the tin on a high shelf in the oven and cook the Yorkshire pudding for 40 minutes or until golden brown and crisp. Serve it cut into squares presto pronto. ","ingredients":" 175g\/6oz plain flour,  2 free-range eggs,  175ml\/6fl oz milk (whole or semi-skimmed),  110ml\/4fl oz water,  2 tbsp beef dripping,  salt and freshly milled black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/traditionalyorkshire_67345"}