{"recipe_name":"Treacle marinated lamb fillet with caraway creamed carrots","author":"Martin Blunos","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the marinade, place all the ingredients into a pan and bring to the boil.  Remove from the heat and allow to cool. Add the lamb to the marinade, cover, and leave overnight in the fridge. Preheat oven to 180C\/355F\/Gas 4. For the carrots, place the carrots in a pan and cover with cold water. Bring to the boil and simmer until tender. Drain off the water, leaving two tablespoons behind. Pour double cream in and mix well. Heat a separate dry pan and add the caraway seeds. Cook for 1-2 minutes.  Mix the seed with the carrot and add the butter. For the sauce, reduce the stock and the vinegar until thickened to the consistency of treacle. Remove the meat from the marinade and pat dry on kitchen towels. Heat a pan with a drizzle of oil until hot and add the lamb. Sear on all sides. Transfer to an ovenproof dish and place in the oven to cook for a further 15-20 minutes. Remove and serve with the carrots and the sauce on an oblong serving dish. ","ingredients":" 1 litre\/1 pint 15fl oz water,  50g\/2oz salt,  50g\/2oz sugar,  ½ tbsp black treacle,  ½ tsp ground allspice berries,  5 juniper berries,  ½ tsp black peppercorns,  2 sage leaves,  2 bay leaves,  1 garlic head, halved ,  2 shallots, peeled and sliced,  1 sprig of thyme,  4 lamb fillets,  2 tbsp vegetable oil,  4 carrots, cut into 1cm\/½in cubes,  150ml\/5fl oz double cream,  1 tsp caraway seeds,  salt and freshly ground black pepper,  1 tsp unsalted butter,  ½ lemon, juice only,  sprig of chervil,  250ml\/9fl oz chicken stock,  125ml\/4½fl oz balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/treaclemarinatedlamb_74708"}