{"recipe_name":"Trio of brown trout with rhubarb compôte and dill sauce","author":"The Hairy Bikers","programme":"The Hairy Bikers' Food Tour of Britain","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mousseline of wild brown trout, grease four individual-sized ramekins with butter.  Bring the fish stock, carrot, celery, onion and white wine to a simmer in a saucepan. Season, to taste, with salt and freshly ground black pepper. Continue to simmer for 25-30 minutes. Add the smoked trout and salmon fillets to the hot stock and poach for 4-5 minutes. Remove from the stock using a slotted spoon and set aside to cool. When the poached fish has cooled, remove the skin and pick the meat from the bones. Reserve half of the fish meat for the trout, spinach and tarragon pastry.  Place the remaining poached fish into a food processor with the creamed horseradish, double cream, butter, parsley and beaten egg. Blend until smooth.  Spoon the mixture into the prepared ramekins.  Place the ramekins into a high-sided roasting tray. Add enough boiling water to the tray to reach halfway up the sides of the ramekins. Cover the tray with aluminium foil and carefully transfer to the oven. Bake in the oven (it should still be set to 170C\/325F\/Gas 3) for 10-12 minutes, or until the mousseline has set. For the trout, spinach and tarragon pastry, preheat the oven to 170C\/325F\/Gas 3. Heat half of the butter in a saucepan over a low to medium heat. Add the flour and whisk until well combined.  Gradually whisk in the milk, a little at a time, until all of the milk has been incorporated into the mixture and the sauce is smooth and has thickened.  Add the tarragon and simmer gently for 4-5 minutes. Season, to taste, with salt and freshly ground black pepper, then cover and set aside to cool.  When the sauce has cooled, stir in the cooked langoustines or prawns. Meanwhile, heat the remaining butter in a pan over a medium heat. When the butter is foaming, add the spinach and stir until wilted.  Drain the water from the wilted spinach leaves, then pat dry with kitchen paper (the spinach leaves should be as dry as possible).  Roll out the puff pastry onto a lightly floured work surface into a large rectangle (20x30cm\/8-10in). Spoon the wilted spinach along a long edge of the pastry rectangle, until it covers half of the rectangle (leave 1cm\/½in free at the edges of the rectangle).  Flake over the reserved poached fish from the mousseline.  Drizzle over the reserved tarragon sauce.  Top with the remaining wilted spinach. Brush the edges of the pastry rectangle with a little of the beaten egg. Fold the other half of the pastry over the filling mixture and press down at the edges to seal, using your fingers or a fork. Transfer to a baking sheet. Score the top of the pastry parcel lightly using a sharp knife, then brush with the remaining beaten egg.  Transfer the pastry parcel to the oven and bake for 20-25 minutes, or until the pastry is risen and golden-brown. Keep warm. (Keep the oven on.) Meanwhile, for the baked stuffed trout, season the trout, inside and out, to taste, with salt and freshly ground black pepper. Stuff the stomach cavity of each with the chopped butter and herbs. Place the trout in a roasting tray. Drizzle over a splash of white wine and olive oil. Cover the roasting tray with aluminium foil, then bake in the oven (it should still be set to 170C\/325F\/Gas 3)for 10-15 minutes, or until the trout is cooked through. For the rhubarb compôte, heat the rhubarb, sugar, star anise and 1-2 tablespoons of water in a pan over a low heat.  Heat for 10-12 minutes, stirring regularly, or until the sugar has dissolved and the rhubarb has broken down to a purée. Remove the star anise from the pan, then set aside (keep warm). Meanwhile, for the watercress quenelles, bring a pan of salted water to the boil. Add the watercress and Chinese cabbage and boil for 2-3 minutes, or until tender. Drain well. Blend the blanched watercress and cabbage, the pine nuts and olive oil in a food processor until the mixture is loose but well combined. Season, to taste, with salt and freshly ground black pepper.  Add the lemon juice and a splash or two of chicken stock, as necessary, then blend again until the mixture is well combined but still retains some texture.  Transfer the mixture to a pan and heat gently over a low heat until warmed through. Keep warm until ready to serve.  For the dill sauce, in a glass or ceramic bowl, whisk together the sugar, vinegar and mustard until well combined.  Gradually whisk in the olive oil in a thin stream, until the mixture is smooth, thick and well combined. Season, to taste, with salt and freshly ground black pepper, then stir in the dill. Set aside. To serve, cut the trout, spinach and tarragon pastry into four slices and place one onto each serving plate. Place one ramekin of mousseline alongside each. Drizzle over the dill sauce and top with one of the deep-fried sage leaves. Arrange the poached trout next to the mousseline and spoon a little of the rhubarb compôte on top. Make quenelles of the watercress mixture and place one alongside each serving of poached trout. ","ingredients":" 500ml\/17fl oz fish stock,  1 carrot, peeled and finely chopped,  1 celery stalk, finely chopped,  1 onion, peeled and finely chopped,  250ml\/9fl oz dry white wine,  salt and freshly ground black pepper,  2 hot-smoked trout fillets,  2 smoked salmon fillets,  1 tsp creamed horseradish (from a jar),  150ml\/5fl oz double cream,  3 tbsp unsalted butter, softened, plus extra for greasing ,  2 tsp chopped fresh parsley,  1 free-range egg, beaten,  50g\/2oz unsalted butter,  1 tbsp plain flour, plus extra for dusting,  250ml\/9fl oz whole milk,  1 tbsp chopped fresh tarragon leaves,  salt and freshly ground black pepper ,  500g\/1lb 2oz cooked langoustines or prawns, heads removed, shells removed, de-veined,  500g\/1lb 2oz baby spinach leaves,  1 x 250g\/9oz pack ready-made puff pastry,  plain flour, for dusting,  poached trout and salmon meat (reserved from the mousseline, see above),  1 free-range egg, beaten, for egg wash,  4 whole brown trout, heads and tails removed, skin scored 3-4 times using a sharp knife ,  salt and freshly ground black pepper,  300g\/10½oz cold butter, chopped into 12 pieces,  bunch mixed herbs, such as parsley, chives and tarragon,  splash white wine,  splash olive oil,  6 rhubarb stems, trimmed, roughly chopped,  50-60g\/2-2½oz soft brown sugar,  1 star anise,  splash water,  200g\/7oz watercress leaves,  1 Chinese cabbage, core removed, leaves shredded,  50g\/2oz pine nuts,  2 tbsp extra virgin olive oil,  salt and freshly ground black pepper,  2 tsp freshly squeezed lemon juice,  splash chicken stock,  15g\/½oz sugar,  200ml\/7fl oz red wine vinegar,  80g\/2¾oz Dijon mustard,  400ml\/14fl oz olive oil,  salt and freshly ground black pepper ,  2 tbsp chopped fresh dill,  4 deep-fried fresh sage leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/trioofbrowntroutwith_92124"}