{"recipe_name":"Trout picnic pie","author":"Frances Quinn","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the filling, preheat the oven to 220C\/425F\/Gas 7. Place the chopped peppers and sweet potatoes in roasting trays, coat them lightly in a little of the olive oil and roast for 20-30 minutes. Place the lemon zest and rice in a saucepan with a little olive oil to coat. Add the turmeric and bay leaves. Mix the vegetable bouillon with hot water (double the volume of water to rice). Cover the rice with bouillon and simmer for 10-15 minutes, or until the rice is cooked. Drain thoroughly, add a knob of butter and set aside.  For the pastry, mix the cold water with the lemon juice. Put the flour and salt in a bowl and, using your fingertips, rub the butter into the flour until the mixture resembles fine breadcrumbs. Make a well in the centre of the mixture and add the whole egg and egg yolk. Bring the pastry together with your hands, gradually adding the water and lemon juice liquid until you have a smooth dough. Transfer the pastry to a lightly floured work surface and gently knead it into a ball. Flatten to create a disc shape, wrap in cling film and place in the fridge to rest for at least 10 minutes. Meanwhile for the filling, cook the asparagus in a pan of salted boiling water until just tender, then transfer to a bowl of cold water to cool. Gently fry the shallots in a pan with a knob of butter and a little olive oil. When the shallots are translucent, add the garlic and cook for a few minutes to soften. Add the shallots to the cooked rice and stir through the toasted pine nuts. Fry the beetroot in the same pan you cooked the shallots in. Cook gently for a few minutes until just tender. Add the brown sugar and balsamic vinegar and season with salt and pepper. Transfer to a dish to cool. Add the chopped dill, parsley and mint to a bowl with the lemon juice, a tablespoon of olive oil and the white wine vinegar. Season to taste with salt and pepper, then toss through the cooled asparagus. In a bowl, mix together the butter, garlic, lemon zest and chopped herbs. Cover the rainbow trout fillets with the herb butter.  Preheat the oven to 180C\/350F\/Gas 4 and line a large loaf tin with aluminium foil and then baking parchment (to make removing the pie easier once cooked). Remove the chilled pastry from the fridge. Divide into two and roll out one half on a lightly floured work surface until it is large enough to line the loaf tin. Line the tin with the pastry, leaving a slight overhang around the edge. Start to layer the pie filling, seasoning every layer as you go with salt and pepper.  Start with a layer of rice, then peppers, a rainbow trout fillet, some smoked trout, asparagus, beetroot and sweet potato. Repeat until the pastry case is full and all the ingredients have been used. Roll out the remaining pastry to form a pie lid. Brush the edges of the pastry case with a little beaten egg, lift the lid into place and press down to seal. Use any pastry trimmings to decorate the top of the pie. Weave strips of pastry in a lattice to represent a picnic hamper. Top with a pastry bow, a picnic hamper fastening and some flowers. Neatly crimp the edges of the pie and cut out a small square in the centre of the pie to allow steam to escape. Brush the surface of the pie with egg wash and then bake for approximately 50 minutes, or until dark golden-brown (check after 30 minutes - if the pastry is browning too quickly cover the edges with foil to stop it burning). While the pie is baking make the saffron mayonnaise. Stir together the sunflower and rapeseed oil in a measuring jug. In a bowl beat the egg yolk, soaked saffron, salt, mustard and lemon juice. Slowly add the oil in a thin stream, whisking all the time until you have a thick mayonnaise. Transfer to a small pot and chill until ready to serve. To serve, toss the salad leaves and cherry tomatoes together in a bowl. Serve the pie hot with the salad and mayonnaise alongside. ","ingredients":" 6 red Romano peppers, chopped,  4 sweet potatoes, cut into chunks,  5 tbsp olive oil,  1 lemon, zest only,  100g\/3½oz basmati rice,  ½ tbsp ground turmeric,  3 bay leaves,  1 tsp vegetable bouillon powder,  few knobs of butter,  300g\/10½oz asparagus tips,  4 shallots, chopped ,  2 garlic cloves, finely chopped,  50g\/1¾oz pine nuts, toasted,  400g\/14oz cooked beetroot, grated,  1 tbsp brown sugar,  3 tbsp balsamic vinegar,  salt and black pepper,  handful fresh dill, chopped ,  handful fresh parsley, chopped ,  handful fresh mint, chopped ,  ½ lemon juice, juice only,  1 tbsp white wine vinegar,  salt and black pepper,  500g\/1lb 2oz rainbow trout fillets, boned, skinned,  120g\/4¼oz smoked trout,  For the herb butter,  50g\/1¾oz butter, softened,  1 garlic clove, crushed,  ½ lemon, zest only,  handful dill and parsley, chopped,  80ml\/2½fl oz ice-cold water,  1 tbsp lemon juice,  500g\/1lb 2oz plain flour, plus extra for dusting,  1 tsp salt,  250g\/9oz unsalted butter, cubed,  1 free-range egg, plus 1 yolk,  1 free-range egg, beaten with pinch of salt, to glaze,  120ml\/4fl oz sunflower oil,  1½ tbsp rapeseed oil,  1 free-range egg, yolk only,  pinch saffron strands, soaked in 1 tbsp lemon juice for 15 minutes,  pinch salt,  ½ tbsp English mustard,  ½ tbsp lemon juice,  200g\/7oz mixed salad,  70g\/2½oz lamb's lettuce and wild rocket,  300g\/10½oz cherry tomatoes","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/trout_picnic_pie_26682"}