{"recipe_name":"Trout fillet with pine nut crust, herb rice and spicy tomato sauce","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the trout with pine nut crust, place the pine nuts in a food processor or mini blender and pulse until roughly chopped. Spread out on a tray and roll the trout fillet pieces in the nuts to coat. Heat the oil and butter in a small frying pan and fry the trout for about four minutes on each side, or until golden-brown and crisp. Add the lemon juice at the end, allowing it to slightly reduce in the pan. For the herb rice, heat the oil in an ovenproof pan and gently fry the onion and garlic until soft. Add the rice and fry for 1-2 minutes. Add the hot vegetable stock, season, to taste, with salt and freshly ground black pepper and stir. Cook on the hob for about 7-8 minutes, then put a lid on the pan and place in the oven for a further 8-10 minutes, stirring once during cooking and adding more hot water if more liquid is required. Remove from the oven and stir in the chopped dill and parsley. For the spicy tomato sauce, heat the oil in a saucepan and gently fry the onion and garlic until soft. Add the chilli and fry for a further 1-2 minutes. Add the chopped tomatoes, season, to taste, with salt and freshly ground black pepper and turn up the heat until the tomatoes are cooking down and the sauce is bubbling. Add the white wine and cook for a further two minutes. Reduce the heat and put a lid on the pan. Cook for a further five minutes, or until the tomatoes are cooked down. Finally stir in the torn basil leaves. Using a hand blender, process the sauce until smooth, adding more salt and freshly ground black pepper if required. To serve, place a spoonful of the rice onto a serving plate, arrange the trout halves on top and spoon over the sauce. Garnish with a sprig of dill. ","ingredients":" 55g\/2oz pine nuts,  1 fillet rainbow trout, halved,  1 tbsp olive oil,  15g\/½oz butter,  ½ lemon, juice only,  1 tbsp olive oil,  ½ onion, finely chopped,  1 garlic clove, finely chopped ,  200g\/7oz long grain rice,  200ml\/7fl oz hot vegetable stock,  salt and freshly ground black pepper ,  2 tbsp chopped fresh dill, plus a sprig for garnish,  2 tbsp chopped fresh flatleaf parsley,  1 tbsp olive oil,  ½ onion, finely chopped,  1 garlic clove, finely chopped ,  1 fresh green chilli, chopped,  3 fresh tomatoes, chopped,  salt and freshly ground black pepper ,  2 tbsp white wine,  1 handful fresh basil, torn","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/troutfilletwithpinen_88058"}