{"recipe_name":"Trout en papillote with smoked trout and watercress salad","author":"The Hairy Bikers","programme":"The Hairy Bikers' Food Tour of Britain","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 210C\/425F\/Gas 7. For the trout en papillote, spread a large sheet of greaseproof paper onto a baking tray. Dot all over with some of the butter. Place one trout onto the greaseproof paper, then stuff the cavity with a quarter of the herbs and lemon slices. Season, to taste, with salt and freshly ground black pepper, then sprinkle over a quarter of the watercress leaves. Bring the edges of the greaseproof paper together and fold to form a sealed parcel. (You may need to wrap the parcel in aluminium foil to hold it closed.) Repeat the process with the remaining trout, herbs, lemon slices and watercress, until you have four sealed parcels. Transfer the parcels to a baking tray and bake in the oven and bake for 15-20 minutes.  Meanwhile, boil the potatoes in pan of salted water for 10-12 minutes, or until tender. Drain well, then add the butter to the pan. Season, to taste, with salt and freshly ground black pepper.  Meanwhile, for the salad, place the flaked smoked trout, watercress leaves, walnuts and chopped pears into a bowl and mix well to combine. In a separate bowl, whisk together the white wine vinegar, rapeseed oil and honey until well combined. Season, to taste, with salt and freshly ground black pepper and whisk again. Drizzle the dressing mixture over the salad and mix until the salad is completely coated in the dressing. For the mustard and horseradish cream, in a separate bowl, mix together the mustard, horseradish cream and crème fraîche until well combined. To serve, unwrap the trout parcels and place one portion of steamed trout and watercress into the centre of each of four serving plates. Spoon the buttered potatoes, dressed salad and a dollop of horseradish cream alongside. ","ingredients":" 50g\/2oz butter,  4 whole trout, gutted and cleaned,  1 large bunch fresh dill,  1 large bunch fresh flatleaf parsley,  1 large bunch fresh chervil,  2 lemons, sliced,  2 bunches fresh watercress, leaves only,  700g\/1½lb new potatoes, scrubbed,  600g\/1lb 5oz hot-smoked trout fillets, flaked,  2 large bunches fresh watercress, washed, leaves only,  110g\/4oz walnuts, shells removed,  2 pears, peeled, cores removed, flesh chopped,  1 tbsp white wine vinegar,  3 tbsp rapeseed oil,  1 tbsp honey,  2 tsp wholegrain mustard,  1 tbsp ready-made horseradish cream,  3 tbsp crème fraîche","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/troutenpapillotewith_91839"}