{"recipe_name":"Truffle panna cotta","author":"Andrew Turner","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 5","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the panna cotta, bring the double cream, milk, caster sugar, vanilla pod and 20g\/1oz of the truffle to the boil in a pan. Remove from the heat and set aside to cool slightly. Whisk the dissolved gelatine into the cream mixture until smooth and thickened. Pour the mixture into five panna cotta moulds or ramekins. Chill in the fridge for 2-3 hours, or until set. Meanwhile, for the candied truffle, heat the truffle shavings in the stock syrup until tender, about 4-5 minutes. Remove the truffle from the syrup and set aside to dry on a sheet of greaseproof paper. For the orange truffle syrup, return the stock syrup used to cook the truffle to the boil. Stir in the orange juice and zest, the dark rum and the espresso until well combined.  Reduce the heat until the mixture is simmering and continue to simmer for 5-10 minutes, or until the volume of syrup has reduced and thickened slightly. To serve, place an orange slice into the centre of each of five serving plates. Run the panna cotta moulds under hot water to loosen the panna cotta. Turn one panna cotta out onto each orange slice. Drizzle over the orange truffle syrup and sprinkle with the candied truffle. ","ingredients":" 350ml\/12oz double cream,  150ml\/5oz full-fat milk,  80g\/3oz caster sugar,  ½ fresh vanilla pod, split,  20g\/¾oz fresh winter truffle, grated,  1½ gelatine leaves, soaked in warm water until dissolved,  5g\/¼oz fresh winter truffle shavings,  250ml\/9fl oz stock syrup (made by boiling 125g\/4½oz sugar and 250ml\/7fl oz water until the mixture resembles syrup),  250ml\/9fl oz stock syrup used to cook the truffle (see above),  2 oranges, juice only,  1 orange, zest only, plus five orange slices, to serve,  50ml\/2fl oz dark rum,  50ml\/2fl oz double espresso","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/trufflepanacotta_10350"}