{"recipe_name":"Tuna Niçoise","author":"Paul Hollywood","programme":"Paul Hollywood's Bread","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the tapenade, combine everything except half of the basil and the black pepper in a food processor and blend until roughly chopped up, but not puréed. Pour into a dish and garnish with black pepper and the remaining basil leaves.   To make the dressing, place all ingredients in a clean jam jar. Put the lid on and shake well until the dressing has emulsified. To make the salad, tear the Baby Gem leaves and place in a bowl with the remaining salad ingredients. To make the tuna, heat a griddle pan until hot. Rub a little olive oil on both sides of the tuna steaks and season with salt and freshly ground black pepper. Fry the tuna in a hot pan for two minutes on each side, or until cooked to your liking.  To serve, drizzle two tablespoons of dressing over the salad. Very gently, using your hands, mix the salad so that it’s coated in the dressing. Arrange the salad on a large platter or board. Place the eggs around the salad. Slice the tuna on the diagonal and lay slices on top of the salad. Sprinkle over the chives. Pour any remaining dressing in a jug leave on the table next to the salad. Serve with the fougasse and tapenade. ","ingredients":" 50g\/1¾oz anchovies in oil,  400g\/14oz pitted black olives,  75g\/2½oz capers, drained and rinsed,  2-3 garlic cloves,  1 tsp Dijon mustard,  2 tsp lemon juice,  2 tbsp good-quality olive oil,  handful fresh basil, chopped,  fresh black pepper,  2 tsp Dijon mustard,  1 tbsp white wine vinegar,  100ml\/3½oz extra virgin olive oil,  ½ lemon, juice only,  pinch of salt and pepper,  4 Baby Gem lettuce ,  200g\/7oz green beans, topped, tailed and blanched,  4 tsp capers, drained and rinsed,  200g\/7oz cooked new potatoes,  24 baby plum tomatoes, cut in half,  4 tuna steaks, approximately 175g\/6oz each,  1 tbsp olive oil,  salt and freshly ground black pepper,  4 soft-boiled medium eggs, peeled and halved,  1 tbsp chopped chives,  1 loaf olive sourdough fougasse ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/tuna_nicoise_87874"}