{"recipe_name":"Turbot on the bone with red wine tartare dressing and chargrilled leeks","author":"Nathan Outlaw","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/450F\/Gas 8. Trim the turbot using a sharp, big knife and a mallet and cut into 4 pieces. Heat a non-stick pan and add the fish, white side down. Place in the oven and cook for 10-12 minutes Place the red wine, vinegar, sugar and 110ml\/4fl oz water into a saucepan and cook until reduced to a syrup. Heat a frying pan until hot, add the butter with the thyme and garlic and cook until a nut brown colour. To make a dressing, add 2 tbsp of the red wine reduction to 4 tbsp of the brown butter and then mix with the chopped herbs, gherkin and 1 tbsp of the capers and warm gently. For the leeks, bring a pan of salted water to the boil, add the leeks and cook until just tender then drain and pat dry. Heat a griddle pan until hot, toss the leeks with a little olive oil, salt and black pepper and char on each side until scorched. For the capers, heat 2.5cm\/1in of oil in a deep sided pan until hot. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully add the remaining 2 tbsp of the capers and cook until fried then drain onto kitchen paper. To serve, remove the fish from the oven and peel off the darker skin then season with salt and place on a warm plate.  Place the leeks on the plate and spoon over the dressing.  Finish with the lemon and deep fried capers. ","ingredients":" 1 whole turbot (2kg\/4lb 8oz),  110ml\/4fl oz Nero d’Avola red wine from Sicily,  110ml\/4fl oz red wine vinegar,  110g\/4oz caster sugar,  250g\/9oz unsalted butter,  2 garlic cloves,  sprig of thyme,  1 tbsp chopped parsley,  1 tbsp chopped chervil,  1 tbsp chopped chives,  1 tbsp chopped tarragon,  2 tbsp chopped gherkins,  3 tbsp medium sized capers,  12 baby leeks, trimmed and blanched,  2 tbsp rapeseed oil,  salt and freshly ground black pepper,  1 lemon, segmented and chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turbot_on_the_bone_with_69241"}