{"recipe_name":"Turbot with a ginger and lime sauce and steamed greens","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ginger and lime sauce, heat a frying pan and add the oil. Once hot, add the shallots and cook for 1-2 minutes. Add the garlic, ginger, lemongrass and lime leaf and cook for a further 2-3 minutes. Stir in the fish sauce, palm sugar, rice wine vinegar, lime juice and stock and cook for 2-3 minutes. Keep warm while you cook the fish and vegetables. For the turbot, heat a large frying pan and add the oil, once hot add the fish skin-side down. Cook for 2-3 minutes on each side and allow to rest on a warm plate. (Depending on the size of your frying pan you may need to cook the fish in batches.)  For the steamed greens, place a steamer over a saucepan of boiling water and add the bok choi, broccoli, ginger, lemongrass, sesame oil and soy sauce. Cover with a lid and cook for 4-5 minutes. Just before serving add the fresh mint and coriander to the sauce. To serve, place the steamed vegetables in the centre of shallow bowls and place the fish on top. Remove the skin and pour over the ginger and lime sauce. ","ingredients":" 2 tbsp vegetable oil,  2 banana shallots, peeled and finely diced,  2 garlic cloves, roughly chopped,  5cm\/2in piece fresh root ginger, cut into julienne,  1 lemongrass stick, finely chopped,  1 lime leaf, finely chopped,  2 tbsp Thai fish sauce,  3 tbsp palm sugar (alternatively use soft brown sugar),  2 tbsp rice wine vinegar,  2 tbsp lime juice,  150ml\/5fl oz vegetable stock,  3 tbsp roughly chopped fresh mint,  3 tbsp roughly chopped fresh coriander,  2 tbsp vegetable oil,  4 x 150g-200g\/5½-7oz turbot fillets, skin on, pin-boned,  4 bok choi, halved,  150g\/5½oz Tenderstem broccoli,  2cm\/¾in piece fresh root ginger, thinly sliced,  2 sticks lemongrass, bruised and chopped in half,  2 tbsp sesame oil,  2 tbsp soy sauce","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turbot_with_a_ginger_and_48467"}