{"recipe_name":"Turbot, crab, wild garlic and leeks","author":"Paul Ainsworth","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the garlic oil, heat the vegetable oil to 80C. Pour over the garlic leaves in a blender and blend on highest speed for 30 seconds. Pour into an ice bain-marie and chill. Hang in a chinois lined with paper towels so no particles can get through. Leave overnight. The oil should have all gone through and be clear. For the oyster wild garlic mayonnaise, it is important to have all your ingredients chilled and chill the bowl of your food processor too. Place the oyster and egg yolk in the food processor and begin to blend. When smooth add a splash of lemon juice and a pinch of salt, slowly begin to add the garlic oil, let it emulsify then slowly drizzle the oil in until the mayonnaise is thick. Adjust the seasoning with lemon juice and salt to taste. Set aside in the fridge. For the crab, the most humane way to kill the crab is to put it to sleep in the freezer for about one hour before cooking. Alternatively you can pierce its underside with a sharp knife. Place all of the other ingredients, except the crab, into a large pan with 3 litres\/5¼ pints water and bring to the boil to make the bouillon. Submerge the crab in the boiling bouillon, place the lid on and once it comes back to the boil remove the lid and cook for 14 minutes. Remove the crab and chill quickly in the refrigerator. When ready to pick, remove the kegs and claws then take the body out of the shell, crack open all the legs and claws removing all white meat, then carefully pop out the joints from the body and pick the white meat out. Save the shells for making a sauce. Carefully pick through the crab for shell and cartilage in an ice cold tray. Store the crab meet in a bowl that is on ice. For the leeks, put the salt, butter, thyme, garlic and pepper into 200ml\/7fl oz water. Bring to the boil and simmer until emulsified. Use a large pan so the leeks will be only 1 layer thick. Check for seasoning, add in the leeks and evenly disperse. Cook until tender and chill quickly, spread out evenly, in the refrigerator. For the crab bisque, heat the oil in a pan and gently fry the diced vegetables in olive oil in a pan. Add in herbs, spices, salt and saffron and cook but don’t burn the spices. Once you have good colour on the vegetables add the tomato purée and cook for a couple of minutes, then add the chopped fresh tomatoes. Deglaze the pan with brandy then add the roasted crab shells. Mix well with the vegetables. Transfer to a pressure cooker. Cover with crab or fish stock and pressure cook for 30 minutes. Sieve off the liquid and heat the liquid in a pan to reduce it until you have a strong roasted crab flavoured stock that will be a deep brown colour. Finish with butter, lemon juice and a little oyster mayonnaise for flavour but do not boil at this stage as you will loose the body of the sauce. For the turbot, preheat the oven to 180c\/160C fan\/ Gas 4. Season the turbot well all over with salt and place dark skin side down into a pre heated non-stick pan with olive oil. Colour the fish on all sides then add the butter. Baste the fish in the nut-brown butter then remove on to a non-stick baking tray. With the remaining butter in the pan add the lemon juice, mix, then pour over the fish. Bake in oven for a few minutes until the thermometer reads 45\/46C on the bone. Leave to rest before serving. To serve, warm your leeks in a little crab stock and finish with lemon juice to taste, and some chervil and chives. Placed into small copper pans or a serving dish. Finish your fresh crab with lime zest, fresh lemon and lime juice, chopped oyster leaf, chervil and chives and salt, if needed.  Then place on top of the leeks. Finish the crab and leeks off with a salad of crispy seaweed, oyster leafs, fennel tops, piped dollops of oyster wild garlic mayonnaise, wild garlic flowers and garlic oil. Place you cooked turbot into the centre of the plate (this is your show stopper). Finish with a swirl of garlic oil around the fish then pour the hot bisque sauce through the oil, finish with extra sauce on the side. ","ingredients":" 100g\/3½oz picked wild garlic leaves,  500ml\/18fl oz vegetable oil,  1 oyster,  1 egg yolk,  300ml\/10fl oz garlic oil (from above),  lemon juice,  salt and pepper,  60g\/2¼oz salt,  50ml\/2fl oz white wine,  1 lemon juice,  ½ fennel bulb, diced,  ½ Spanish onion, diced,  1 carrot, diced,  1 celery stick, diced,  ½ head garlic,  pinch white peppercorns,  1-star anise,  small bunch thyme,  2kg\/4lb 8oz fresh, whole crab,  12g\/½oz salt,  250g\/9oz unsalted butter,  1 tbsp picked thyme,  2 garlic cloves, thinly chopped,  9 turns of a pepper mill,  650g\/1lb 7oz leeks, light green and white parts only, cut into 1.5cm\/½in dice,  2 tbsp olive oil,  3 celery stick, diced,  1 large onion, diced,  2 large carrot, diced,  fennel leaves, diced,  half a leek, diced,  3 garlic cloves, diced,  1 bay leaf,  2 sprigs of thyme,  2 star anise,  1 tsp peppercorns, coriander seeds, fennel seeds,  1 pinch saffron,  2 pinch rock salt,  2 tbsp tomato purée,  4 ripe red vine tomatoes, chopped,  good splash brandy,  crab shells, from above, roasted in oven,  crab stock, or fish stock, to cover,  butter, to taste,  lemon juice, to taste,  1 whole turbot, cleaned and portion into tranches on the bone (250g per serving),  olive oil,  50g\/1¾oz unsalted butter,  1 lemon, juice only,  handful oyster leaf,  handful chervil, chopped,  handful  chives, chopped,  crispy seaweed,  fennel tops,  wild garlic flowers","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turbot_crab_wild_garlic_41516"}