{"recipe_name":"Turbot steaks with seaweed, turnips and potatoes","author":"Nathan Outlaw","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/200C Fan\/Gas 6.  For the seaweed butter, put the butter, dried sea lettuce, shallot, garlic and lemon zest in a bowl and mix well. Season with salt and pepper. Lay a sheet of cling film on your work surface and shape the butter into a roll on top of it. Wrap the roll in the cling film and twist and tie the ends. Refrigerate until firm.  For the turbot steaks and vegetables, lay the potato and turnip slices in a baking dish large enough to hold the fish, then scatter over the shallots, garlic and thyme. Season with salt and pepper, sprinkle with the lemon juice and pour on the fish stock. Bake for 45 minutes, or until just cooked.  Just before the potatoes will be ready, heat a frying pan over a medium heat and add a little oil. Add the turbot and fry for about a minute on each side to lightly colour. Season the turbot with salt and pepper and lay it on top of the potatoes. Return the dish to the oven for 10 minutes.  Cook the broccoli in lightly salted boiling water for 2-3 minutes, then drain and return to the pan. Add some of the seaweed butter and toss. Cut six slices of seaweed butter and place three slices on each turbot steak. Bake for another 2 minutes. Serve immediately, with the broccoli.  ","ingredients":" 250g\/9oz unsalted butter, softened,  3 tbsp dried sea lettuce ,  1 shallot, finely chopped,  2 garlic cloves, finely chopped,  1 lemon, finely grated zest only,  2 baking potatoes, cut into 2-3mm thick slices ,  2 small turnips, cut into 2-3mm thick slices,  3 shallots, thinly sliced,  2 garlic cloves, finely chopped,  2 tsp chopped fresh thyme leaves,  1 lemon, juice only,  250ml\/9fl oz fish stock,  light rapeseed oil, for cooking,  2 x 250g\/9oz turbot steaks,  400g\/14oz purple sprouting broccoli,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turbot_steaks_with_55325"}