{"recipe_name":"Turbot with cauliflower cheese purée","author":"Jason Atherton","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Add the chopped cauliflower to a large saucepan and cover with the milk. Bring to a simmer and cook for five minutes. Strain and sieve - retaining both the milk and the cauliflower. Scrub the clam shells clean in cold water. Discard any clams that have broken shells, and discard any open clams that do not close when given a sharp tap. Heat a medium saucepan with a lid and add the oil. Once hot, add the onion and clams, stir and add the white wine and put the lid on. Once the clams have opened drain and reserve the cooking liquid. (Discard any clams that have not opened.) Heat a large saucepan and once hot add the butter. Once the butter is melted, stir in the flour and cook for 2-3 minutes.  Gradually add the clam cooking liquor and milk from the cauliflower, whisking continuously until a smooth sauce is achieved. Add the cheese and cooked cauliflower and place in a food processor. Blend, adding more milk and clam cooking liquor if needed, until you get a smooth sauce. For the vegetables, cut the whole cauliflower in half. Cut one half into large florets keeping as much stem as possible. Keep the other half cauliflower uncut, for slicing on a mandolin later. Heat a large frying pan and once hot add the butter. When the butter is foaming add the cauliflower florets, broccoli and carrots and cook on a low heat for five minutes. Add the clams in their shells and continue to cook for a few minutes more until the vegetables are browned. Shave the remaining cauliflower on a mandolin, place in ice-cold water and set aside. Make nori salt, by placing the nori sheets in a spice mill and blending. Remove from the mill and mix with the sea salt. Drain the shaved cauliflower and season with the nori salt. For the turbot, heat a large frying pan, once hot add the oil and place the turbot fillets skin-side down and cook for 3-4 minutes. Turn them over and cook for another minute. To serve, place a spoonful of the purée on each of four plates. Lay the fish on top, place some cauliflower florets, broccoli, a carrot and a few clams next to the fish. Garnish with the cauliflower shavings and nori salt. Drizzle a little olive oil around the plate. ","ingredients":" 500g\/1lb 2oz cauliflower, chopped,  600ml\/1 pint milk,  500g\/1lb 2oz clams,  1 tbsp sunflower oil,  half small onion, finely chopped,  250ml\/9fl oz white wine,  50g\/1¾oz butter,  75g\/2½oz flour,  200g\/7oz strong cheddar, grated,  1 cauliflower, outer leaves removed,  50g\/1¾oz butter,  1 broccoli, cut into florets (keeping as much stem on them as possible),  4 small carrots, whole,  2 nori sheets,  20g\/¾oz sea salt,  1 tbsp olive oil,  4 x 120g\/4oz turbot fillets, skin on","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turbot_with_cauliflower_17937"}