{"recipe_name":"Turbot with Prosecco sauce, chanterelle mushrooms, roasted squash and samphire","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fish stock, place all the ingredients into a large saucepan, cover with 850ml\/1½ pints water and simmer for 20-40 minutes, frequently skimming the top to remove impurities. Pass through a sieve into a jug. Discard the bones. For the roasted squash and samphire, heat a large frying pan and add the oil. Once hot, add the garlic and shallot and cook for 2-3 minutes. Add the squash and star anise and cook for 5-8 minutes, or until the squash has cooked through. Remove the star anise and discard. For the turbot, melt a few knobs of butter in a large frying pan over a medium heat. Add the fish, skin-side down and cook for 2 minutes, or until the skin is crisp and the fish is cooked two-thirds of the way through (you may need to cook the fish in batches). Flip over and cook for another minute, then remove from the heat and leave to rest in a warm place until ready to serve. Heat a frying pan until medium-hot, add 50g\/2oz butter and the shallots and fry for a couple of minutes, or until softened but not browned. Add the Prosecco and cook until the volume of liquid has reduced by half, then add the fish stock and cook until reduced by half again. Stir in the cream and cook until reduced by a third. Strain through a fine sieve into a clean pan, add salt and pepper to taste and set aside.  Blanch the samphire in a large saucepan of boiling water for a minute then drain. Heat another frying pan until hot, add the remaining butter, chanterelles and samphire. Fry over a high heat until the samphire is just wilted, but still bright green. Season with a little salt and black pepper. To serve, pile the squash into the centre of serving bowls and top with a turbot fillet, skin-side up. Spoon the Processco sauce over the top and garnish with the mushrooms, samphire, chervil and fresh truffle. ","ingredients":" 1kg\/2lb 4oz fish bones,  1 large onion, roughly chopped,  1 large leek, chopped,  1 large carrot, chopped,  1 celery stick, including the leafy top, sliced,  1 tsp peppercorns,  2 fresh bay leaves,  2 tbsp olive oil,  1 garlic clove, chopped,  1 shallot, chopped,  1 butternut squash, peeled and cut into 2cm\/¾in cubes,  2 star anise,  110g\/3¾oz butter,  4 x 200g\/7oz turbot fillets, pin-boned, skin on,  2 medium shallots, finely sliced,  150ml\/5fl oz Processco,  150ml\/5fl oz fish stock (from above),  150ml\/5fl oz double cream,  200g\/7oz samphire (alternatively use asparagus tips),  300g\/10½oz chanterelle mushrooms, cleaned,  salt and freshly ground black pepper,  2 tbsp chervil,  fresh truffle, grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turbot_with_prosecco_98770"}