{"recipe_name":"Turkey meatballs in tomato sauce","author":"Nigella Lawson","programme":"Nigella Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/turkey_meatballs_in_16570_16x9.jpg","method":"For the sauce, put the onion and celery into a food processor and blitz to a mush. (Or you can chop as finely as humanly possible by hand.) Reserve 2 tablespoons of the mixture for the meatballs. Warm the garlic oil in a large, heavy-based saucepan or casserole, add the onion and celery mixture, along with the thyme, and cook at a moderate to low heat, stirring every now and again, for about 10 minutes. Add the cans of plum tomatoes, filling up each empty can with water to add to the pan. Season with the sugar, salt and pepper, stir well and let the mixture come to a bubble, then turn the heat down and simmer the sauce gently while you get on with the meatballs. For the meatballs, put all the ingredients for the meatballs, including the reserved chopped onion and celery, and salt according to preference, into a large bowl and gently mix together with your hands. Don’t overmix, as that will make the meatballs dense-textured and heavy. When all the meatball ingredients are not too officiously amalgamated, start rolling them into balls. The easiest way is to pinch out an amount about the size of a generously heaped teaspoon and roll it into a ball between the palms of your hands. Put each meatball onto a baking tray lined with baking parchment or greaseproof paper. You should get about 50 little meatballs. Drop the meatballs gently into the simmering sauce; I try to let these fall in concentric circles working round the pan from the outside edge inwards, in the vaguest of fashions. Let the meatballs simmer in the sauce for 30 minutes, or until cooked through. Serve with rice, pasta, couscous or however you so please.  ","ingredients":" 1 onion, peeled,  1 stick celery,  2 tbsp garlic oil,  1 tsp dried thyme,  2 x 400g\/14oz cans chopped plum tomatoes, plus approximately 2 full cans of water,  1 tsp sugar,  1 tsp sea salt flakes or ½ tsp pouring salt,  black pepper, to taste,  500g\/1lb 2oz turkey mince,  1 free-range egg,  3 tbsp breadcrumbs,  3 tbsp grated parmesan,  1 tsp Worcestershire sauce,  ½ tsp dried thyme","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turkey_meatballs_in_16570"}