{"recipe_name":"Turkey ‘en croute’ with tomatoes and cucumber salsa","author":"Brian Turner","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salsa, mix all the ingredients together and leave to stand for two hours. For the turkey en croute, fold the thin part of the turkey breast under and tie with cook’s string to make an even shape. Heat one tablespoon of oil and butter in a large frying pan. When hot, add the turkey and fry to seal and colour the meat on all sides.  Season with salt and pepper and leave to cool. When cool, remove the string. Make pancakes by mixing the eggs and flour together in a bowl. Slowly add the milk, beating all the time until smooth. Add the chopped parsley and half of the melted butter. Season with salt and pepper. Heat a little oil in a large frying pan (approximately 25cm\/10in). When hot, add a ladle of pancake batter and immediately start swirling it round the pan to get a nice even layer. Cook the pancake for approximately 30-40 seconds. Use a palette knife to lift the pancake carefully to look at the underside to check it is golden-brown before turning over. Cook the other side for approximately 30-40 seconds and transfer to a plate. Repeat until all the batter has been used. Add the remaining melted butter to a pan. Gently fry the chopped shallots without colouring. Add the mushrooms and cook slowly until all the moisture from them has evaporated. Season and set aside to cool. On a lightly floured work surface roll out the puff pastry into a rectangle, at least three times as wide as the turkey and 15cm\/6in longer. The pastry should be about 3mm thick. Brush the egg wash around the edges of the pastry.  Lay the pancakes on a work surface so they overlap to form a sheet. Smear some of the the shallot and mushroom mixture down the middle and lay the turkey breast on top. Smear the turkey with the remaining shallot and mushroom mixture. Draw the pancakes over the turkey to wrap like a parcel. Lay the turkey parcel on the puff pastry, then pull the pastry over and seal using egg wash. Turn over onto a roasting tray (so the pastry seams are hidden) and make a small incision in the pastry to allow steam to escape. Brush with egg wash and rest for 30 minutes in the fridge. Then remove from the fridge and bring to room temperature before cooking. Preheat the oven to 220C\/425F\/Gas 7. Brush the pastry again with egg wash and bake for 10 minutes. Reduce the oven temperature to 180C\/350F\/Gas 4 and cook for a further 50 minutes, or until the pastry is crisp and golden-brown. Leave to rest for 15 minutes, then slice and serve with the salsa. ","ingredients":" 4 tomatoes, deseeded, chopped,  ½ cucumber, skinned, deseeded, chopped,  1 large red onion, finely chopped,  1 green chilli, deseeded, finely chopped,  1 tbsp chopped marjoram,  2 tbsp chopped parsley,  3 tbsp olive oil,  1 lemon, juice only,  salt and pepper,  1 turkey breast (approximately 2kg\/4lb 8oz), skin removed,  1 tbsp oil, plus extra for frying the pancakes,  25g\/1oz butter,  salt and pepper,  2 free-range eggs,  170g\/6oz plain flour,  425ml\/¾ pint milk,  1 tbsp chopped fresh parsley,  50g\/2oz butter, melted,  1 shallot, finely chopped,  340g\/11¾oz button mushrooms, very finely chopped,  450g\/1lb puff pastry,  2 free-range eggs, beaten, for egg wash","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turkey_en_croute_with_78858"}