{"recipe_name":"Turkey legs coq au vin","author":"Hugh Fearnley-Whittingstall","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Carefully cut the whole legs from the turkey, then cut at the joint to separate the thigh from the drumstick. Cut off the wings with poultry shears at the point at which they attach to the breast. Heat the butter and oil in a heavy pan and fry the bacon pieces until browned. Transfer the bacon pieces to your chosen casserole dish. Lightly brown the onions in the same pan and transfer these to the casserole dish.  Dust the turkey legs with seasoned flour and brown these next, turning several times until coloured and crisp. Pour over the brandy and set light to it (by tipping the pan towards the gas flame, if you are cooking on gas, with a lit wooden taper if you are not). When the flames have subsided, transfer the turkey legs and all the juices in the pan to the casserole dish. Return the pan to the heat, deglaze one more time by pouring in the wine and scraping the bottom and sides of the pan while the wine bubbles. Pour the boiling wine over the turkey pieces and then repeat the process with the water or stock (the job of deglazing is sure to be done by now but it is good to add hot, not cold, liquid to the casserole to start the cooking). Now add the herbs, celery and tomatoes to the pan and bring to a gentle simmer. Cover the pan and cook over a very low heat or in a low oven for about 1½ hours until the meat is completely tender. Strain the stock into a separate, clean pan leaving the meat and vegetables in your casserole dish. Boil the stock fast to reduce by half or even two-thirds, into a rich, intense sauce. If you think the sauce seems a little thin you can whisk in a few  crumbs  of beurre manié. Season to taste with salt and pepper. When the turkey pieces are cool enough to handle, remove the meat from the bones with your fingers and return the pieces of meat to the finished sauce along with the bacon pieces and vegetables. Set aside, keeping in the fridge if necessary, reheating carefully and thoroughly but without burning or serve immediately. ","ingredients":" 2 turkey legs,  2 turkey wings,  turkey giblets (ie neck, heart, gizzard, but not the liver - save for the stuffing),  50g\/2oz butter,  1 tbsp olive oil,  250g\/9oz small (ie pickling) onions, blanched and then peeled,  250g\/9oz pancetta or thick cut streaky bacon, in chunky pieces,  50g\/2oz seasoned flour,  ½ wine glass brandy,  500ml\/16½fl oz red wine,  500ml\/16½fl oz poultry or pork stock, or water,  bouquet garni of bay, thyme and parsley stalks,  4 sticks celery, cut into 3cm\/1¼in lengths,  4 garlic cloves, bruised,  4 medium tomatoes, peeled, deseeded and  finely chopped,  salt and fresh ground black pepper,  beurre manie (25g\/1oz flour mixed with 25g\/1oz soft butter)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turkeylegscoqauvin_13962"}