{"recipe_name":"Turkey roasted in honey","author":"Michelle Berriedale-Johnson","programme":null,"prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Remove the giblets from the bird. Chop the liver and discard the rest. Heat the oil in a pan and gently cook the liver, onion and parsley until the liver is firm and the onion soft.  Take off the heat and add the apple, raisins, lemon rind and juice, almonds, breadcrumbs (or ground rice\/quinoa), ginger, seasoning, and egg if you are using it. Mix it all well together and stuff the bird at either the neck end or at the body cavity. Secure the bird with skewers and put it in a roasting pan.  Melt the honey with the butter or dairy-free margarine and spoon them over the bird; as it cools it will cling to the skin.  Leave the bird to marinate in the honey, uncovered, in a  fridge or cool larder, for 24 hours, spooning over any excess mixture. Roast the bird in a moderate oven (170C\/350F\/Gas 4) for 20 minutes to the pound, basting frequently with the honey and butter\/spread mixture. The skin will gradually turn dark brown and shiny in contrast to the white meat below.   The bird is cooked when the juices run clear when a skewer is inserted into the thickest part of the thigh. Rest the bird for 15 minutes and serve. ","ingredients":" 1 capon or small turkey, with giblets,  2 tbsp olive oil,  1 medium onion, peeled and finely chopped ,  large handful of parsley, finely chopped ,  1 tart eating apple or ½ a cooking apple, peeled and chopped into small pieces,  75g\/3oz raisins,  1-2 lemons, rind and juice only,  75g\/3oz ground almonds,  75g\/3oz gluten-free breadcrumbs OR ground rice OR, if you do not want to use nuts use 150g\/5oz quinoa (dry weight) boiled for 10 minutes in salted water and then drained,  1 tsp ground ginger ,  1 tsp salt,  ½ tsp black pepper,  1 egg (optional),  2 tbsp honey,  50g\/2oz butter or dairy-free spread","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/turkeyroastinhoney_77290"}