{"recipe_name":"Twisty rye breadsticks","author":"Robert Smart","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 18 breadsticks","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the flours, yeast, salt, olive oil and bay extract into a large bowl. Measure out 450g\/1lb of water. Add enough of the water to make a soft, but not sticky dough. You may not need it all. Knead well for 10 minutes by hand on a lightly floured work surface, or for five minutes if using an electric mixer fitted with a dough hook. Put the dough in a bowl covered with lightly oiled cling film. Leave to rise for 15 minutes.  Set the oven to 150C\/300F\/Gas 2. Using an oven thermometer to measure the temperature, adjust the temperature to give a reading of 160C\/325F in the centre of the oven. Chop the olives into fine strips and set aside on kitchen paper to dry. (If you simply chop the olives randomly, the chunks have a tendency to fall out of the sticks. However if you cut them into fine strips, they go into the dough much better and stay in the sticks.) Turn out the dough onto a lightly floured work surface and divide into four equal portions.  Push out into rectangles about 20cm\/8in long. Roll flat with a rolling pin and, if you have them, rolling guides (these are plastic sticks that can be bought from specialist baking stores. You simply place the rolling guide sticks parallel to each other at a 90 degree angle to your rolling pin so that the rolling pin rolls initially over the guide sticks and enables the dough to be rolled to the same depth as the guides). You now want to aim to roll to 30cm\/12in along one side. Cover loosely with a tea towel and leave to rest for five minutes. Sprinkle one strip of dough with caraway seeds, olives and peperoncino flakes. Place another strip of dough on top and roll to 40cm\/16in. Sprinkle with coarse semolina, clear up any excess that's on the work surface and turn the dough over. Sprinkle with poppy seeds and then clear up any excess seeds.  Mark strips using the wider width of the rolling guide and, using a large cook’s knife, cut 18 strips. Twist and leave on an oiled and floured baking tray with the end overhanging. Repeat with the remaining dough. Leave to rest for 10 minutes. Trim to the length of the baking tray. Bake until the breadsticks are lightly golden-brown and feel firm to the touch. Reduce the heat to 140C\/275F\/Gas 1 and check the breadsticks every 10 minutes, checking each time for colour and moisture.  Do the ‘spec check’. This is when you open the door every ten minutes which lets the moisture out. Whenever I open an oven door a blast of moisture condenses on my spectacles, which is generally a right pain. However, in the case of breadsticks it is quite handy, because it indicates that the sticks aren’t fully dried out. Once I can open the door without steaming up, I know the sticks are dry. Bake the sticks on the higher temperature until the colour is correct, then continue on the lower temperature until they pass the ‘spec check’. The total cooking time will be up to 40 minutes. Remove from the oven and leave to cool on wire rack. ","ingredients":" 560g\/1lb 4oz strong white flour, plus extra for dusting,  190g\/6½oz rye flour ,  15g\/½oz fast-action yeast,  15g\/½oz salt ,  3 tbsp olive oil (not extra virgin), plus extra for oiling,  1½ tsp bay extract,  handful Kalamata olives, pitted,  caraway seeds, to taste,  smoked peperoncino flakes, to taste,  coarse semolina, to taste,  black poppy seeds, to taste","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/twisty_rye_breadsticks_93503"}