{"recipe_name":"Ultimate burger in a brioche bun","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/ultimate_burger_in_a_73911_16x9.jpg","method":"Season the steak mince with salt and freshly ground black pepper and mix in a bowl using your hands. Divide the mince into four equally-sized balls and press each one between your palms to form a patty. Place the patties on a plate, cover, and chill in the fridge for an hour. Thirty minutes before you want to eat, light your barbecue. Allow the flames to flare up and die down. Meanwhile, in a bowl, whisk together the egg yolks and mustard until well combined. Gradually add the rapeseed oil in a thin stream, whisking continuously, until the mixture thickens to a mayonnaise and all of the oil has been incorporated. Stir in the beer mustard and lemon juice, then season, to taste, with salt and freshly ground black pepper. When the barbecue coals are just glowing, rub the patties with the vegetable oil and cook for 3-4 minutes on each side, or until cooked to your liking. (Alternatively, cook over a high heat on a griddle pan.)  Place each brioche onto the barbecue, cut-side down, and cook for one minute, or until chargrill marks appear on the bread. Set aside. To assemble the burgers, spread a little of the chilli relish onto the base of each brioche bun. Place a lettuce leaf and a slice of tomato on top, then add a burger, a slice of cheese, and a dollop of the mustard mayonnaise. Top with a few gherkin and red onion slices, then place the top half of the brioche bun on top. Place the burgers onto serving plates, keeping them from toppling over by spearing them with wooden skewers, if desired. ","ingredients":" 800g\/1lb 12oz best-quality beef steak, minced,  3 egg yolks,  1 tbsp Dijon mustard,  300ml\/10½fl oz rapeseed oil,  25g\/1oz beer mustard or wholegrain mustard,  ½ lemon, juice only,  2 tbsp vegetable oil,  4 brioche rolls, cut in half,  4 tbsp ready-made mild chilli relish,  ½ round lettuce, leaves separated,  2 tomatoes, sliced,  200g\/7oz cheese slices, preferably Monterey Jack,  8 gherkins, drained, sliced,  1 red onion, peeled, sliced,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ultimate_burger_in_a_73911"}