{"recipe_name":"Umami bomb (parmesan and wild mushroom custard)","author":"Alexis Gauthier","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the parmesan and wild mushroom custard, preheat the oven to 150C\/300F\/Gas 2 and grease four ramekins.  Pour the olive oil into a hot pan and fry the chanterelle mushrooms and ceps for a minute until they release their water. Drain and set aside the mushrooms. Discard the cooking liquid. Melt the butter in the pan used to cook the mushrooms. When the butter is golden-brown, add the shallots, garlic and sliced pancetta. Stir and return the mushrooms to the pan.  Season with salt and stir. Continue cooking for two minutes, taking care not to colour the mushrooms (it will make them taste slightly bitter). Transfer to a plate to cool. When the mushroom mixture is cool, divide it between the prepared ramekins. In a bowl, whisk the eggs and the whipping cream. Mix in the egg yolks, parmesan and milk. Season to taste with salt and pepper. Divide the mixture evenly among the prepared ramekins. Place in a baking dish and pour cold water into the baking dish to reach halfway up the side of the ramekins. Cook in the oven for 20-25 minutes.  Check the custards are cooked by inserting a knife into one of them, if it comes out clean, the custard is cooked. Return to the oven for a few minutes if required. When the custards are cooked, set aside to cool slightly. For the vegetable medley, preheat the oven to 220C\/425F\/Gas 7.     Place the pancetta between two baking trays that fit together and bake in the oven for 5-6 minutes, or until crisp. Remove from the oven and allow to cool with the baking tray on top so the pancetta stays straight. Heat a large frying pan and add the olive oil. Once hot, add the courgette, mangetout, asparagus, girolles and peas and cook them (without colouring) until they are tender. Place the parmesan and plain flour in a bowl and mix. To make a parmesan crisp, heat a frying pan and sprinkle a quarter of the mixture in a neat line. When the mixture starts to bubble, remove from the pan in one piece and place over a rolling pin to curve the parmesan crisp. Repeat with the remaining mixture. To serve, add a spoonful of warm chicken jus to the custards. Place the vegetables and a slice of pancetta on top of the custards with a parmesan crisp. ","ingredients":" 2 tbsp olive oil,  100g\/3½oz yellow chanterelle mushrooms, washed and roughly chopped,  100g\/3½oz ceps, washed and roughly chopped,  40g\/1½oz unsalted butter, plus extra for greasing,  ½ shallot, finely chopped,  2 garlic cloves, finely chopped,  2 thin slices pancetta, sliced into thin strips,  salt,  2 free-range eggs,  160g\/5½oz whipping cream,  4 medium free-range egg yolks,  120g\/4¼oz parmesan, grated,  200ml\/7fl oz full-fat milk,  pepper,  200ml\/7fl oz chicken jus or reduced chicken stock, warmed,  4 slices pancetta,  25ml\/1fl oz olive oil,  1 courgette, finely chopped,  100g\/3½oz mangetout, sliced,  100g\/3½oz asparagus, sliced,  150g\/5½oz girolle mushrooms, cleaned,  100g\/3½oz fresh peas,  100g\/3½oz parmesan, grated,  10g\/¼oz plain flour","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/umami_bomb_parmesan_and_62918"}