{"recipe_name":"Ultimate Korean fried chicken with pickled radish","author":"Judy Joo","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pickled radish, put the rice vinegar, sugar, salt and 110ml\/3¾fl oz water in a bowl. Whisk until the sugar and salt have dissolved. Add the radish and toss to coat. Cover and leave at room temperature for 24 hours, then place in the fridge.  For the coating, put the cornflour, salt, baking powder and pepper in a large mixing bowl and whisk together. Add the chicken and toss well until evenly coated. Transfer the chicken to a rack, shaking well to get rid of any excess coating.  Leave to rest for 1 hour in the fridge.  Pour enough oil into a large casserole dish to reach a depth of 5cm\/2in. Heat the oil over a medium-high heat until it reaches 175C\/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) For the batter, mix the dry ingredients in a large bowl. In a separate bowl whisk the wet ingredients and 235ml\/8¼fl oz water together. Just before frying, whisk the wet mixture into the dry mixture.  The consistency should be relatively thin and runny.  Dip each piece of chicken into the batter, letting excess batter drip off.  Suspend the chicken in the oil for a couple of seconds for it to set before letting it slip completely into the oil. You may need to do this in batches.  Fry the chicken for 15-20 minutes, or until golden brown and cooked through. Transfer to a wire rack to drain.  For the black soy umani sauce, put all of the ingredients except the cornflour in a small saucepan and simmer over medium heat until the sugar dissolves. Mix the cornflour with 1½ tbsp water and whisk into the sauce. Bring to the boil, then remove from the heat.  For the red chilli sauce, put all of the ingredients in a small saucepan and simmer over medium heat for 2 to 3 minutes, whisking well to make sure ingredients are dissolved and incorporated. .  Place the chicken and pickled radishes on a serving plate with the sauces.  Garnish with fresh chives and sesame seeds.  ","ingredients":" 110ml\/3¾fl oz rice vinegar,  110g\/4oz superfine sugar or caster sugar,  1 tsp kosher salt or sea salt ,  500g\/1lb 2oz radish, preferably Daikon, cut into 10mm\/½in cubes,  35g\/1¼oz cornflour,  2½ tsp kosher salt or sea salt,  ½ tsp baking powder,  freshly ground black pepper,  2 chicken drumsticks, thighs and wings (with tips), bone in, skin on,  vegetable oil, for deep-frying,  70g\/ 2½oz cornflour,  35g\/1¼oz fine matzo meal,  35g\/1¼oz plain flour,  2 tbsp chilli flakes, preferably Korean chilli flakes (gochugaru),  1 tbsp kosher salt or sea salt,  2½ tsp garlic granules,  2½ tsp onion granules,  ¼ tsp baking powder,  5 tbsp vodka,  2 tbsp chilli paste, preferably Korean chilli paste (gochujang),  250ml\/9fl oz soy sauce,  2 tbsp rice wine vinegar,  4 tbsp mirin,  100g\/3½oz  dark brown sugar,  2 garlic cloves, crushed,  4 tsp grated fresh ginger,  ½ tsp chilli paste, preferably gochujang (Korean chilli paste),  1 tsp sesame oil,  1½ tbsp cornflour,  70g\/2½oz  chilli paste, preferably Korean chilli paste (gochujang),  4 tsp soy sauce,  1 tbsp rice wine vinegar,  70g\/2½oz dark brown sugar,  3 garlic cloves, crushed,  2 tsp grated fresh ginger,  4 tsp sesame oil,  1 tsp roasted white sesame seeds,  ¼ bunch fresh chives, chopped,  2 tsp black sesame seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ultimate_korean_fried_29527"}