{"recipe_name":"Vanilla and orange cheesecake with almond sponge, orange and cardamom syrup","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes 2 cheesecakes","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the almond sponge, mix the icing sugar and ground almonds together in a mixing bowl.  In a separate bowl, whisk the whole eggs and yolks together, then whisk in the icing sugar and almonds and continue to beat until pale and thick.  In a separate bowl, whisk the egg whites until soft peaks form when the whisk is removed from the bowl. Add the sugar, a little at a time, whisking as you go, until the mixture forms stiff peaks when the whisk is removed from the bowl.  Fold the sugar into the egg and almond mixture and then gently fold in the sieved flour.  Divide the mixture between two trays lined with a non-stick silicone mat and smooth with a palette knife. Bake in the oven for 12-14 minutes, or until pale golden-brown.  Remove the sponge from the oven and leave to cool slightly in the trays before carefully removing to a wire rack to cool completely. Cut the sponge to line two 28cm x 7cm\/11in x 2¾in deep chefs’ rings.  Reduce the oven temperature to 150C\/300F\/Gas 2, For the cheesecake, beat together the caster sugar, vanilla seeds, lemon and orange zest, cornflour and cream cheese in a bowl until pale and fluffy.  Beat in the eggs, one by one, and then add the cream to the mixture. Beat to combine. Pour the cheesecake mixture into the lined chefs’ rings and bake the cheesecakes in the oven for 35-40 minutes, or until set. Remove from the oven and leave in the rings to cool. To make the orange syrup, heat the orange juice, sugar, vanilla pods and cardamom in a pan and cook until the mixture has reduced and is thickened and syrupy. Strain into a clean pan and heat gently.  To serve, cut the cheesecake into wedges and arrange on serving plates. Scatter the chopped orange and pomegranate seeds on top and drizzle with orange and cardamom syrup. Finish with shredded mint to serve.   ","ingredients":" 150g\/5½oz icing sugar, sifted,  150g\/5½oz ground almonds,  3 free-range eggs,  90g\/3¼oz egg yolks (about 5 large egg yolks),  275g\/9¾oz egg whites (about 9 large egg whites),  110g\/4oz caster sugar,  120g\/4¼oz plain flour, sifted,  200g\/7oz caster sugar,  2 vanilla pods, seeds only,  1 lemon, zest only,  1 orange, zest only,  4 tbsp cornflour,  845g\/1lb 14oz cream cheese,  3 free-range eggs,  375ml\/12½fl oz double cream,  10 oranges, juiced (to make about 400ml\/14fl oz orange juice),  400g\/14oz caster sugar,  4 empty vanilla pods,  8 cardamom pods, cracked,  1 orange, peeled, cut into small pieces,  ½ pomegranate seeds,  1-2 tbsp shredded fresh mint ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vanilla_and_orange_64396"}