{"recipe_name":"Vanilla and gingerbread cheesecakes with fresh raspberries and raspberry sorbet","author":"Stuart Gillies","programme":"Great British Menu","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the gingerbread, preheat the oven to 160C\/320F\/Gas 3 and grease and line a 900g\/2lb loaf tin.  Sift the dry ingredients into a large bowl. Mix the milk, honey, eggs and sugar in another bowl with the citrus zest and vanilla seeds, then add to the dry ingredients and mix well until evenly combined. Spoon the mixture into the prepared tin. Bake for 45 minutes or until a skewer inserted in the centre comes out clean. Cool in the tin for about 30 minutes, then remove and leave to cool on a wire rack. To make gingerbread crumbs (you need 100g\/4oz), cut the gingerbread into 5mm\/¼in-thick slices and leave to dry on a tray overnight. The next day, grind the slices to fine crumbs in a food processor. Store in a plastic container until ready to use. (The rest of the gingerbread can be eaten as a cake; wrapped in foil it will keep for a week or more.) For the stock syrup, put the lemon slice in a heavy pan with the sugar, liquid glucose and 300ml\/½ pint water. Heat gently, stirring occasionally, until the sugar has dissolved, then bring to the boil and boil for five minutes. Cool. Remove the lemon slice, then pass the syrup through a fine sieve. Chill in a covered container in the fridge. For the raspberry sorbet, put the raspberries in a heavy pan, sprinkle lightly with caster sugar and two tablespoons of water, and cook over a low heat for about five minutes or until the raspberries soften. Tip into a fine sieve set over a bowl and push the purée through to remove the seeds. Cover and chill in the fridge. Set 100ml\/3½fl oz of raspberry purée aside in the fridge for later. Combine the remaining purée with 250ml\/9fl oz of the chilled stock syrup, the liquid glucose and lemon juice. Churn in an ice cream machine until thickened, according to manufacturer's instructions, then decant into a clean container and store in the freezer until ready to use.  For the cheesecakes, stand eight metal chefs' rings, each measuring 5.5cm\/2¼in tall and 4.5cm\/1¾in across, on a non-stick mat or baking sheet lined with cling film. Combine the soft cheese, cream, crème fraîche, sugar and vanilla seeds in a large bowl. Whisk together well until thick, then put the mixture in a plastic piping bag and pipe neatly into the rings. Make sure there are no gaps or air pockets and pipe right up to the tops, then smooth the tops with the back of a flat knife. Refrigerate for two hours or until set firm.  Meanwhile, make scoops of sorbet and transfer to a tray lined with baking parchment. Place in the freezer. Put the raspberries in a bowl with the reserved 100ml\/3½fl oz raspberry purée and lightly mix with a fork. Set aside at room temperature.  About five minutes before serving, remove the cheesecakes from the fridge. One at a time, lift each cheesecake off the mat and dip both ends in the gingerbread crumbs, then warm the ring in your hands for 30 seconds (or very quickly flash round the ring with a blowtorch). Now hold the ring over a plate and carefully lift it up so the cheesecake drops out onto the plate.  To finish, put a spoonful of the raspberries to the side of each plate and sprinkle a line of gingerbread crumbs between the cheesecake and the raspberries. Top each cheesecake with a scoop of sorbet and serve immediately. ","ingredients":" 125g\/4½oz strong rye flour,  125g\/4½oz plain flour ,  4 tsp baking powder,  2 tsp ground mixed spice,  2 tsp ground ginger,  125ml\/4fl oz whole milk,  250g\/9oz perfumed clear honey,  3 medium free-range eggs,  50g\/2oz light muscovado sugar ,  1 small lemon, grated zest only,  1 small orange, grated zest only ,  seeds scraped from ½ split vanilla pod,  1 thick slice of lemon,  300g\/10oz caster sugar,  15g\/½oz liquid glucose (available from cake specialists and online),  500g\/1lb 2oz English raspberries,  caster sugar for sprinkling,  ¼ tsp liquid glucose ,  ½ lemon, juice only,  250g\/9oz full-fat soft cheese,  250ml\/9fl oz double cream,  125g\/4½oz crème fraîche,  125g\/4½oz caster sugar,  seeds scraped from 1 split vanilla pod,  300g\/10oz English raspberries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vanillaandgingerbrea_86247"}