{"recipe_name":"Veal kidneys in a creamy mustard sauce with pilau rice and wilted spinach","author":"Michel Roux Jr.","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pilau rice, heat the butter and olive oil in a large pan over a medium heat. Add the onion and garlic and fry for 2-3 minutes, or until softened. Add the rice and stir well to coat. Pour in the stock, stir well and then bring the mixture to the boil. Reduce the heat until the liquid is simmering. Cover the pan with a lid or aluminium foil and continue to simmer for 15-18 minutes, until the rice has absorbed the stock and is tender. Season, to taste, with salt and pepper. For the veal kidneys, carefully cut away the surrounding fat on the kidneys, then turn them upside down to reveal the fatty sinews. With the point of a sharp knife, cut around the sinews so the kidneys come away clean. Divide the kidneys into bite sized pieces, following the natural lobes as much as possible.  In a heavy-based frying pan, heat a little olive oil until smoking hot. Add the kidneys and season lightly with salt and pepper. Cook for 3-4 minutes (depending on size), turning the kidneys to seal all over. Tip into a colander to drain. The kidneys should still be very pink when they finish cooking in the sauce.  In the same pan, gently fry the shallots in the butter over a medium heat, stirring frequently, for 5 minutes without letting them colour. Increase the heat, add the brandy and cook until the volume of liquid is reduced by half. Add the wine and again reduce by half. Add the cream and reduce to a light sauce. Remove from the heat and whisk in all the mustards. Reheat gently, do not boil or it will become bitter. Add the kidneys and heat through.  To serve, melt the butter in a sauté pan. Add the garlic and fry for 1-2 minutes, then add the spinach and cook until wilted. You might need to add 1-2 tablespoons of water if the spinach starts to stick to the pan. Serve the kidneys, rice and wilted spinach in shallow serving bowls with the sauce poured over the kidneys. ","ingredients":" 25g\/1oz butter,  1 tbsp olive oil,  1 onion, finely chopped,  1 garlic clove, finely chopped,  300g\/10½oz basmati rice,  450ml\/16fl oz chicken stock,  salt and freshly ground black pepper,  2 whole veal kidneys, cleaned and trimmed,  5 tbsp olive oil,  2 shallots, chopped,  25g\/1oz butter,  2 tbsp brandy,  4 tbsp dry white wine,  250ml\/9fl oz double cream,  2 tsp wholegrain mustard ,  1 tsp Dijon mustard ,  1 tsp mixed herb or tarragon mustard ,  50g\/1¾oz unsalted butter,  1-2 garlic cloves, chopped,  50g\/1¾oz spinach (large leaf or baby)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/veal_kidneys_in_a_creamy_76920"}