{"recipe_name":"Veal escalopes with salsa verde","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03fkvry.jpg","method":"First prepare your barbecue: light the barbecue so that it flares up and dies down, then wait until the coals are glowing but have not yet turned white. Alternatively, heat a griddle pan over a high heat until very hot. Zest two of the lemons into a large bowl, then squeeze in the juice. Add a few of the sprigs of mint, parsley, dill, chervil and tarragon, and the halved garlic bulb. Pour in 150ml\/5fl oz of the extra virgin olive oil, mix until well combined and set aside. Sandwich the veal slices between two long sheets of cling film. Bash them with a rolling pin until they are about 1cm\/½in thick, then add them to the herby oil and stir to coat. Set aside. Finely chop the remaining herbs together and add them to a bowl with the shallot. Zest over two of the lemons, then chop again. Stir in the anchovies and chop again, then stir in the Dijon mustard and capers and chop until fine. Season, to taste, with salt and freshly ground black pepper, then make a well in the centre of the mixture. Lift the veal slices out of the marinade and lay them on the barbecue or griddle pan. Cook for 2-3 minutes on one side, then 2 minutes on the other side. Transfer to a serving platter. Meanwhile, heat 50ml\/2fl oz of the remaining oil to a frying pan. Add the spinach leaves and cook until just wilted, then lay them on top of the veal slices. Cut the remaining lemon into wedges. Drizzle the remaining oil into the well in the centre of the salsa verde mixture, then mix together to form a thick paste. Spoon the salsa verde on top of the veal and spinach. Garnish the platter with the lemon wedges. ","ingredients":" 5 lemons,  1 small bunch fresh mint leaves,  1 small bunch fresh flatleaf parsley, leaves only,  ½ small bunch fresh dill,  ½ small bunch fresh chervil,  1 small bunch fresh tarragon,  1 bulb garlic, cut in half horizontally,  250ml\/9fl oz extra virgin olive oil,  1kg\/2lb 4oz veal cushion (a joint from the leg), cut into 2cm\/¾in thick slices,  1 shallot, finely chopped,  2 sprigs fresh basil, leaves only,  3 anchovies, drained, finely chopped,  1 tbsp Dijon mustard,  1 tbsp capers, drained,  300g\/10½oz spinach leaves,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/veal_escalopes_with_13599"}