{"recipe_name":"Veal escalopes with prosciutto, sage and mozzarella","author":"Antony Worrall Thompson","programme":"Saturday Brunch","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the escalopes or chops on a board, cover them with cling film and beat each one with a meat mallet or rolling pin until they are about 5mm\/¼in thick. Place one sage leaf in the centre of each escalope, sprinkle with parmesan, and season with a scant amount of salt and a decent grinding of black pepper. Top each with one slice of Parma ham, pushing down so the ham seals itself to the escalope. Heat half the butter and the oil in a large, heavy-based frying pan. Cook the escalopes, Parma ham side down, for two minutes, then turn them over and cook for a further one minute on the other side. Remove and set aside to keep warm, ham side up, reserving the pan and it's juices.  Preheat your grill. Place two slices of pepper and mozzarella on each escalope, then grill the escalopes until the cheese is melting.  Meanwhile, add the chopped sage to the frying pan and cook for 30 seconds. Pour in the wine and stock and boil to emulsify and reduce by half. Whisk in the remaining butter and season to taste. Place one escalope on each of four warmed plates, spoon over the sage butter sauce and serve with new potatoes. For the green beans - steam the green beans until tender. Toss with the remaining ingredients and serve. ","ingredients":" 4 175g\/6oz veal escalopes or 4 275g\/10oz chops,  8 fresh sage leaves, 4 finely chopped,  50g\/2oz parmesan cheese, freshly grated,  salt ,  freshly ground black pepper,  4 thin slices Parma ham,  50g\/2oz unsalted butter,  1 tbsp olive oil,  4 roasted peppers,  1 ball buffalo mozzarella, cut into 8 slices,  4 tbsp dry white wine,  4 tbsp veal stock,  300g\/10½oz green beans,  1 tbsp olive oil,  handful chopped mint,  1 lemon, juice only,  1 clove garlic, sliced thinly","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vealescalopeswithpar_72315"}