{"recipe_name":"Veal chop with spatzle and red wine sauce","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/390F\/Gas 6. For the veal, season the veal chop with salt and freshly ground black pepper, then rub the olive oil into the veal. Mix the herbs and the breadcrumbs in a bowl until well combined. Press the veal chops into the breadcrumbs to coat. Heat a frying pan until hot, add the butter and, when foaming, add the veal chops. Fry for 2-3 minutes on each side, or until golden-brown. Place in the oven for 8-10 minutes, or until cooked through. For the spätzle, bring a saucepan of salted water to the boil. Blend all the spätzle ingredients, except the butter and olive oil, in a food processor to form a dough. Season to taste with salt and freshly ground black pepper. Place a spoonful of the dough onto a clean work surface. With the palm of your hand, roll the dough into a thin sausage-shape 2-3cm long. Repeat with the rest of the mixture. Carefully drop the spätzle into the boiling water and cook for 1-1½ minutes. Drain and rinse in iced water to refresh. Heat a frying pan until hot, add the butter, olive oil and spätzle and fry for 1-2 minutes until coloured. For the sauce, place the stock into a saucepan, bring to the boil, then turn down the heat and simmer for 5-7 minutes until the liquid has reduced by two thirds. Add the red wine and repeat, cooking until the liquid has reduced by two thirds. Add the butter, season to taste with salt and freshly ground black pepper, and whisk until the sauce is glossy. To serve, place a veal chop onto each serving plate. Pile a helping of the spätzle alongside and pour a spoonful of the red wine sauce over the veal. ","ingredients":" 4 veal chops, trimmed,  salt and freshly ground black pepper,  2 tbsp olive oil,  2 tbsp chopped fresh dill,  2 tbsp chopped fresh chervil,  2 tbsp chopped fresh chives,  75g\/3oz Japanese breadcrumbs (also sold as panko),  50g\/2oz butter,  500g\/1lb 2oz plain flour,  4 free-range eggs,  2 tbsp double cream,  2 tbsp chopped fresh dill,  2 tbsp chopped fresh chives,  2 tbsp chopped fresh chervil,  50g\/2oz butter,  2 tbsp olive oil,  300ml\/11fl oz beef or veal stock,  110ml\/4fl oz) red wine,  50g\/2oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vealchopwithspatzlea_89437"}