{"recipe_name":"Veal cutlet marinated in barley miso, ginger and yuzu with burnt chili cucumber pickle","author":"Nic Watt","programme":"2007-16","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Combine the miso, ginger, yuzu zest, shallot, garlic, shichimi pepper, soy sauce, sake, mirin and oil in a shallow dish.  Whisk the marinade together until well combined, then add the veal cutlet to the dish and rub the marinade all over it. Marinade for 24 hours. For the burnt chilli cucumber pickle, blacken the chilli directly over a direct flame (either with a mini-blow torch or simply over the gas hob).  Roughly chop the chilli, including the blackened skin and seeds. Cut the courgette on the diagonal, then make three cuts, following the diagonal, 2-3mm apart, but not going all the way through. Make a final cut all the way through - you will have a little fan of courgette. Repeat with the remaining courgettes. Season the sliced courgette with sea salt and allow to stand for a few minutes, just enough to soften. Pour over the sushi vinegar. Combine the red chili, courgette, ruby grapefruit segments and coriander in a small bowl.  Preheat the oven to 180C\/350F\/Gas 4 and preheat a griddle to hot. Griddle the veal cutlets on each side until browned. Transfer to a roasting tray and roast for about six minutes, turning once in the oven. Allow the veal cutlets to rest for a couple of minutes.  Squeeze a little ginger juice over the resting cutlet and serve with the burnt chili cucumber pickle. ","ingredients":" 3 tbsp barley miso,  3 tbsp finely chopped fresh root ginger,  3 tbsp finely diced yuzu zest (available from specialist suppliers),  2 tbsp finely chopped shallot ,  1 tsp crushed garlic,  1 pinch shichimi pepper (available from Japanese suppliers),  2 tsp soy sauce,  2 tsp sake,  2 tsp mirin,  4 tbsp rice bran oil (available online),  280g\/10oz veal cutlet, bone on ,  1 red chilli,  1 yellow courgette, halved lengthways,  1 green courgette, halved lengthways,  1 pinch sea salt,  3 tbsp sushi vinegar,  ½ ruby grapefruit, cut into segments,  5-6 sprigs fresh coriander,  fresh ginger juice, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/veal_cutlet_marinated_in_10646"}