{"recipe_name":"Veal with buccaneer's sauce","author":"Michel Roux","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the buccaneer's sauce, heat half of the butter in a non-reactive saucepan over a medium heat until melted. Add the sliced shallots and fry for 1 minute, or until just softened.  Add the ginger and continue to fry, until the shallots are very lightly coloured. Reduce the heat to low, then add the banana and continue to fry, stirring well, for 1-2 minutes, or until the banana has softened and has started to break down.  Add the raspberry vinegar and continue to cook, stirring well, for a further 2-3 minutes. Add the veal stock and bring the mixture to the boil. Reduce the heat until the mixture is simmering gently and continue to simmer for 20 minutes. Strain the sauce through a fine sieve into a clean pan, then whisk in the remaining butter, a cube at a time, waiting until each cube has melted before adding the next, until the sauce is smooth and glossy. Season, to taste, with salt and freshly ground black pepper. (NB: The buccaneer's sauce needs to be served immediately.)  Meanwhile, for the veal, heat the grill to its highest setting.  Season the veal chops, to taste, with salt and freshly ground black pepper. Heat a frying pan over a high heat. Add half of the butter and all of the oil. When the butter is foaming, add the veal chop and fry for 3-4 minutes on each side, or until golden-brown on both sides. Remove from the pan and set aside rest for 2-3 minutes. Bring a pan of water to the boil, add the vegetables and cook for 2 minutes, or until just tender. Drain well, add the remaining butter and stir until melted. Place the banana slices onto a baking tray and dust with the icing sugar. Place under the grill for 1-2 minutes, or until the sugar has just caramelised. To serve, place one veal chop into the centre of each of four serving plates. Pile the vegetables to one side and drizzle the sauce on the other side. Pile 3-4 pieces of grilled banana next to the veal bone. ","ingredients":" 110g\/4oz chilled butter, cut into cubes,  60g\/2½oz shallots or small onions, peeled, thinly sliced,  40g\/1½oz fresh root ginger, peeled, finely grated,  110g\/4oz fully ripe bananas, peeled, sliced into rounds,  6 tbsp raspberry vinegar,  400ml\/14fl oz veal stock ,  salt and freshly ground black pepper,  4 thin veal chops, preferable rosé veal,  salt and freshly ground black pepper ,  50g\/2oz butter,  1 tbsp olive oil,  150g\/5oz mangetout,  150g\/5oz baby sweetcorn, cut in half lengthways,  2 bananas, peeled, thickly sliced,  2-3 tbsp icing sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vealwithbuccaneerssa_93213"}