{"recipe_name":"Vegan prune and ginger tart with almond pastry ","author":"Hemsley + Hemsley","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/vegan_prune_and_ginger_17804_16x9.jpg","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Lightly grease 4 mini tart tins, 10cm\/4in in diameter, with a little coconut oil. For the pastry, pulse all of the pastry ingredients in a food processor until the mixture just comes together as a dough. Turn out onto a clean work surface and press into a smooth ball, using your hands. Wrap in cling film and chill for 10 minutes in the fridge. Cut the dough into 4 equal-sized pieces, then roll each into a ball. Flatten each ball between the palms of your hands, then place into the prepared tart tins. Use your fingers to spread and smooth the pastry thinly and evenly across the base and sides of each tin. Don't worry about breaking the pastry-just patch up any holes and aim for the thinnest finish possible.Trim away any excess pastry using a sharp knife. Prick the base of each pastry case several times with a fork. Chill in the fridge for at least 20 minutes. Bake for 10-12 minutes, or until the edges are pale golden-brown. Remove and set aside to cool and crisp up. Gently turn out the pastry cases onto a wire rack and set aside to cool completely.  Meanwhile, for the filling, blend all of the ingredients together in a food processor until smooth. Add more ginger and salt, to taste.  Spread the filling mixture into the cooled tart cases, smoothing each into an even layer. Chill in the fridge until needed, or serve at room temperature. ","ingredients":" 25g\/1oz coconut oil, melted, plus extra for greasing ,  160g\/5¾ oz ground almonds,  pinch sea salt,  pinch bicarbonate of soda,  1½ tbsp maple syrup ,  ½ tsp vanilla extract,  250g\/9oz soft prunes,  5 tbsp coconut oil,  3 tbsp freshly pressed ginger juice (available online, or see tip),  2 tsp finely grated root ginger,  3 tsp vanilla extract,  2 pinches salt ","vegetarian":true,"calories":553.0,"protein":10.0,"carbs":30.0,"sugars":29.0,"total_fat":41.0,"saturated_fat":18.0,"fiber":5.0,"salt":1.1,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vegan_prune_and_ginger_17804"}