{"recipe_name":"Vegetable korma with homemade chapattis","author":"Gordon Jones","programme":"Virgin Cooks","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chapattis, in a bowl, mix together the chapatti flour, chickpea flour and salt. Add a splash of groundnut oil to the mixture and stir to combine.  Gradually add the water in a thin stream until the mixture comes together as a dough. (NB: You may not need to use all of the water.) Turn out the dough onto a lightly floured work surface and knead lightly until soft and elastic. Cover the bowl with a damp tea towel and set aside for 10 minutes to rest. When the dough has rested, divide it into 12 equal pieces.  Dust each dough ball with flour, then roll each out, one at a time, onto a heavily floured work surface, until it forms a circle about 20cm\/8in in diameter. Stack the rolled chappatis onto a plate, separating each with a sheet of greaseproof paper. Heat a large frying or griddle pan. When the pan is hot, add the chappatis, one at a time, and grill for 2-3 minutes on each side, or until golden-brown or until griddle marks appear on both sides. Keep warm until needed. Meanwhile, for the vegetable korma, heat the ghee in a large frying pan over a medium heat. When the ghee is foaming, add the chopped onion, chilli, ginger and garlic. Fry for 1-2 minutes, stirring well.  Add the garam masala, fenugreek, cumin, mustard seeds, asafoetida and curry leaves and stir well. Continue to fry for 2-3 minutes, or until the onions have softened and the spices are fragrant.  Add the chopped aubergine, butternut squash, peppers and parboiled sweet potato. Continue to cook for 4-5 minutes, stirring regularly.  Add the okra and green beans and cook for a further 3-4 minutes.  Add the cinnamon stick, pour over the coconut milk and stir well. Season, to taste, with salt and freshly ground black pepper, then bring the mixture to a gentle simmer. Continue to simmer for 12-15 minutes, or until the sauce has thickened. (Discard the cinnamon stick.)  To serve, spoon the vegetable korma into the centre of four to six serving plates. Sprinkle over the ground almonds and chopped coriander. Serve the chappatis alongside. ","ingredients":" 200g\/7oz chapatti flour,  75g\/2½oz ground chickpea flour (gram flour or besan),  pinch salt,  splash groundnut oil,  175-250ml\/6-9fl oz water,  plain flour, for dusting,  1 tbsp ghee,  1 small onion, peeled, chopped,  ½ green chilli, finely chopped,  4cm\/1¾in piece fresh ginger, peeled, julienned,  3 garlic cloves, peeled, finely chopped,  ½ tsp garam masala,  ½ tsp ground fenugreek,  ¼ tsp ground cumin,  ¼ tsp mustard seeds (whole),  pinch asafoetida ,  small handful curry leaves (available from some supermarkets and from Asian grocers),  1 aubergine, peeled, chopped,  1 butternut squash, peeled, seeds scooped out, chopped,  3 mixed peppers (yellow, green and red), cores removed, chopped,  80g\/2¾oz sweet potatoes, peeled, chopped, parboiled,  150g\/5oz okra, trimmed,  150g\/5oz green beans, trimmed,  ½ cinnamon stick ,  1 x 400ml\/14fl oz can coconut milk ,  salt and freshly ground black pepper ,  100g\/3½oz ground almonds,  bunch chopped fresh coriander leaves","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vegetablekormawithho_92056"}