{"recipe_name":"Vegetarian cottage pie","author":"Gordon Jones","programme":"Virgin Cooks","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. For the topping, place the potatoes and parsnips or swede into a large pan of water. Bring to the boil and cook for 12-15 minutes, or until tender. Drain well. Add the butter to the cooked vegetables and mash using a potato masher or ricer. Add the milk, a little at a time, and continue to mash until smooth. Season, to taste, with salt and freshly ground black pepper. Set aside. For the filling, heat the oil in a large pan over a low to medium heat. Add the onion and fry for 8-10 minutes, or until softened.  Add the garlic, carrot, leek and thyme and continue to fry for a further 4-5 minutes, or until softened. Add the vegetarian mince to the pan and fry for a further 2-3 minutes, stirring continuously, or until golden-brown.  Add the drained cannellini beans, chopped tomatoes and tomato purée and stir well to combine. Bring the mixture to a simmer and continue to simmer for as further 4-5 minutes, or until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper. Taste and add a little sugar to the mixture if needed. Spoon the filling mixture into a large ovenproof dish. Spread the mashed potato and parsnip (or swede) mixture over the filling in a smooth, even layer. Transfer to the oven and cook for 18-20 minutes, or until the topping is golden-brown and the filling is cooked through.  Serve with steamed green vegetables. ","ingredients":" 500g\/1lb 2oz floury potatoes, such as King Edward or Maris Piper, peeled, cut into pieces,  300g\/10½oz parsnips or swede, peeled, cut into pieces, boiled until tender, drained,  knob of butter,  splash milk ,  salt and freshly ground black pepper,  1 tbsp rapeseed or groundnut oil,  1 onion, peeled, finely chopped,  1 garlic clove, peeled, crushed to a paste with the edge of a knife,  1 large carrot, peeled, finely chopped ,  1 leek, trimmed, thinly sliced ,  2 tsp chopped fresh thyme leaves,  300g\/10½oz Quorn,  1 x 400g\/14oz can cannellini beans, drained and rinsed,  1 x 400g\/14oz can chopped tomatoes ,  1 tbsp tomato purée ,  salt and freshly ground black pepper ,  sugar, to taste (optional),  steamed green vegetables, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vegetariancottagepie_92035"}