{"recipe_name":"Vegetarian cauliflower, spinach and chickpea balti","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a saucepan then add the ginger and garlic and stir. Add the onions and stir-fry for five minutes until they are translucent.  Add the water and bring to the boil. Add the rest of the sauce ingredients, cover and simmer on a low heat for 30 minutes.  Remove the bay leaves and cardamom pods, and liquidise the rest in a blender.  Heat the oil in a large wok then add the onions and fry gently until they begin to turn brown.  Add the ginger and garlic, stir well, and cook for one minute.  Add the tomatoes, cauliflower, chickpeas, salt and enough balti sauce to coat all the vegetables (4-6 ladles of sauce).  Turn the heat to low, cover and simmer until the cauliflower is just tender.  Add the green chillies and spinach and stir-fry for three more minutes until the spinach has wilted down.  Stir in the coriander.  Just before serving, sprinkle the garam masala on top.  Serve with naan bread or chapatis. ","ingredients":" 3 tbsp vegetable oil,  2cm\/¾in piece ginger, grated,  1 large garlic clove, crushed,  3 onions, chopped,  250ml\/8¾fl oz water,  4 tomatoes, chopped,  2 tsp chopped fresh coriander ,  1 tsp ground cumin,  ½ tsp turmeric powder,  ¼ tsp chilli powder,  ½ tsp paprika,  ½ tsp garam masala,  2 bay leaves,  4 cardamoms, broken slightly open,  1½ tsp salt,  1 tbsp vegetable oil,  2 onions, chopped,  2cm\/¾in piece ginger, grated,  3 garlic cloves, crushed,  2 tomatoes, chopped,  200g\/7¼oz cauliflower florets,  250g\/8¾oz tinned chickpeas, drained and rinsed,  2 tsp salt,  250g\/8¾oz baby spinach leaves,  2-3 fresh green chillies, finely chopped,  1 tbsp chopped fresh coriander ,  1 tsp garam masala,  naan bread","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vegetariancauliflowe_74041"}