{"recipe_name":"Red lentil and aubergine moussaka","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/veggiemoussaka_90770_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4 and cook the lentils according to packet instructions. For the filling, toss the aubergine slices in the vegetable oil, then drain and season, to taste, with salt and freshly ground black pepper. Heat a frying pan over a medium heat, add the aubergine slices in batches and fry for 2-3 minutes on each side, or until golden-brown on both sides. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Add the onion, pepper and garlic to the pan and fry for 2-3 minutes, or until softened. Add the tomato purée, stir to coat the vegetables in it, then continue to fry for a further 4-5 minutes.  Add the canned chopped tomatoes and cinnamon stick and simmer for 4-5 minutes.  Add the lentils and return the fried aubergines to the mixture. Simmer for a further 2-3 minutes, or until warmed through.  Transfer the mixture to an ovenproof dish and sprinkle over the chopped parsley.  For the topping, in a bowl, beat together the ricotta, Greek-style yoghurt, eggs and grated nutmeg until well combined. Season, to taste, with salt and freshly ground black pepper. Pour the topping mixture into the ovenproof dish on top of the filling. Sprinkle over the grated parmesan. Transfer the veggie moussaka to the oven and bake for 25-30 minutes, or until the topping is golden-brown and has set and the filling is bubbling. Serve immediately. ","ingredients":" 100g\/3½oz red lentils,  400g\/14oz aubergines, sliced into thin rounds,  50ml\/2oz vegetable oil ,  salt and freshly ground black pepper,  1 red onion, finely chopped ,  1 red pepper, finely chopped ,  1 garlic clove, finely chopped,  50g\/2oz tomato purée,  400g\/14oz canned chopped tomatoes, drained,  1 cinnamon stick,  2 tbsp chopped fresh parsley,  125g\/4½oz ricotta,  125g\/4½oz Greek-style yoghurt,  3 free-range eggs,  freshly grated nutmeg,  salt and freshly ground black pepper,  50g\/2oz freshly grated pecorino","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/veggiemoussaka_90770"}