{"recipe_name":"Veloute of mussels with spinach and pommes frites","author":"Galton Blackiston","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pommes frites, heat the oil to 190C\/375F in a deep fat fryer (or heat the oil in a heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it). (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully lower the potato chips into the hot oil and fry for 4-5 minutes, or until softened but not browned. Remove the chips from the hot oil using a slotted spoon and set aside to drain on kitchen paper. Increase the oil temperature to 200C\/400F (check the temperature on a digital thermometer if you don't have a deep fat fryer). Return the drained chips to the oil and fry for a further 2-3 minutes, or until crisp and golden-brown. Remove the chips from the hot oil using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Meanwhile, for the velouté of mussels, heat a large pan over a high heat. (NB. You will need to use a pan with a tight-fitting lid.) When the pan is hot, add the mussels and pour over the white wine. Cover the pan with the lid and cook over a high heat, shaking the pan occasionally, for 4-5 minutes, or until all of the mussels have opened. Drain well, reserving the cooking liquid in a clean bowl. Set the mussels aside to cool (discard any mussels that have failed to open during cooking). When the mussels are cool enough to handle, remove the mussel meat from the shells and place into a mixing bowl.  Strain the cooking liquid through a fine sieve or muslin cloth into a bowl and set aside. Melt the butter in a separate pan over a medium heat. When the butter is foaming, add the onions and fry until softened. Add the flour and curry powder and stir until well combined. Continue to fry gently for 1-2 minutes, then add the reserved, strained cooking liquid and the stock. Stir well to combine, then simmer for 8-10 minutes. When the volume of liquid has reduced by about half, add the cream, stir well and return the mixture to the boil. Just before serving, add the mussel meat and spinach leaves and cook for 1-2 minutes to warm through.  To serve, ladle the mussel velouté into warmed serving bowls. Sprinkle over the chopped chives. Serve the pommes frites alongside. ","ingredients":" 3 floury potatoes, such as Maris Piper or King Edward, peeled and cut into thin chips,  sunflower oil, for deep frying,  750g\/1½lb mussels, cleaned, rinsed and debearded (discard any mussels that do not close tightly when tapped),  175ml\/6¼fl oz dry white wine,  50g\/1¾oz unsalted butter,  1 medium onion, peeled and finely sliced,  2 level tsp plain flour,  1 level tsp medium curry powder,  125ml\/4½fl oz fish or chicken stock,  125ml\/4½fl oz double cream,  100g\/3½oz baby spinach leaves, washed,  4 tsp chopped fresh chives, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/velouteofmusselswith_91181"}