{"recipe_name":"Venison casserole with braised red cabbage and butternut squash","author":"Jun Tanaka","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/300F\/Gas 2. Heat the olive oil in a large frying pan. Season the venison with salt and freshly ground black pepper, then add to the hot pan. Fry the meat in batches until browned all over, then set aside. Add a little olive oil and a generous knob of butter to a large, lidded casserole. Fry the shallots over a medium heat until they start to colour. Add the bacon, carrots and garlic and continue to cook for a few minutes. Add the browned venison to the casserole dish. Pour in the red wine and port, bring to the boil and then simmer until the liquid has reduced by half. Add the stock, star anise, cinnamon and redcurrant jelly, and season to taste with salt and freshly ground black pepper. Place the lid on the casserole dish and transfer to the oven and cook for 1½-2 hours, or until the meat is tender. For the butternut squash mash, add the butter to a large pan. Gently fry the squash without colouring for 15-20 minutes, or until soft. Add the cream and season to taste with sea salt and freshly ground black pepper.  Use a hand blender to blend the butternut squash until smooth. Pass the mash through a sieve and set aside in a warm place until ready to serve. For the red cabbage, place the crème de cassis, red wine, orange zest and thyme in a pan. Bring to a simmer and cook until the liquid has reduced in volume by three-quarters.  In a separate pan over a high heat, add a little olive oil and fry the cabbage for two minutes. Season to taste with salt and freshly ground black pepper. Add the vinegar and transfer to a clean pan. Add a little more oil to the pan the cabbage was fried in and gently fry the onions for 10 minutes.  Add the onions to the cabbage and pour over the reduced cassis mixture . Mix well, cover with foil and cook in the oven with the venison for an hour. When the casserole is cooked, carefully remove all the venison pieces into a clean pan then use a sieve to strain the cooking liquid onto the meat. Place on over a high heat and bring to a rolling boil. Cook until the liquid has reduced in volume by half.  Serve the casserole with the butternut squash mash and red cabbage alongside. ","ingredients":" olive oil, for frying ,  1kg\/2lb 4oz venison shoulder and neck fillet, trimmed and cubed,  salt and pepper,  knob of butter,  10 shallots, peeled,  4 rashers smoked bacon, diced,  6 small carrots, with green tips attached,  2 garlic cloves,  350ml\/12fl oz red wine,  150ml\/5fl oz red port,  1litre\/1¾ pint beef stock,  1 star anise,  1 cinnamon stick,  3 tbsp redcurrant jelly,  50g\/1¾oz butter,  1 butternut squash, peeled and roughly chopped,  100ml\/3½fl oz double cream,  sea salt and black pepper,  300ml\/10fl oz crème de cassis,  500ml\/18fl oz red wine,  1 strip orange zest,  sprig thyme,  olive oil, for frying,  1 red cabbage, finely sliced,  100ml\/3½fl oz red wine vinegar,  5 red onions, finely sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/venison_casserole_with_25450"}