{"recipe_name":"Venison cobbler","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4.  Heat the oil in a medium, flameproof casserole dish (or a large heavy-based saucepan) and fry the onions, celery and carrot gently for 10 minutes, or until the onion is softened and lightly coloured, stirring occasionally.  Add the flour and mustard and cook for a few seconds before slowly stirring in the ale and 250ml\/9fl oz of water. Add the venison, redcurrant jelly, thyme leaves and bay leaves and stir. Season with a little salt and lots of coarsely ground black pepper. Bring to a gentle simmer, stirring occasionally, then cover with a lid.  Carefully transfer the dish to the oven and cook for 1¾–2 hours, or until the venison is very tender and the sauce is thick. Season to taste with salt and pepper, adding a little lemon juice to lift the richness. (At this point you can cool the venison mixture and leave it in the fridge to finish off later, or the next day if you like.) When you’re ready to cook your cobbler, spoon the venison mixture into an ovenproof pie dish. For the cobbler topping, preheat the oven to 200C\/400F\/Gas 6.  Put the flour and salt in a large bowl and rub in the butter with your fingertips until the mixture resembles breadcrumbs. Add the milk, stirring constantly, until the mixture comes together and forms a soft, spongy dough. Turn the dough out onto a floured work surface and roll out until it is about 2cm\/¾in thick. Cut out 6cm\/2½in rounds with a pastry cutter, kneading and re-rolling any leftover dough as necessary.  Place the ‘cobbles’ over the surface of the pie so they nearly cover the filling and brush them with milk or beaten egg.  Bake for 30 minutes, or until the topping is golden-brown and the filling is hot. ","ingredients":" 2 tbsp sunflower oil,  2 large onions, sliced,  2 celery sticks, trimmed and sliced,  1 medium carrot, peeled and cut into rough 15mm\/⅝in  cubes,  2 tbsp plain flour,  1 tsp English mustard powder,  500ml\/18fl oz real ale or stout,  1kg\/2lb 4oz venison (ideally shoulder or leg), cut into 3cm\/1in chunks,  2 heaped tbsp redcurrant jelly,  1 tbsp fresh thyme leaves, roughly chopped,  2 bay leaves,  1–2 tbsp fresh lemon juice,  flaked sea salt and freshly ground black pepper,  500g\/1lb 2oz self-raising flour, plus extra for dusting,  ½ tsp fine sea salt,  100g\/3½oz cold butter, cut into cubes,  300ml\/10½oz whole milk, plus extra for glazing,  beaten egg, to glaze (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/venison_cobbler_98688"}