{"recipe_name":"Venison cooked in a spiced salt crust with caramelized chicory","author":"Jun Tanaka","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the venison sauce, heat a little olive oil in a large saucepan and fry the venison trimmings until brown all over. Add the carrots and onion and fry gently for two minutes, or until the onions are soft and translucent. Add the garlic, thyme, juniper berries, black pepper, red wine and port. Simmer for five minutes then add the beef stock.  Simmer for 45 minutes. Pass through a sieve into a clean saucepan and simmer again until the volume of liquid has reduced to a rich sauce. For the venison in a spiced salt crust, preheat the oven to 225C\/425F\/Gas mark 7. To make the salt crust, combine all the spices in a large bowl. Put a few pinches of the spices to one side. Add the salt, egg white and 100ml\/3½fl oz water to the bowl. Slowly add the flour and knead until you have a smooth dough. Cover with cling film and set aside to rest for an hour.  In a very hot pan, heat a little oil and brown the venison loin for a minute. Remove the venison and sprinkle it with the reserved spices.  On a lightly floured work surface, roll out the salt crust dough to a rectangle 1cm\/½in thick. Place the venison in the middle of the dough ready to encase it. Trim off any excess where the corners will overlap to form a rough cross shape. Fold the ends over the venison, then wrap the long edges over so the meat is completely enclosed. Turn it over to hide the seams and make a small hole in the top. Bake for 12-14 minutes. To check the venison is cooked, insert a metal skewer into the hole and leave for 10 seconds. Place the skewer on the back of your hand, if the meat is cooked it should feel warm. Remove from the oven and set aside to rest for 12 minutes.  For the caramelized chicory, melt the butter in a frying pan. Add the chicory and season to taste with salt and pepper. Sprinkle over the sugar and cook for two minutes. Pour in the orange and lemon juices and the chicken stock. Simmer for five minutes before finishing with chopped mint. To serve, place the chicory on serving plates. Crack open the salt crust, wipe the venison with kitchen paper and carve. Place a few slices next to the chicory and spoon over the sauce.  ","ingredients":" olive oil, for frying,  200g\/7oz trimmings from venison loin (below),  2 carrots, chopped,  1 onion, chopped,  2 garlic cloves, chopped,  2 sprigs fresh thyme,  2 juniper berries,  1 tsp black peppercorns,  350ml\/12fl oz red wine,  100ml\/3½fl oz port,  1litre\/1¾ pint beef stock,  10g\/⅓oz ground black pepper,  10g\/⅓oz ground star anise,  10g\/⅓oz ground cinnamon,  10g\/⅓oz ground juniper berries ,  250g\/9oz rock salt,  1 free-range egg white,  200g\/7oz plain flour,  oil, for frying,  400g\/14oz venison loin,  25g\/1oz butter,  2 heads red chicory, cut in quarters lengthways,  15g\/½oz sugar,  1 orange, juice only,  ½ lemon, juice only,  150ml\/5fl oz chicken stock,  few mint leaves, sliced into very thin strips","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/venison_cooked_in_a_29725"}