{"recipe_name":"Venison salad with fig purée and wild mushrooms","author":"Michael Caines","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the vinaigrette, mix together all the ingredients. For the fig purée, cut the figs in half and remove the pulp, with no white flesh. Heat the butter in a pan until foaming. Add the five-spice and cook for 2 minutes and then add the flesh of the figs. Add the port and cook for 10-15 minutes.   In a blender, blend until smooth, then pass through a sieve. Finish with a little more butter and season with salt and pepper. Set aside and keep warm.   Season the venison with salt and pepper. Heat a thick bottomed pan with a little oil and 25g\/1oz butter. When the butter is foaming, add the venison and cook slowly, colouring all around. Cook for approximately 10 minutes, remove from the pan and leave to rest for 15 minutes before serving.  For the ragoût, using the pan that you cooked the meat in, add a knob of butter and the shallots cooking gently for about 1 minute before adding the mushrooms.  Add the chicken stock and cook for 2 minutes. Whisk in the remaining 25g\/1oz of butter. Add some vinaigrette to taste and finish with salt, pepper, chopped parsley and a pinch of five spice. To serve, slice the venison. Put a little fig purée on each plate, put the mushrooms in the middle of the plate and meat on top. Dress the salad leaves lightly in the vinaigrette and scatter them over and around. Pour over a little ragoût and serve . ","ingredients":" 200ml\/7fl oz groundnut oil,  70ml\/2½fl oz white wine vinegar ,  pinch ground white pepper,  pinch salt ,  1 garlic clove, lightly crushed ,  1 sprig fresh thyme ,  300g\/10½oz ripe black or green figs, whole,  20g\/¾oz butter,  pinch Chinese five-spice,  30ml\/1fl oz port,  4 venison fillets or 240g\/9oz venison saddle,  1 tbsp vegetable oil,  60g\/2¼oz unsalted butter ,  1 shallot, finely chopped ,  125g\/4½oz mixed wild mushrooms,  80ml\/2½fl oz chicken stock,  1 tbsp chopped fresh parsley,  pinch Chinese five-spice,  60g\/2½oz mixed salad leaves,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/venison_salad_with_fig_16503"}