{"recipe_name":"Venison and leek meatballs with honey-drizzled parsnip crisps","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the meatballs, place the venison, leeks, garlic, salt and freshly ground black pepper into a food processor and blend until combined.  Using floured hands, on a clean work surface, roll the minced meat into golf ball size balls. Heat the vegetable oil in a frying pan over a high heat and fry the meatballs for six minutes, or cooked all the way through. Remove the meatballs from the pan and keep warm. For the gravy, add the red wine to the meatball pan, turn up the heat and loosen the bits in the pan with a spoon.  Turn the heat up, add the balsamic vinegar and cook over a high heat until the liquid reduces by half. Stir in the butter and cook for one minute. Keep warm. For the parsnip crisps, heat the oil in a deep heavy-bottomed saucepan, until very hot or until a breadcrumb sizzles in it (CAUTION: Hot oil is very dangerous. Do not leave unattended). Carefully lower the parsnips into the hot oil and deep fry for six minutes or until golden. Remove with a slotted spoon and drain on kitchen paper. Transfer the parsnips onto a serving plate and drizzle with the honey. To serve, pile the meatballs on top of the parsnip crisps, pour over the gravy and garnish with the lime wedges. ","ingredients":" 150g\/ 5½oz venison leg, boned,  2 baby leeks, chopped,  1 clove garlic, chopped,  salt and freshly ground black pepper,  1 tbsp plain flour,  1 tbsp vegetable oil,  75ml\/ 2½fl oz red wine,  balsamic vinegar, for drizzling,  50g\/ 1¾oz butter,  3 parsnips, peeled and sliced into long thin ribbons,  vegetable oil, for deep frying,  1 tbsp clear honey,  1 lime, cut into wedges to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/venisonandleekmeatba_84446"}