{"recipe_name":"Venison meatballs","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the meatballs, beat the eggs and milk together in a bowl. Add the minced venison, breadcrumbs, parmesan and garlic and mix well. Mould the meatball mixture into balls, each the size of a golf ball. Place the meatballs onto a plate or tray and chill in the fridge for 20 minutes. Heat the oil in a frying pan over a medium heat. Remove the meatballs from the fridge and place into a hot frying pan. Fry for 8-10 minutes, or until golden-brown all over. For the ragu, heat the oil in a separate frying pan. Fry the onion, carrot, celery and garlic for 5-6 minutes, or until softened.  Add the tomato purée and cook for a further 7-8 minutes, until the sauce is thick and deep red in colour. Add the wine, chicken stock and rosemary and bring to boil. Reduce the heat and simmer for 45 minutes to an hour.  Add the meatballs to the sauce and simmer for 5-6 minutes, until the meatballs are completely cooked through. To serve, place a generous portion of cooked spaghetti into each serving bowl. Spoon over equal amounts of the meatballs and sauce, and finish with grated parmesan. ","ingredients":" 2 free-range eggs,  125ml\/4fl oz milk,  450g\/1lb minced venison steak,  200g\/7oz breadcrumbs,  75g\/3oz parmesan, grated ,  1 garlic clove, finely chopped,  1 tbsp vegetable oil,  1 tbsp vegetable oil,  1 onion, finely chopped,  1 carrot, finely chopped,  1 stick celery, finely chopped,  4 garlic cloves, finely chopped,  150g\/5oz tomato purée,  450ml\/¾ pint red wine,  450ml\/¾ pint chicken stock,  2 sprigs fresh rosemary,  spaghetti, cooked according to packet instructions,  parmesan, freshly grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/venisonmeatballs_89798"}