{"recipe_name":"Venison with juniper berries, sour cherry sauce and pumpkin mash","author":"Silvena Rowe","programme":"2007-16","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the venison, place all of the venison ingredients, except the grapeseed oil and the salt and freshly ground black pepper, into a large bowl, mix well, and place into the fridge to marinate overnight. Preheat the oven to 200C\/400F\/Gas 6. Remove the venison from the marinade, and pat dry with kitchen paper. Reserve the marinade. Lightly brush the venison with one tablespoon of the grapeseed oil, and season with salt and freshly ground black pepper. Heat an ovenproof frying pan until hot, then add the remaining tablespoon of grapeseed oil and the venison. Cook for 1-2 minutes on each side, then transfer into the oven to roast for 10-12 minutes for rare, or longer if you like it medium to well done. Remove the venison when cooked to your liking and leave to rest in a warm place. For the sauce, return the pan that the venison was cooked in to the heat and add the butter. Strain out the vegetables from the marinade, reserving the liquid, and add to the pan to fry for 4-5 minutes. Add the cherries, redcurrant jelly, thyme, the stock and half of the marinade liquid. Bring to the boil and cook to reduce the liquid by half, then pass through a fine sieve into a bowl. Remove the cherries from the sieve and return them to the strained liquid. For the mash, place the potato and pumpkin into a large saucepan over a high heat and cover with water. Bring to the boil, add a pinch of salt, then reduce the heat and simmer for 15 minutes, or until the vegetables are tender. Drain the potatoes and butternut squash, then return to the pan on the heat for one minute, to drive off the extra moisture. Add the olive oil and mash the potato and butternut squash until smooth. Season, to taste, with salt and freshly ground black pepper. To serve, place a spoonful of the mashed potato and butternut squash into the centre of each of six plates. Slice each venison medallion into three pieces and place three slices on top of each pile of mash, then spoon the sour cherry sauce over. ","ingredients":" 6 x 150g\/5oz venison medallions, cut from the loin,  200ml\/7fl oz red wine,  4-6 sprigs fresh thyme,  4-6 sprigs fresh rosemary,  1 garlic clove, peeled and crushed,  1 small shallot, finely chopped,  1 small carrot, finely chopped,  1 celery stalk, finely chopped,  8 white peppercorns,  10 juniper berries, crushed,  2 tbsp grapeseed oil,  salt and freshly ground black pepper,  20g\/¾oz butter,  300g\/10½oz fresh or frozen cherries, stones removed ,  2 tsp redcurrant jelly ,  ½ tsp chopped fresh thyme,  110ml\/4fl oz good chicken stock ,  600g\/1lb 5oz King Edward potatoes (or similar floury potatoes), peeled and chopped ,  600g\/1lb 5oz butternut squash, peeled and chopped,  5 tbsp extra virgin olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/venisonwithjuniperbe_84738"}