{"recipe_name":"Victorian Christmas pudding","author":null,"programme":null,"prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Mix together all of the ingredients in a large mixing bowl until thoroughly combined. Dampen the cloth in water, squeezing out any excess. Spread the cotton out onto a work surface and rub a handful of flour over it (this seals the cloth). Place the floured cloth into a large bowl, so that the cloth lines the bowl and any excess hangs over the edges. Transfer the pudding mixture to the bowl and use the bowl and the cloth to mould the pudding into a sphere. Bring the edges of the cloth tightly together so that the pudding is wrapped inside it, then tie the top of the cloth together tightly with string, to seal.  Place the wrapped pudding into a large pot of boiling water and cover with a lid. Boil for 5-6 hours, adding more water during cooking, as necessary, if the water level gets too low (the water should cover the pudding at all times). Alternatively, cook the pudding in a pressure cooker for about one hour (or according to manufacturer's instructions). (NB: A pudding this size will need to be cooked in a pan large enough to hold a minimum of six litres of water, plus the pudding. Otherwise the pudding can be divided into two smaller puddings and cooked separately for 4-6 hours each, or until cooked through.)  When the pudding is cooked, remove and pat it dry with kitchen paper, then hang in a cool, dark place for as long as possible, ideally several days (it will keep for up to three months).  When the pudding is required, prepare a steamer. Add the wrapped pudding to the steaming pan, cover with a lid and steam for two hours. Remove from the pan and unwrap. To serve, place the pudding onto a serving plate, douse it in brandy, and set the alcohol alight. Allow the flames to flare up and die down before serving. (CAUTION: Keep the flames well away from your eyes and face). Serve with custard, whipped cream or brandy butter. ","ingredients":" 450g\/1lb shredded beef suet,  225g\/8oz flour, plus extra for sealing the cotton,  225g\/8oz breadcrumbs,  225g\/8oz sugar ,  450g\/1lb raisins,  450g\/1lb currants,  Large pinch freshly grated nutmeg, or to taste,  2 tsp mixed spice ,  115g\/4oz candied peel, chopped,  Pinch salt,  1 lemon, rind only,  8 free-range eggs, beaten,  300ml\/10½fl oz brandy","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/victorianchristmaspu_92620"}