{"recipe_name":"Victorian mincemeat pies","author":null,"programme":null,"prep_time":"overnight","cooking_time":"over 2 hours","serves":"Makes 8-10 meal-sized pies","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the mincemeat, mix all of the mincemeat ingredients together in a large bowl, using your hands, until well combined. Transfer the mixture to a saucepan and heat over a very low heat for 3-5 hours, stirring occasionally, or until it has reduced to a thick, dark paste. Meanwhile, for the shortcrust pastry, sift the flour into a large mixing bowl. Add the butter or margarine cubes, then rub them into the flour using your fingertips until the mixture resembles fine breadcrumbs.  Gradually add the water, a tablespoon at a time, stirring well until the mixture comes together as a stiff dough.  Turn out the pastry onto a lightly floured work surface and knead well until smooth and elastic.  Roll out the pastry onto a lightly floured work surface to a 1cm\/&frac12;in thickness. Using an upturned bowl, cut 8-10 discs from the pastry. Reserve the remaining pastry. Place a coffee mug into the centre of each pastry disc and draw the sides of the pastry up against the mug, overlapping the edges, to form free-standing pastry cases. Divide the mincemeat evenly among the pastry cases. Roll out the remaining pastry onto a lightly floured work surface. Using the same mug as before, cut 8-10 discs from the pastry to create 'lids'.  Place one pastry 'lid' on top of each pie, tucking the edges into the pastry case. Pinch the pastry together well to prevent the filling from leaking out during baking. Using a sharp knife, cut a cross into the top of each pastry lid to allow the steam to escape. In a bowl, mix together the milk and sugar until the sugar has dissolved. Brush the top of each pie with this mixture.  Place the mince pies onto a baking tray. Bake in the oven for 20 minutes, or until the pastry is crisp and golden-brown. Remove the mince pies from the oven and cool on a wire rack. ","ingredients":" 450g\/1lb sirloin steak, finely chopped ,  450g\/1lb suet, grated,  4 large apples, peeled, core removed, flesh chopped,  1.35kg\/3lb currants,  ½ small loaf day-old bread, grated ,  Freshly grated nutmeg, to taste,  Ground cinnamon, to taste,  Ground cloves, to taste,  Ground ginger, to taste,  Salt and freshly ground black pepper,  450g\/1lb sugar,  2 lemons, zest and juice,  3 large oranges, juice only,  Candied peel, diced (optional),  250ml\/9fl oz brandy ,  250ml\/9fl oz ruby port,  225g\/8oz flour, plus extra for dusting,  115g\/4oz butter or margarine, cut into cubes,  Water, as necessary,  4-6 tsp milk,  1 tsp sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/victorianmincemeatpi_92621"}