{"recipe_name":"Victoria's crown","author":"Ian Cumming","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":null,"pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":" Line 4 large baking trays and a 23cm\/9in springform cake tin with baking parchment. On one tray draw a 15cm\/6in circle and 2 matching semicircles, 1 with a cross attached to the top. Draw 4 matching quarter circles. On 2 baking trays draw 35-40 9cm\/3½in long lines spaced well apart. Finally draw a 23cm\/9in circle on the remaining tray. For the savoiardi, beat the egg whites until stiff peaks form when the whisk is removed. Gradually add 200g\/7oz caster sugar, beating all the time. Beat for a couple of minutes until thick and well combined. In a separate bowl, beat the egg yolks with the remaining caster sugar and the vanilla paste until pale and doubled in volume. Carefully fold the yolk mixture into the egg whites. Sift in the flour and carefully fold in. Preheat the oven to 180C\/160C Fan\/Gas 4. Spoon the mixture into a large piping bag fitted with a 12mm\/½in plain nozzle. Start piping the shapes onto the templates. For the 23cm\/9in circle pipe a spiral starting from the outside into the middle so it is entirely covered in batter (this will make the base).  Pipe the outline of the other shapes and then pipe out at least 35 fingers making some of them a bit thinner than most.  Dust all the fingers and shapes with icing sugar and bake for approximately 20 minutes. Once cooked, carefully remove from the trays and set aside to cool on wire racks.  For the compôte, mix the rhubarb, stem ginger and caster sugar together on a baking tray.  For the bavarois cream, put the rhubarb on a baking tray and cover it with 150g\/5½oz caster sugar. Roast both the trays of rhubarb for 15 minutes. Put the milk, vanilla paste, the remaining 100g\/3½oz caster sugar and half the cream in a large saucepan and bring to a simmer. Meanwhile, put the egg yolks in a mixing bowl and beat until doubled in volume and pale. Soak the gelatine in a dish of water. Pour half the hot milk mixture onto the egg yolks, whisking all the time. Return all the mixture back to the pan and gently heat until thick enough to coat the back of a wooden spoon. Squeeze out any excess water from the gelatine, then add it to the custard and mix thoroughly until dissolved. Transfer the roasted rhubarb for the bavarois to a blender and pulse until smooth. Put the purée in a sieve and push through into the custard. Stir well and add a few drops of red food dye so it becomes a pale pink colour. Whip the remaining 400ml\/14fl oz double cream until soft peaks form when the whisk is removed. Gently stir into the custard. Put the ice in a large bowl of cold water. Put the saucepan in the iced water to reduce the temperature as quickly as possible. Once cold, put in the fridge until almost set. For the compôte, soak the gelatine in cold water. Put the roasted rhubarb in a saucepan and gently warm through. Squeeze any excess water from the gelatine then add it to the pan. Stir until the gelatine is dissolved then set aside to cool. To assemble the russe, line the collar of a 23cm\/9in springform tin with baking parchment. Place the large circle of savoiardi on a serving plate and put the collar on top. Trim one end of the savoiardi fingers so they are all the same length. Make a syrup by gently warming the caster sugar in 50ml\/2fl oz water. Keep heating until the sugar is dissolved. Dip each side of the savoiardi fingers in the syrup. Place the fingers cut-end down around the edge of the springform tin. They should be tightly packed so they remain upright without support.  Pour half of the compôte into the bottom of the tin and put it in the fridge until set (alternatively freeze it for 30 minutes to speed up the process). To assemble the crown that sits on top of the finished russe. Mix up the fondant icing sugar with a dribble of water to make a thick paste. Use this paste to 'glue' together the remaining savoiardi. First stick the quarter-circles together back to back, then stick the two semi-circles together in the same way (with the cross at the top). Allow to set.  When set, use the circle as the base of the crown and balance the semi-circle across the top with the two quarter-circles propping it up up – trim the tops and bottoms of the semi circles and quarter circles if need be. Use the icing to ‘glue’ the pieces into place and allow to set. Cover the paste with cling film.  When set, spray the crown with edible gold spray. Pipe a thin line of fondant along the seams the semi-circles and quarter-circles and top with silver balls. When the bavarois cream is almost set, pour half of it on top of the compôte (in the ring savoiardi fingers) and put in the fridge or freezer until fully set. For the ginger jelly, place the ginger in a pan with 400ml\/14fl oz water and the sugar. Boil for approximately 5 minutes, then remove from the heat and add the lemon verbena. Set aside to cool slightly. Soak the gelatine in a bowl of cold water for about 5 minutes. Pass the ginger syrup through a fine sieve. Squeeze any excess moisture from the gelatine then add to the ginger syrup. Chill until needed. Once the layer of custard is set, put the remaining compôte on top and chill again until set.  When the compôte is set,  put two-thirds of the remaining bavarois cream on top and chill to set. Take the reserved bavarois cream and add a small amount of red food dye. Put it in a piping bag fitted with a small star nozzle and pipe a pattern on top of the custard. Chill to set. When the ginger jelly is semi set, pour it on top of the layer of set custard. Gently smooth the surface. To decorate the crown, stick the 2 large 'diamonds' on the centre of each side of the cross using the royal icing to glue them in place. Then use small diamonds to further decorate. Put the russe on a serving plate and remove the springform collar. Place the crown on top.  Put the remaining bavarois cream in a piping bag fitted with star nozzle and pipe stars around the base of the savoiardi fingers. ","ingredients":" 6 large free-range eggs, separated,  300g\/10½oz golden caster sugar ,  3 tsp vanilla paste,  270g\/9¾oz plain flour,  50g\/1¾oz icing sugar,  400g\/14oz rhubarb, trimmed and roughly chopped,  4 pieces stem ginger in syrup, finely chopped,  120g\/4¼oz caster sugar,  5 sheets leaf gelatine,  400g\/14oz rhubarb, trimmed and roughly chopped,  250g\/9oz caster sugar,  270ml\/9½fl oz full-fat milk,  5 tsp vanilla paste,  800ml\/1⅓ pint double cream,  10 large egg yolks,  15 sheets gelatine,  reserved juice from roasted rhubarb,  red food colouring,  1 bag of ice,  110g\/4oz fresh ginger, thinly sliced,  160g\/5¾oz golden granulated sugar,  4-5 lemon verbena leaves ,  5 sheets gelatine,  50g\/1¾oz caster sugar ,  50g\/1¾oz fondant icing sugar ,  edible gold spray,  edible silver balls,  2 large clear edible diamonds, 2cm\/¾in diameter (optional),  24 clear edible diamonds, 1cm\/½in diameter (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/victorias_crown_99544"}