{"recipe_name":"Vietnamese-style scallops with papaya salad","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the papaya salad, in a bowl, mix together the green papaya, spring onions, pomelos, mint, coriander and holy basil until well combined. For the dressing, grind the palm sugar, lime juice, garlic and ginger in a pestle and mortar until they form a smooth paste. Add the nuoc nam (Vietnamese fish sauce) and chilli and stir well to combine. For the Vietnamese scallops, brush the scallops all over with vegetable oil. Heat a frying pan over a high heat until smoking, then add the scallops and cook without moving them for 20-30 seconds, or until the bottom half of each scallop has turned opaque. Turn the scallops and repeat the process until the scallops are completely opaque (do not overcook the scallops or they will be chewy). Remove from the pan and set aside.  To serve, add the toasted, crushed rice to the salad, then drizzle over half of the dressing. Mix together until well combined, then pile into the centre of three serving plates. Place four of the scallops on top of each salad and garnish with the cress. Spoon over the remaining dressing. ","ingredients":" 110g\/4oz green papaya, peeled, seeds removed, julienned,  4 spring onions, trimmed, julienned,  2 pomelos, peeled, segmented, roughly chopped,  2 tbsp fresh mint leaves, shredded,  2 tbsp chopped fresh coriander leaves,  2 tbsp chopped fresh holy basil leaves (available from some supermarkets and Asian grocers),  1 tbsp palm sugar,  ½ lime, juice only,  ½ garlic clove, crushed to a paste with the edge of a knife,  1 tsp finely grated ginger,  1 tbsp nuoc nam (Vietnamese fish sauce),  1 red chilli, finely chopped,  12 scallops, cleaned,  1 tbsp vegetable oil,  1 tbsp uncooked basmati rice, toasted in a dry frying pan until pale golden-brown, crushed,  1 x 20g\/¾oz punnet cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vietnamesescallopswi_91368"}