{"recipe_name":"Vodka and tonic battered cod with chips and tomato ketchup","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cod, heat the vegetable oil and beef dripping in a deep fat fryer to 170C\/325F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Fry the chipped potatoes in the oil for 2-3 minutes, or until tender, but not coloured. (You may need to do this in batches.) Drain the potatoes onto kitchen paper and increase the oil temperature in the pan or deep fat fryer to 190C\/375F\/Gas5. Meanwhile, mix the yeast, salt and sugar in a bowl until well combined.  Pour the tonic water into the yeast mixture and whisk in the the flour, vodka and vinegar. Leave to the mixture to ferment – it is ready to use when the mixture starts to bubble.  Coat the cod fillets in the batter and fry in the oil for 3-4 minutes, or until golden-brown and crisp. Remove the battered cod with a slotted spoon and drain on kitchen paper.   Fry the semi-cooked chips in the oil for a second time for 2-3 minutes, or until golden-brown and crisp. For the tomato ketchup, heat the vinegar, spices and sugar in a heavy-based pan until simmering. Add the remaining ingredients, bring to the boil and stir to prevent the mixture from sticking to the side of the pan.  Once the mixture has reached boiling point, reduce the temperature to a simmer and cook for a further 30 minutes, stirring occasionally. Blend the mixture in a blender until smooth, then push the ketchup through a sieve. Serve the cod alongside the chips with a good dollop of tomato ketchup. ","ingredients":" 1litre\/1¾ pints vegetable oil,  1kg\/2lb 4oz beef dripping,  400g\/14oz chipping potatoes, peeled, cut into batons,  15g\/⅔oz fresh yeast,  pinch salt,  pinch sugar,  175ml\/6fl oz tonic water,  200g\/7oz plain flour,  25ml\/1fl oz vodka,  1 tsp cider vinegar,  4 x 175g\/6oz cod (or other white fish such as coley or pollack) fillets, skinned, pin boned,  250ml\/9fl oz red wine vinegar,  1 bay leaf,  ½ tsp ground coriander,  ½ tsp ground cinnamon,  75g\/3oz light soft brown sugar,  1.6kg\/3lbs 8oz chopped tinned tomatoes,  1 tsp salt,  1 tbsp English mustard powder,  1 garlic clove, crushed,  Tabasco sauce,  2 tbsp tomato purée,  1-2 tbsp cornflour","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/vodka_and_tonic_battered_64040"}