{"recipe_name":"Waldorf salad with grilled mackerel","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/waldorf_salad_with_19251_16x9.jpg","method":"To make the mayonnaise put the egg yolks, vinegar, mustard and sugar into the small bowl of a food processor, or if you don’t have a food processor with a small bowl, you can use a stick blender. Season with salt and some ground black pepper.  Blend until smooth, then with the motor running, gradually add the oil and blend until smooth and thick. Add the crème fraîche and 1-2 tablespoons of cold water. Blend for a few seconds more until the sauce has a soft dropping consistency. Transfer to a bowl, cover and chill in the fridge. For the salad, place the walnut halves into small non-stick frying pan over a medium-high heat for 3-4 minutes, or until toasted all over. Leave to cool. Finely slice the celery, keeping the leaves for later. Add the sliced celery to a large bowl together with the sliced apples and halved grapes. Pour over the lemon juice and toss well. This will keep the apples from going brown. Mix in the mayonnaise, toasted walnut halves and celery leaves. Preheat the grill to the highest temperature setting. Add the mackerel fillets to a large mixing bowl and pour over olive oil and lemon juice. Sprinkle over the parsley and season with flaked sea salt and freshly ground black pepper. Toss well, ensuring the fillets are well coated. Transfer the mackerel to a baking tray, skin-side up, and grill for 2-3 minutes, or until the skin is crisp. Serve the mackerel fillets immediately, with the Waldorf salad and a wedge of lemon. ","ingredients":" 2 large free-range egg yolks,  1 tbsp white wine vinegar,  2 tsp Dijon mustard,  ½ tsp caster sugar,  ¼ tsp flaked sea salt,  freshly ground black pepper,  150ml\/5fl oz sunflower oil,  100ml\/3½fl oz crème fraîche,  65g\/2¼oz shelled walnut halves,  3 large sticks of celery, plus celery leaves,  2 eating apples, quartered and finely sliced,  250g\/9oz seedless red grapes, halved,  around 2 tsp fresh lemon juice,  8 fresh mackerel fillets,  4 tsp olive oil ,  4 tsp lemon juice ,  2 tbsp flatleaf parsley, finely chopped,  flaked sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/waldorf_salad_with_19251"}