{"recipe_name":"Warm poached salmon and 'never-fail hollandaise'","author":"Allegra McEvedy","programme":"Economy Gastronomy","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the white wine, onions, bay leaves, water or fish stock and salt and freshly ground black pepper into a saucepan or roasting tray that is large enough to hold the salmon fillets. Heat for 20 minutes over a low heat. (NB: Do not allow the liquid to simmer or boil.) Meanwhile, place the new potatoes into a separate saucepan and cover with cold water. Add a pinch of salt and the mint sprigs and simmer for 20-25 minutes, or until tender. When the poaching liquid has warmed through, add the salmon fillets, skin-side down. Cover the pan or roasting tray with aluminium foil and continue to poach on a low heat for ten minutes.  Add the asparagus spears to the poaching liquid, then cover again and continue to poach for a further five minutes, or until the asparagus is tender and the salmon is cooked through. Meanwhile, for the hollandaise, heat the butter in a pan over a medium heat.  Blend the egg yolks, mustard and lemon juice in a food processor until pale and well combined.  When the butter is foaming vigorously, with the motor of the food processor still running, pour the melted butter into the egg and lemon mixture a drop at a time, or until the mixture is well combined and has thickened.  Transfer the hollandaise sauce to a bowl and season, to taste, with salt and freshly ground black pepper. To serve, carefully lift the salmon fillets from the poaching liquid and pat dry. Place one into the centre of each of four serving plates. Spoon the new potatoes and asparagus spears alongside. Drizzle over the hollandaise sauce. (NB: The poaching liquid can be set aside to cool and frozen, then defrosted and reused. Remove the bay leaves before freezing.) ","ingredients":" 250ml\/9fl oz white wine,  400g\/14oz onions, peeled, finely chopped,  3 bay leaves,  500ml\/17fl oz water or fish stock,  salt and freshly ground black pepper, to taste,  700g\/1lb 7oz new potatoes, preferably Jersey Royals, scrubbed,  few sprigs fresh mint,  4 x 200g\/7oz salmon fillets,  12 asparagus spears, woody ends trimmed,  150g\/5oz salted butter,  2 free-range egg yolks,  ½ tbsp Dijon mustard,  ½ lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/warmpoachedsalmonand_92049"}