{"recipe_name":"Warm roquefort cheesecake with pears in balsamic vinaigrette","author":"Delia Smith","programme":null,"prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. First of all make the base of the cheesecake by mixing the breadcrumbs and Pecorino Romano cheese together, then pour in the butter, adding a good grinding of pepper.  Press the crumb mixture firmly down all over the base of the tin, then bake in the preheated oven for 10-15 minutes. (This time will vary slightly, so it does need careful watching - the aim is for the base to be crisp and toasted. If it is undercooked it does not have the lovely crunchy texture so necessary to the finished cheesecake.) Then remove it from the oven and turn the heat down to 180C\/350F\/Gas  4. Now make the filling. First beat together the eggs and curd cheese in a bowl, then stir in the fromage frais and seasoning. After that crumble the Roquefort fairly coarsely and stir it in, together with the chives. Pour the mixture into the tin and scatter the diced spring onion over the top, then place it on the high shelf of the oven and bake for 30-40 minutes or until the centre feels springy to the touch. Allow the cheesecake to cool and settle for about 20 minutes before serving cut into slices. The pears in balsamic vinaigrette can be prepared up to two hours before serving. Thinly pare off the skins of the pears using a potato peeler and being careful to leave the stalks intact. Now lay each pear on its side with the stalk flat on a board, then take a very sharp knife and make an incision through the tip of the stalk. Turn the pear the right way up and gently cut it in half, first sliding the knife through the stalk and then through the pear. Now remove the central core of each half, then, with the pear core side downwards, slice it thinly but leave the slices joined at the top. Press gently and the slices will fan out. Make up the vinaigrette by crushing the clove of garlic and sea salt together with a pestle and mortar until it becomes a creamy paste. Now add the mustard and several grinds of black pepper. Work these into the garlic, then, using a small whisk, add the balsamic vinegar and then the oil - whisking all the time to amalgamate. Serve one pear half with each portion of the cheesecake, with a little of the vinaigrette spooned over. ","ingredients":" 110g\/4oz white breadcrumbs,  50g\/2oz Pecorino Romano, finely grated (or parmesan),  25g\/1oz butter, melted,  freshly ground black pepper,  3 eggs, beaten,  225g\/8oz medium fat curd cheese,  110g\/4oz fromage frais,  175g\/6oz Roquefort,  1 tbsp chives, snipped,  4 spring onions, finely diced,  salt and freshly ground black pepper (to taste),  4 pears, firm but ripe,  1 clove garlic, peeled,  1 tsp sea salt,  1 tsp mustard powder,  1 tbsp balsamic vinegar,  4 tbsp extra virgin olive oil,  freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/warmroquefortcheesec_67093"}