{"recipe_name":"Warm potato and spinach salad with flaked poached salmon and red pepper coulis","author":"Richard Phillips","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the poached salmon, place all the poached salmon ingredients into a large pan and bring to the boil. Remove from the heat, cover and leave to cook in the residual heat for five minutes, or until the salmon is cooked through. Remove the salmon from the liquid and pull away and discard the skin. Flake the salmon into pieces and set aside. For the spinach and potato, place the spinach into a pan, add the water, nutmeg, lemon juice and zest, salt and freshly ground black pepper and leave to wilt for 1-2 minutes. Drain off the excess water and stir in the cooked potato. For the salad dressing, whisk all the ingredients together and then pour over the spinach and potato mix. For the red pepper coulis, heat the olive oil in a saucepan, add the onion and red pepper and fry over a gentle heat until softened. Add the milk, garlic, salt and freshly ground black pepper and boil for six minutes, or until the red pepper is tender. Allow to cool slightly, then pour into a blender and blend until smooth. To serve, spoon the spinach and potato onto a serving plate. Top with the flaked salmon and spoon around the red pepper coulis. ","ingredients":" 200g\/7oz salmon fillet,  2 sprigs fresh dill,  ½ lemon, juice only,  1 garlic clove, peeled,  300ml\/½ pint fish stock,  splash white wine,  2 cloves,  85g\/3oz baby spinach,  splash water,  ¼ tsp freshly grated nutmeg,  salt and freshly ground black pepper ,  ½ lemon, juice and zest,  ¼ potato, chopped and cooked,  1 tbsp white wine vinegar,  3 tbsp olive oil,  2 tsp Dijon mustard,  salt and freshly ground black pepper ,  dash olive oil,  ½ onion, finely chopped,  1 red pepper, chopped,  100ml\/3½fl oz milk,  1 garlic clove, chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/warmpotatoandspinach_88581"}