{"recipe_name":"Warm salad of scallops, black pudding and pea and mint purée","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pea and mint purée, heat a medium non-stick deep frying pan and melt half the butter until hot and foaming. Add the spring onions and cook until soft.  Add the peas, caster sugar, stock and remaining butter and stir together. Place a circle of greaseproof paper over the top of the mixture and allow to sweat for about 4-5 minutes. Remove the paper and stir in the mint leaves and cream. Cook for another minute until all the liquid has evaporated.   Transfer into a food processor and blend until almost smooth, leaving some texture in the mixture. Set aside until ready to use. For the scallops and black pudding, heat the vegetable oil in a frying pan and gently fry the black pudding slices until crisp. Remove from the pan and keep warm. Lightly brush a heavy-based frying pan with a little extra vegetable oil and place it over a high heat until very hot.  Season the scallops with a little salt then place them in the hot pan and sear for one minute on each side, until browned. Remove from the pan. Place a generous spoonful of the mint purée on each of four warm serving plates. Arrange the scallops and black pudding slices in overlapping layers on top of the purée. Drizzle the sherry vinegar reduction over the warm scallop salad and serve immediately, sprinkled with fresh mint. ","ingredients":" 2 tbsp light vegetable oil, plus a little extra for brushing ,  1 black pudding, cut into 1cm\/½ in thick slices,  12 king scallops ,  salt and freshly ground pepper ,  55g\/2oz unsalted butter,  6 spring onions, finely sliced ,  175g\/6oz frozen peas,  1 tsp golden caster sugar,  300ml\/½ pint vegetable stock,  2 tbsp fresh mint leaves, roughly chopped,  150ml\/5¼fl oz double cream,  sprigs of fresh mint, to garnish,  sherry vinegar, boiled until reduced by half, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/warmsaladofscallopsb_79287"}