{"recipe_name":"Warm salad of new potatoes and gruyere cheese","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200c\/400F\/Gas 6. Cut the red pepper in half, remove the seeds and stalk and place cut side-down on a baking tray. Drizzle with olive oil and bake until brown, about 15-20 minutes. Remove from the pan and place in a bowl. Cover with cling film and allow to cool.  When cool, peel the skin off and dice the flesh. Mix the dice with six tablespoons of the olive oil, the vinegar and some seasoning to make the dressing. Dice the potatoes (keep the skins on) and place in a bowl with the mustard, some more seasoning and the chopped fresh rosemary. Place in a microwave for about 30 seconds.  Press the mixture into 4 x 5cm\/2in round steel rings and place on a baking tray. Top with the cheese and place under the grill to brown the top. (If you do not have a microwave then place the steelrings filled with potatoes in a warm oven to warm through the potatoes and slowly melt the cheese). For the tapenade, place all the ingredients into a food processor, except the olive oil (include the oil from the tomatoes) - if you need more to bind the mixture, add more olive oil. Place a small pile of frisée leaves in the middle of each plate. Place the ring of potato on top and add the tapenade. Spoon round the red pepper dressing and serve. ","ingredients":" 1 red pepper ,  olive oil,  1 tbsp balsamic vinegar,  salt and freshly ground black pepper,  225g\/8oz cooked new potatoes,  1 tbsp grain mustard,  1 sprig fresh rosemary, chopped,  85g\/3oz gruyère (or raclette) cheese, grated,  ½ head frisée lettuce,  60g\/3oz tapenade,  a few sprigs fresh basil,  1 x 400\/14oz jar sun-dried tomatoes in oil,  1 tbsp capers,  canned anchovy fillets ,  1 tbsp pesto,  1 tbsp pine kernels,  salt and freshly ground black pepper,  olive oil, if needed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/warmsaladofnewpotato_74710"}