{"recipe_name":"A medley of shellfish with baby vegetables","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":null,"pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the shellfish, heat a large lidded saucepan over a high heat. Add the clams, mussels and white wine. Place a lid on top and cook for 2-3 minutes, or until the clams and mussels have opened (discard any unopened clams and mussels). Keep the cooking liquor from the shellfish. Heat a frying pan over a medium heat and add 50g\/1¾oz butter. Once hot and melted, add the shallots and cook for 1-2 minutes.  Add the reserved liquor from the shellfish and cook until the volume of liquid is reduced by half. Add the fish stock and again reduce by half. Turn down the heat and add the cream and remaining butter. For the vegetables, fill a large saucepan with boiling salted water and blanch the turnips for 3 minutes, the carrots for 2 minutes and the asparagus for a minute. Drain and set aside. Heat a frying pan and add the butter and the vegetables. Cook for 1-2 minutes then add a couple of tablespoons water and cook until the vegetables are tender. Just before serving, add the langoustines and lobster to the sauce to warm through. Then add the fresh chervil. Heat a large frying pan over a high heat and add the oil. Once hot, add the scallops and cook on each side for 1-2 minutes. Add a knob of butter to the pan just before they are finished and glaze the scallops as it melts. Put the baby vegetables and all the shellfish in a serving bowl and garnish with the sea aster and sea purslane. ","ingredients":" 400g\/14oz clams, scrubbed and debearded,  400g\/14oz mussels, scrubbed and debearded (discard any mussels with broken shells and any that refuse to close when tapped),  150ml\/5fl oz white wine,  125g\/4½oz unsalted butter,  2 shallots, finely chopped,  150ml\/5fl oz fish stock,  100ml\/3½fl oz double cream,  1 cooked lobster, meat removed ,  8 cooked langoustines, shells removed,  2 tbsp olive oil,  8 scallops, shelled, cleaned, roe removed,  3 tbsp chopped fresh chervil ,  1 bunch baby turnips, trimmed,  1 bunch baby carrots, peeled and trimmed,  8 asparagus spears, trimmed,  50g\/1¾oz unsalted butter,  20g\/¾oz sea aster,  1 handful sea purslane","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/a_medley_of_shellfish_75055"}