{"recipe_name":"Water buffalo fillet with a bone marrow crust, fondant potatoes and baby carrots","author":"The Hairy Bikers","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the water buffalo, place a large sheet of cling film onto a work surface. Place the water buffalo fillet on top and wrap the cling film around it as tightly as possible to form a sausage shape. Twist the ends of the cling film tightly to secure. Chill in the fridge for at least two hours.  Meanwhile, for the bone marrow crust, in a bowl, mix together the cooked bone marrow, the breadcrumbs, parsley and softened butter until well combined.  Line a baking tray with greaseproof paper. Spread the bone marrow mixture onto the greaseproof paper to form a thin layer. Chill in the fridge until set. For the fondant potatoes, heat the butter in a saucepan over a medium heat. When the butter is foaming, add the crushed garlic, thyme and potatoes. Fry the potatoes for 3-4 minutes on each side, or until golden-brown on both sides. Add a little of the stock and bring to a simmer, then add enough of the remaining stock to just cover the potatoes and return the mixture to a simmer. Cover the pan with a lid and continue to simmer for 20-25 minutes, or until the potatoes are tender. When the water buffalo fillet has chilled, preheat the oven to 200C\/400F\/Gas 6. Unwrap the chilled water buffalo fillet and carve into four 3cm\/1¼in thick steaks. Season each steak, to taste, with salt and freshly ground black pepper. Heat 1-2 teaspoons of the oil in a frying pan over a high heat. Add one of the water buffalo steaks and fry for 20-30 seconds on each side, or until golden-brown on both sides. Remove from the pan and transfer to a roasting tray. Repeat the process with the remaining oil and water buffalo steaks. Cut discs about the same size as the water buffalo steaks from the chilled bone marrow crust mixture, using a cookie cutter or an upturned mug. Place one on top of each of the browned steaks. Transfer the steaks to the oven and cook for 6-8 minutes (for medium-rare), or until cooked to your liking. Remove from the oven and set aside to rest. Reserve the meat juices. Meanwhile, for the buttered baby carrots, bring a pan of salted water to the boil. Add the carrots and boil for 2-3 minutes, or until just tender. Drain well. Return the drained carrots to the pan and add the butter. Stir until the butter has melted and the carrots are coated. Season, to taste, with salt and freshly ground black pepper.  To serve, place one fondant potato onto each of four serving plates. Place one water buffalo steak alongside. Spoon the carrots alongside. Drizzle over any meat juices. ","ingredients":" 800g\/1lb 12oz water buffalo fillet (remove from the fridge an hour before cooking so that the meat reaches room temperature),  salt and freshly ground black pepper,  3 tbsp olive oil,  50g\/2oz cooked bone marrow,  100g\/4oz dried white breadcrumbs,  1 tbsp chopped fresh curly-leaved parsley,  50g\/2oz butter, softened,  150g\/5oz butter,  1 garlic clove, crushed to a paste with the edge of a knife,  1 sprig fresh thyme,  4 large potatoes, peeled, cut into barrel shapes, one slice taken off each end,  75ml-110ml\/3-4fl oz chicken stock,  300g\/11oz baby carrots, scrubbed,  50g\/2oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/waterbuffalofilletwi_92105"}