{"recipe_name":"Watermelon sorbet with rosewater gulab jamun and marinated watermelon wedges","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sorbet, roughly chop one kilogram (2lb 2oz) of the watermelon and place into a food processor with the sugar and lemon juice. Blend until smooth. Strain through a sieve into an ice cream machine and churn until frozen. Cut the remaining watermelon into thin wedges and set aside. For the gulab jamun, preheat a deep fat fryer to 170C\/350F. Place the powdered milk, flour, baking powder and bicarbonate of soda into a bowl and mix to combine. Add half the cream and mix well. Add the butter and as much of the remaining cream as necessary to form a soft and slightly sticky dough. Form the dough into small balls and place in the deep fat fryer. Fry for 2-3 minutes until golden and cooked through. Remove with a slotted spoon and drain on kitchen paper. Meanwhile, make the syrup. Place the water, sugar, vodka and rosewater into a pan and bring to a boil. Reduce the heat and simmer for 1-2 minutes.  Divide the syrup between two bowls. Place the fried jamun into one of the bowls and toss to cover with the syrup. Leave to absorb the syrup for 10 minutes. Pour the remaining syrup over the reserved watermelon slices and the strawberry quarters and leave for 10 minutes. To serve, place several slices of watermelon in the centre of a serving plate, then scatter with some of the strawberries. Top with a few gulab jamun and a scoop of watermelon sorbet. Garnish with a sprig of fresh mint. ","ingredients":" 1.2kg\/2lb10oz watermelon flesh,  200g \/7oz caster sugar,  2 lemons, juice only,  200g\/7oz strawberries, quartered,  225g\/8oz powdered milk,  50g\/2oz plain flour,  1¼tsp baking powder,  ½tsp bicarbonate of soda,  175ml\/6fl oz double cream,  25g\/1oz melted butter,  75ml\/3fl oz water,  200g\/7oz caster sugar,  50ml\/2fl oz vodka,  1 tsp rosewater,  4 sprigs of mint, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/watermelonsorbetwith_86357"}