{"recipe_name":"Watercress soup with crushed Jersey Royal potatoes and chives","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the soup, heat a pan until hot, then add the butter and shallots and fry for 2-3 minutes over a low heat until softened, but not browned. Add the potatoes and stock and bring to the boil, then reduce the heat to simmer for 8-9 minutes, until the potatoes are just tender. Add the watercress and continue to simmer for two minutes, then remove from the heat and leave to cool for 2-3 minutes. Pour the soup into a food processor and blend until smooth. Return the soup to the pan and add the cream. Season, to taste, with salt and freshly ground black pepper and grate in a pinch of nutmeg. For the Jersey Royals, place the potatoes into a pan over a medium heat and cover with water. Bring to the boil, then cook for 8-10 minutes, or until tender. Drain the potatoes, then return to the pan. Add the butter and chives and roughly crush the potatoes with the back of a fork. Meanwhile, pour the cream into a bowl and add the lemon juice, salt and freshly ground black pepper. Whisk the cream until soft peaks form when the whisk is removed. To serve, place a large spoonful of the crushed potatoes into the centre of each of four shallow soup bowls. Ladle the soup around the crushed potatoes, leaving islands of potato visible. Top each pile of crushed potatoes with a spoonful of soured cream and a few sprigs of watercress. ","ingredients":" 50g\/2oz butter,  2 large banana shallots, roughly chopped,  125g\/4 ½oz Jersey Royal potatoes, washed, scrubbed and thinly sliced,  450ml\/16fl oz chicken stock (vegetarians can substitute vegetable stock),  225g\/8oz watercress, roughly chopped,  150ml\/5fl oz double cream,  salt and freshly ground black pepper,  pinch freshly grated nutmeg,  400g\/14oz Jersey Royal potatoes, washed,  75g\/3oz butter,  4 tbsp chives, finely chopped,  110ml\/4fl oz double cream,  ½ lemon, juice only,  salt and freshly ground black pepper,  watercress, to garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/watercresssoupwithcr_88999"}