{"recipe_name":"Strawberry salad with a peppered Blackwater cheese basket","author":"Kevin Dundon","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cheese baskets, heat a non-stick frying pan until very hot. Sprinkle a quarter of the hard goats' cheese into the centre of the pan in a circle about 10cm\/4in diameter. Sprinkle with some of the cracked black pepper and cook for 2-3 minutes until the fat starts to separate from the cheese and bubble. Remove from the heat and leave to cool for one minute. Using a spatula, remove the melted cheese disc from the pan. Shape the cheese disc into a basket around the end of a straight-sided tall glass and hold for 30 seconds to one minute, or until set hard enough to hold its shape. Transfer to a wire rack and allow to cool completely. Repeat with the remaining ingredients until you have four cheese baskets. Heat a frying pan until hot. Add the olive oil and bacon and fry for 1-2 minutes, until golden-brown. Add the garlic and the sourdough bread and stir-fry for 3-4 minutes until golden and crisp. To construct the salad, place the soft goats' cheese, strawberries, raspberries, herbs and mixed leaves into a bowl. Drizzle over enough of the raspberry vinaigrette to lightly coat the ingredients in the bowl. To serve, arrange the cheese baskets on serving plates and spoon in the dressed fruit and salad mixture. Garnish with the bacon and croutons. ","ingredients":" 110g\/4oz mature hard goats' cheese (such as Blackwater), grated ,  ½ tsp cracked black pepper ,  2 tbsp olive oil,  2 slices streaky bacon, cut into 5mm\/¼in thick slices,  1 garlic clove, finely sliced,  85g\/3oz sourdough bread (or other bread of your choice), cut into 1cm\/½in cubes,  220g\/8oz soft goats' cheese (such as Mine Gabhar), cut into chunks ,  110g\/4oz small strawberries, hulled and halved,  110g\/4oz raspberries,  large handful fresh mixed summer herbs (e.g. chives, dill, mint and oregano),  50g\/2oz mixed baby salad leaves,  2-3 tbsp raspberry vinaigrette","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wexfordstrawberrysal_83818"}