{"recipe_name":"'Westie' shortbread","author":"Lulu","programme":"Series 2","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 1 giant cookie","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/170C Fan\/Gas 3 and line a baking tray with baking parchment.  In a large mixing bowl cream together the butter, sugar and honey until pale and fluffy.  Add the plain flour, rice flour and salt. Rub the mixture together with your hands until the mixture resembles coarse breadcrumbs. Pressing it against the side of the bowl, bring the mixture together to form a dough. Place dough in the centre of the tray. Knead and push outwards until 1cm\/½in thick all over. Prick the surface of the dough all over with fork and place in fridge for 25 minutes. Bake for 30-35 minutes, or until pale golden brown in colour. Meanwhile, for the royal icing. Whisk the egg whites with an electric whisk until soft peaks form. Add the icing sugar, 1 heaped tablespoon at a time, and fold in.  Once all the sugar has been incorporated, add lemon juice and continue to beat on medium-high speed until stiff peaks form and icing has lost its shininess. Use a Westie dog shaped template to cut out the biscuit. Leave to cool.  Using a palette knife spread the royal icing thinly over the shortbread, leaving a 1cm\/½in gap from the edge all the way around .  Roll two small balls of black fondant for the eyes and a triangular piece for the nose. For the collar, roll a thin sausage of red fondant and flatten. Place the fondant pieces on the cookie.  ","ingredients":" 250g\/9oz unsalted butter, softened and cut into small cubes,  125g\/4½oz caster sugar,  2 tbsp heather honey,  250g\/9oz plain flour,  120g\/4¼oz  rice flour,  ½ tsp salt,  85g\/3oz egg whites ,  450g\/1lb icing sugar, sifted,  ½ tsp lemon juice,  black fondant icing,  red fondant icing","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/westie_shortbread_99458"}