{"recipe_name":"Whisky-cured salmon with cucumber ketchup and chargrilled cucumber","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the whisky-cured salmon, place the sugar, salt, vanilla seeds and whisky in a large bowl and mix together. Sprinkle some of the mixture on the bottom of a non-reactive baking tray and lay the salmon on top, skin-side down. Cover the rest of the salmon with the curing mixture and cover with cling film. Place in the fridge for 4-6 hours, or overnight. For the tapioca crisps, place the tapioca in a saucepan with the stock and cook, stirring constantly. Add the beetroot juice and stir. Tip out onto a lined baking tray. Allow to dry for 2-3 hours. Heat a deep-fat fryer (or large heavy-based saucepan half filled with oil) to 190C\/380F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Break off bits of the dried tapioca and place in the fryer with for a second, then lift out with a slotted spoon and set aside to drain on kitchen paper. Sprinkle with salt. For the cucumber ketchup, place the vinegar and sugar into a medium saucepan and heat until the sugar has dissolved. Remove from the heat and allow to cool slightly before pouring it into a large food processor with the cucumber. Blend until smooth. With the processor still running, add the xantham gum until well-combined and thickened. Season with salt and set aside. For the chargrilled cucumber, heat a large griddle pan until hot. Drizzle the cucumber with the rapeseed oil and cook until evenly charred on each side. Remove from the heat and cut into four pieces. To serve, slice the salmon into thin slices on an angle and place a few slices in the centre of each of four plates. Spoon a little of the cucumber ketchup alongside, with a piece of chargrilled cucumber. Scatter over a few watercress leaves and tapioca crisps and serve. ","ingredients":" 25g\/1oz caster sugar,  25g\/1oz fine salt,  1 vanilla pod, seeds scraped out,  2 tbsp whisky,  1 x 500g\/1lb 2oz side of salmon, skin on, pin bones removed,  100g\/3½oz tapioca pearls,  200ml\/7fl oz vegetable stock,  2 tsp beetroot juice,  vegetable oil, for deep-frying,  salt,  100ml\/3½fl oz white wine vinegar,  2 tsp caster sugar,  2 cucumbers, roughly chopped,  1 tsp xantham gum,  1 cucumber, peeled, with the ends and round edges trimmed off,  rapeseed oil, for drizzling,  large handful watercress or 2 tbsp watercress sprouts","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whisky-cured_salmon_with_72948"}