{"recipe_name":"Whisky and orange mustard rib of beef with potato and turnip dauphinoise","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mustard, place the vinegar and sugar in a saucepan and bring to a simmer. Add the mustard seeds and powder and stir well. Simmer over a high heat for three minutes until the volume of the liquid has reduced by half and the seeds slightly softened. Pour into a food blender and blend to a purée – it takes a few of minutes for the seeds to break down and the mustard to become creamy. Add the whisky, orange juice and honey, then blend once more. Season with a little salt and freshly ground black pepper and set aside. For dauphinoise, preheat the oven to 170C\/325F\/Gas 3. Butter an ovenproof dish with a little of the butter then rub the garlic clove around the dish. Toss the potatoes and turnips together in a bowl, season with salt and freshly ground black pepper. Tip into the ovenproof dish, pressing the slices down to form an even layer. Place the cream and milk in a bowl and whisk to combine. Season with salt, black pepper and nutmeg and pour the cream and milk over the potatoes and turnips. Dot with the remaining butter and then cover tightly with aluminium foil. Place in the oven and cook for an hour until the vegetables are just tender. After an hour, remove from the oven and set aside. For the beef, increase the oven temperature to 200C\/400F\/Gas 6. Spread some of the mustard all over the beef (any remaining mustard can be kept in a container in the fridge for a few weeks). Heat a large frying pan until very hot. Add a little oil to the pan and fry the beef on all sides until nicely browned. Transfer to a roasting dish and place in the oven for 1 hour 30 minutes. Remove from the oven, cover with foil and rest for 15-30 minutes. For the dauphinoise, remove the foil and return to the oven for a further 30 minutes until golden-brown on top. For the beef, place the beef on a board ready to carve and then return the roasting pan to the heat. Make a gravy by heating the meat juices over a medium heat until bubbling, then add the wine and cook until the liquid has reduced by half. Add the beef stock and cook until reduced by half again, then season to taste. To serve, carve the beef and serve with a spoonful of dauphinoise and dollop of mustard. Drizzle over the gravy to finish. ","ingredients":" 150ml\/5fl oz cider vinegar,  5 tbsp caster sugar,  60g\/2¼oz yellow mustard seeds,  25g\/1oz brown mustard seeds,  2 tbsp English mustard powder,  50ml\/1¾fl oz single malt whisky,  50ml\/1¾fl oz orange juice,  2 tsp honey,  50g\/1¾oz butter, plus extra for greasing,  1 garlic clove, cut in half,  500g\/1lb 2oz King Edward potatoes, peeled and thinly sliced,  500g\/1lb 2oz turnips, peeled and thinly sliced,  salt and freshly ground black pepper,  300ml\/10fl oz double cream ,  300ml\/10fl oz whole milk ,  pinch freshly grated nutmeg,  4kg\/8lb 8oz 3-bone forerib of 28-day aged beef,  200ml\/7fl oz white wine,  300ml\/10fl oz beef stock","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whisky_and_orange_31001"}