{"recipe_name":"White chocolate, macadamia and coffee torte","author":"Cathryn Dresser","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mascarpone cream, in a bowl mix the espresso powder and brandy together, then add the icing sugar and mascarpone. Mix until combined, then cover and set aside For the torte, preheat the oven to 170C\/325F\/Gas 3. Blend the macadamia nuts in a food processor until very fine but stop before they turn into a paste. Spread them over a clean tea towel (this will absorb any excess oil).  Line two 20cm\/8in loose-bottomed tins with greaseproof paper. Melt a knob of butter and brush it generously over the paper before sprinkling with caster sugar. Swirl the sugar around the tin until the paper is evenly coated, then tip out any excess. In a large bowl, mix the blended macadamias with the ground almonds. Sit a heat-proof bowl over a pan of simmering water, add the white chocolate and stir occasionally until it has completely melted. Pour the melted chocolate into the blended macadamia and ground almond mix and stir through. Set aside to cool slightly. Beat the caster sugar, vanilla and all eight egg yolks together until pale and fluffy.  Gently beat in the chocolate and nut mixture, then add the milk and stir through. In a clean bowl whisk the egg whites to stiff peaks. Using a metal spoon, fold one spoonful of the whites into the yolk mixture, then fold in the remainder in two or three batches until completely incorporated.  Pour the mix into the two prepared tins and bake for 35-40 minutes. For the decorations, cut up the chocolate and put two-thirds of it into a heatproof bowl set over a pan of simmering water. As the chocolate melts use a sugar thermometer to check the temperature, when the chocolate reaches 87F\/30C remove the bowl from the heat. Use a wooden spoon to stir in the remaining chocolate in small batches. Set aside to cool for a few minutes or until the chocolate reaches 80F\/26C, then put it back over the simmering water and heat until the temperature reaches 82F\/27C. Pour the chocolate over a transfer sheet, pattern side up. Use a palette knife to smooth the surface until you have an even layer that is approximately 2-3mm\/ 1\/8in thick. Set aside for a few minutes to allow the chocolate to cool then, before it has completely set, then use a sharp knife to score two rows of triangle shapes onto the surface (these will cover the sides of the completed torte). For the white chocolate ganache, melt the chocolate in another heat-proof bowl set over the pan of simmering water. In a heavy based pan on a low heat, warm the cream until just before boiling point.  Pour the cream over the chopped chocolate and whisk until smooth then add the brandy.  Transfer a quarter of the ganache to a separate bowl and stir the coffee essence into it (the ganache should be a dark-brown colour). Cover both with cling film and set aside. When the torte are cooked, remove from the oven, allow to cool in the tins for 10 minutes, then remove from the tins and transfer to a cooling rack to cool completely. To construct the torte, place a teaspoon of the mascarpone cream in the centre of your serving plate\/stand (this will hold the torte in place). Put the first layer of torte over it and cover the top with mascarpone cream. Carefully sandwich the other layer on top and pour over the white chocolate ganache and smooth. Fill a piping bag fitted with a very fine nozzle with the coffee ganache and pipe parallel lines approximately 2½cm\/1in apart across the top of the torte. Turn the torte 90 degrees and drag a skewer or a cocktail stick across the lines in alternate directions to feather the lines of ganache.   Wipe up any excess ganache that has dripped onto the serving plate and place the coffee beans and macadamia halves around the top edge.  Peel the acetate sheet from the chocolate transfer and use the scored marks to snap the chocolate into triangles.  Stick the chocolate triangles to the side of the torte (the ganache should hold them in place but use some leftover ganache if necessary). ","ingredients":" 1 tbsp instant espresso powder,  3 tbsp brandy,  1 tbsp icing sugar,  250g\/9oz mascarpone,  200g\/7oz macadamia nuts,  knob of butter,  caster sugar, for sugaring the cake tins,  80g\/2¾oz ground almonds,  200g\/7oz white chocolate, broken into pieces,  180g\/6¼oz caster sugar,  1 tbsp vanilla paste,  6 free-range eggs, separated,  2 free-range eggs, yolks only,  2 tbsp milk,  200g\/7oz white chocolate ,  chocolate transfer sheet (available online),  1 bag chocolate covered coffee beans,  50g\/1¾oz macadamia nuts, halved ,  170g\/6oz white chocolate, chopped,  100ml\/3½fl oz double cream,  1 tbsp brandy,  1½ tsp coffee essence (available online and from large supermarkets)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/white_chocolate_80777"}