{"recipe_name":"White chocolate bread and butter pudding with whisky ice cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ice cream, preheat the oven to 200C\/180C Fan\/Gas 4. Spread the breadcrumbs out on a baking tray and toast in the oven for a couple of minutes until crisp and slightly browned. Meanwhile, beat the two creams with the sugar. Mix together the egg yolks and whisky, if using, and add to the cream mixture, beating it in well. When the breadcrumbs are cool, fold them gently into the cream mixture, making sure they are evenly distributed. Lastly, whip the egg whites until stiff and fold into the mixture. Transfer to a sealable container, place in the freezer and store until needed. (There is no need to stir this ice cream while it freezes.) For the bread and butter pudding, preheat the oven to 130C\/110C Fan\/Gas 2. Put the milk, cream and vanilla pod in a saucepan and bring slowly to the boil. Place the eggs, egg yolks and sugar into a bowl and whisk to combine. When the cream mixture has come to the boil, remove from the heat and remove the vanilla pod. Whisk the egg mixture into the cream mixture. Add the white chocolate and whisk until melted and smooth. Grease an ovenproof dish and butter the bread. Place the bread into the dish, overlapping the slices. Drizzle the whisky over the bread. Pour over the custard mixture. Bake for 20-25 minutes, or until golden-brown and just set. Remove from the oven and dust with icing sugar. Place under a preheated grill or use a mini-blowtorch to caramelise the top. For the crème Anglaise, place the egg yolks and sugar in a bowl and whisk until well blended. Combine the milk, cream and vanilla pod in a saucepan and bring to the boil. Immediately reduce the heat and simmer for one minute Pour the milk onto the egg mixture and whisk in. Return the mixture to the saucepan and heat slowly, until the custard has thickened enough to coat the back of the spoon. Remove and discard the vanilla pod. Cut the pudding into squares and remove from the dish, dust with icing sugar and use a blow torch to colour the top. Serve with the brown bread ice cream and crème Anglaise. ","ingredients":" 175g\/6oz brown wholemeal breadcrumbs ,  300ml\/10fl oz double cream ,  300ml\/10fl oz single cream ,  125g\/4½oz icing sugar ,  2 free-range eggs, separated,  1 tablespoon whisky, (optional) ,  350ml\/12fl oz milk,  350ml\/12fl oz double cream,  1 vanilla pod, split ,  2 free-range eggs,  4 free-range egg yolks,  150g\/5½oz caster sugar,  150g\/5½oz white chocolate, roughly chopped,  8-10 slices white bread, cut into quarters,  110g\/3¾oz butter, softened, plus extra for greasing,  4 tbsp whisky,  2 tbsp icing sugar, to dust,  4 free-range egg yolks,  40g\/1½oz caster sugar,  150ml\/5fl oz milk,  150m\/5fl ozl double cream,  1 vanilla pod, seeds removed","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/white_chocolate_bread_66263"}