{"recipe_name":"White chocolate, hazelnut and raspberry layered genoise mousse cake","author":"Holly Bell","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 10-12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mousse, place the gelatine in a small bowl of cold water and set aside to soften. Place the chocolate in a glass bowl and melt in the microwave for about two minutes, stirring from time to time until the chocolate is thoroughly melted and smooth. Set aside to cool.  Gently heat 100ml\/3½fl oz of the cream in a small saucepan on the hob. Remove the pan from the hob, squeeze the water from the gelatine, then stir it into the cream until completely dissolved. Set aside in the fridge to cool.  Whisk the egg whites until stiff peaks form when the whisk is removed. Whisk the remaining cream until stiff peaks form when the whisk is removed. Fold in the melted chocolate with a metal spoon. Add the gelatine and cream mixture and mix until well combined. Gently fold in the egg whites then cover the bowl with clingfilm and chill in the fridge for 1-2 hours. For the sponge cake, preheat the oven to 180C\/350F\/Gas 4. Grease two 15cm\/6in cake tins and line the bases and sides with greaseproof paper, making sure the paper extends above the top of the tins.  Place the flour and hazelnuts in a food processor and pulse until very finely ground. Place the eggs, egg yolk and sugar in a bowl set over a pan of barely simmering water, making sure the bottom of the bowl does not touch the water. Whisk the eggs and sugar over the heat for about five minutes or until the mixture is light, fluffy and warm. Remove the bowl from the heat and whisk with an electric whisk for about five minutes or until the mixture has tripled in volume and has the consistency of softly whipped cream.  Sift one-third of the flour and hazelnut mixture over the whipped eggs and gently fold in using a large rubber spatula. Fold in half of the remaining flour mixture, then the rest.  (Do not over mix the batter.)  Mix a cupful of the batter into the melted butter with a small spatula.  When completely combined, fold the butter mixture into the batter with a spatula.  Divide the batter between the prepared cake tins, smoothing the top level. (The batter should not reach more than half the depth of the tins.) Bake the cakes in the oven for 20-25 minutes or until the mixture shrinks slightly from the edges of the pan and the top springs back when lightly pressed. Cool on a wire rack, removing the cake tins and greaseproof paper as soon as they are cool enough to handle.  To make the praline, place the chopped hazelnuts and sugar in a small saucepan. Heat gently until the sugar has dissolved and turned a pale caramel colour. Pour the mixture onto the prepared baking tray and set aside to cool. When the caramel has set, break into pieces by smashing it with a rolling pin then place the pieces in a food processor and pulse until you have a coarse powder. To assemble the cake, cut each sponge in half horizontally with a serrated knife.  Position one cut sponge onto a cake stand, brush with hazelnut liqueur and pipe or spread the mousse on top. Repeat these layers with the remaining sponges, then coat the whole cake with the remaining mousse, using a palette knife. Arrange the raspberries on top of the cake then gently press the powdered praline onto the sides, using greaseproof paper to make a smooth finish. Brush any excess praline away from the cake stand with a pastry brush.  ","ingredients":" 2 sheets leaf gelatine,  400g\/14oz good quality white chocolate, cut into small pieces ,  568ml\/1 pint double cream,  3 free-range eggs whites,  125g\/4½oz plain flour,  35g\/1¼oz skinned hazelnuts ,  4 free-range eggs,  1 free-range egg yolk,  185g\/6½oz caster sugar,  60g\/2¼oz butter, melted,  300g\/10½oz chopped hazelnuts,  150g\/5½oz caster sugar,  200ml\/7fl oz hazelnut liqueur,  500g\/1lb 2oz raspberries ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/white_chocolate_hazelnut_53975"}