{"recipe_name":"White chocolate, bourbon and raspberry cheesecake","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Lightly grease a 25cm\/10in spring-form cake tin.  Place 200g\/7oz of the white chocolate and the double cream into a bowl suspended over a pan of simmering water (do not let the bottom of the bowl touch the water) and heat until just melted. Place the sponge disc in the base of the tin. Sprinkle with a little bourbon, if you like.  Place the cream cheese into another bowl and add the vanilla extract. Then beat together with the lemon zest and juice, bourbon and egg yolks.  Stir in the sugar, corn flour and white chocolate cream and mix until thoroughly combined. Carefully fold in the raspberries and the remaining chopped white chocolate. Whisk the egg whites until stiff peaks form when the whisk is removed. Fold the whisked egg whites into the cream cheese mixture with a large metal spoon, making sure they are fully incorporated, then pour the mixture over the sponge base in the cake tin.  Set the cheesecake on a large sheet of foil and wrap the foil up around the base of the tin to seal the bottom. Pour 2-3mm of warm water into a roasting tray, and sit the cake tin in the tray. (This will help create steam during cooking.) Bake for one hour until the top is golden-brown but the middle of the cake still has a slight wobble.  Remove from the oven and leave to cool and set completely before removing from the tin.  For the raspberry sauce, place the raspberries, icing sugar and 50ml\/2fl oz water into a blender and purée until smooth.   Strain the sauce through a fine sieve pushing it through with a spatula or spoon. Slice the cheesecake and serve with a drizzle of raspberry sauce. ","ingredients":" oil, for greasing,  25cm\/10in sponge cake disc (cut from a large ready-made sponge flan case),  300g\/11oz white chocolate, roughly chopped,  350ml\/12fl oz double cream,  750g\/1lb 10oz full-fat soft cream cheese,  1½ tsp vanilla extract,  2 lemons, zest and juice,  50ml\/2fl oz bourbon, plus extra for sprinkling,  3 free-range eggs, separated,  200g\/7oz caster sugar,  4 tbsp cornflour,  250g\/7oz raspberries,  250g\/9oz raspberries ,  2 tbsp icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/white_chocolate_bourbon_02403"}