{"recipe_name":"White chocolate and raspberry bread","author":"Paul Hollywood","programme":"Paul Hollywood's Bread","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 1 loaf","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Combine the flour, starter and salt in a large mixing bowl. Add the water and mix with your hands until you have a soft dough.  Coat a chopping board with olive oil, then tip the dough onto it and knead the dough for 5-10 minutes, or until the dough forms a soft, smooth skin.  Tip the dough into a lightly oiled bowl and cover with a clean tea towel. Leave to rise in a warm place (22-24C\/71-51F) for five hours, or until at least doubled in size. Once risen, knead the dough until it is smooth, knocking the air out. Add the white chocolate chips and raspberries and continue to knead until the chocolate and raspberries are well mixed into the dough. Roll into an elongated shape to fit into a long proving basket. Flour the proving basket and place the dough into the basket. Leave to rise for 5-9 hours. Preheat the oven to 220C\/425F\/Gas 7. Liberally sprinkle semolina on to the exposed dough in the proving basket; this will give it grip on the baking tray and stop it from spreading.  Place a baking tray over the proving basket, then quickly flip it over, removing the basket and leaving the loaf shape on the baking tray.  Bake for 20 minutes, then reduce the oven temperature to 190C\/375F\/Gas 5 and bake for another 20-25 minutes.  If the bread looks like it is colouring very quickly reduce the heat earlier and cover with foil. ","ingredients":" 375g\/13oz strong white flour, plus extra for dusting,  250g\/9oz sourdough starter,  7g salt,  100-130ml\/3½-4fl oz tepid water,  olive oil, for kneading,  150g\/5½oz white chocolate chips,  100g\/3½oz fresh raspberries (not frozen),  fine semolina flour, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/white_chocolate_and_89452"}