{"recipe_name":"White fish poached in oil","author":"Jonray and Peter Sanchez-Iglesias","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the watercress oil, bring a large pan of water to the boil. Add the watercress for 15 seconds. Drain and refresh immediately in cold water. Put the watercress into a muslin cloth and squeeze out as much water as possible. Place in a blender with the rapeseed oil and a pinch of salt . Blend for five minutes, or until the colour of the oil changes to dark green. Put a sieve lined with muslin over a bowl. Add the oil and leave to stand for an hour, or overnight. For the fish, put the rapeseed oil in a pan and heat to 50C\/120F. Poach the fish for 8-10 minutes then remove and place on a wire rack to drain. Leave the fish in a warm place for 5-10 minutes and finish by charring the skin with a chef’s blowtorch.  For the cider sauce, heat the oil in a saucepan and gently fry the shallot without browning it.  Add half the cider, the whitebait and garlic and heat until the volume of liquid has reduced by half. Add the double cream and bring to a simmer for five minutes. Let the sauce cool slightly then pulse in a blender and pass the sauce through a fine sieve. For the greens, steam the purple sprouting broccoli in a steamer for 4-5 minutes until tender. Trim the kale into large pieces. Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 160C\/320F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Do not leave unattended) Add the kale to the fryer and fry until crisp (make sure you cover the fryer with lid when cooking the kale as it may spit). Drain the kale on a tray lined with kitchen paper and season with sea salt. Put the kale crisps in an oven set to the lowest possible temperature to keep warm until ready to serve. Just before serving, add the remaining cider to the sauce and season, to taste, with salt. Ladle the sauce into the middle of serving bowls. Drizzle with watercress oil. Place the fish in the centre. Finish with the purple sprouting broccoli and kale crisps. ","ingredients":" 150g\/5½oz watercress,  150ml\/5fl oz rapeseed oil ,  sea salt,  4 x 110g\/4oz turbot fillets,  300ml\/10½fl oz rapeseed oil,  300ml\/10½fl oz sunflower oil,  20ml\/¾fl oz rapeseed oil,  40g\/1½oz shallot, finely chopped,  50ml\/2fl oz cider,  15g\/½oz dried whitebait,  ¼ garlic clove, chopped,  250ml\/9fl oz double cream ,  4 stalks purple sprouting broccoli,  4 stalks kale,  vegetable oil, for deep frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/white_fish_poached_in_77936"}