{"recipe_name":"White chocolate, whisky and croissant butter pudding","author":"James Martin","programme":"Sweet Baby James","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Pour the milk and cream into a pan, add the vanilla pod and bring slowly to the boil. Crack the eggs into a large mixing bowl with the egg yolks and sugar and beat together until pale and fluffy. Lay the croissant slices over the base of an ovenproof dish, slightly overlapping the pieces. Sprinkle with the sultanas and pour over the melted butter. When the cream mixture has reached boiling point, take it off the heat and allow to cool slightly. Add the egg mixture and grated chocolate to the cream and stir well. Set aside for a few minutes to allow the chocolate to melt, stirring occasionally. Add the whisky to the cream mixture, then strain the cream through a sieve over the croissants. Remove the vanilla pod. Cover the dish with foil and bake in the oven for 15-20 minutes, or until almost set. Remove from the oven, coat the top with the jam and dust with icing sugar. Heat with a mini-blowtorch to caramelise the top, or place under a hot grill. To serve, allow the pudding to reach room temperature and serve with a scoop of ice cream and a sprig of mint, to garnish. ","ingredients":" 500ml\/17fl oz milk,  500ml\/17fl oz double cream,  1 vanilla pod, split lengthways,  3 free-range eggs,  5 free-range egg yolks,  200g\/7oz caster sugar,  4 large ready-made croissants, sliced,  25g\/1oz sultanas,  25g\/1oz butter, melted,  175g\/6oz white chocolate, grated,  3 tbsp whisky,  55g\/2oz apricot jam,  icing sugar, to dust,  vanilla ice cream,  sprig fresh mint, to garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whitechocolatewhisky_86302"}