{"recipe_name":"White onion risotto with roasted tomatoes","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 140C\/285F\/Gas 1. For the roasted tomatoes, cover a baking tray with sea salt.  Place the tomatoes, cut-side up, onto the tray of salt and place into the oven for three hours, or until the tomatoes are completely dried out. For the risotto, heat the oil in a deep frying pan and add the onions. Fry the onions until softened but not browned. Add the rice, thyme and wine and stir well. When the wine has been absorbed by the rice, add a ladleful of stock and stir constantly until almost all the stock has been absorbed. Add another ladleful of stock and repeat the process of stirring and adding stock until the rice is completely cooked through, but still with a bit of 'bite'. Add the cream and the spinach and stir well, seasoning, to taste, with salt and freshly ground black pepper. For the black pudding, heat the oil in a clean frying pan over a medium heat. Add the black pudding and fry, turning once, until crisp on both sides and completely cooked through. To serve, place a generous portion of the risotto into each bowl. Top each bowl of risotto with two roasted tomato halves and three slices of black pudding and garnish with fresh parmesan shavings. ","ingredients":" sea salt,  6 large tomatoes, cut in half,  2 tbsp vegetable oil,  2 onions, sliced,  450g\/1lb Arborio or similar risotto rice,  1 tbsp fresh thyme leaves,  splash white wine,  650ml\/1 pint 3½fl oz hot vegetable stock,  75ml\/3fl oz double cream,  400g\/14oz baby spinach,  salt and freshly ground black pepper,  parmesan shavings, to serve (vegetarians can substitute similar vegetarian hard cheese),  2 tbsp vegetable oil,  12 slices vegetarian black pudding","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whiteonionrisottowit_86925"}