{"recipe_name":"Whole roasted sea bass with beetroot salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pickle, place the ingredients in a medium saucepan with 100ml water and heat un-til the honey has dissolved. Pour into a bowl and leave to cool. Add the beetroot leaves to the pickle and leave for at least 2 hours. For the salad, preheat the oven to 200C\/180C Fan\/Gas 4. Put the beetroot onto tin foil, season with salt and freshly ground black pepper, drizzle with oil and top with the thyme. Wrap the foil into a parcel and seal the top. Bake for 20-40 minutes. Remove from the oven and set aside to cool. For the sea bass, preheat the oven to 180C\/160C Fan\/Gas 5. Place the sea bass on a baking tray lined with foil. Cover the fish with another sheet of foil. Cook in the oven for 10 minutes then remove the top foil to uncover the fish and cook for a further 10-15 minutes. Heat a griddle pan and drizzle the chicory with the oil and place on the griddle for 2-3 minutes, or until charred all over.  Put the chicory in a large bowl, add the onion and walnuts. Peel the cooled beetroot, cut into pieces and add to the bowl. Mix to combine. Whisk the walnut oil, Dijon mustard, vinegar, salt and pepper together in a small bowl. Just before serving pour the dressing over the salad and mix. To serve, place the salad on the plate with the flaked sea bass fillet and garnish with the beetroot leaves. ","ingredients":" 4 tbsp honey,  the leaves from the heritage beetroot (from below),  100ml\/3½fl oz rice wine vinegar,  1 shallot, peeled and sliced,  pinch salt ,  1 whole wild sea bass or 2 farmed, fins removed and cleaned,  1 bunch heritage beetroots and leaves,  2 tsp olive oil,  1 sprig fresh thyme,  1 head chicory, leaves separated,  1 small red onion,  100g\/3¼oz walnut halves,  3 tbsp walnut oil,  1 tsp Dijon mustard,  1 tbsp sherry vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whole_roasted_seabass_96858"}