{"recipe_name":"Whole roasted masala chicken and potatoes","author":"Madhur Jaffrey","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/whole_roasted_masala_77631_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Place all the marinade ingredients into a blender and process to a paste. Using a sharp knife, make two deep, diagonal cuts into each breast of the chicken, going all the way down to the bone. Make two equally deep slashes in the thighs and two in the drumsticks as well.  Place the chicken, breast side up, on a roasting tray lined with enough foil to cover the bird completely.  Pour the marinade paste over the chicken, rubbing it well into all the cuts. Set aside for 30 minutes.  Sprinkle the chilli powder and black pepper over the chicken evenly. Wrap up the chicken in the foil so it is completely covered, with the tightly closed seam at the top.  Bake in the middle of the hot oven for one hour.  Unwrap, without letting the juices run out, and cook, uncovered, for 15 minutes, basting two or three times with the juices.  Check the chicken is cooked by inserting a skewer into the thickest part of the thigh, between the leg and the body. If the juices run clear with no trace of pink, it is cooked. Continue to cook for a little longer if needed. Preheat the oven to 180C\/350F\/Gas 4. Meanwhile, for the roasted masala potatoes, pour the oil into a large bowl. Add the potatoes and sprinkle in the salt and pepper. Ensure the potatoes are well coated, then transfer to a baking tray in a single layer.  Place in the middle of the oven and roast for 20 mins. Spoon the coriander, cumin, turmeric and chilli powder on to a plate and mix well.  Remove the potatoes from the oven. Using tongs, roll the potatoes in the spice mix, making sure all sides are covered.  Return them to the oven for a further 20 minutes, or until lightly browned and tender all the way through when pierced with a knife. Set the chicken in a warm place to rest for 10-15 minutes, then carve and serve with the roasted masala potatoes. ","ingredients":" 4 tbsp lemon juice ,  2 tbsp peeled, finely chopped root ginger ,  2 tbsp finely chopped or crushed garlic ,  3 hot green chillies, finely chopped,  ½ tsp salt,  1 tsp ground coriander,  1 tsp garam masala,  1.75kg (3lb 14oz) whole chicken, skin removed,  ½ tsp chilli powder,  ½ tsp freshly ground black pepper,  2 tbsp olive or sunflower oil,  5 medium potatoes, peeled, halved lengthways, and cut into 5x4cm\/2x1½in chunks,  ½ tsp of salt,  ¾ tsp freshly ground black pepper,  1 tsp ground coriander ,  1 tsp ground cumin,  ½ tsp turmeric,  1 tsp Kashmiri (mild) chilli powder","vegetarian":false,"calories":569.0,"protein":73.0,"carbs":47.0,"sugars":2.0,"total_fat":9.0,"saturated_fat":2.0,"fiber":5.0,"salt":1.3,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whole_roasted_masala_77631"}