{"recipe_name":"Whole steamed sea bream with ginger, citrus and chilli and sticky rice","author":"James Tanner","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First prepare the fish. Using scissors, remove all fins and trim the tail, then use a sharp knife to make a few neat diagonal slashes along each side of the fish. Remove the head of the fish if you wish. Take a bowl and mix together the fish sauce, wine, oyster sauce, half of the ginger, half the chillies, the orange juice, lime zest, and half the garlic chives to make the marinade. In another bowl, rip up the kaffir lime leaves and add the remaining ginger, garlic chives and the white parts of the spring onion. Mix together then pack the mixture inside the belly cavity of the fish. Set two large saucepans on the hob with about 5cm\/2in water in the bottom of each and bring the water to a simmer. Place a bamboo steamer with a lightly oiled deep plate inside on one pan. Place a colander lined with a muslin cloth on top of the other pan. Put the fish on the oiled plate and drizzle over the marinade ingredients. Sprinkle over the Sichuan peppercorns and lemongrass then cover with a lid and steam gently for around 20 minutes or until the fish is just cooked through. Meanwhile, take the soaked, rinsed rice and put it into the muslin-lined colander. Cover with a lid and cook for 20-30 minutes or until the rice is just tender. Halfway through cooking, stir the rice with a fork.  Check the steamers as you cook the rice and fish and top up with a little boiling water as required. While the fish and rice are steaming, place the sugar in a small pan, cover with about a cup of water and bring to a boil. Pour the syrup over the lime segments and set aside. Check the fish is just cooked through by sliding a skewer or chopstick into the fleshy part of the back of the fish. Carefully remove the whole fish and arrange on serving platter. Pour over the cooking juices and scatter over sliced green parts of the spring onions, the sweet and sour lime segments, coriander cress and sesame seeds. Finish with a drizzle of sesame oil and serve the rice alongside. ","ingredients":" 2 x 600g\/1lb 5oz whole sea bream, scaled, gutted and gills removed,  1 tbsp fish sauce,  2 tbsp shaoxing rice wine,  1 tbsp oyster sauce,  1 tbsp fresh ginger, grated,  2 red chillies, sliced,  1 orange, juice only ,  2 limes, zested and segmented,  2 tbsp chopped garlic chives, or Asian chives,  6 kaffir lime leaves,  2 spring onions, sliced,  1 tsp ground Sichuan peppercorns,  1 lemongrass stalk, trimmed and finely chopped ,  400g\/14oz sticky Asian rice, soaked for at least three hour, then rinsed,  2 tbsp caster sugar,  1 handful coriander cress,  1 tbsp toasted sesame seeds,  2 tsp sesame oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whole_steamed_sea_bream_67892"}