{"recipe_name":"Whole roasted duck with purple sprouting broccoli, duck-fat potatoes and bordelaise sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6.  For the whole roasted duck, use a small sharp knife to pierce the skin of the duck all over, but be careful not to tear holes in the skin. Season the duck with salt and black pepper and place on a wire rack sat in a roasting tin. Roast for 25 minutes. Remove the duck from the oven and pour any excess fat from the roasting tin into a jug. Reduce the oven temperature to 120C\/250F\/Gas ½.  When the oven reaches 120C\/250F\/Gas ½, return the duck to the oven and cook for a further 1¼ hours - basting with the reserved fat every 20 minutes. Once cooked allow the duck to rest for 30 minutes. For the duck fat potatoes, heat a large frying pan and add the duck fat. Once hot and melted, add the diced potatoes and cook for 6-8 minutes, or until golden-brown and tender. For the bordelaise sauce, heat a medium saucepan and add the butter. Once hot, add the shallot and cook for 2-3 minutes. Add the thyme, bay leaf and peppercorns and cook for a few minutes. Add the red wine and cook until the volume of liquid has reduced by half. Pour in the warm veal jus and reduce by half again. Season with a little sugar, to taste. Pass through a fine sieve and set aside in a warm place until ready to serve. For the purple sprouting broccoli, bring a large pan of salted water to the boil. Add the broccoli and cook for 2-3 minutes. Remove from the water and refresh in ice-cold water. Melt the butter in a large frying pan. Add the broccoli and gently fry for 1-2 minutes. To serve, remove the duck breasts from the roasted duck and cut into pieces. Divide the meat between serving plates. Serve the potatoes and broccoli next to the duck with a spoonful of the sauce. ","ingredients":" 1 whole duck, trimmed and wings removed,  salt and freshly ground black pepper,  2 large potatoes, peeled and diced into 1cm\/½in cubes,  100g\/3½oz duck fat (trimmed from the whole duck),  50g\/1¾oz unsalted butter,  1 shallot, finely chopped,  2 sprigs thyme, leaves picked,  1 bay leaf,  5 black peppercorns,  200ml\/7fl oz red wine,  300ml\/10½fl oz veal jus, warmed (available from some large supermarkets),  pinch sugar,  400g\/14oz purple sprouting broccoli,  75g\/2½oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whole_roasted_duck_with_88418"}