{"recipe_name":"Whole roasted sea bass on a bed of tomatoes and black oilves, with crab croquettes","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crab croquettes, preheat the oven to 200C\/400F\/Gas 6. Bake the potatoes for one hour, then take them out of the oven and let them stand until cool enough to handle.   Scoop out the warm potato and mash in a bowl. Add the crab meat, parsley and lemon zest. Season with salt and pepper and mix. Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the chopped almonds onto another plate. Shape the crab mixture into small balls or cylinder shapes. Dredge each croquette in the flour, dip in the egg, then roll in the almonds until completely coated. Leave to chill in the fridge for at least an hour to rest. To cook the sea bass, preheat the oven to 190C\/375F\/Gas 5. Place the sliced tomatoes, olives and garlic in the bottom of a baking tray and drizzle over two tablespoons of the olive oil. Stuff the cavity of the sea bass with the herbs and place the fish on top of the tomatoes and olives. Drizzle over the remaining olive oil and place some aluminium foil over the fish. Bake in the oven for about 20 minutes, until cooked through, depending on the size of your sea bass. Remove the foil for the last 10 minutes. To cook the crab croquettes, heat a deep, heavy-bottomed saucepan half-filled with sunflower oil, or heat a deep-fat fryer to 160C\/325F. Carefully lower the croquettes into the hot oil, in batches if necessary, and fry for 2-3 minutes, or until golden-brown and hot inside. Remove the croquettes from the oil using a slotted spoon and set aside to drain on kitchen paper. Keep warm.  To make the salad, heat a griddle pan on a high heat and drizzle one tablespoon of oil over the onion wedges. Place on the griddle for 2-3 minutes on each side until bar marks appear. Place the frisée leaves and herbs in a large serving bowl and add the onion wedges. In a small bowl whisk the remaining oil with the lemon juice. Pour the dressing over the salad just before serving. To serve, place a section of the sea bass on each serving plate with the tomatoes and olives, croquettes and salad. ","ingredients":" 2 large baking potatoes,  75g\/2½oz white crab meat,  25g\/1oz brown crab meat,  1 tbsp finely chopped parsley,  ½ lemon, zest only,  salt and pepper,  50g\/1¾oz plain flour,  2 free-range eggs, beaten,  100g\/3½oz flaked almonds, finely chopped,  sunflower oil, for deep-fat frying,  1kg\/2lb 4oz heritage tomatoes, sliced,  100g\/3½oz pitted black olives,  6 garlic cloves, skin on, smashed,  4 tbsp olive oil,  1 whole wild sea bass, gutted and scaled, skin scored,  2 tbsp chopped dill,  2 tbsp chopped marjoram,  2 tbsp chopped chervil,  1 head frisée lettuce,  4 tbsp chopped parsley,  2 tbsp chives, cut into 1cm\/½in lengths,  4 tbsp olive oil,  1 red onion, cut into thin wedges, root end left on,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/whole_roasted_seabass_on_29102"}