{"recipe_name":"Wild boar loin and sausage parcel, sour winter slaw and poached quince","author":"Kuba Winkowski","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sour winter slaw base, place all ingredients in a bowl and mix well. Bash everything with the end of a rolling pin till bruised and juice is released. Put the mixture into a sterilised 2 litre preserving jar, press it a little and top up with cooled water to cover. (Make sure there is some space to the top of the jar, but vegetables are fully covered.) Place jar on a tray or deep plate and leave in warm place for 3 days. (in the first 24 hours some juice may come up through the lid). After 3 days put in the fridge or a cold larder. The slaw is ready to eat. If you like it to be more sour leave it out for up to a week.   To finish the slaw, combine all the ingredients for the slaw mix together with the base just before serving. For the wild boar and sausage parcel, marinate the wild boar loin in all the ingredients for 2 to 4 hours in the fridge. When marinated quickly seal the loin on all sides, by cooking in a frying pan of hot oil.  Add the marinade and heat to reduce in volume to a sticky glaze. (Take care as the alcohol may catch fire.) Cool and set aside in the fridge.  For the sausage meat, first cook the mushrooms. Heat the lardo in a frying pan until melted then add the mushrooms. Fry quickly, season with lemon juice, salt and pepper. Set aside two thirds of the mushrooms and warm up before serving. Chop the rest of the cooked mushrooms and add them to the wild boar sausage meat, egg and marjoram and mix well to combine. To make the parcel, on cling film flatten the sausage meat into an even rectangle the width of the loin and long enough to wrap around the loin. Place the loin on top of the sausage meat and wrap the sausage meat around it. Roll and shape it into a smooth even sausage, wrapped in cling film. Chill in the fridge to set. When cold place sage leaves in a line on top of the roll. Wrap in pork caul, to create a nice tight parcel (you can use streaky bacon instead). To cook the parcel, preheat the oven to 180C\/160C Fan\/Gas 4.   Heat the vegetable oil in an ovenproof frying pan big enough to hold the parcel. Place the parcel in the pan with the sage leaves down and quickly seal all over until golden-brown. Transfer the pan to the oven and cook for 15 minutes. Take out and rest in a warm place for 10 minutes (this is very important). For the poached quince, place all ingredients except the quince in a pan. Add 500ml\/18fl oz of water and bring to the boil. Add the quince and simmer for about 15 minutes until soft, but not mushy. Then strain, reserving the cooking liquid. Take half the quince pieces and put in a blender. Add enough cooking liquid to cover and blend to a smooth, thick purée (add some more cooking liquid if necessary) Toss the remaining quince pieces in caster sugar and cook in a hot frying pan until caramelised. To serve, pour the warm purée onto a serving plate and arrange the caramelised quince pieces around the plate. Carve the wild boar parcel into 1cm\/½in thick slices, and season lightly with sea salt. Arrange 3 slices per person. Add a high pile of sour winter slaw, scatter around the reheated wild mushrooms, sprinkle with chopped parsley and spring onions.  ","ingredients":" 450g\/1lb white cabbage, shredded,  200g\/7oz red cabbage, shredded,  4 carrots, coarsely grated,  2 candy beetroot, coarsely grated ,  2 yellow beetroot, coarsely grated,  1 quince, coarsely grated,  4 tsp salt ,  1 bay leaf,  5 all spice berries,  5g caraway seeds,  300ml\/10fl oz boiled and cooled water,  300g\/10½oz sour slaw base (from above),  3 tbsp olive oil,  1 pinch freshly ground black pepper,  2 pinch salt,  1 pinch caster sugar,  10g chopped parsley, plus extra for garnish,  2 spring onions sliced, green only, plus extra for garnish,  300g\/10½oz wild boar loin, cleaned form fat and sinews,  40ml\/1½fl oz  quince liquor,  5g salt,  1 pinch freshly ground black pepper,  10g wholegrain mustard,  100g smoked lardo, diced,  300g mixed wild mushrooms,  1 tsp lemon juice,  salt and freshly ground black pepper,  350g\/12oz wild boar sausages (about 6),  3g chopped fresh marjoram, (or 1g dried),  1 egg, beaten,  5 sage leaves,  100g\/3½oz pork caul, soaked in salted water till white and dried on a cloth (alternatively use streaky bacon),  vegetable oil, for frying,  400ml\/14fl oz white wine,  100ml\/3½fl oz quince liquor,  150g\/5½oz caster sugar, plus extra for the quince peices,  3 tbsp lemon juice,  1 vanilla pod, cut and seeds scraped out,  2 star anise,  3 green cardamom pods,  6 all spice berries,  10 juniper berries, lightly crushed,  1 cinnamon stick,  2 bay leaves,  2 cloves,  5 strips orange zest,  3 quinces, flesh cut into chunks, cores discarded","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wild_boar_loin_and_87384"}