{"recipe_name":"Wild sea bass en papillotte","author":"Kim Woodward","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6.  Lay the sea vegetables, clementine peels, diced pumpkin, fresh dill and sea bass fillets in the middle of a large piece of parchment paper.  Fold over the parchment paper to seal, but leaving a 5cm\/2in gap at one side. Pour the fish stock through the gap and seal, using a stapler if you have one, or by folding over as before.  Heat some olive oil in an ovenproof frying pan and place the bag in the pan. When the bag starts to rise (about a minute), transfer the pan to the oven for 4-5 minutes. For the hollandaise, put the clementine juice, white wine vinegar and white wine in a pan and place over a medium heat. Bring to a boil and cook until the volume of liquid has reduced by about two thirds in volume.  Put the egg yolks in a heatproof bowl and add the reduction. Place the bowl over a pan of boiling water and start to whisk. Whisk consistently, as the eggs start to turn light, fluffy and pale in colour slowly start adding the clarified butter in a thin stream until incorporated. Add the clementine segments, a dash of Tabasco and chopped fresh dill. Heat a lidded saucepan over a very high heat. Once the pan is really hot and smoky, add the mussels, shallot, parsley stalks and white wine.  Cover with the lid and allow to steam for 2 minutes, or until the mussels have opened (discard any mussels that remain closed).  Open the fish parcel and lift all contents into the middle of a large serving plate. Scatter the mussels around the serving plate and serve the hollandaise on the side.  ","ingredients":" 50g\/1¾oz sea beets (available in some supermarkets or online),  50g\/1¾oz sea aster (available online),  20g\/¾oz sea purslane (available online),  clementine peels (see below),  300g\/10½oz pumpkin, peeled and diced,  20g\/¾oz fresh dill,  2 x 140g\/5oz wild sea bass, filleted,  150ml\/5fl oz fish stock,  olive oil, for frying,  100g\/3½oz mussels, preferably Shetland mussels, scrubbed and debearded (discard any mussels with broken shells and any that refuse to close when tapped),  1 shallot, finely chopped,  parsley stalks,  100ml\/3½fl oz white wine ,  3 clementines, segments and juice, peel reserved,  100ml\/3½fl oz white wine vinegar,  100ml\/\/3½fl oz white wine,  3 free-range egg yolks,  150g\/5½oz clarified butter,  splash Tabasco,  few sprigs fresh dill, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wild_sea_bass_en_83887"}