{"recipe_name":"Wild salmon with English asparagus and hollandaise sauce","author":"James Martin","programme":"James Martin's Food Map of Britain","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 20","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/wild_salmon_with_english_40568_16x9.jpg","method":"Tie the celery, parsley, tarragon and bay leaves together to make a bouquet garni.  Half fill a large fish kettle with cold water, add the bouquet garni, leek, fennel, onions, carrots, asparagus trimmings, salt, peppercorns, white wine vinegar and lemons. Place the salmon on top and add more cold water to cover, if needed. Cover with a lid and bring to the boil, then remove from the heat. In a large pan of boiling water cook the asparagus spears for 1-2 minutes, or until tender. Drain and plunge into ice-cold water to refresh. To make the sauce, place the egg yolks in a bowl set over a pan of simmering water (take care not to let the bowl touch the water) and beat until pale and thickened. Slowly add the warm butter in a thin steady stream, whisking all the time until you have a smooth emulsion. Beat in the white wine vinegar and season with salt and pepper. To serve, scoop a piece of fish onto each plate along with some blanched asparagus and a spoonful of sauce. ","ingredients":" 2 sticks of celery,  small bunch parsley,  small bunch tarragon,  2 bay leaves,  1 leek, sliced,  1 fennel bulb, sliced,  2 onions, quartered,  6 carrots, peeled and sliced,  2kg\/4lb 8oz asparagus, trimmings reserved ,  2 tbsp salt,  1 tbsp black peppercorns,  100ml\/3½oz white wine vinegar,  2 lemons, chopped in half ,  1x 3.5kg\/8lb wild salmon, gutted and scaled,  6 free-range egg yolks,  1kg\/2lb 4oz clarified butter, kept warm,  1 tbsp white wine vinegar,  salt and black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wild_salmon_with_english_40568"}