{"recipe_name":"Wild strawberries and yuzu sorbet","author":"Jason Atherton","programme":"Spring Kitchen with Tom Kerridge","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the wild strawberry and yuzu sorbet, place in the strawberries in a blender and blend until smooth. Pass through a sieve. Place the sugar and 150ml\/5½fl oz water in a sauce pan and boil until the sugar is dissolved and you have a syrup.  Add the strawberry purée and yuzu juice to the syrup. Place in an ice cream maker and churn following the manufacturer’s instructions until frozen. For the meringue, preheat the oven to 80C\/150F\/Gas ¼, or the lowest possible setting. Combine the ingredients in a large freestanding mixer and whisk until stiff peaks form when the whisk is removed. Spoon into a piping bag and pipe small dots onto a silicone mat or a baking tray lined with baking parchment. Bake for 2-3 hours, or until firm.  Pound the basil leaves in a pestle and mortar. When you remove the meringues from the over, stir them through the crushed basil and set aside. For the strawberry jam, combine all ingredients in a thermo mix or blender and pulse until fully incorporated.  Strain through a sieve and pour into sterilized jars. For the basil soup, place the sugar and 350ml\/12fl oz water in a large saucepan and bring to the boil. Squeeze the gelatine to remove any excess water, then add to the pan. Set aside to cool. Place the basil leaves and sugar in a blender and pulse to form a smooth paste. Add the lemon juice and the gelatine mixture, blend again then pass through a fine sieve. For the gariguettes and fraise des bois, dress the gariguettes with a drizzle of vanilla syrup and mix with the fraise des bois. To serve, arrange the dressed strawberries in small bowls, place five mini meringues around the strawberries, a few dabs of strawberry jam and sprinkle a few micro basil leaves over the top. Place a scoop of sorbet on top of the strawberries and grate some fresh yuzu or lime zest over the top.  Drizzle with some vanilla syrup and scatter some marshmallows over and serve. Finally, at the table, poor some chilled basil soup into the bowls. ","ingredients":" 1kg\/2lb 4oz wild strawberries, hulled,  60g\/2½oz yuzu juice,  150g\/5½oz sugar,  100g\/3½oz pasteurised egg white,  100g\/3½oz caster sugar,  100g\/3½oz icing sugar,  250g\/9oz strawberry purée,  50g\/1¾oz vanilla syrup,  1 spoon Gelcrem Fred ,  70g\/2½oz sugar,  1½ leaves gelatine, soaked in iced water for 10 minutes,  20g\/½oz basil leaves,  50g\/½oz sugar,  50g\/½oz lemon juice,  160g\/5⅔oz gariguette strawberries, hulled and cut into quarters ,  100ml\/3½fl oz vanilla syrup (made from 250g\/9oz sugar, 250ml\/9fl oz water and the seeds from a vanilla pod),  20 fraise des bois alpine strawberries, hulled,  micro basil leaves, for garnish,  1 lime or yuzu, zest only,  marshmallows, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wild_strawberries_and_62191"}