{"recipe_name":"Wild mushroom and sweetcorn biryani parcels","author":"Atul Kochhar","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the parboiled rice, add the rice, bay leaf, cardamom and cloves to a pan of boiling, salted water. Cook the rice until it is almost tender, then drain well and set aside. For the biryani, heat the oil and butter in a frying pan. When the butter is foaming, add the cumin, cardamom and bay leaf and fry for 1-2 minutes, or until fragrant and beginning to pop. (CAUTION: Keep the pan away from your eyes and face - the seeds may pop.) Add the chopped garlic and fry for 1-2 minutes, or until pale golden-brown.  Add the chopped onion and fry for 2-3 minutes, or until golden-brown. Add all of the mushrooms and the sweetcorn kernels and continue to fry, stirring well, for a further 3-4 minutes, or until softened. Add the ground spices and stir well to coat the vegetables. Continue to fry for 1-2 minutes, or until fragrant, then add the white truffle paste (if using), tomato purée and cream and stir well to combine. Add the parboiled rice and chopped coriander and season, to taste, with salt and freshly ground black pepper. Brush one side of each sheet of filo pastry all over with some of the melted butter.  Place one sheet of filo pastry on top of another to create two layers of pastry, then spoon a quarter of the biryani mixture into the centre of the pastry.  Fold the sides over the rice filling, then roll the pastry into a parcel. Brush all over with more melted butter. Repeat the process with the remaining filo pastry and biryani mixture. Place the biryani parcels and the coriander cress onto a baking tray and bake in the oven for 12-15 minutes, or until the pastry is crisp and golden-brown and the coriander cress has dried.  Meanwhile, for the mushrooms, heat the oil and butter in a pan over a medium heat. When the butter is foaming, add the crushed garlic, coriander seeds and chilli flakes and fry for 1-2 minutes, or until the garlic has softened. Add the toasted almonds, then add the mushrooms and stir well. Continue to fry for 1-2 minutes, or until the mushrooms have softened, then drizzle over the lemon juice. Season, to taste, with salt and freshly ground black pepper. For the raita, blend all of the raita ingredients together in a food processor until well combined, then chill in the fridge until needed. To serve, spoon the mushroom and almond mixture into the centre of each of four serving plates. Cut the biryani parcels in half and place one biryani parcel (two halves) on top of each serving. Sprinkle over the dried coriander cress and truffle shavings, if using. Serve the raita alongside. ","ingredients":" 400g\/14oz low GI rice (available from health food shops and some supermarkets),  1 bay leaf,  2 green cardamom pods,  2 cloves,  1 tbsp vegetable oil,  1 tbsp butter,  1 tsp cumin seeds,  2 green cardamom pods, lightly crushed,  1 bay leaf,  2 garlic cloves, peeled, chopped,  200g\/7oz onions, peeled, finely chopped ,  2 large Portobello mushrooms, wiped clean, chopped,  110g\/4oz mixed wild mushrooms, wiped clean, roughly chopped,  75g\/3oz sweetcorn kernels,  1 tsp ground coriander,  ½ tsp ground cumin,  ½ tsp red chilli powder,  ½ tsp garam masala ,  1 tbsp white truffle paste (optional),  ½ tbsp tomato purée,  2 tbsp single cream,  2 tbsp chopped fresh coriander leaves,  salt and freshly ground black pepper,  8 large sheets ready-made filo pastry,  110g\/4oz butter, melted,  1 punnet coriander cress,  ½ tbsp butter,  ½ tbsp vegetable oil,  1 garlic clove, crushed to a paste with the edge of a knife,  ½ tsp crushed coriander seeds,  ¼ tsp dried chilli flakes,  50g\/2oz almonds, lightly toasted, cut into halves,  110g\/4oz mixed wild mushrooms, wiped clean, sliced,  1 tbsp freshly squeezed lemon juice,  salt and freshly ground black pepper,  1 x 20g\/¾oz punnet coriander cress (optional),  300g\/11oz Greek-style yoghurt,  1 tsp toasted cumin seeds, ground to a powder,  110g\/4oz fresh blackberries, blended to purée,  black truffle shavings (optional), to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wildmushroomandsweet_92214"}