{"recipe_name":"Wild rabbit and morel stew with olive oil mash","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the wild rabbit and morel stew, sprinkle the flour into a bowl and season, to taste, with salt and freshly ground black pepper. Dredge the rabbit pieces in the seasoned flour until completely coated. Heat the oil in a large casserole over a medium heat. Add the coated rabbit pieces, in batches if necessary, and fry for 3-4 minutes on each side, or until browned on all sides. Remove from the pan and set aside on a warm plate. Add the bacon to the casserole the rabbit was cooked in and fry for 1-2 minutes, or until the fat is released.  Add the onion, garlic and thyme leaves and fry, stirring well, for 2-3 minutes, or until the bacon is crisp and golden-brown and the vegetables have softened. Add the morels, strained soaking liquid and the red wine to the casserole and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until the volume of liquid has reduced by half, about 8-10 minutes.  When the liquid has reduced, add the beef stock and return the mixture to the boil. Return the browned rabbit pieces to the casserole and season, to taste, with salt and freshly ground black pepper.  Bring the contents of the casserole to a simmer, then cover the pan with a lid and simmer gently for 1-1½ hours, or until the rabbit meat is tender and the cooking liquid has thickened slightly. Meanwhile, for the olive oil mash, boil the potatoes in a large pan of salted water, for 10-15 minutes, or until tender. Drain well. Return the potatoes to the pan and heat over a low heat for 10-15 seconds to drive off any excess moisture. Mash the potatoes well using a potato masher or ricer, then add the olive oil and butter and mash again until smooth and well combined. Season, to taste, with salt and freshly ground black pepper. To serve, place a spoonful of the olive oil mash into the centre of each of four serving dishes. Place two pieces of rabbit on top of each portion of olive oil mash. Spoon over the stew. Sprinkle over the flatleaf parsley. ","ingredients":" 40g\/1½oz plain flour,  salt and freshly ground black pepper,  1 wild rabbit, cut into eight serving pieces,  2 tbsp vegetable oil,  3 rashers smoked streaky bacon, cut into lardons,  1 onion, peeled, roughly chopped,  2 garlic cloves, peeled, finely chopped,  2 sprigs fresh thyme, leaves only,  40g\/1½oz dried morel mushrooms, soaked in 150ml\/5fl oz warm water for at least 30 minutes,  200ml\/7fl oz red wine,  350ml\/12fl oz beef stock,  1kg\/2lb 2oz floury potatoes, such as King Edward or Maris Piper, peeled, cut into equal-sized pieces,  75-110ml\/3-4fl oz extra virgin olive oil,  50g\/2oz butter,  salt and freshly ground black pepper ,  4 tbsp chopped fresh flatleaf parsley, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wildrabbitandmorelst_92455"}