{"recipe_name":"Wild salmon and crushed peas with marjoram and vine tomato sauce","author":"Jason Atherton","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a frying pan until hot and add the olive oil. Place the salmon fillets in the pan, skin-side down. Cook the salmon for three minutes, then turn over and cook for a further three minutes until cooked all the way through. Remove from the heat and rest in a warm place. For the crushed peas with marjoram, bring a saucepan of water to the boil and add the podded peas. Cook the peas for 1-2 minutes, then drain and transfer to a bowl of iced water to cool. When the peas are cool, drain them. Heat a small frying pan until hot. Add the peas to the pan along with the marjoram and butter and heat through, crushing lightly with a wooden spoon. Keep warm. While the fish and peas are cooking, make the vine tomato sauce. For the vine tomato sauce, whisk the Dijon mustard, white wine vinegar and extra virgin olive oil together in a bowl and season with salt and freshly ground black pepper. Transfer the mustard mixture, cherry tomatoes and sugar to a blender or food processor and blend until puréed. Pour the puréed mixture through a sieve into a bowl. Add the Cabernet red wine vinegar and stir well. Place a chef's ring in the middle of an individual serving plate and place half of the peas inside, pressing well to the edges. Remove the ring. Repeat with the remaining peas on another plate. Place a salmon fillet on top of each of the pea circles and spoon the sauce around. Finish with a sprinkle of seaweed salt and a sprig of basil each. Serve at once. ","ingredients":" 1 tbsp olive oil,  2 x 150g\/5oz wild salmon fillets,  500g\/1lb 2oz fresh peas, pods removed,  1 tbsp fresh marjoram, finely chopped ,  2 tbsp butter,  1 tsp Dijon mustard,  1 tbsp white wine vinegar,  3 tbsp extra virgin olive oil,  salt and freshly ground black pepper ,  200g\/7oz ripe baby cherry tomatoes,  ½ tsp caster sugar,  1 tsp Cabernet red wine vinegar ,  seaweed salt (equal parts of sea salt and dried nori ground together in a mortar and pestle),  2 sprigs fresh basil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wildsalmonandcrushed_86204"}