{"recipe_name":"Wild salmon trout with asparagus, peas and a citrus butter vinaigrette","author":"Paul Rankin","programme":"Great British Menu","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Check the fish for bones, removing any you find, and carefully scale the skin side with a blunt serrated knife. Rinse and pat dry. Cut into four portions and carefully make four or five shallow incisions in the skin of each portion using a very sharp knife. Brush liberally with light olive oil set aside.  To make the vinaigrette, boil the shallots with the white wine in a small saucepan until reduced by half. Add the lemon zest and allow to infuse while you clarify the butter. Melt the butter in another saucepan and bring to a gentle boil for 3-4 minutes. Remove from the heat and allow to settle, then skim off any foam or scum from the top. Pour the clear butter into the shallot reduction, leaving any milky residue behind in the pan (discard the milky residue). Season the vinaigrette with salt and freshly ground black pepper and set aside. Warm through for serving. Season the salmon trout fillets with salt and freshly ground white pepper and fry skin-side down in a hot pan. Cook until the skin is nicely crisp and the fish is just cooked. This should take 5-8 minutes, depending on the thickness of the fillets. While the fish is cooking, cook the asparagus, peas and leeks in a pan of boiling salted water until just tender. Drain thoroughly.  To serve, scatter the pea shoots (if using) in with the hot vegetables and spoon into the centre of each warmed plate. Spoon over the warm butter vinaigrette, and top with the fillets of fish. ","ingredients":" 1 large fillet of wild salmon trout, about 500g\/1lb 2oz,  2 tbsp light olive oil,  salt and freshly ground white pepper,  8 asparagus spears, peeled and chopped into 1cm\/½in pieces,  125g\/4½oz shelled fresh peas,  1 leek, sliced into 1cm\/½in slices,  handful pea shoots (optional),  salt and freshly ground white pepper,  2 tbsp finely chopped shallots,  150ml\/5½fl oz dry white wine,  1 tsp grated lemon zest,  150g\/5½oz unsalted butter,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wildsalmontroutwitha_81961"}