{"recipe_name":"Witchill potatoes, caramelised onion purée, buffalo milk and turkey prosciutto","author":"David Everitt-Matthias","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the brine, combine all the ingredients, except the turkey, in a large saucepan with 1 litre\/1¾ pints water and bring to the boil. Cook for five minutes. Remove from the heat and leave to cool. Place the turkey in the brine, cover and leave in the brine in the fridge for 4-5 days. For the turkey coating, toast all the ingredients, apart from the sea salt, in a dry pan until the seeds start popping and the mixture smells aromatic. Remove from the heat and leave to cool, then grind in a blender, or in spice mill or clean coffee grinder. Mix with the salt and keep in a sealed jar until needed. For the turkey prosciutto, drain the turkey, rinse briefly and dry with a clean cloth. Roll the turkey in the spiced coating mixture, then roll it in a piece of muslin. Tie both ends with string, making a loop at one end. Hang up and leave to air-dry for 1-2 weeks in a cool, airy place. When needed, remove the cloth and slice as finely as possible. You will need 4-5 slices per portion. For the pickled green elderberries, put the salt into 350ml\/12fl oz water in a medium saucepan and bring to the boil to dissolve the salt. Place to one side and cool. Check the elderberries for any bugs, then put the berries in a sterilised container that has a tight fitting lid. Pour in the brine. Cover the container and keep in a cool place or the fridge for 2-3 weeks. Keep an eye on the berries, you don’t want them to shrivel. If they start to look a bit too wrinkled, drain and quickly rinse under cold running water. Once the salting period is over, drain the brine from the berries and put them into a clean, sterilised, warm jar. Bring the vinegar to the boil, then pour over the berries to cover them completely. Immediately cover with a tight-fitting lid and leave to cool. Keep in the refrigerator. (They can be stored for 6- 8 months.) For the salted wild garlic buds, put the salt into 200ml\/7fl oz water in a small saucepan and bring to the boil. Remove from the heat and leave to cool. Make sure the garlic buds are free of stalks, then rinse thoroughly. Place them in a sterilised jar, pour over the brine solution and cover. Keep in a cool, dark place for 2-3 weeks before using. If you want to keep them longer than this, drain the buds, place in another sterilised jar and cover with olive oil. Keep in the fridge until needed. For the leek ash, set a large pan of salted water on the heat and bring up to the boil. Meanwhile, cut the leeks in half lengthways, separate the layers and wash well, removing any grit. Drain. Blanch the leeks in the boiling water, then drain and refresh. Place on a cloth to dry. Spread out the batch of leeks, in a single layer, on a baking tray and grill them until black and dry. Repeat until all the leek layers have been grilled. Place the blackened, dried leeks in a blender, or a clean spice mill or coffee grinder, and blend to a powder. Pass the powder through a fine sieve, to end up with a uniform fine powder with no big bits in it. Store in an airtight container until needed (up to one month).  For the buffalo milk jelly, place all the ingredients in a medium-sized saucepan and whisk together, then leave to sit for five minutes. Heat up the mixture, whisking occasionally, and boil for two minutes. Season. Strain through a fine chinois into a stainless-steel tray, about 15cmx3cmx½cm. Leave to cool, then cover and leave in the fridge for about four hours, until set. Remove from the fridge 30 minutes before needed.  For the Witchill potatoes, put the potatoes in a large saucepan, just cover with water and add some salt. Bring up to the boil, then simmer for 10-15 minutes, or until tender. Drain and leave to cool. When needed, cut each potato into four even slices. Warm the butter in a medium pan, add the potatoes and turn around in the butter, then add the leek ash. Turn the potatoes in the ash and butter until coated. Season and keep warm until needed. For the caramelised onion purée, heat the duck fat in a large saucepan, add the onions and stir well, then cover with a lid. Cook for about five minutes, stirring occasionally, until the onions have collapsed and become translucent. Remove the lid and cook until the onions are a lovely deep golden-brown colour, stirring well to prevent them from catching. Transfer the onions to a blender and blend until smooth. Add the butter and blend again. Remove from the blender to a small saucepan and season. Keep warm until needed. For the spring onions, heat a large frying pan. While it is getting hot, toss the spring onions in the oil and seasoning. Place them in the pan and keep turning until wilted, golden-brown and cooked.  To serve, make a smear of onion purée down the centre of each plate. Sprinkle with green elderberries and garlic buds. Using a teaspoon, place four scoops of buffalo milk jelly on each place, then add the spring onions. Now, add the potatoes, four slices per plate. Arrange 4-5 slices of turkey prosciutto on each plate, bending them a little. Finally, add the chickweed and dust a band of leek ash over the centre of the plate. ","ingredients":" 1kg\/2lb 4oz red wine,  225g\/8oz salt,  1 head garlic, cut across in half,  150g\/5½oz roughly chopped carrots,  200g\/7oz roughly chopped onions,  2 sprigs thyme,  2 bay leaves,  1 sprig rosemary,  20 black peppercorns,  400g\/14oz piece skinless turkey breast, sinew-free,  6g black peppercorns,  8g coriander seeds,  8g mustard seeds,  2g cumin seeds,  5g fennel seeds,  8g flaked sea salt,  75g\/2½oz salt,  500g\/1lb 2oz green elderberries,  400ml\/14fl oz white balsamic vinegar,  40g\/1½oz salt,  250g\/9oz wild garlic buds,  3 leeks,  450g\/1lb buffalo milk,  80g\/3oz double cream,  50g\/1¾oz dried buffalo milk powder (available from specialist suppliers online),  1.8g agar-agar,  6 Witchill potatoes, about 40g\/1½oz each, scrubbed,  50g\/1¾oz unsalted butter,  4g leek ash (from above),  50g\/1¾oz duck fat,  600g\/1lb 5oz onions, finely sliced,  30g\/1oz unsalted butter,  12 pencil-thin spring onions, trimmed,  1 tsp olive oil,  salt and freshly ground black pepper,  10g\/¼oz pickled green elderberries (from above),  10g\/¼oz salted garlic buds (from above),  chickweed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/witchill_potatoes_56219"}