{"recipe_name":"Wreck fish with beurre noisette buckwheat, crayfish tails and chargrilled baby fennel","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crayfish bisque, heat the oil and butter in a large frying pan and gently fry the shallots and fennel for 2-3 minutes. Add the tomato purée and cook, stirring, for a further minute. Add the crayfish shells and brandy and cook for another minute. Add the fish stock, bay leaves and parsley and bring to a simmer. Cook for 20-25 minutes, or until the volume of liquid has reduced by a third. Remove from the heat and allow to cool slightly. Pour the mixture into a food processor and blend to a fine purée. Pass the purée through a sieve into a clean saucepan and season with salt and pepper. Cook the buckwheat according to the packet instructions. Heat a large sauté pan and add the butter, once it has turned brown add the cooked buckwheat and sauté for 2 minutes until coated in the butter and hot. Blanch the baby fennel in boiling water for 2 minutes and refresh in ice cold water. Once cooled pat dry. Do the same with the samphire. Heat a griddle pan. Oil the dry baby fennel and place on the griddle pan. Cook each side for 1-2 minutes, or until char marks appear.  Heat a large pan and add the butter, once hot add the spinach and samphire and cook until the spinach is wilted. For the fish, heat a large frying pan and add the butter. Once hot, add the wreck fish fillets and crayfish tails and cook for 2 minutes on each side. To serve, put some buckwheat on serving plates and top with the samphire and spinach, then the wreck fish and crayfish and spoon the bisque over the top. Garnish with the baby fennel, fennel pollen, and fennel tops. ","ingredients":" 1 tbsp olive oil,  50g\/1¾oz butter,  2 shallots, chopped,  1 fennel bulb, finely chopped,  1 tbsp tomato purée,  500g\/1lb 2oz crayfish shells, taken from the fresh crayfish tails (below),  2 tbsp brandy,  1 litre\/1¾ pints fish stock ,  2 bay leaves,  2 sprigs fresh flatleaf parsley,  salt and freshly ground black pepper,  200g\/7oz buckwheat,  100g\/3½oz unsalted butter,  4 baby fennel bulbs,  100g\/3½oz samphire,  dash olive oil,  55g\/2oz unsalted butter,  100g\/3½oz spinach,  1 tsp fennel pollen (or ground fennel seeds),  4 tbsp chopped fennel tops,  55g\/2oz butter,  2 wreck fish fillets (or sea bass), skin on, pin boned,  6 crayfish tails, blanched ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wreck_fish_with_beurre_16464"}