{"recipe_name":"Yorkshire curd tart","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the filling, heat the milk in a large saucepan over a low heat and bring to a very gentle simmer. Remove from the heat. Pour in the lemon juice and stir twice as the curds form. Set aside to cool for an hour.  Line a sieve with muslin and place over a large bowl. Pour the curds and whey into the sieve and allow to drain in the fridge for at least six hours, preferably overnight.  To make the pastry, put the flour, butter and sugar in a food processor and blend on the pulse setting until the mixture resembles fine breadcrumbs. With the motor running, slowly add the egg and blend until the mixture comes together and begins to form a ball. Remove carefully and shape into a flattened round ready for rolling. Roll the pastry out on a lightly floured surface.  Using the rolling pin, lift the pastry carefully and line the pie dish, pressing down well into the base and sides of the tin. Trim any excess pastry and lightly prick the base of the tart and set aside.  Preheat the oven to 180C\/350F\/Gas 4.  Place a baking tray in the oven to heat. Using an electric whisk, cream the butter and sugar together until light and fluffy. Gradually beat in the egg, a little at a time, beating well between each addition. Stir in the curd cheese, lemon zest, nutmeg and fruit. Mix until well combined. Spoon the curd into the pastry base and spread to the sides. Bake for 30-35 minutes, or until the pastry is golden-brown and the filling sets.  Leave to cool in the tin for at least 30 minutes before serving. Serve at room temperature or chill before cutting. ","ingredients":" 1.2 litres\/2 pints full-fat milk,  4 tbsp lemon juice,  ½ lemon, zest only,  65g\/2½oz butter, softened ,  65g\/2½oz caster sugar,  1 free-range egg, beaten,  ¼ tsp finely grated nutmeg,  50g\/2oz mixed dried fruit ,  175g\/6oz plain flour, plus extra for rolling,  100g\/3½oz cold butter, cubed,  2 tsp caster sugar,  1 free-range egg, beaten","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/yorkshire_curd_tart_23874"}