{"recipe_name":"Wreck fish and crayfish with fennel purée and crayfish bisque","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crayfish bisque, heat the oil and butter in a large frying pan and gently fry the shallots and fennel for 2-3 minutes. Add the tomato purée and cook, stirring, for a further minute. Add the crayfish shells and brandy and cook for another minute. Add the fish stock, bay leaves and parsley and bring to a simmer. Cook for 20-25 minutes, or until the volume of liquid has reduced by a third. Remove from the heat and allow to cool slightly. Pour the mixture into a food processor and blend to a fine purée. Pass the purée through a sieve into a clean saucepan and season, to taste, with salt and freshly ground black pepper. For the fennel puree, place the chopped fennel in a large frying pan and cover with cold water. Add a generous sprinkling of salt, place over a medium heat and bring to the boil. Once boiling, reduce the heat slightly and simmer until very tender.  Drain in a colander and place the fennel in a blender. Add the butter, olive oil and crème fraîche and purée until smooth. Season with salt and black pepper. For the fried wreck and crayfish, heat a large frying pan and add the butter. Once hot, add the wreck fish fillets and crayfish tails and cook for two minutes on each side. To serve, put some purée on serving plates and top with the fried wreck fish and crayfish and spoon the bisque over the top. Garnish with the fennel pollen, sea purslane and beets. ","ingredients":" 1 tbsp olive oil,  50g\/1¾oz butter,  2 shallots, chopped,  1 fennel bulb, finely chopped,  1 tbsp tomato purée,  500g\/1lb 2oz crayfish shells, taken from the fresh crayfish tails (below),  2 tbsp brandy,  1 litre\/1¾ pints fish stock ,  2 bay leaves,  2 sprigs fresh flatleaf parsley,  salt and freshly ground black pepper,  3-4 fennel bulbs, chopped,  40g\/1½oz unsalted butter ,  2 tbsp mild-tasting extra-virgin olive oil ,  3 tbsp crème fraîche,  55g\/2oz butter,  6 crayfish tails, blanched ,  2 wreck fish fillets (or sea bass), skin on, pin boned,  1 tsp fennel pollen (or ground fennel seeds),  50g\/1¾oz sea purslane,  50g\/1¾oz sea beets","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/wreck_fish_and_crayfish_51233"}