{"recipe_name":"Yorkshire tea cake","author":"Silvena Rowe","programme":"Country Show Cook Off","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the tea bags in a bowl and add 200ml\/7fl oz hot water, the brandy, rosewater, honey and dried fruit. Cover and soak overnight, or until the fruit is plump. (If you are short of time, you can cheat a little by warming the ingredients gently to speed up the process).   Preheat the oven to 180C\/350F\/Gas 4 and line a 450g\/1lb loaf tin with baking paper. When the fruit is plump, strain it and discard the liquid and tea bags.  Sift the flour, baking powder, cinnamon and nutmeg into a large bowl. Add the marmalade and brown sugar. Stir in the egg and melted butter and combine to form a soft dough.  Add the fruit and thoroughly mix together. Transfer the mixture to the prepared loaf tin and bake for 50-60 minutes, or until a wooden skewer comes out clean. Remove from the oven and leave in the tin for 10 minutes. Turn out and cool on wire rack. To decorate the cake, brush the cake with marmalade. Cut the marzipan fruits in half and place on top of the cake. Use the gold leaf to gilt the marzipan fruits. ","ingredients":" 2 good-quality strong, black tea bags,  4 tbsp brandy ,  1 tsp rosewater ,  1 tbsp clear honey ,  115g\/4oz sultanas,  75g\/2½oz raisins,  50g\/1¾oz currants,  180g\/6½oz strong bread flour ,  1½ tsp baking powder,  ½ tsp ground cinnamon ,  ½ tsp ground nutmeg,  2 tbsp medium-cut orange marmalade ,  120g\/4oz soft brown sugar,  1 large free-range egg, at room temperature, lightly beaten,  30g\/1oz unsalted butter, melted and cooled until tepid,  2 tbsp marmalade,  marzipan fruits (optional) ,  gold leaf (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/yorkshire_tea_cake_98065"}