{"recipe_name":"Yusheng smoked salmon ‘prosperity’ salad","author":"Ching-He Huang","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2-3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a small pan, add all the ingredients for the plum sauce with 200ml\/7fl oz water. Cook until the liquid has turned syrupy and pink. Sieve the liquid and set aside to cool. Stir in the lime juice and store in the fridge until ready to serve. For the salad, cook the mung bean noodles according to the packet instructions. Drain, dress with the toasted sesame oil and keep chilled in the fridge.  Prepare all the other salad ingredients and keep them chilled in the fridge until ready to serve.  To assemble the dish, divide the salad ingredients between serving plates, separated out, not mixed. Layer the smoked salmon slices to resemble a rose decoration in the centre.  Before serving, drizzle the plum sauce over the top and sprinkle with peanuts. Let everyone toss the ingredients as high as possible with chopsticks, without it falling off the plate, saying aloud auspicious phrases for prosperity! Break over the wonton wrappers and serve immediately. ","ingredients":" 1 stick cinnamon ,  1 star anise,  2 ripe plums, stones removed, quartered,  2 tbsp demerara sugar ,  2 limes, juice only,  50g\/1¾oz mung bean noodles ,  1 tsp toasted sesame oil ,  4 pickled beetroots, grated ,  1 medium carrot, spiralized into noodles,  1 cucumber, spiralized into noodles ,  1 daikon or white turnip, spiralized into noodles,  1 pomelo (or 1 pink grapefruit), peeled and separated into segments,  2 spring onions, sliced into long strips, dipped in ice water for spring onion curls (optional) ,  4 slices smoked salmon,  1 handful peanuts, toasted ,  5 wonton wrappers, deep-fried, seasoned with salt and ground white pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/yusheng_smoked_salmon_03937"}