{"recipe_name":"Yuzu mayonnaise with chicken goujons ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the egg yolks, vinegar and mustard into a food processor. Blend to combine then, with the motor still running, gradually add the oil. Continue blending until all the oil has been added and the mayonnaise has thickened. Season with the yuzu juice, chilli dipping sauce, salt and freshly ground black pepper. Heat a deep-fat fryer to 190C\/375F, or heat 1 litre\/1¾ pints vegetable oil in a deep-sided, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Don't leave unattended).    Set up three bowls, one containing the flour, another the beaten eggs and the third, breadcrumbs. Place a few chicken strips at at time first into the flour, coat them and pat off the excess, then dip them into the egg. Coat thoroughly in egg, then put into the breadcrumbs. Coat thoroughly again. Do this in batches, making sure the chicken is well coated in each. Place a few of the goujons in the fryer and cook for about 2-3 minutes, until crisp and golden-brown. Drain on kitchen paper and repeat until all the goujons are cooked. To serve, pile the chicken goujons on to the plate and finish with a dollop of yuzu mayonnaise. ","ingredients":" 4 free-range eggs, yolks only,  1 tbsp white wine vinegar,  1 tbsp Dijon mustard,  500ml\/18fl oz rapeseed or light olive oil,  1-2 tsp yuzu juice, to taste,  2 tbsp chilli dipping sauce,  salt and freshly ground black pepper,  4 boneless and skinless chicken breasts, cut into strips,  50g\/2oz plain flour,  3 free-range eggs, beaten,  125g\/4½oz fresh fine breadcrumbs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/yuzu_mayonnaise_with_25805"}