{"recipe_name":"Chocolate Swiss roll with brandy buttercream filling","author":null,"programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350 Gas 4. Grease a 23 cm x 33 cm Swiss roll tin and line with baking parchment. To make the sponge: sift the flour, cocoa and salt together and set aside. Sprinkle a large piece of greaseproof paper with caster sugar and set aside. Put the egg whites in a clean bowl and whisk until frothy. Add the cream of tartar and whisk until stiff.  Place the sugar in a bowl and the egg yolks and whisk until pale and thick. Add the almond essence. Using a large metal spoon stir in the reserved flour and cocoa mixture. Finally, lightly fold in the egg whites until well blended - take care not to beat the air out of the mixture.  Spoon the mixture into the Swiss roll tin and level the top. Bake for 15-20 minutes or until sponge-like to the touch. Turn the sponge onto the greaseproof paper dusted with caster sugar. Peel away the baking parchment and roll the sponge with the greaseproof paper inside. Leave to cool. For the buttercream, beat the butter in a mixing bowl until smooth and then gradually beat in the icing sugar and cocoa powder. Add the brandy and mix well. Once the sponge has cooled unroll it carefully and spread it with half the filling and roll it up again - without the greaseproof paper this time.  Spread the rest of the filling over the cake to cover it. Score it with a fork to resemble a log and dust with cocoa powder. Decorate with a sprig of holly. ","ingredients":" 30g\/1oz plain flour,  30g \/1oz cocoa powder,  ¼tsp of salt,  3 large eggs, separated,  ¼ tsp of cream of tartar ,  110g\/4oz caster sugar,  2 drops almond essence,  100g \/3½ oz butter,  150g\/5oz icing sugar,  55g\/2oz cocoa powder,  splash brandy or rum,  caster sugar for, dusting,  cocoa powder, for sifting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/yulelog_2809"}