{"recipe_name":"Authentic lamb tagine ","author":"Zoubida Boutarfas","programme":"Nigel Slater: Eating Together","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tagine, heat the oil in a medium-sized tagine, or a deep, heavy-based, lidded casserole. Add the lamb leg and fry for 2-3 minutes, turning regularly.  Add the onion, garlic, salt, pepper, ginger, turmeric and saffron and stir well to coat the meat in the spices. Continue to fry for 4-5 minutes, or until the onion has softened and the meat is browned all over.  Tie the bunches of coriander and parsley together using cook's string to make a small bouquet. Place it on top on the meat.  Add the cinnamon sticks and 750ml\/1¼ pints water to the tagine, then bring the mixture to a gentle simmer. Cover the tagine or casserole with the lid and continue to simmer for 2 hours, turning the pieces of meat after 1 hour and topping up with more water during cooking, as necessary. The tagine is ready when the meat is tender enough to come away easily from the bone when poked with a knife. Meanwhile, for the garnish, wash the apricots and prunes, then add them to a saucepan of boiling water. Boil for 10 minutes, or until soft.  Drain the water from the saucepan, then add the sugar, ground cinnamon and 4 tablespoons of the cooking liquid from the tagine.  Heat the vegetable oil in a frying pan over a medium heat. Add the blanched almonds and fry for 2-3 minutes, shaking the pan during cooking, until golden-brown on both sides. Remove the almonds from the pan using a slotted spoon and set aside to drain on a plate lined with kitchen paper.  Just before serving, reheat the spiced prunes and apricots. Sprinkle a plate with the toasted sesame seeds, then roll the prunes and apricots in the seeds until coated.  To serve, remove the herb bouquet and cinnamon sticks from the tagine and discard. Pile the tagine into bowls and garnish with the fried almonds and sesame-coated prunes and apricots. ","ingredients":" 2 tbsp olive oil ,  1 x 1kg\/2lb 4oz leg of lamb, cut through the bone into 4 pieces,  1 large onion, sliced  ,  1 garlic clove,  1½ tsp salt ,  1½ tsp black pepper,  1½ tsp ground ginger,  1½ tsp ground turmeric,  ½ tsp saffron strands,  small bunch fresh coriander,  small bunch fresh parsley ,  2 cinnamon sticks,  250g\/9oz dried apricots,  250g\/9oz dried prunes,  4 tbsp caster sugar,  1½ tsp ground cinnamon,  2 tbsp vegetable oil,  250g\/9oz blanched almonds,  3 tbsp toasted sesame seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/zoubidas_lamb_tagine_90479"}