{"recipe_name":"Breast of lamb with tartare sauce","author":"Brian Turner","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/320F\/Gas Mark 2. Put the piece of lamb into a ovenproof dish that has a tight fitting lid. Cut the carrots into quarters lengthways and cut the onions into quarters. Put into the dish with the lamb. Add the thyme, chicken stock, Worcestershire sauce and wine. Season and cover the dish with its lid. Transfer to the oven and cook for around three hours, basting every 30 minutes and turning the meat regularly. The meat should be completely tender when cooked enough. Remove from the oven and leave to rest. After 15 minutes remove the meat from the stock. Push out the bones and discard. Loosely wrap the meat in cling film and place between two heavy chopping boards. Place in the fridge and leave for a few hours or preferably overnight. Remove the meat from the cling film and cut into strips. In a clean bowl, lightly beat the eggs with the mustard. In a separate bowl place the seasoned flour. In another bowl mix the breadcrumbs together with the mint. Dip the strips of lamb into the seasoned flour and then into the mustard-egg mixture and finally into the breadcrumbs. Roll each strip carefully in your hands to make sure the breadcrumbs are well stuck on. In a heavy-bottomed saucepan, heat enough vegetable oil for deep frying (CAUTION: hot oil can be dangerous. Do not leave unattended). Deep-fry the strips until crispy and golden. Remove with a slotted spoon and drain on kitchen towel. For the tartare sauce (if using), mix all the ingredients together. Serve the hot crispy lamb strips with the tartare sauce (if using). ","ingredients":" 1 x 1.35kg\/3 lb piece breast of lamb,  2 carrots,  2 onions,  1 sprig thyme,  280ml\/½pint chicken stock,  1 tbsp Worcestershire sauce,  1 glass white wine,  salt and freshly ground black pepper,  seasoned flour,  1 tbsp Dijon mustard,  2 free-range eggs,  340g\/12oz fresh white breadcrumbs,  1 bunch chopped fresh mint,  vegetable oil, for deep-frying,  280ml\/½pint mayonnaise,  60g\/2oz chopped capers,  85g\/3oz chopped gherkins,  2 tbsp chopped fresh parsley,  half lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/breastoflambwithtart_79286"}