{"recipe_name":"Breast of teal with sweet potato mash and game jus","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the breast of teal, cover the teal breast with a little olive oil and season with salt and freshly ground black pepper. Heat a small ovenproof frying pan and add the teal breast. Cook for 2-3 minutes on each side and then transfer the frying pan to the oven. Cook the breast in the oven for eight minutes, or until cooked through. Remove from the oven and leave to rest for two minutes. For the game jus, place the teal bones and carcass into a small saucepan with all the rest of the game jus ingredients, except the butter. Heat the saucepan over a high heat and boil for ten minutes, adding a little more boiling water if the mixture becomes too thick and dry.  Add the butter to the game jus and mix well.  Once the butter has melted, strain the mixture into a gravy boat. For the sweet potato mash, place the sweet potato into a small saucepan filled with boiling water and cook for ten minutes, or until the potato has become soft.  Drain the excess water from the sweet potatoes and add the butter, soy sauce and black pepper and mash with a potato masher, until the mash becomes smooth. To serve, place the mash onto a clean plate.  Slice the teal breast thinly and place it on top of the mash.  Pour the game jus over the top of the teal breast. ","ingredients":" 1 breast of teal,  drizzle olive oil,  salt and freshly ground black pepper,  1 teal carcass,  1 beef stock cube,  75ml\/2½fl oz red wine,  1 garlic clove,  1 tsp white wine vinegar,  1-2 tbsp boiling water,  15g\/½ oz butter,  1 small sweet potato, peeled and chopped,  25g\/1oz butter,  2 tsp soy sauce,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/breastoftealwithswee_84611"}