{"recipe_name":"Brill cooked on the bone with sea vegetables and mash","author":"Adam Byatt","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the potatoes in a saucepan of boiling salted water and simmer very slowly until soft. Mash the potatoes and add the butter and milk. Season with salt and pepper and keep warm until ready to serve. Preheat the oven to 190C\/170C Fan\/Gas 5. In an ovenproof frying pan, heat the olive oil. Lightly dust the fish with flour. Fry for a minute to lightly brown one side. Turn over, add the shallots, thyme, seaweed powder, butter and white wine. Cover the fish with a circle of baking paper and bake for 7 minutes. Remove from the oven and let it rest for 3 minutes. Remove the skin from the fish and keep warm. To make the sauce, pass all of the cooking liquor from the frying pan into a small saucepan. Add the crème fraîche and whisk well to form a smooth sauce. For the sea vegetables, heat the butter, 50ml\/2fl oz water and a pinch of salt in a frying pan. Bring to the boil. Pick the sea vegetables and wash in lightly salted water. Add to the pan and cook for 1 minute, then drain well. To serve, spoon the mash onto the plates and make a well in the centre. Place the sea vegetables at the back of the plate and the fish next to it. Pour the sauce all around and finish with the chive oil and oyster leaves. ","ingredients":" 400g\/14oz Ratte potatoes (or other waxy potatoes), peeled ,  200g\/7oz salted butter,  100ml\/3½fl oz milk,  salt and freshly ground black pepper,  1 tbsp olive oil,  4 x 250g\/9oz tronçons (or steaks) from a 2–2.5kg brill,  3–4 tbsp plain flour, for dusting,  2 shallots, sliced into rings,  1 sprig thyme,  pinch seaweed powder ,  knob of unsalted butter,  150ml\/5fl oz white wine ,  50ml\/2fl oz crème fraîche,  50g\/1¾oz butter,  20g\/¾oz sea aster,  20g\/¾oz sea beets,  20g\/¾oz salty fingers,  20g\/¾oz sea purslane,  20g\/¾oz samphire,  chive oil,  8 oyster leaves ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/brill_cooked_on_the_bone_24487"}