{"recipe_name":"Brill with spiced carrots","author":"Glynn Purnell","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spiced carrots, add the vadouvan spice to the chicken stock and bring to a simmer. Put the carrots in the stock and cook for 5–7 minutes until tender. Remove the carrots, increase the heat and reduce the volume of liquid by half. Whisk in the butter and set the stock and carrots aside. For the vinaigrette, mix all ingredients together in a bowl until well combined. Set aside. For the fish, pour the coconut milk and milk into a large saucepan. Stir in the ginger, cardamom pods, lime leaves and salt. Bring to a gentle simmer over a medium heat, then add the brill fillets and cook them gently for 3–4 minutes. Turn off the heat, but leave the fish in the poaching liquid to keep warm.  To serve, return the spiced carrots to the reduced stock and heat until the carrots are warm and glazed.  Using a fish slice, remove the fish fillets from the poaching liquid and transfer to serving plates. Place the spiced carrots alongside. Dress the fish and carrots with the vinaigrette and garnish with cress and baby carrot leaves. ","ingredients":" 500ml\/18fl oz chicken stock,  1 tbsp vadouvan (a spice mix similar to masala),  12 baby carrots, washed and peeled,  50g\/1¾oz butter,  8 tbsp olive oil ,  2 tsp aged balsamic vinegar ,  2 large carrots, shredded into thin strips ,  1 lemon, finely grated zest only,  300ml\/10fl oz full-fat coconut milk,  250ml\/9fl oz full-fat milk,  1 tsp cardamom pods, cracked ,  5 lime leaves ,  10g ground ginger ,  1 pinch rock salt ,  4 x 150g\/5½oz brill fillets ,  1 tbsp coriander cress,  leaves from the baby carrots","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/brill_with_toffee_and_85667"}