{"recipe_name":"Brioche toast with caramelised pears and ginger syrup","author":"The Hairy Bikers","programme":"Food & Drink","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Whisk the eggs, maple syrup, vanilla seeds and a pinch of salt together in a large bowl.  For the caramelised pecans, heat the sugar in a small pan until it turns a deep caramel colour (CAUTION: boiling sugar is extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over.). Add the nuts and stir well to coat. Pour the mixture onto a baking tray lined with non-stick baking paper. Leave to cool and harden for a few minutes, then chop into pieces. Melt 50g\/1¾oz butter in a large non-stick frying pan. Dip the brioche slices into the egg mixture then pan fry in the butter for 2-3 minutes on each side, or until golden brown. Heat the remaining butter in a non-stick pan and add the sliced pear, reserving four slices for a garnish. Add a tablespoon of sugar to the pan and cook for 2-3 minutes. Then add the chopped ginger and syrup. Cook for a further 1-2 minutes until the liquid has reduced and the pears have caramelised. Arrange the toasted brioche on four plates, top with the caramelised pears and fresh pear slices, crème fraiche and a squeeze of lemon and zest. Scatter with chopped pecans and dust with icing sugar.  ","ingredients":" 4 large free-range eggs,  4 tbsp maple syrup ,  ½ vanilla pod, cut in half lengthways and seeds scraped out,  pinch of salt ,  100g\/3½oz demerara sugar, plus 1 tbsp for the caramelised pears,  50g\/1¾oz pecan nuts,  60g\/2¼oz unsalted butter,  4 slices brioche,  3 conference pears, peeled, cored and cut into thick slices,  75g\/2½oz stem ginger in syrup, finely chopped,  100ml\/3½fl oz syrup, reserved from the stem ginger,  4 tbsp crème fraîche,  1 unwaxed lemon, zest and a little juice,  icing sugar, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/brioche_toast_with_41352"}