{"recipe_name":"Brioche donuts filled with apple compôte","author":"Richard Corrigan","programme":"Full on Food","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Prepare the dough by adding a few drops of the water to the yeast and leave at room temperature to become frothy and creamy.   Put the flour, salt and sugar in a bowl, and tip in the yeast and the remainder of the water.  Add the eggs and egg yolks and finally, the butter.  Draw together with your hands, then knead until the dough is silky smooth.   Break off ball sized pieces and roll into balls. Place on a baking sheet, with plenty of room between each ball.  Leave to prove in a warm place until the balls have doubled in size. Meanwhile, prepare the compote.  Heat the butter in a heavy-bottomed pan.   Add the apples, sugar, cinnamon and lemon zest and heat gently until the fruit is stewed. Remove the cinnamon stick. Transfer the stewed fruit to a squeezy plastic bottle. To cook the donuts, heat ground nut oil in a deep fat fryer to 190C\/375F.  To test if oil is the correct temperature, drop a small cube of bread in the oil, if it sizzles and turns golden the oil is ready to use. (CAUTION: hot oil is very dangerous. Do not leave unattended.)  Re-shape the balls then drop them in the hot oil.   When they are golden brown, fish the balls out with a slotted spoon and sit on a piece of paper towel.   Combine the caster sugar with the cinnamon.   When the donuts are cool enough to handle, roll them in the cinnamon sugar, then take the bottle of apple compote and push gently into each donut, squeezing to release a dollop of compote. ","ingredients":" 30g\/1¼oz fresh yeast,  25ml\/1fl oz water,  500g\/1lb 1½oz strong flour,  pinch salt,  20g\/¾oz caster sugar,  4 eggs,  4 egg yolks,  500g\/1lb 1½oz butter, cold and diced,  6 tsp caster sugar,  1 tsp cinnamon ,  groundnut oil, for deepfrying,  10g\/½oz butter,  6 Bramley apples, peeled and chopped ,  150g\/5¼oz caster sugar ,  1 cinnamon stick ,  1 lemon, zest only","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/briochedonutsfilledw_74853"}