{"recipe_name":"Broad bean, yoghurt and mint soup","author":"Sophie Grigson","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Take about one-eighth of the blanched broad beans, chop roughly and set aside. Heat the butter in a heavy-bottomed, lidded pan. Add the onion and celery, cover and sweat over a low heat for about ten minutes, or until very tender. Add the rice and summer savory or thyme and cook for another minute, uncovered. Add the broad beans, except for the reserved chopped ones, and the stock. Season with salt and freshly ground black pepper, bring up to the boil, reduce the heat and simmer for about ten minutes, or until the rice is tender. Remove the savory or thyme stem, then allow to cool slightly. Pour the soup into a food processor in batches and blend until smooth. Shortly before serving, reheat the soup thoroughly, then take off the heat. Add a tablespoon of the yoghurt, together with the reserved beans and the chopped mint and stir well. Mix in a second tablespoon of yoghurt and continue stirring in, a spoonful at a time, until all the yoghurt is incorporated. Taste and adjust the seasoning. To serve, pour the soup into bowls and top with a sprig of mint and a light dusting of paprika or cayenne pepper. ","ingredients":" 450g\/1lb shelled broad beans, thawed if frozen, blanched and skins removed,  30g\/1oz butter,  1 onion, chopped,  1 stick celery, thinly sliced,  2 tbsp pudding rice,  1 generous sprig fresh summer savory or thyme,  1 litre\/1¾ pints hot chicken stock or vegetable stock,  salt and freshly ground black pepper,  115ml\/4fl oz Greek-style yoghurt,  handful fresh mint leaves, chopped,  4 small sprigs fresh mint,  paprika or cayenne pepper, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/broadbeanyoghurtandm_85610"}