{"recipe_name":"Brothy Vietnamese pork cao lau ","author":"Ching-He Huang","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 120C\/100C Fan\/Gas ½. Line a roasting tray with greaseproof paper.  To prepare the fried pork skin, remove the skin from the pork shoulder and pork belly. Clean off any fat with a sharp knife and slice the skin into 2½cm\/1in pieces. Pat dry and place on a wire rack over the prepared tray. Roast for 2½ hours until dry.  Place the pork bones in 1litre\/1¾pint water. Bring to the boil, then discard the water and scum. Reheat another pot of water and add the pork bones, then bring to a simmer. Place the onion, lemongrass, shallot and ginger on a hot griddle pan. Char and brown on all sides. Place the charred ingredients into the bone broth and add the star anise, sea salt and pepper. Simmer for 30 minutes.  Place the pork shoulder and pork belly in a large plastic bag. In a food processor, add the garlic, ginger, lemongrass and shallot and process until fine. Add into the bag with the meat. Add all the seasoning ingredients. Seal and marinade in the fridge for 30 minutes.  Remove the meat from the fridge. Heat a wok or pan over high heat, add the rapeseed oil and brown the pork meat until coloured. Add in the rest of the marinade and cook braising with the wok or pan lid on, for 40 minutes. Check the braising liquid every 15 minutes, add two ladlefuls of the pork broth to help the braising process and turn the meat to ensure even braising. While the meat is braising, blanch some beansprouts in a pan of water, drain and set aside. In the same pan cook the rice noodles in boiling water for 6-8 minutes until al dente. Drain, run through cold water, drain well and toss through 1 tablespoon of rapeseed oil.  To deep fry the pork skin, heat the vegetable oil in a deep fat fryer or a deep-sided, heavy bottomed pan to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended). Remove the skin from the oven and then deep fry until golden-brown, drain on kitchen paper.  Once the pork is cooked, take the pork out and add the broth to the wok so the broth fuses with the braising liquid and bring to the boil.  To serve, dress the base of the noodle bowl with some fresh romaine lettuce leaves, top with a handful of cooked rice noodles, pour the broth over, dress with sliced braised pork belly and shoulder, top with blanched beansprouts, fresh mint, coriander, Vietnamese lemon balm, perilla leaves, chilli slices, lime wedge, tablespoon of hoisin and teaspoon of sriracha. Top with the fried pork skin. Serve immediately.  ","ingredients":" 320g\/11½oz pork shoulder, washed, pat dry, skin removed ,  500g\/1lb 2oz pork belly, washed, pat dry, skin removed ,  500g\/1lb 2oz pork bones,  2 onions, halved,  3 lemongrass stalks, halved,  2cm\/¾in fresh ginger, sliced,  1 banana shallot, peeled and halved,  2 star anise,  1 tsp sea salt ,  1 tsp ground white pepper,  5 garlic cloves, roughly chopped ,  5cm\/2in piece fresh root ginger, peeled, roughly chopped ,  2 shallots, peeled ,  2 lemongrass stalks, peeled,  2 star anise,  3 tbsp low-sodium light soy sauce ,  3 tbsp Shaoxing rice wine or dry sherry,  1 tbsp dark soy sauce,  1 tbsp fish sauce ,  1 tbsp demerara sugar or palm sugar,  1 tsp Chinese five spice powder,  ¼ tsp salt,  ½ tsp freshly ground black pepper,  400g\/14oz dried 5mm wide flat rice noodles,  1 tbsp rapeseed oil ,  2cm\/¾in fresh ginger, sliced,  vegetable oil, for deep-frying,  100g\/3½oz beansprouts,  half head of romaine lettuce, stalk removed, long leaves separated, washed, pat dry, sliced down the middle,  30g\/1oz fresh mint, washed, pat dry ,  30g\/1oz fresh coriander ,  30g\/1oz Vietnamese lemon balm ,  30g\/1oz of fresh perilla leaves ,  1 red chilli, thinly sliced,  1 lime, sliced into 4 wedges,  4 tbsp hoisin sauce ,  4 tsp sriracha sauce","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/brothy_vietnamese_pork_36958"}