{"recipe_name":"Brown butter Cornish hake with 'pressure-cooked' spring soup","author":"Paul Ainsworth","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the brown butter for the hake, add the butter to a hot frying pan. Stir gently and allow the butter to brown. Once brown, pass through a fine sieve into a bowl and leave to cool in the fridge.  Season the hake fillets with sea salt and then place the fillets into the fridge for 1½ hours. (This firm’s up the texture of the fish and draws out any excess water.)  For the pressure-cooked soup base, bring the stock to a simmer in a separate pan. Put the pressure cooker over a medium heat. Add the olive oil, when hot add the bacon and stir. Fry until golden-brown (about 4 minutes). Add the fennel, onion, garlic, celery and broken spaghetti. Season lightly with sea salt and cook for a further 3 minutes, or until the vegetables are slightly soft but not coloured. Tie the thyme and rosemary sprigs together using cook's string. Add to the pressure cooker along with the hot stock. Crush the ripe tomatoes in your hands and add them to the pressure cooker along with the vine. Place the lid on and, following the manufacturer’s instructions, bring up to pressure and cook for 10 minutes. Preheat the oven to 160C\/140C fan\/Gas 2. For the hake, take the brown butter from the fridge and whisk to a paste, it should smell like toffee. Season the hake lightly with sea salt and brush all over with brown butter. Place on an oven tray and bake for about 6-8 minutes.    Once the 10 minutes is up on the pressure cooker, remove it from the heat and allow cool, so you can remove the lid. The contents should be really hot still, carefully remove the thyme bundle, tomato skins and vine using tongs. Add all the spring greens, herbs and season with white pepper. Set aside until the spring greens are slightly soft.  Serve in bowls with a fillet of hake on top. Finish with a little olive oil, a grating of lemon zest and a squeeze of juice. Add a pinch of sea salt on the fish skin and serve immediately.  ","ingredients":" 250g\/9oz butter (unsalted or salted depending on your preference), cubed,  4 x 150g-200g\/5½-7oz hake fillets, skin on,  sea salt flakes,  1 lemon, zest and juice only,  1 litre\/1¾ pints good-quality chicken or vegetable stock ,  3 tbsp extra virgin olive oil, plus extra to serve,  300g\/10½oz smoked streaky bacon or pancetta, chopped,  1 head fennel, chopped into 1cm\/½in cubes,  1 medium onion, finely chopped,  3 garlic cloves, finely grated,  2 sticks celery, peeled and chopped into 1cm\/½in cubes,  100g\/3½oz dried spaghetti, broken into bite-sized pieces ,  2 sprigs rosemary,  4 sprigs thyme,  4 ripe plum tomatoes on the vine ,  sea salt flakes,  6 asparagus spears, woody ends removed, peeled,  1 bunch spring onions, finely sliced,  100g\/3½oz fresh peas, podded,  100g\/3½oz broad beans ,  6 baby courgettes, thinly sliced,  100g\/3½oz green beans, finely chopped,  ½ bunch radishes, cut into quarters,  1 small handful fresh basil,  1 small handful fresh chives,  freshly ground white pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/brown_butter_cornish_02807"}