{"recipe_name":"Brown shrimp tartlets","author":"Galton Blackiston","programme":"Country Show Cook Off","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Butter the holes of a muffin tin (This recipe makes eight tarts, so you may need to bake them in batches). Cut the filo pastry down to the correct size for your muffin tins, then coat the filo pastry with the clarified butter and press into muffin tins creating four layers of buttered filo in each case. Bake for approximately 10-15 minutes until light golden-brown (to blind bake – they should not be completely cooked). For the filling, place the eggs, egg yolks and double cream in a bowl and beat gently. Add the nutmeg, salt and freshly ground black pepper.  Place a sieve over a pouring jug and strain the egg mixture. Heat the oil in a frying pan, then quickly fry the spring onions until just softened.  In a pan of boiling water cook the samphire, then immediately drain them and run under cold water to stop them losing colour and cooking further.  Mix with the spring onions. Divide the samphire and spring onion mix between the pastry cases. Top with some shrimps and the blue cheese, then pour the egg mixture over to fill the cases. Place the tarts on a baking tray in the centre of the preheated oven. Cook for approximately 20 minutes, or until the filling is just set. Leave to cool for a few minutes before serving. ","ingredients":" 4 sheets filo pastry,  50g\/1¾oz clarified butter ,  3 free-range eggs,  2 free-range egg yolks,  425ml\/¾ pint double cream ,  pinch freshly grated nutmeg,  salt and freshly ground black pepper,  2 tbsp rapeseed oil or olive oil,  2 bunches spring onions, finely sliced,  few sprigs samphire,  100g\/3½oz peeled brown shrimps,  40g\/1½oz blue cheese, freshly grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/brown_shrimp_tartlets_80711"}