{"recipe_name":"Brussels sprout bhajis","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Half-fill a deep heavy-based pan with vegetable oil and heat until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place the gram flour into a large mixing bowl. Gradually add the water to the flour, whisking well to form a batter with a consistency similar to pouring cream. Add the chilli and mix well. Set aside in a cool place. Meanwhile, heat two tablespoons of oil in a frying pan over a medium heat. Add the onion and fry until softened, but not coloured. Drain off the oil and transfer the onion to kitchen paper to drain. Place the sprouts and green beans into a bowl. Add the fried onion and mix well. Take tablespoon-sized amounts of the sprout mixture and dip into the batter to coat completely. Carefully add the battered sprout mixture into the pan of hot oil and cook until crisp and golden-brown. Remove with a slotted spoon and drain onto kitchen paper. Repeat to use up all of the sprout mixture. For the yoghurt dressing, mix the yoghurt with mint and lime juice in a bowl. Season, to taste, with salt and freshly ground black pepper. To serve place the bhajis into a serving bowl with the yoghurt dressing alongside for dipping. ","ingredients":" vegetable oil, to shallow fry and deep fry,  300g\/10½oz gram flour (also sold as besan or chickpea flour),  150ml\/5fl oz water (approximately),  1 green chilli, finely chopped,  1 large onion, sliced,  200g\/7oz Brussels sprouts, halved, boiled until al dente,  100g\/3½oz fine green beans, boiled until al dente, finely chopped,  250g\/9fl oz plain yoghurt,  2 tbsp finely chopped fresh mint,  half lime, juice only,  salt and freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/brusselssproutsbhaji_87673"}