{"recipe_name":"Bubble and squeak and candied shallots","author":"The Hairy Bikers","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/bubble_and_squeak_and_38318_16x9.jpg","method":"For the candied shallots, simmer the shallots gently for 4-5 minutes in a pan of boiling water to soften. Drain. Heat the butter in a non-reactive frying pan, add the shallots and fry gently until golden-brown, about 3-4 minutes. Add the sugar and stir until it melts and begins to caramelise and coat the shallots. Mix the wine, port, cassis and stock together in a bowl. Add a quarter of the wine mixture to the pan with the shallots and bring to a boil, then add the bay leaf and lemon zest. Reduce the heat until the mixture is simmering, then continue to simmer until the liquid has reduced to a glaze. Add some more of the wine mixture to the pan and simmer again until the liquid has reduced to a glaze. Add the remaining liquid bit by bit, reducing each time, until the shallots are coated in the glaze. Set aside until needed. For the bubble and squeak, heat half of the olive oil in a frying pan and cook the leeks for 3-4 minutes, or until softened but not coloured.  Mix the leeks, mashed potato and cabbage together in a bowl. Season, to taste, with salt and freshly ground black pepper.  Heat the remaining olive oil in the frying pan. Place four 7.5cm\/3in chefs' rings into the pan and spoon the bubble and squeak into the rings, packing down gently. Cook until golden-brown on the bottom, turn the rings over carefully and cook on the other side. Remove from the pan and keep warm until ready to serve, carefully removing the chefs’ rings before serving. ","ingredients":" 30 shallots, peeled ,  150g\/5oz butter,  3 tbsp caster sugar,  200ml\/7fl oz red wine,  125ml\/4fl oz port,  crème de cassis,  600ml\/1 pint beef stock,  1 fresh bay leaf,  1 lemon, zest only,  1 tsp dried thyme,  3 tbsp olive oil,  2 leeks, washed, sliced,  1.25kg \/2lb 12oz potatoes, peeled, boiled, mashed and left to cool,  750g\/1lb 10oz spring cabbage, finely shredded, blanched (or leftover cooked cabbage or Brussels sprouts),  sea salt flakes and freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bubble_and_squeak_and_38318"}