{"recipe_name":"Apple, sultana and cinnamon swirls","author":"Val","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/apple_sultana_and_48182_16x9.jpg","method":"For the pastry dough, put the flour, salt and sugar on one side of a large mixing bowl and the yeast on the opposite side. Add the eggs, warm milk and 50ml\/1¾fl oz water and mix for one minute using a fork until combined. Add a little more water if needed to form a soft dough. Dust a work surface with flour and turn out the dough. Dust with a little flour and knead for 5 minutes, then shape into a ball. Lightly oil a mixing bowl and a large piece of cling film. Put the dough in the bowl and cover with the cling film. Set aside in a warm place to prove for an hour, or until almost doubled in size.  For the filling, beat the butter and 110g\/4oz of the sugar in a mixing bowl. Stir in the cinnamon and set aside.  Put the apples in a saucepan and add the remaining sugar. Cook over a medium heat for about 10 minutes, stirring regularly, until the apples begin to break down. Add the sultanas, orange juice, orange zest, and lemon zest. Heat gently for 5 minutes then set aside to cool. When cold, stir in the vanilla extract.  For the glaze, combine the apricot conserve and lemon juice with 2 tablespoons water in a heavy-based saucepan. Slowly bring to the boil, (don’t stir it too much or bubbles will form and the glaze will appear cloudy), transfer the glaze to a heatproof bowl and place over a pan of gently simmering water until the glaze is runny. Pass through a sieve then return to the pan and set aside.  To finish the pastry, roll out the dough on a lightly floured work surface until 1cm\/½in thick.  Beat the chilled butter using a rolling pin, until it is flattened into a rectangle roughly half the size of the dough rectangle. Arrange the dough with a short edge nearest you and put the butter in the middle. Fold the top and bottom of the pastry over the butter and press down the edges to ensure the butter is sealed within the pastry. Using a rolling pin, tap the dough from the middle upwards and from the middle downwards. This ensures that the butter is evenly distributed. Roll out the pastry to a large rectangle approximately 1cm\/½in thick. Turn dough so you have a long edge nearest you, then fold the right third into the middle and cover with the left third. Chill in the fridge for 30 minutes. Do this turning, folding and chilling two more times. Preheat the oven to 200C\/180C Fan\/Gas 6. Line two large baking trays with non-stick baking paper.  To assemble the pastries, roll the pastry out into a rectangle about 36x30cm\/10x8in and 1cm\/½in thick. Spread with the cinnamon and butter mixture leaving about 2cm\/¾in of dough free from the mixture on the side nearest to you. Roll up the dough towards you. Brush the last bit of dough with a little egg wash to help it stick.  Cut away the scruffy ends then slice the roll into 12 even pieces with a sharp knife. Place the pastries on the prepared trays, allowing plenty of room around each one. Lightly flour your hands and flatten each slice slightly, making a small indent in the middle. Spoon 1 teaspoon of the apple mixture into the centre of each pastry. Cover with a clean tea towel or plastic bag and set aside in a warm place for 10 minutes.  Brush with egg wash and then bake for 15–20 minutes, or until crisp and golden-brown. Place the cooked pastries on cooling racks and brush them with apricot glaze while they are still hot. Leave to cool completely. Meanwhile, mix all the icing ingredients together until smooth. Transfer to a paper piping bag and pipe lines across the pastry to finish.  ","ingredients":" 500g\/1lb 2oz strong white flour, plus extra for dusting,  10g\/¼oz fine sea salt,  50g\/1¾oz caster sugar,  9g\/⅓oz fast-action yeast ,  1 large free-range egg, plus 1 large egg yolk, lightly beaten,  150ml\/5fl oz full-fat milk, heated to 43C,  1 tsp light olive oil or vegetable oil, for greasing,  250g\/9oz unsalted butter, chilled ,  110g\/4oz unsalted butter, softened ,  160g\/5¾oz caster sugar,  4 tsp ground cinnamon ,  250g\/9oz peeled, cored and chopped Bramley apples (about 2 apples),  50g\/1¾oz sultanas ,  1 small unwaxed orange, zest and juice ,  ½ unwaxed lemon, zest only,  1 tsp vanilla extract ,  50g\/1¾oz apricot conserve,  2 tsp lemon juice,  1 free-range egg, beaten with 2 tbsp full-fat milk,  150g\/5½oz icing sugar, sifted,  2 tbsp boiling water,  ½ tsp vanilla extract","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/apple_sultana_and_48182"}