{"recipe_name":"Apple tart with mulberry and blackberry ice cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mulberry and blackberry ice cream, add the mulberries, blackberries, 15g\/½oz of the sugar and a tablespoon of cold water to a pan and heat for five minutes, or until the berries have softened. Set aside to cool. Pour the cream and milk into a heatproof bowl. Add the vanilla seeds and stir well. Place the bowl over a pan of gently simmering water (do not allow the base of the bowl to touch the water). Heat the mixture gently but do not boil. In a separate bowl, beat the egg yolks and 80g\/2¾oz of the sugar until fluffy. Add the warm cream and milk mixture and stir well. Return the custard mixture to the bowl used to heat the cream and continue to cook gently over the simmering water. Stir regularly, until the mixture is thick enough to coat the back of a spoon. Drain the berries through a sieve set over a bowl and reserve the liquid. Place the sieve over another bowl and push the berries through the sieve to form a purée, add a little of the reserved liquid if the purée is very thick.  Set aside a little of the purée and vanilla custard for decoration. Stir the remaining purée into the custard. Transfer to an ice cream maker and churn according to manufacturer’s instructions. For the apple tart, preheat the oven to 200C\/400F\/Gas 6. Place the roughly chopped apples and two tablespoons of water in a pan and cover with a lid. Place over a medium heat and bring to a simmer. Cook for 3-4 minutes, or until the apples are soft. Whisk the apples to a smooth purée, then set aside to cool. On a lightly floured work surface, roll out the pastry to a circle about 30cm\/12in in diameter. Lightly score an inner circle 1cm\/½in inside the edge of the pastry. Brush the top of the pastry with beaten egg. Wait one minute, then brush the pastry again with more egg. When the apple purée is cold, spread it over the inner circle of pastry. Layer the thin slices of apple over the apple purée. Brush the apple slices with melted butter and sprinkle over the caster sugar. Bake for 25-30 minutes, or until the pastry is golden-brown and the apples are caramelised. To serve, cut the tart into slices and place in the centre of serving plates with a ball of ice cream alongside.  ","ingredients":" 250g\/9oz mixed mulberries and blackberries,  95g\/3oz sugar,  150ml\/5fl oz cream,  150ml\/5fl oz milk,  ½ vanilla pod, cut in half lengthways and seeds scraped out,  3 free-range egg yolks,  3 Bramley apples, peeled, cored and roughly chopped,  450g\/1lb ready-made puff pastry,  1 free-range egg yolk, beaten,  2 Pink Lady apples, peeled, cored and thinly sliced,  75g\/2½oz butter, melted,  4 tbsp caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/apple_tart_with_mulberry_25791"}