{"recipe_name":"Buffalo chicken wings with roast potato salad","author":"Donal Skehan","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the potatoes, preheat the oven 200C\/180C Fan\/Gas 6. Put the potatoes in an oven tray with some olive oil, salt and pepper. Mix well then roast for 45 minutes, or until the potatoes are golden-brown. When the potatoes are done, take them out of the oven and leave to cool for about 5 minutes. In a large bowl, make the dressing by mixing the mayonnaise, garlic and lemon juice, then season with sea salt and ground black pepper to taste. Add the potatoes and toss to coat. For the chicken wings, whisk the butter, hot chilli sauce, Worcestershire sauce, 1 teaspoon paprika, cayenne pepper and salt and black pepper together in a saucepan over a high heat. Bring to the boil, then reduce the heat and simmer for 5 minutes until slightly thickened. For the wings, heat 5cm\/2in of sunflower oil in a large, deep casserole until it reaches 190C\/375F (or until a small cube of bread sizzles and turns brown within 1 minute when added to the oil).  Season the flour with salt and pepper and mix through the remaining teaspoon of paprika. Dredge the chicken in the flour and fry the wings in batches in the hot oil for 15 minutes, or until cooked through, crisp and golden-brown. Remove from the oil using tongs and drain on a plate lined with kitchen paper. Place the chicken wings in a large bowl and toss with the sauce until completely coated. For the salad, mix the lettuce, celery and herbs in a large bowl. In a separate bowl whisk together all the dressing ingredients. Just before serving pour the dressing over the salad. To serve, place the chicken wings onto a serving plate and serve salad alongside, with the potatoes in a separate bowl. ","ingredients":" 500g\/1lb 2oz waxy potatoes, washed and cut into chunks,  1 tbsp olive oil,  3 tbsp mayonnaise,  1 garlic clove, crushed,  ½ lemon, juice only,  110g\/4oz butter,  120ml\/4fl oz hot chilli sauce,  ½ tbsp Worcestershire sauce,  2 tsp paprika,  ½ tsp cayenne pepper,  ½ tsp sea salt,  ½ tsp freshly ground black pepper,  sunflower oil, for frying,  100g\/3½oz plain flour,  1.3kg\/3lb chicken wings,  2 Little Gem lettuce, leaves separated,  12 celery sticks, sliced,  1 tbsp chopped fresh mint,  1 tbsp chopped fresh coriander,  1 tbsp chopped fresh parsley,  1 lemon, juice only,  1 tsp Dijon mustard,  3 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/buffalo_chicken_wings_25720"}