{"recipe_name":"Buffalo wings","author":"The Hairy Bikers","programme":"Hairy Bikers - Chicken & Egg","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/buffalo_wings_09457_16x9.jpg","method":"If you have time, prepare the wings by sprinkling generously with salt. Lay out, on a rack in the fridge, cover and chill overnight – this will help them crisp when you fry them. An hour before you want to cook them, remove from the fridge to bring to room temperature and pat dry.  For the hot sauce, melt the butter in a small saucepan and add the garlic. Cook gently for a minute or two, then whisk in the hot sauce, vinegar and sugar. Season with salt and pepper. To make the blue cheese sauce, mash the cheese with the onion, buttermilk, crème fraîche and vinegar. Pour enough oil in a deep-fat fryer or large saucepan, to fill it no more than halfway. Heat the oil to 160C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cook the wings in batches for around 10 minutes, then drain them of any excess oil. Raise the temperature of the oil to 190C and fry again, cooking for a further 2 minutes, until cooked through, very crisp and deep brown. Turn out on to kitchen paper. Put the wings in a bowl and smother them in the hot sauce. Serve them with the blue cheese sauce and celery sticks. ","ingredients":" 1kg\/2lb 4oz chicken wings, tips removed and split into “drumettes” and “flats”,  vegetable oil, for deep frying,  a few celery sticks,  salt and freshly ground black pepper,  50g\/1¾oz butter,  2 garlic cloves, crushed,  125ml\/4fl oz hot sauce ,  1 tbsp cider vinegar,  1 tsp caster sugar,  100g\/3½oz creamy blue cheese ,  1 small onion, very finely chopped,  100ml\/3½fl oz buttermilk,  150ml\/5fl oz crème fraîche,  1 tsp cider vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/buffalo_wings_09457"}