{"recipe_name":"Butter-poached lobster with asparagus, spinach and Maltaise sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lobster, heat a large frying pan and add the butter. Once hot and bubbling add the lobster meat and cook on each side for 1-2 minutes. Keep warm until ready to serve. For the Maltaise sauce, put the egg yolk, lemon juice and a tablespoon of water in a blender. Blend to combine. With the motor running, slowly pour the warmed butter through the spout in the lid until all the butter is combined and the sauce emulsifies. Finish with the blood orange zest and juice and mix to combine. Season with salt. For the asparagus and spinach, cook the asparagus in a large pan of boiling water for 2-3 minutes. Drain and set aside. Heat a large frying pan and add half the butter. Once the butter is melted, add the asparagus and fry for 2 minutes. Season with salt and pepper. Set aside on a warm plate. Heat the remaining butter in the pan. Add the spinach and a tablespoon of water. Cook until wilted. To serve, place the wilted spinach in the centre of the serving plates and top with the asparagus and lobster. Pour over the sauce and garnish with baby cress. ","ingredients":" 75g\/2½oz unsalted butter,  2 lobsters, meat removed from the shells (keep the meat in whole pieces if possible),  1 egg yolk,  1 lemon, juice only,  110g\/4oz clarified butter, warmed,  ½ blood orange, zest and juice only,  1 bunch asparagus, woody ends trimmed, peeled ,  100g\/3½oz unsalted butter,  50g\/1¾oz baby spinach,  salt and freshly ground black pepper,  2 tbsp mixed baby cress (such as baby bull’s blood, red vein sorrel and chervil) or small edible flowers","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/butter-poached_lobster_74792"}