{"recipe_name":"Butter chicken curry and chapati","author":"James Martin","programme":"Home Comforts at Christmas","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/butter_chicken_curry_and_92429_16x9.jpg","method":"Blend the chilli powder, cumin, garam masala, coriander, 3 garlic cloves, turmeric, cinnamon, ginger and cashews to a fine purée in a food processor. Add half of the lemon juice and blitz once more until smooth. Stir in the yoghurt until well combined. Put the chicken breasts in a bowl and pour over the marinade, mixing to coat. Marinate in the fridge for 1 hour. Preheat the grill to its highest setting and place an oven shelf in the middle of the oven. Transfer the marinated chicken to a grill tray lined with aluminium foil. Grill for 12-15 minutes, until the marinade has browned and the chicken is just cooked through. Meanwhile, heat the oil in a frying pan over a medium heat. Add the cinnamon stick and cardamom pods and stir-fry for 1 minute, until fragrant. Add the remaining garlic, chillies and tomatoes and simmer for 4-5 minutes. Add the grilled chicken and cook for a further 4-5 minutes, until the sauce has thickened slightly and the chicken is cooked through. Whisk in the chilled butter a little at a time, then add the cream and simmer for another 2 minutes. Season, to taste, with salt and freshly ground black pepper. Keep warm. Meanwhile, make some chapatis, pile the flour onto a clean work surface and make a well in the centre. Gradually and carefully add 250ml\/9fl oz cold water, pulling the flour in from the inner edges of the well to combine, until the mixture comes together as a soft dough. Knead until soft, smooth and elastic. Divide the dough into 4 pieces then roll each piece into a ball. Roll out the balls onto a floured work surface to form a flat disc 2-3mm thick. Heat a griddle pan or non-stick frying pan over a high heat until very hot. Cook the chapatis one at a time until just charred, about 20 seconds on each side. When the chapati is cooked, bubbles will form at its surface. Brush the cooked chapatis with the melted butter. Serve the butter chicken with the chapatis. ","ingredients":" 2 tsp chilli powder,  2 tsp ground cumin,  1 tbsp garam masala,  1 tsp ground coriander,  6 garlic cloves, roughly chopped,  ½ tsp ground turmeric,  ½ tsp ground cinnamon,  7.5cm\/3in piece fresh root ginger, roughly chopped,  50g\/1¾oz cashews, roughly chopped,  2 lemons, juice only,  150g\/5½oz plain, full-fat yoghurt,  4 large boneless skinless chicken breasts, cut into 2.5cm\/1in dice,  1 tbsp vegetable oil,  1 cinnamon stick,  4 cardamom pods, split,  2 long green chillies, finely sliced,  1 x 400g tin chopped tomatoes,  75g\/2½oz chilled butter, plus 25g\/1oz melted butter,  50ml\/2fl oz double cream,  250g\/9oz wholemeal plain flour, plus extra for dusting,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/butter_chicken_curry_and_92429"}