{"recipe_name":"Spice spatchcocked chicken with chilli masala sauce and puy lentil salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6.  Cut the chicken down the back bone, and flatten out with the palm of your hand, skin side up. Cut several slashes into the flesh then rub with the lemons and a little of the vegetable oil. Mix the spices together in a bowl then rub into the chicken. Heat an oven proof griddle pan until hot, place the chicken skin side down, and the lemons cut side down, onto the griddle and sear for 2-3 minutes until coloured and charred slightly at the edges. Remove the lemon from the griddle, and set aside. Flip over, drizzle with a little more of the oil, then place the whole pan into the oven and roast for 25-30 minutes until cooked through, and the juices run clear when the meat is pierced. Remove the cooked chicken from the oven and rest for 10 minutes before carving into portions. For the masala sauce, heat a large frying pan until hot, add the vegetable oil, onions and chillies, and cook for 10 minutes until the onions are golden-brown and softened. Add the spices, garlic and ginger and cook for another two minutes. Add the ground almonds and tomatoes and bring to a simmer then add the cream and stock. Return to a simmer and cook for 10-15 minutes until the sauce has thickened. Check the seasoning, and add salt and freshly ground black pepper to taste, then stir through the coriander. For the lentil salad, place all the ingredients into a bowl and toss together carefully, then season with a little salt and freshly ground black pepper. To serve, pile lentil salad onto each plate, and place a couple of pieces of chicken alongside, spoon the sauce over and finish with a charred lemon.  ","ingredients":" 1 x 1.5 kg\/3lb 5oz chicken,  2 lemons, cut in half,  2 tbsp vegetable oil,  1 tsp ground coriander,  1 tsp ground cumin,  1 tsp ground cinnamon,  1 tsp turmeric,  1 tsp chilli powder,  ½ tsp ground cardamom,  2 tbsp vegetable oil,  2 onions, finely sliced,  2 long red chillies, finely sliced,  1 tsp chilli powder,  2 crushed bay leaves,  ½ tsp ground cinnamon ,  1 tbsp garam masala ,  4 garlic cloves, finely sliced,  25g\/1oz fresh root ginger, finely grated,  50g\/2oz ground almonds ,  400g\/14oz tin chopped tomatoes ,  150ml\/5fl oz double cream,  150ml\/5fl oz chicken stock,  salt and freshly ground black pepper,  4 tbsp coriander leaves, roughly chopped,  400g\/14oz tin cooked puy lentils, drained,  1 red onion, finely diced,  2 tomatoes, de-seeded and chopped,  2 long red chillies, seeded and finely sliced,  3 tbsp roughly chopped coriander leaves,  3 tbsp roughly chopped mint leaves,  1 lemon, juice only,  2 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/butter_chilli_13339"}