{"recipe_name":"Butter chilli chicken with chips ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the marinade, place all the ingredients except the chicken into a food processor and blend to a purée.  Pour into a bowl then add the chicken, mix well then place into the fridge to marinate for at least one hour. For the curry, heat a large sauté pan until hot, add half the butter and the onion and chillies and cook for 10 minutes until golden-brown and softened. Remove the mixture from the pan and set aside. Return the pan to the heat then lift the chicken out of the marinade and cook in batches on a high heat for 1-2 minutes until coloured. Return the onion mixture, chicken and marinade to the pan and bring to a simmer. Add the cream and chicken stock, return to a simmer and cook for 5-10 minutes until the chicken is cooked through and the sauce thickened. Season, to taste, with salt and freshly ground black pepper then stir through the coriander. For the chips, heat the vegetable oil in a deep-sided, heavy-based pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave the pan unattended.) Alternatively, heat a deep-fat fryer to 160C. Place the potatoes into the hot oil, a few at a time, and cook in batches for 2-3 minutes until just tender but not coloured. Drain onto kitchen paper and turn up the heat to 190C\/375F. Place the semi-cooked chips back into oil in batches and cook for another 2-3 minutes until golden-brown and crisp. To serve, pile the chips onto serving plates and spoon the curry alongside. ","ingredients":" 150ml\/5oz plain yoghurt,  50g\/2oz ground almonds ,  1 tsp chilli powder,  2 birds’-eye chillies, roughly chopped ,  ½ tsp ground cinnamon ,  1 tbsp garam masala ,  6 green cardamom pods, split and seeds lightly crushed,  4 garlic cloves, roughly chopped,  25g\/1oz fresh root ginger, roughly chopped,  1 x 400g\/14oz tin chopped tomatoes ,  4 chicken breasts, boneless and skinless, cut into long strips,  50g\/2oz butter,  1 large onion, finely sliced,  2 birds'-eye chillies, finely sliced,  150ml\/5fl oz double cream,  200ml\/7fl oz chicken stock ,  4 tbsp coriander leaves, roughly chopped,  salt and freshly ground black pepper,  vegetable oil, for frying ,  400g\/14oz chipping potatoes, peeled and cut into batons 1cm x 1cm x 6cm\/½in x ½in x 2½in long","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/butter_chilli_chicken_91839"}