{"recipe_name":"Butter mutton with puri","author":"James Martin","programme":"Saturday Kitchen Best Bites","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mutton curry marinade, place the mutton into a large bowl, add all the mutton curry marinade ingredients and mix well. Place in the fridge to marinate for at least 3 hours, or preferably overnight. For the mutton curry sauce, when the mutton has marinated, heat a large wok over a high heat, add the cumin, coriander, fenugreek, cinnamon and cloves and stir-fry for 10-20 seconds, or until fragrant and just toasted. Tip the toasted spices into a pestle and mortar and grind to a fine powder. Set aside. Add half of the ghee to the wok. When it has melted, add the marinated mutton, in batches, and fry for 1-2 minutes on all sides, or until slightly charred on all sides. Remove from the wok and set aside. Repeat the process with the remaining mutton. Add the remaining ghee to the wok, then add the ginger and garlic and fry for 30 seconds. Add the ground spices and tomato purée and cook for a further 1-2 minutes. Reduce the heat slightly, add the double cream and bring the mixture to a simmer, stirring well. Reduce the heat to very low, return the mutton to the pan and cook the curry gently for 1½ hours, or until the meat is tender. Just before serving, add the ground almonds. Stir well and cook for a further minute. Season, to taste, with salt and freshly ground pepper.  For the puri, place the flour into a bowl with a pinch of salt. Make a well in the centre. Gradually add the water, drawing more flour into the well as you go, until the mixture comes together as a firm dough. (You may not need to add all of the water.) Turn out the dough onto a lightly floured work surface. Knead for 1-2 minutes, then wrap in cling film and chill in the fridge for 30 minutes. When the dough has chilled, divide it into 4-8 golf-ball sized portions. Roll each out into 2mm thick flat discs. Heat the vegetable oil in a wok until a breadcrumb sizzles and turns golden-brown when dropped into it. Alternatively, heat the oil in a deep-fat fryer to 190C\/375F. Carefully lower the puri into the hot oil one at a time. Fry for 30-45 seconds on each side, or until light golden-brown and puffed up. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. To serve, ladle the butter mutton curry onto serving plates. Sprinkle over some of the green chillies, fenugreek leaves and coriander leaves. Pile 1-2 puri alongside each serving. ","ingredients":" 1kg\/2lb 2oz mutton leg, bone removed, meat cut into 2.5cm\/1in cubes,  150ml\/5fl oz plain yoghurt,  3 garlic cloves, crushed,  3cm\/1¼in piece fresh root ginger, peeled, finely grated,  1 lemon, juice only,  1 tsp garam masala,  1 tsp chilli powder,  ½ tsp ground coriander,  ½ tsp ground cumin,  ½ tsp ground turmeric,  ½ tsp salt,  1 tsp cumin seeds,  1 tsp coriander seeds,  ¼ tsp fenugreek seeds,  1 cinnamon stick,  6 cloves,  50g\/2oz ghee,  2.5cm\/1in piece fresh root ginger, peeled, finely grated,  2 garlic cloves, crushed,  300g\/10½oz tomato purée,  150ml\/5fl oz double cream,  75g\/3oz ground almonds,  salt and freshly ground pepper,  300g\/10½oz wholewheat flour, plus extra for dusting,  pinch salt,  110ml\/4fl oz water,  vegetable oil, for deep frying,  2 birds’-eye chillies, finely sliced,  2 tbsp fresh coriander leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/butter_mutton_with_puri_99299"}