{"recipe_name":"Buttermilk and poire William panna cotta with ginger doughnuts and pear purée","author":"James Martin","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the panna cotta, chill a jug in the freezer. Heat the double cream, vanilla pod and seeds and the sugar in a saucepan until just boiling, stirring occasionally. Remove the pan from the heat, squeeze out the excess water from the soaked gelatine and add it to the hot cream. Whisk in the buttermilk until the gelatine is dissolved completely. Pass the mixture through a fine sieve into the chilled jug, and then stir in the poire William. Chill the cream mixture in the fridge, whisking every five minutes until the mixture begins to set. Divide the mixture among four dariole moulds and chill in the fridge for at least two hours. For the doughnuts, mix the flour, salt, 25g\/1oz of the caster sugar and all of the butter, 150ml\/5fl oz water and yeast until well combined.  Mix for 4-5 minutes, or until the mixture comes together as a smooth dough. Cover with cling film and set aside for one hour to rise, or until doubled in size. Divide the dough into 12 equal portions and roll each into a ball. Line a tray with baking parchment and place the dough balls onto it, leaving plenty of room between each ball. Set aside in a warm place to prove for a further 20 minutes. When the dough has proved, heat the oil in a deep fat fryer to 150C\/302F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully lower the dough balls into the hot oil in batches and deep fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Place the remaining caster sugar and ground ginger on a plate and roll the doughnuts in it until completely coated. For the pear purée, place the peeled pears into a saucepan with the lemon zest and juice, and the sugar, vanilla pod and seeds. Add enough water to just cover the pears. Place on the heat, bring to the boil then reduce the heat and simmer for 15 minutes.  Lift the pears out and drain onto kitchen paper until cool enough to handle. Cut two of the pears in half top to bottom, then cut each half into about eight chunky pieces, discarding the core. Pat the pear pieces dry then transfer to a baking tray. Sprinkle with icing sugar and caramelise using a chef’s blowtorch (or under a pre-heated grill) until golden brown. Roughly chop the remaining two pears and place in a blender with two tablespoons of the poaching liquid and blend to a thick purée- adding more liquid if necessary. Heat a frying pan until hot, add the butter and cook until just nut brown then add the pear purée and heat through – the sauce should split. To serve, dip the outside of the panna cotta moulds into hot water for a few seconds, then gently turn out onto the centre of each serving plate. Place three doughnuts onto each plate and scatter the caramelised pear chunks around. Finish with a drizzle of the buttery pear purée and some mint leaves. ","ingredients":" 300ml\/10fl oz double cream,  1 vanilla pod, split in half lengthways and seeds scraped out,  100ml\/3½fl oz condensed milk,  2 gelatine leaves, soaked in water for at least five minutes,  350ml\/12fl oz buttermilk,  25ml\/1fl oz poire William,  250g\/9oz strong white flour,  pinch salt,  50g\/1¾oz caster sugar,  30g\/1oz butter, softened,  1 tsp fast-action yeast,  vegetable oil, for deep frying,  1 tsp ground ginger,  4 pears, peeled,  1 lemon, zest and juice,  150g\/5½oz caster sugar,  1 vanilla pod, split and seeded,  1-2 tbsp icing sugar, for dusting,  50g\/1¾oz butter,  4 tiny sprigs mint","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/buttermilk_and_poire_45307"}