{"recipe_name":"Buttermilk cream with rhubarb and rose petals","author":"Paul Rankin","programme":"Great British Menu","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First prepare the crystallised rose petals. Brush the rose petals lightly with the whisked egg white, then dust generously with the sifted caster sugar. Place on a tray and allow to dry overnight. Next make the hazelnut shortbread. Place all the shortbread ingredients in a chilled food processor bowl and process until it all just comes together - over-processing will cause the butter to start to melt. Tip out onto a clean work surface and, using the heel of your hand, quickly press together to make sure that all the ingredients are well mixed. Pat into a round, wrap tightly in clingfilm and chill for at least one hour.  Preheat the oven to 150C\/300F\/Gas 2. Roll out the chilled dough and cut into 24-36 rectangles that are just under 1cm\/½in thick. Transfer to a baking sheet and chill for at least 30 minutes. Bake the shortbread for 25-30 minutes. Ideally it should take little or no color. Allow to cool and set slightly before removing to a wire rack to finish cooling. Store in an airtight container. For the buttermilk creams, heat the double cream with the split vanilla pod. As soon as it comes to the boil, remove from the heat and add the condensed milk. Gently squeeze dry the gelatine leaves, then add to the hot cream, stirring gently until melted.  When the cream mixture has cooled to near body temperature, add the buttermilk. Strain through a fine sieve. Scrape the seeds from the vanilla pods and stir into the cream mixture. Carefully pour into 8-10cm\/3-4in moulds or ramekins. Allow to set in the fridge for at least four hours. Now, for the rhubarb, in a wide pan, bring the sugar, water, grenadine syrup and rosewater to the boil. Add the rhubarb and cook gently at a simmer for 2-3 minutes. Remove from the heat and allow to cool. To serve, dip the moulds into hot water for a few seconds, then gently turn out a buttermilk cream onto the centre of each cold plate. Surround with a spoonful of rhubarb and its sauce. Place two or three rose petals on top of the buttermilk cream and serve with the hazelnut shortbread. ","ingredients":" 30 organic rose petals,  3 free-range egg whites, lightly whisked,  caster sugar, sifted,  600g\/1lb 5oz plain flour,  200g\/7oz caster sugar,  150g\/5½oz hazelnuts, toasted and ground in a food processor,  450g\/1lb unsalted butter, chilled and cubed,  600ml\/1 pint double cream ,  2 vanilla pods, split lengthways and seeds scraped out,  200ml\/7fl oz condensed milk ,  4 thin gelatine leaves, soaked in cold water for at least 10 minutes,  700ml\/1¼ pints buttermilk, at room temperature,  150g\/5½oz sugar,  100ml\/3½fl oz water,  50ml\/2fl oz grenadine syrup,  2 tbsp rosewater,  500g\/1lb 2oz tender young rhubarb, cut thinly on a sharp angle","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/buttermilkcreamwithr_81983"}