{"recipe_name":"Butternut squash with Persian pistachio pesto, feta and pomegranate seeds","author":"Sabrina Ghayour","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/butternut_squash_with_55612_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6 and line a baking tray with baking parchment. For the butternut squash, rub each wedge of butternut squash with oil and season generously with sea salt and black pepper. Place on the lined baking tray. Roast the squash for about 45-50 minutes, just until the edges have begun to brown slightly (you want to blacken the edges a little to give them a nice chewy texture). Check the squash is cooked by inserting a knife - if it slides in easily the squash is cooked.  For the pesto, add the pistachios and cheese to a food processor. Pulse to break them into small pieces and add enough olive oil to slacken the mixture to your desired consistency (you may not need all the oil). Add all the herbs, the chilli (if using) and lemon juice. Pulse again to combine the herbs and add a little more olive oil. Season generously with sea salt and give the mixture one last pulse. Taste the pesto, to make sure it has enough salt and acidity, and allow it to rest in the fridge until you need it.  To serve, serve the butternut squash on plates, drizzled generously with the pesto. Crumble your feta over the top and scatter some pomegranate seeds over to finish.  ","ingredients":" 1 large butternut squash, quartered lengthways (skin-on) and seeds removed,  4 tbsp olive oil,  sea salt and freshly ground black pepper,  150g\/5½oz feta ,  100g\/3½oz pomegranate seeds,  100g\/3½oz shelled pistachio nuts,  70g\/2¼oz parmesan, chopped into rough chunks,  100ml\/3½fl oz olive oil ,  1 small bunch fresh coriander,  1 small bunch fresh parsley,  1 small bunch fresh dill,  1 hot red chilli or 1 tbsp chilli oil (optional),  1 lemon, juice only,  2 tsp sea salt","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/butternut_squash_with_55612"}