{"recipe_name":"Butternut squash and prawn curry with noodles","author":"John Torode","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a wok over a medium heat and add the red curry paste. Fry for two minutes, until fragrant, then add the palm sugar and cook for 4-5 minutes until the mixture is sticky and fragrant. Add the squash and sweet potato, stir well and cook for 2-3 minutes. Add the coconut milk, coconut cream, fish sauce and the lemongrass and bring to the boil. Reduce the heat to simmer for 20-30 minutes, until the squash and potato are tender but not mushy.  Add the lime pickle and king prawns and cook for a further 2-3 minutes, until the prawns are pink and cooked through. For the garnish, heat the oil in a wok over a low heat. Add the sliced chilli and cook slowly until all of the moisture from the chillies has evaporated (at which point the oil will stop bubbling), then turn up the heat slightly, so the chillies caramelise and crisp up. Remove the chilli slices with a slotted spoon and drain on kitchen paper. Repeat this cooking process with the sliced garlic and the shallots.  To serve, divide the noodles among four shallow bowls. Top with several spoonfuls of the curry, then sprinkle each bowl with a little of the bean shoots, coriander leaves and basil leaves. Garnish each dish with a pinch of each of the crisp fried chillies, garlic and shallots. ","ingredients":" 75ml\/3fl oz vegetable oil ,  50g\/2oz ready-made red curry paste from a jar,  15g\/2\/3oz palm sugar (available from Asian supermarkets),  1 medium butternut squash, peeled, seeds removed, cut into large chunks,  1 sweet potato, peeled, cut into large chunks ,  1 x 400ml\/14 fl oz can coconut milk,  90ml\/3½fl oz coconut cream,  ½ tbsp fish sauce (nam pla),  2 sticks lemongrass, crushed,  1 tbsp lime pickle from a jar (available from supermarkets and Asian supermarkets),  250g\/9oz raw king prawns, peeled and de-veined,  250g\/9oz pre-cooked Ming or egg noodles, cooked according to packet instructions,  55ml\/2fl oz vegetable oil,  50g\/2oz red chilli, thinly sliced,  50g\/2oz garlic, thinly sliced,  50g\/2oz shallots, thinly sliced,  50g\/2oz bean sprouts, picked and washed ,  small bunch coriander, leaves only ,  small bunch of basil, leaves only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/butternutsquashandpr_88913"}