{"recipe_name":"Apple and elderflower cobbler","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Place the apples, cordial and sugar in a large saucepan and mix together. Place the pan over a gentle heat to cook for 5-6 minutes, until the apples are just beginning to soften, but are still holding their shape. For the topping, place the flour, baking powder, salt, sugar and butter into a food processor and blend until the mixture resembles breadcrumbs. Add the buttermilk and pulse the mixture, until it comes together as a very thick batter. Transfer the apple mixture to an ovenproof dish, then spoon dollops of the cobbler batter on top. Sprinkle the cheese over the top and transfer to the oven to bake for 25 minutes, or until the top is crisp and golden. For the custard, place the milk and vanilla pod and seeds into a saucepan and heat to scalding point. Remove from the heat and allow to infuse for two minutes. Place the eggs and sugar into a clean bowl and whisk together. Gradually pour the hot milk onto the egg mixture, whisking constantly, then return the custard to the milk saucepan pan and place over a low heat. Simmer and stir until the custard thickens, then stir in the cream. To serve, spoon generous portions of the cobbler out into bowls and pour the custard over. ","ingredients":" 900g\/2lb apples, peeled, cut into wedges,  125ml\/4fl oz elderflower cordial,  150g\/5oz sugar,  225g\/8oz flour,  3 tsp baking powder,  pinch salt,  25g\/1oz demerara sugar ,  100g\/3½oz cold butter, cut into cubes,  175ml\/6fl oz buttermilk,  100g\/3½oz crumbled wensleydale cheese,  300ml\/10½fl oz milk,  1 vanilla pod, split, seeds scraped out,  4 free-range egg yolks,  30g\/1oz sugar,  100ml\/3½fl oz double cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/appleandelderflowerc_85238"}