{"recipe_name":"Café crème","author":"Raymond Blanc","programme":"Raymond Blanc's Kitchen Secrets","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sabayon and parfait, whisk the egg yolks and sugar together in a large heatproof bowl until pale and fluffy. Add the wine, then set the bowl over a pan of barely simmering water and continue to whisk for 3-4 minutes, or until the mixture is pale and has thickened (the temperature of the mixture should reach about 78-80C\/175F). Whisk in the soaked gelatine leaf until dissolved, then remove the bowl from the heat and whisk again. Add the cayenne pepper and lemon juice, to taste, then continue to whisk until the mixture has cooled slightly. Set aside until completely cool. Whisk one-third of the whipped cream into the cooled sabayon mixture, then carefully fold in the remaining cream until just combined. Chill the sabayon in the fridge for at least two hours, or up to 12 hours. Remove three-quarters of the chilled sabayon from the fridge and reserve the rest. Fold the coffee essence carefully into the sabayon until combined. Spoon the mixture into four 5cm\/2in dariole moulds, levelling the top with a palette knife (any extra can be spooned into a freezerproof container). Freeze for at least 3-4 hours or overnight, until solid. For the coffee cup and saucer, reserve 100g of the chocolate, then melt the rest of it in a bowl set over a pan of simmering water (do not let the bottom of the bowl touch the water). Using a sugar thermometer, heat until the chocolate is 55C then remove the chocolate from the pan, quickly stir in the reserved chopped chocolate and cool, stirring to disperse the heat. Place the bowl back over the pan of water and heat again until the thermometer reads 32-33C. Keeping the chocolate at a steady temperature, place a 7cm\/3in x 15cm\/6in piece of very clean acetate on to the work surface, and using a small palette knife, spread some chocolate onto the acetate, so that it's just 1-2mm thick. Take a 5cm\/2in wide piece of plastic pipe or ring mould and, place the chocolate lined acetate into each tube, chocolate side innermost. Pull the join apart slightly so it fits the pipe tightly. Using a little chocolate on your finger, cover over any gap in the join. Put the tubes onto a parchment-lined tray to set (NB: do not place in the fridge - this will make the chocolate bloom or whiten). Repeat with three more pieces of acetate to make four tubes. Lightly oil the back of a small saucer with a little vegetable oil, then take a large piece of cling film and set the saucer into the centre of the sheet. Lift up all four corners, then twist together, expelling any air and creases from the base of the plate. Check the temperature of the chocolate - it should be 32-33C. If necessary, place the bowl back over the pan of hot water to heat to the correct temperature. Holding the cling film as a tail, dip the base of the saucer lightly into the melted chocolate. Using the side of a finger, brush off any excess chocolate, so the coating is 2-3 mm thick. Wipe your finger around the edge of the saucer to create a lip - about 2mm in from the edge of the saucer.  Place the saucer cling film-side down onto the baking tray to set. Repeat the process with three more saucers (or more if you want, as some may break when trying to remove the cling film). To make the cup handles, take a small piping bag and fill it with the tempered chocolate (NB: before doing this check the temperature of the chocolate. If it's too cold, gently heat the bowl over a pan of hot water to return it to 32-33C). Line a baking tray with non-stick parchment. Pipe elaborate S shapes with the chocolate onto the tray, then pipe over them again to give double thickness. Repeat three more times (or more, in case of breakages). Place all the chocolate shapes aside for at least 5 hours to fully set. For the ganache 'sugar cubes', place the cream into a saucepan, bring to the boil then remove from the heat. Add the chocolate, stir well and return to a low heat until the chocolate is fully melted. Line a small square or rectangular tray with cling film. Pour the chocolate ganache into the tray then cover and place in the fridge. Leave to set for at least 6 hours, or until solid. Turn the ganache out of the tin and remove the cling film. Using a hot knife, cut into small cubes then drop into the demerara sugar and toss to coat on all sides. Carefully peel the cling film away from the china saucer. Heat a palette knife (if using hot water, make sure the knife is completely dry) and run it around the outside edge of the saucer to give a smooth finish. Place the saucer in the centre of the serving plate. Lift the chocolate tube out of the plastic tube and carefully peel away the acetate.  Heat a frying pan until hot, then very briefly hold the end of the chocolate tube onto the frying pan to melt slightly. Press the melted end of the cup into the centre of the chocolate saucer, pressing down lightly so they stick together. Take a chocolate handle and place the edge briefly onto the hot frying pan and the press lightly against the join on the cup, holding in place until stuck to the cup. To serve, dip a small sponge round into the cold coffee then place carefully into the bottom of the cup. Remove the moulds from the freezer and dip into hot water to loosen the parfait. Run a blunt knife around the inside of the mould, then insert a knife into the centre of the parfait to remove it from the mould, then carefully slide it into the cup.There should still be a gap of about 0.5cm\/¼in to the top of the cup. Carefully spoon the reserved sabayon onto the top of the parfait then swirl with caramel syrup. Place two chocolate ganache cubes on the edge of the saucer with a spoon alongside. Repeat the process with the remaining three cups and serve immediately. ","ingredients":" 8 free-range egg yolks,  100g\/3½oz caster sugar,  250ml\/9fl oz sweet, fruity dessert wine, such as Monbazillac or Beaume de Venice,  1 gelatine leaf, soaked in cold water for 10 minutes, squeezed dry,  small pinch cayenne pepper,  1-2 tsp freshly squeezed lemon juice,  200ml\/7fl oz whipping cream, whisked until soft peaks form when the whisk is removed,  50ml\/2fl oz coffee essence,  600g\/21¼oz dark chocolate (70 per cent cocoa), finely chopped,  1 tbsp vegetable oil,  300ml\/10½fl oz double or whipping cream,  300g\/10½oz dark chocolate (70 per cent cocoa), finely chopped ,  4-5 tbsp demerara sugar,  4 x 5cm\/2in diameter sponge cake rounds,  50ml\/1¾fl oz strong espresso coffee, cooled,  2 tbsp caramel syrup","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/caf_93703"}