{"recipe_name":"Cajun-style blackened salmon with spring onions, roasted sweetcorn, honeyed lemons and yoghurt dressing","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salmon, place all the spices and salt into a bowl and mix together.  Place the salmon on top of the spices and rub slightly to ensure all the spices have stuck to one side of the salmon.  Heat the olive oil in a small frying pan, add the whole unpeeled cloves of garlic and the salmon (spiced-side down) and roast for four minutes.  Flip over, remove the pan from the heat and leave to continue cooking slightly off the heat- until the salmon is cooked through. For the spring onions, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Put the flour in a large bowl with the salt and freshly ground black pepper and turmeric and slowly whisk in the water a little at a time until you have a thick batter. Stir in the chives.  Dip the spring onions into the batter and then gently lower into the hot oil. Deep fry for 3-4 minutes, or until golden and crisp. Remove with a slotted spoon and drain on kitchen paper. Sprinkle with a little sea salt. For the roasted sweetcorn, heat the oil in a frying pan. Scrape a sharp knife down the length of the corn cob to remove all the corn kernels. Put the corn kernels into the hot oil and fry for one minute. Set aside and keep warm. For the honeyed lemons, heat the olive oil in a frying pan, add the halved lemons cut-side down and roast for 3-4 minutes. Drizzle with the honey and roast for one minute. For the dressing, mix together all the dressing ingredients in a small bowl. To serve, place the spring onions onto a serving plate, top with the blackened salmon, pour over the dressing and then scatter the roasted corn over the top. Place the honeyed lemons on the side. ","ingredients":" pinch ground paprika,  pinch chilli powder,  pinch dried chilli flakes,  pinch cayenne pepper,  pinch sea salt,  150g\/5½oz salmon fillet, skin removed,  1 tbsp olive oil,  4 garlic cloves, unpeeled,  300ml\/12fl oz vegetable oil, for deep frying,  100g\/3½oz self-raising flour,  sea salt and freshly ground black pepper,  ½ tsp ground turmeric,  150ml\/¼ pint sparkling water,  3 tbsp chopped fresh chives,  4 spring onions, halved lengthways,  1 tbsp olive oil,  1 sweetcorn cob,  salt and freshly ground black pepper,  1 tbsp olive oil,  2 lemons, halved,  1 tbsp honey,  250g\/9oz Greek-style yoghurt,  3 tbsp honey,  salt and freshly ground black pepper,  2 spring onions, roughly chopped,  2 tsp balsamic vinegar,  small handful fresh parsley, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cajunstyleblackeneds_86210"}