{"recipe_name":"Cajun-style salmon with salmon crisps and Thai-style noodles","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Thai-style noodles, heat the vegetable oil in a wok or large frying pan and stir fry the garlic, chilli and broccoli for 2-3 minutes. Add the noodles, coriander, honey, lime juice and sesame oil and stir well. Remove from the heat and set aside to keep warm. For the Cajun-style salmon, place the spices into a pestle and mortar or spice grinder and grind until combined. Remove the skin from the salmon fillet, chop the skin into strips and set aside. Rub the spice mixture over the salmon fillet. Heat the oil in a frying pan and cook the salmon fillet for 4-5 minutes on each side, or until cooked through. Meanwhile, for the salmon crisps, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully place the salmon skin strips into the hot oil and deep fry until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. To serve, place the noodles onto a plate, top with the salmon fillet and sprinkle over the salmon crisps. ","ingredients":" 1 tbsp vegetable oil,  1 garlic clove, chopped,  ½ red chilli, finely chopped,  ½ head broccoli, cut into florets, blanched and drained,  100g\/3½oz medium egg noodles, cooked according to packet instructions and drained,  small handful fresh coriander, chopped,  2 tbsp clear honey,  2 limes, juice only,  1 tsp sesame oil,  2 black peppercorns,  ¼ tsp cumin seeds,  ¼ tsp coriander seeds,  ½ tsp paprika,  ¼ tsp cayenne pepper,  100g\/3½oz salmon fillet, skin on,  2 tsp vegetable oil,  vegetable oil, for deep frying,  salmon skin (see below)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cajunstylesalmonwith_85361"}