{"recipe_name":"Calves’ livers with Maderia sauce, mash and deep-fried onion rings","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Madeira sauce, heat the butter in a frying pan over a medium heat. When the butter is foaming add the shallots and fry for 2-3 minutes, or until just softened. Add the Madeira and thyme, stir well and bring to the boil. Simmer until the liquid has reduced in volume by a third. Add the jus and simmer gently for 15-20 minutes, or until the liquid has thickened. Add the sherry vinegar and chervil. Season with salt and pepper. Keep warm until ready to serve. For the mashed potato, boil the potatoes in salted water for 15 minutes, or until tender. Drain and place back into the pan over the heat to remove excess moisture. Mash the potatoes until smooth. Heat the butter and milk in a saucepan until the butter is melted. Add to the mash and beat well until soft and creamy. Season with salt and pepper. Place in a piping bag until needed and keep warm. For the onion rings, whisk the yeast and beer together in a bowl. Add the flour and whisk to a smooth batter. Set aside for 5 minutes.  Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Dip the onion rings in the batter then lower them carefully into the hot oil (you may need to do this in batches). When the onion rings are golden-brown, remove them from the oil using a slotted spoon and season with salt and pepper. Drain on kitchen roll. For the buttered kale, heat the butter in a frying pan. Add the kale leaves and 2 tablespoons water and cook until wilted down. For the calves’ liver, season the plain flour with salt and pepper. Coat the slices of calves liver in the flour and shake off any excess. Heat the butter in frying pan set over a medium heat. When the butter is foaming, fry the calves' liver for 1-2 minutes on each side, or until golden-brown on both sides. To serve, pipe the mash onto serving plates and put the liver alongside. Pour over the sauce and top with the buttered kale and onion rings. ","ingredients":" 50g\/1¾oz unsalted butter,  2 shallots, sliced,  100ml\/3½fl oz Madeira,  2 tsp chopped fresh thyme leaves,  300ml\/10fl oz beef or veal jus or gravy,  2 tbsp sherry vinegar,  2 tbsp chopped fresh chervil,  2kg\/4lb 8oz potatoes, peeled and quartered,  150g\/5½oz butter,  150ml\/5fl oz full-fat milk,  1 tsp fresh yeast,  400ml\/14fl oz beer,  200g\/7oz plain flour,  vegetable oil, for deep-frying,  2 small onions, finely sliced into rings,  50g\/1¾oz unsalted butter,  1 head kale, thinly sliced,  50g\/1¾oz plain flour, for dusting,  8 thin slices calves' liver,  50g\/1¾oz unsalted butter,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/calves_livers_with_00669"}