{"recipe_name":"Calypso pepperpot chicken with rice and peas","author":"Ainsley Harriott","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to the medium.   For the calypso chicken, place two teaspoons of the pepper sauce in a shallow non-metallic dish with the garlic, paprika, thyme, half the coriander, half a teaspoon of salt and two teaspoons of freshly ground black pepper. Add the oil and stir until well combined. Lightly slash each chicken breast and then rub in the pepper mixture until the chicken is well coated. Arrange the chicken breasts on the grill rack and cook for 8-10 minutes on each side OR until the chicken is cooked all the way through and lightly charred on the outside. Place the coconut cream and mango pieces in a pan and bring to the boil. Reduce the heat and simmer gently for about five minutes or until the mango is tender. Add the remaining teaspoon of pepper sauce, one tablespoon of chopped coriander and the lime juice to the mango mixture. Blend to a purée in a food processor or with a hand blender and season to taste with freshly ground black pepper. Transfer to a bowl. For the rice and peas, fry the onion in the oil and butter over a medium heat for two minutes then add the garlic and chilli and fry for another two minutes. Stir in the rice, thyme, and cinnamon stick (if using) until everything is well coated in the oil. Pour in the kidney beans or peas, add the grated creamed coconut and stir until the coconut has dissolved and the mixture is creamy. Stir in the hot water with half a teaspoon of salt, bring to the boil, cover and cook over a low heat for 25-30 minutes. Remove from the heat and set aside, undisturbed, for five minutes. Remove the thyme and cinnamon and discard.  Season the rice and peas to taste with salt and freshly ground black pepper and serve with the chicken. ","ingredients":" 3 tsp West Indian hot pepper sauce or Tabasco sauce,  2 garlic cloves, crushed,  1 tsp paprika ,  1 tsp dried thyme ,  2 tbsp chopped fresh coriander, plus sprigs for the garnish ,  3 tbsp olive oil,  4 boneless, skinless chicken breasts ,  200ml\/7fl oz carton coconut cream,  1 small ripe mango, peeled, stoned and diced (about 175g\/6oz in total),  ½ lime, juice only,  1 onion or 3 spring onions, finely chopped,  1 tbsp sunflower oil,  25g\/1oz butter,  2 garlic cloves, finely chopped,  1 red finger chilli, seeded and very finely chopped ,  450g\/1lb long grain rice,  2 sprigs fresh thyme ,  7.5cm\/3in cinnamon stick (optional),  400g\/14oz can red eye kidney beans, black-eyed peas or pigeon peas, rinsed and drained,  125g\/5oz creamed coconut, coarsely grated,  1 litre\/1¾pints hot water,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/calypsopepperpotchic_79922"}