{"recipe_name":"Camembert and quince flatbreads","author":"Paul Hollywood","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Makes 16 small flatbreads","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the flour, salt and yeast in a large free-standing electric mixer with a dough hook attachment. Start the machine running on low speed while you gradually pour in three-quarters of the water. Leave to mix for a minute, then add the rest of the water. Turn the mixer speed up to medium-high and leave to mix for about seven minutes to make a shiny, smooth dough. Alternatively, mix together the dry ingredients in a large mixing bowl, then gradually work in three-quarters of the water with your hand. Give the dough a good mix for a couple of minutes, then knead on a lightly floured worktop for about 10 minutes until the dough is shiny and smooth. Tear or cut the cheese into small pieces and break up the quince jelly. Add to the dough and gently incorporate by hand, mixing the cheese and jelly evenly into the dough.  Place the dough in an oiled bowl and turn to coat with oil, then cover with cling film and leave to rise at room temperature for an hour or until doubled in size. Tip out the risen dough onto a lightly floured worktop and knock back. Divide the dough into 16 portions. Roll each portion of dough into a ball, then roll out each ball with a floured rolling pin to a rough disc about 12.5cm\/5in wide. Heat a heavy frying pan over a high heat. Very lightly oil the pan by wiping it with an oiled piece of kitchen paper. Cook the discs of dough, one at a time, for about two minutes on each side, until they are golden brown all over.  Keep the flatbreads warm by wrapping them in a tea towel while you cook the remaining dough. These are best eaten warm. ","ingredients":" 500g\/1lb 2oz strong white bread flour,  10g\/½oz salt,  1 x 7g sachet fast-action dried yeast,  320ml\/11fl oz lukewarm water,  200g\/7oz Camembert,  150g\/5½oz quince paste (membrillo),  flavourless oil, for oiling the pan","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/camembert_and_quince_70872"}