{"recipe_name":"Cannelloni of Devon crab with olive oil sauce","author":"Alain Roux","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pasta dough, put the flour, salt and egg yolks in the bowl of a food processor.  Pulse until the mixture begins to resemble fine breadcrumbs.   Remove the dough from the bowl and knead to form into a ball.  With the heel of your hand, knead it four or five times, then wrap in cling film and refrigerate for at least 30 minutes.  Using a pasta machine, roll the dough, starting on the widest setting and roll it through repeatedly, narrowing the setting by one notch each time, until the sheet of dough is 1.5 mm thick.   On half the sheet, spread and scatter the small basil leaves.  Fold the plain half over to cover them. Press down gently with the palms of your hands.   Roll the dough back to 1.5 mm thick then cut into four rectangles 8x15cm\/3x6in. Cook in gently simmering salted water with the olive oil for approximately 3-4 minutes. Refresh in cold water, drain and place the sheets flat on a tray and cover with cling film. Reserve in the fridge. For the crab filling crush the peppercorns with the side of the blade of a chopping knife.  Put them in a bowl, add the crab, the olive oil, the lime juice and season to taste. For crab coral purée, pass the coral through a fine sieve.  Add the mascarpone, whisk together, season and warm through just before serving. For virgin olive oil sauce, peel, deseed and cut the tomatoes into small diamond shapes and place in a saucepan with all the other ingredients.  Mix gently and season to taste.  Warm the sauce slightly just before serving. To serve, garnish each cooked rectangular sheet of pasta with the crab filling.  Roll tightly and reheat in a steamer for 3-4 minutes.  Cook the asparagus slices at the same time in the steamer.  In a warm plate, spoon on some crab coral purée (if using). Place on top a warm cannelloni.   Pour the sauce over and around then garnish with the asparagus slices and rocket leaves and serve. ","ingredients":" 125g\/4½oz 00 flour and extra to dust,  2 pinches salt,  4 free-range eggs, yolks only,  20 small basil leaves,  1 tbsp olive oil,  1 tsp green peppercorns, in brine,  200g\/7oz cooked crab meat,  2 tbsp extra virgin olive oil,  ½ lime, juice only,  salt and freshly ground black pepper,  60g\/2¼oz crab coral,  60g\/2¼oz mascarpone,  salt and freshly ground black pepper,  2 ripe plum tomatoes,  40ml\/1¾fl oz extra virgin olive oil,  ¼ lemon, juice only,  1 tbsp chopped basil leaves,  12 coriander seeds, crushed,  salt and freshly ground black pepper,  4 large green asparagus spears approximately 12cm\/5in long, sliced at 2mm thickness with a mandoline (vegetable slicer),  2 bunches rocket salad leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cannelloni_of_devon_crab_51109"}