{"recipe_name":"Cantonese-style duck, special fried rice and wilted spinach","author":"Gary Rhodes","programme":"Take on the Takeaway","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. For the Cantonese-style sauce, heat the oil in a frying pan until hot, add the ginger and stir fry for one minute, then add the garlic. Reduce the heat and cook gently for five minutes, then transfer to a dish and set aside.  Place the pan used for the garlic and ginger back over a medium heat and place the two duck breasts into the pan, skin-side down - there's no need to add any extra oil, as the duck breasts will cook in their own fat. Cook until golden-brown on both sides, then place onto a baking sheet. Transfer to the oven and roast for ten minutes, or until cooked through. Remove from the oven and pour the duck fat from the baking sheet into a dish - this will keep for a week in the fridge and can be used for roasting potatoes. Set the duck breasts aside in a warm place.  Return the garlic and ginger to the pan the duck was cooked in, add the orange zest and place on a medium heat. Add the water and half a stock cube to the pan, stir well and bring to the boil. Add the cider vinegar, honey and a dash of soy sauce, reduce the heat and simmer gently for five minutes. Add the lime juice, season, to taste, with salt and freshly ground black pepper and stir. For the special fried rice, heat the butter in a wok or frying pan over a medium heat until it begins to bubble. Add the mushrooms and stir fry for 2-3 minutes, then add the spring onions and stir fry for a minute. Add the defrosted peas and stir to heat through for a minute. Finally add the drained rice and a squeeze of lime juice, season, to taste, with salt and freshly ground black pepper and mix well.  For the wilted spinach, heat the butter in a pan over a medium heat, add the spinach and cook for two minutes, stirring occasionally - there is no need to add water as the spinach releases water during cooking. Season, to taste, with salt and freshly ground black pepper  To serve, cut the duck breasts into slices and divide between two serving plates. Drizzle over the sauce and serve with the special fried rice and spinach. ","ingredients":" 2 tsp vegetable oil,  2.5cm\/1in piece fresh ginger, grated or finely chopped,  1 garlic clove, crushed or finely chopped,  2 organic duck breasts, skin on,  3 strips orange zest (all pith removed),  4 tbsp water,  ½ chicken stock cube,  2 tsp cider vinegar,  1 tbsp honey,  dash soy sauce,  ½ lime, juice only,  salt and freshly ground black pepper ,  knob of butter,  100g\/4oz mushrooms, cleaned and sliced,  handful spring onions, chopped,  handful frozen peas, defrosted,  100g\/4oz white rice, cooked according to packet instructions and drained,  squeeze lime juice,  salt and freshly ground black pepper ,  knob of butter,  1 x 200g\/7oz bag spinach, washed,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cantonesestyleducksp_86375"}