{"recipe_name":"Cappuccino pavlova","author":"Nigella Lawson","programme":"Nigellissima","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":null,"pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/cappucino_pavlova_09523_16x9.jpg","method":"Preheat the oven to 180C\/375F\/Gas 4 and line a flat oven tray with baking parchment and – if it helps – using a 23cm\/9in cake tin as a guide – draw a circle on it with a pencil. In a smallish bowl, mix the sugar with the instant espresso powder, and set aside for the moment. In a clean, grease-free bowl, preferably metal (and wipe the inside with a piece of kitchen roll dipped in vinegar first, if you want) whisk the egg whites with a pinch of salt until they are holding soft peaks and keep whisking while you gradually add the sugar-coffee mixture, one tablespoon at a time. When all this mixture is incorporated and you have a firm, gleaming, écru-coloured meringue, fold in – using a grease-free metal spoon – the cornflour and vinegar. Dollop large spoonfuls of the meringue mixture inside the drawn circle (or make a circle shape freehand if you prefer) on the baking parchment and smooth and shape it with a spatula so that it looks rather like the crown of a straw boater: it must be flat on top. Put this in the oven and immediately turn the oven down to 150C\/300F\/Gas 2, and cook for one hour. The meringue’s outer shell should be crisp, but only just. When it’s ready, turn off the oven and leave the Pavlova base inside it until cool or overnight. Once the pavlova base is cool, lift it carefully in its paper and place it, top-side down on a large flat plate, then gently peel off the paper. Whip the double cream until thickened and airy, but still soft, and spread this delicately over the top (which previously was the bottom!) of the meringue. With a teaspoon, push the cocoa powder through a fine sieve or tea strainer to decorate – cappuccino-style – the top. ","ingredients":" 250g\/9oz caster sugar,  4 tsp instant espresso powder (not instant coffee granules),  4 free-range egg whites,  pinch salt,  2 tsp cornflour,  1 tsp white wine vinegar,  300ml\/10fl oz double cream,  1 tsp cocoa powder","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cappucino_pavlova_09523"}