{"recipe_name":"Caramelised steamed apple pudding","author":"Galton Blackiston","programme":"Put Your Money Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Lightly grease a 1.5 litre\/12¾fl oz pudding basin with butter. For the butterscotch sauce, melt the butter, sugar and vanilla extract in a pan over a medium heat, stirring well to combine. Continue to heat until the mixture has caramelised.  Add the cream and stir until the mixture is smooth. Bring the mixture to a simmer and continue to simmer until the volume of liquid has reduced slightly. Remove the pan from the heat and set aside to cool completely. For the apples, heat the butter in a separate frying pan over a medium heat. When the butter is foaming, add the apple pieces and fry for 3-4 minutes, or until just tender and starting to caramelise. Set aside to cool slightly.   For the sponge, in a bowl, beat together the butter and sugar until pale and fluffy.   Gradually add the beaten eggs, a little at a time, beating well to incorporate each addition of egg before adding the next.  When all of the eggs have been well combined into the mixture, carefully mix in the flour until well combined.   Sprinkle the caramelised apples into the bottom of the prepared pudding basin. Pour over three quarters of the cooled butterscotch sauce (reserve the remaining sauce). Spoon over the sponge batter in an even layer.  Cover the pudding basin with a pleated sheet of baking parchment, then wrap it in aluminium foil and secure with string.   Place the bowl into a large pan and add enough boiling water so that the water reaches halfway up the sides of the basin. Cover the pan with a lid and steam for at least 1½ hours, topping the pan up with more boiling water as necessary.   Meanwhile, for the crème anglaise, bring the cream, milk and vanilla pod and seeds to the boil in a pan. Remove from the heat and set aside for 15 minutes to infuse. After 15 minutes, discard the vanilla pod (it can be rinsed and re-used in another recipe).  In a bowl, mix together the eggs and sugar until pale and well combined. Pour over the milk and cream mixture over the egg and sugar mixture, whisking continuously until the mixture is well combined.  Strain the mixture through a sieve into a clean pan and place the sieved liquid over a low heat. Heat, stirring continuously, until the crème anglaise mixture is thick enough to coat the back of a spoon. Remove from the heat and place into a bowl of cold water to prevent it from thickening further.  To serve, turn out the steamed apple pudding onto a serving plate and cut it into slices. Place one slice into the centre of each of four serving plates. Drizzle over the remaining butterscotch sauce and the crème anglaise. ","ingredients":" 125g\/4½oz unsalted butter,  175g\/6¼oz light muscovado sugar,  1 tsp vanilla extract,  200ml\/4½fl oz double cream,  25g\/1oz unsalted butter, plus extra for greasing,  3 large eating apples, peeled, cores removed, roughly chopped ,  150g\/5oz unsalted butter ,  130g\/4½oz light soft brown sugar,  3 free-range eggs, beaten,  150g\/5¼oz self-raising flour,  150ml\/5¼fl oz full-fat milk,  275ml\/9¾fl oz double cream,  1 vanilla pod, split, seeds scraped out with a knife,  6 free-range egg yolks,  110g\/4oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/caramelisedsteamedap_91186"}