{"recipe_name":"Abundant steamed sea bass and seasonal clams with sizzling oil","author":"Ching-He Huang","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the goji berry and swede pickle, in a small pan, parboil the cubes of swede. Drain and place on a plate to chill in the fridge for 10 minutes. Place the goji berries in a heatproof bowl, pour over boiling water, leave it for one minute and then rinse and drain. In a small bowl, toss together the chilled swede and goji berries. Before serving add all the rest of the ingredients and mix well for a quick delicious pickle to serve with the fish.  For the sea bass, prepare the fish by rinsing it under cold running water and pat dry with paper towels. Cut two slits into both sides of the fish and season with salt and white pepper.  Stuff the slits and inside the belly cavity with the sliced ginger.  Place the fish on a heatproof plate (making sure that the plate and fish fit inside the bamboo steamer without covering up all of the steam holes around the edges of the plate). Set aside another bamboo steamer tray and plate to use for the clams. Pour half of the light Chinese lager over the fish. Place the plate of fish in a bamboo steamer, stack and cover with the lid.  Place the whole steamer basket over a wok that is three-quarters full with boiling water, making sure the water does not touch the base of the steamer.  Steam until the fish is cooked through and the flesh flakes when poked with a knife - about 8-10 minutes (depending on the thickness of the fish. Don’t steam it too long or the skin will separate, not look as good and will be less tender).  About four minutes into steaming, put the palourde clams on a separate heatproof plate that fits inside another bamboo steamer tray. Season with salt, ground white pepper, grated ginger, and drizzle over the remaining light Chinese lager. Steam the clams with the fish until the flesh of the fish flakes when poked and all the shells of the clams have opened.   Once the sea bass is cooked through, turn off the heat. Leave the sea bass in the steamer to stay hot.  To finish the sea bass, heat a small wok, add the peanut oil and heat to high for a minute. Take off the heat. Remove the lid of the bamboo steamer for the fish and place the spring onions and coriander cress over the top. Pour over the low-sodium light soy sauce, followed by the toasted sesame oil. Pour over the hot peanut oil and it will create a sizzle as it heats up the spring onions and herbs.  In the traditional Chinese way the fish is served whole in the steamer at the table because it symbolises unity and completeness, but you can also serve individual portions for a more modern presentation. To serve, spoon a fillet of the sea bass onto a warm plate, decorate with some palourde clams, the goji berry and swede quick ‘pickle’, blanched baby pak choi leaves, spring onion curls and the coriander micro herbs. Spoon the fish juices over the fish and clams and serve immediately.  ","ingredients":" 1 purple or yellow swede, peeled and sliced into 1cm\/½in cubes ,  2 tbsp dried goji berries,  2 tbsp mirin,  2 tbsp rice vinegar,  2 pinches cracked sea salt ,  2 pinches caster sugar ,  1 large whole sea bass (about 460g\/1lb), cleaned and scaled, head and tail on ,  sea salt and freshly ground white pepper,  2.5cm\/1in piece fresh ginger, peeled and finely sliced, plus 1 tbsp grated ginger,  4 tbsp light Chinese lager ,  100g\/3½oz palourde clams, shells washed (discard any clams that don’t close when tapped),  3 tbsp peanut oil,  2 spring onions, sliced into long ‘horse ears’ on a sharp angle,  few pinches coriander cress,  2-3 tbsp low-sodium light soy sauce ,  2 tbsp toasted sesame oil,  blanched baby pak choi halves ,  spring onion curls ,  coriander micro herbs ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/abundant_steamed_sea_22932"}