{"recipe_name":"Apple and thyme tarte tatin with honeycomb and walnut ice cream","author":"James Martin","programme":"Sweet Baby James","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the honeycomb, place the sugar, honey, glucose and water into a heavy-based pan, insert a sugar thermometer and bring to the boil. Meanwhile, lightly grease a baking sheet. When the mixture reaches 160C\/325F, which is a light caramel, remove from the heat. Add the bicarbonate of soda and stir in quickly, then immediately pour the mixture onto the greased baking sheet - it will start to bubble up straightaway. Leave to cool. When the honeycomb has cooled completely, break it up into small pieces - you will have plenty leftover for you to eat. For the ice cream, place the whipped cream into a large bowl and fold in the honey and walnuts and about two large handfuls of the broken honeycomb. Pour the mixture into a container and place into the freezer to set for about 15 minutes. Preheat the oven to 200C\/400F\/Gas 6. For the tarte tatin, place the sugar into an ovenproof pan (approx 20cm\/8in) and heat gently without stirring until it turns golden-brown. Remove from the heat, add the butter and stir in gently.   Place the puff pastry onto a lightly floured surface and cut out a circle slightly larger than the pan.   Place the apples peeled-side down into the pan with the caramel and sprinkle with the fresh thyme leaves. Cover the apples and caramel mixture with the pastry and tuck the edges down the side of the pan.   Transfer to the oven and bake for 20-25 minutes, or until the pastry is golden-brown. Remove the pan from the oven and leave to rest for a minute before turning it out. To do this, place a plate on top of the pan and invert so that the tart slips out, pastry to the base, apples on top.   Serve the tarte tatin warm with a scoop of the honeycomb and walnut ice cream. ","ingredients":" 350g\/12oz caster sugar,  2 tbsp liquid glucose (available from some supermarkets and online shops),  100ml\/3½fl oz clear honey,  100ml\/3½fl oz water,  oil, for greasing,  1½ tsp bicarbonate of soda,  200ml\/7fl oz double cream, whipped until soft peaks form when the whisk is removed,  1 tbsp clear honey,  50g\/2oz walnuts, shells removed, chopped,  150g\/5oz caster sugar,  25g\/1oz butter,  flour, for dusting,  375g\/13oz ready-rolled puff pastry,  8 Golden Delicious apples, peeled, cored and cut into quarters,  2 sprigs fresh thyme, leaves only","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/appleandthymetarteta_86367"}