{"recipe_name":"Cauliflower and chorizo risotto with seared squid","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a frying pan until hot, add the chorizo and cook over a medium heat until the oils are released and the chorizo is just crisp. Add half the butter and the olive oil, onion and garlic and fry for 2-3 minutes, or until softened.  Add the risotto rice and stir together until well coated in the pan juices. Cook for 1-2 minutes, or until the rice grains start to turn translucent. Add the wine and cook for 3-4 minutes, or until nearly all of the liquid has evaporated.  Add a ladleful of the chicken stock to the pan and stir well. Cook for 1-2 minutes, or until nearly all of the stock has been absorbed, then add another ladleful of the stock. Repeat the process until the rice is cooked but still al dente. Add the cauliflower during the last five minutes of cooking. Stir in the parmesan and season, to taste, with salt and freshly ground black pepper.  Heat a frying pan until hot, add the remaining butter and squid and cook over a high heat for 1-2 minutes until golden brown and just cooked. Season with salt and black pepper and finish with a squeeze of lemon. To serve, spoon the risotto into serving bowls, top with the squid and a scattering of cress. ","ingredients":" 200g\/7oz chorizo, finely diced,  50g\/2oz butter,  2 tbsp olive oil,  1 onion, finely chopped,  1 garlic clove, finely chopped,  250g\/9oz Arborio rice, or other Italian risotto rice,  150ml\/5fl oz dry white wine,  1 litre\/1 pint 15fl oz chicken stock,  1 head cauliflower, cut into small florets,  25g\/1oz parmesan cheese, grated,  3 medium squid, cleaned, cut into triangles,  ½ lemon, juice only,  4 tbsp parsley cress,  4 tbsp red amaranth cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cauliflower_and_chorizo_45104"}