{"recipe_name":"Cauliflower and kale hash with fried egg and hollandaise","author":"Donal Skehan","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cauliflower and kale hash, heat a small lidded frying pan over a high heat, add the oil and fry the onion and cauliflower for 3 minutes stirring very little until lightly charred. Stir in the garlic, kale, paprika and cayenne pepper. When the kale is slightly wilted, add 3 tablespoons water and cover, cooking for 3–4 minutes until the kale and cauliflower is tender. Season with sea salt and stir in the parsley. To make the hollandaise sauce, put the egg yolks in a large heatproof bowl over a pan of gently simmering water (making sure the bowl does not touch the water). Whisk the yolks and slowly add the butter, waiting until each piece melts before adding the next, whisking continuously until it is completely combined and the sauce has thickened. Add the lemon juice and stir through. Turn off the heat, but keep the sauce warm over the pan of water.  For the fried eggs, heat the oil in a frying pan until hot and sizzling. Crack in the eggs. After a minute, baste the egg by tilting the pan and spooning up some of the oil, pouring it over the egg. Baste every minute or so, and cook the egg until it is done to your liking. To serve, spoon the hash on to two serving plates and top with a fried egg, a generous dollop of hollandaise sauce and a sprinkle of chives. ","ingredients":" 1 tbsp olive oil,  1 onion, roughly chopped,  400g\/14oz cauliflower, chopped into small bite-size pieces,  1 garlic clove, finely chopped,  2 small handfuls of kale, stems removed, roughly chopped,  1 tsp smoked paprika,  ½ tsp cayenne pepper,  small handful parsley, roughly chopped,  pinch sea salt,  2 large free-range egg yolks,  150g\/5½oz butter, cold, cut into cubes,  ½ lemon, juice only,  4 tbsp sunflower oil,  2 large free-range eggs,  small handful of chives, finely chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cauliflower_and_kale_38572"}