{"recipe_name":"Cauliflower salad with barbecue chicken and honey","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/cauliflower_salad_with_90691_16x9.jpg","method":"Thirty minutes before you want to eat, prepare your barbecue: allow the flames to flare up and die down until the coals are just glowing.  Meanwhile, rub the chicken-breast pieces in half of the oil and season, to taste, with salt and freshly ground black pepper. Add half of the thyme leaves and mix well. When the barbecue is ready, place the chicken pieces, skin-side down, onto the barbecue and grill for 8-10 minutes on each side, or until golden-brown and cooked through. (The chicken is cooked through if the juices run clear when a skewer is inserted into the centre of the meat.) Place the tomato halves, cut-side down, on a sheet of aluminium foil. Fold up the edges of the foil to make a tray, then drizzle over the remaining oil and the honey. Sprinkle over the remaining thyme and season, to taste, with salt and freshly ground black pepper. Place the foil tray on the barbecue grill, alongside the chicken, and grill for 12-15 minutes, or until the tomatoes have softened and blackened slightly. Meanwhile, blend the cauliflower florets to crumbs in a food processor, then transfer to a large bowl.  Heat a frying pan over a medium heat. When hot, add the maple syrup, vinegar and curry powder, stir well, and cook for 1-2 minutes, or until heated through. Add the maple syrup mixture to the cauliflower, then add the pistachios, almonds, spring onions and herbs and stir until well combined. Season, to taste, with salt and freshly ground black pepper. To serve, pile the cauliflower salad onto a large serving platter and top with the barbecued chicken pieces and the grilled tomatoes. Drizzle over the juices left in the tomato tray. ","ingredients":" 4 chicken breasts, cut in half lengthways,  2 tbsp olive oil,  8 sprigs fresh thyme, leaves only,  4 ripe tomatoes, cut in half horizontally,  3 tbsp clear honey,  1 large cauliflower, core removed, broken into florets,  250ml\/9fl oz maple syrup,  6 tbsp white wine vinegar,  1 heaped tsp curry powder,  75g\/2½oz shelled pistachio nuts, roughly chopped,  75g\/2½oz toasted flaked almonds,  4 spring onions, trimmed, sliced,  3 tbsp chopped fresh mint leaves,  3 tbsp chopped fresh coriander leaves,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cauliflower_salad_with_90691"}