{"recipe_name":"Cauliflower soup with Stilton choux","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the soup, heat a large pan until hot. Add the butter, onion and garlic and sauté for two minutes, or until just softened. Add the cauliflower and vegetable stock and bring to the boil. Reduce the heat and simmer for 4-6 minutes, or until the cauliflower is tender. Cool slightly, then place the mixture in a food blender and blitz to a purée. Return to the saucepan and add 200ml\/7fl oz of the cream. Season with salt and freshly ground black pepper and return to the boil.  Simmer for a minute, then keep warm until ready to serve. For the stilton cheese choux, heat a deep fat fryer to 190C\/375F. Place the water and butter in a saucepan and bring to a rolling boil for a minute. Remove from the heat and add the flour in one go – beating well until the mixture is smooth and comes away from the sides of the pan. Return to the heat for a minute or two to cook through. Remove from the heat again and add the eggs, one at a time, beating well between the addition of each egg. Add the blue cheese and mix well. Season with salt and freshly ground black pepper. Drop teaspoonfuls of the batter into the fryer and fry for 2-3 minutes, or until golden-brown and crisp (you may need to do this in batches). Drain onto kitchen paper and season with a little salt. To serve, ladle the soup into bowls and place a few of the Stilton cheese choux on top. Drizzle over the balsamic vinegar, the remaining double cream and olive oil. Finish with a scattering of coriander cress. ","ingredients":" 50g\/1¾oz butter,  1 onion, finely chopped,  1 garlic clove, finely chopped,  800g\/1lb 12oz cauliflower florets, roughly chopped,  1 litre\/1¾ pint vegetable stock,  250ml\/9fl oz double cream,  2 tbsp reduced balsamic vinegar (or regular balsamic vinegar),  2 tbsp extra virgin olive oil,  2 tbsp coriander cress,  125ml\/4fl oz water,  50g\/1¾oz butter, diced,  75g\/2¾oz plain flour,  2 free-range eggs,  75g\/2¾oz Stilton, crumbled","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cauliflower_soup_with_39115"}