{"recipe_name":"Mary Berry's classic fruit cake","author":"Mary Berry","programme":null,"prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the currants, sultanas, raisins, rinsed, dried and quartered cherries, snipped apricots and chopped mixed peel in a large bowl. Stir in the brandy, cover the bowl and leave in a cool place overnight. Lightly grease a 23cm\/9 in deep round cake tin. Cut a strip of non-stick baking parchment to fit twice around the sides of the tin, fold the bottom edge of the strip up by about 2.5cm\/1 in creasing it firmly, then open out the fold and cut slanting lines into this narrow strip at intervals. Put a circle of non-stick baking parchment into the base of the tin, lightly grease the outer edge and then fit the prepared strip of parchment with the snipped edge in the base of the tin to line the sides of the tin. Place a second circle of non-stick baking parchment in to cover the cut part of the paper. Preheat the oven to 140C\/275F\/Gas 1. Put the flour, grated nutmeg, mixed spice, butter, sugar, eggs, chopped almonds, black treacle and the citrus zest into a large bowl and beat well to mix thoroughly. Fold in the soaked fruits. Spoon the mixture into the prepared cake tin and spread out evenly with the back of a spoon. Decorate the top with the whole blanched almonds and glacé cherries, pushing them lightly into the top of the cake mixture. Cover the top of the cake loosely with a double layer of greaseproof paper. Bake in the pre-heated oven for about 4¼-4 ¾ hours, or until the cake feels firm to the touch and a skewer inserted into the centre comes out clean. Allow the cake to cool in the tin. When cool, pierce the cake at intervals with a fine skewer and 'feed' with a little splash of brandy. Once the cake is completely cold, leave the lining paper on the cake, wrap in a double layer of greaseproof paper and again in foil. Store in a cool, dry place for up to three months, feeding at intervals with more brandy. ","ingredients":" 350g\/12oz currants,  225g\/8oz sultanas,  225g\/8oz raisins,  175g\/6oz glacé cherries, rinsed, dried and quartered,  175g\/6oz ready-to-eat dried apricots, snipped into pieces,  75g\/3oz mixed candied peel, finely chopped,  4 tbsp brandy, plus extra brandy for 'feeding' the cake,  275g\/10 oz plain flour,  ½ tsp grated nutmeg,  ¾ tsp ground mixed spice,  400g\/14oz butter, softened,  400g\/14oz dark muscovado sugar,  5 free-range eggs,  65g\/2½oz whole almonds, chopped (skins left on),  1 tbsp black treacle,  1 lemon, grated zest only,   1 orange, grated zest only,  whole blanched almonds,  glacé cherries, rinsed, dried and halved","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/celebration_cake_61952"}