{"recipe_name":"Chai-spiced ginger and date tea loaf","author":"Kimberley Wilson","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dates, in a small saucepan bring 150ml\/5fl oz of water to the boil. Add the tea and boil for a minute. Strain the tea into a bowl and add the chopped dates. Set aside for ten minutes and then drain the dates using a sieve. Grease and line a 20cm\/8in, round, loose-bottomed spring-form cake tin. For the dough, melt the butter in a small pan and warm the milk in a separate pan. In a bowl, combine the warm milk, butter, sugar and eggs. Stir in the yeast until thoroughly mixed. Set aside for five minutes.  Put the flour and salt in the bowl of a free-standing mixer fixed with a dough hook. Add the yeast mixture, drained dates and chopped stem ginger and mix to a soft, smooth and shiny dough.  For the spice blend, while the dough is mixing, crush the green and black cardamom seeds with the black pepper and star anise in a small pestle and mortar. Transfer to a small bowl and combine with the butter, jaggery (or palm sugar), cinnamon, ginger and vanilla paste to make a spreadable spiced butter. Set aside. When the dough is ready, roll it quite thin and at least 60cm\/23½in long. With your fingers or the back of a spoon, spread the spiced butter all over the top of the dough. Roll up, quite tightly, from the long side, like a Swiss roll.  Cut into 3 x 20cm\/8in long pieces and arrange them vertically on the counter. Plait the pieces in a simple three-braid plait. Carefully lift the plait and arrange it in a circle around the inside of the prepared cake tin. There may be a little gap in the centre but this will fill in as the bread proves. Cover the top of the tin with cling film and place in a warm place to prove for one hour.  Preheat the oven to 180C\/fan oven 160C\/350F\/Gas 4. Place the tin in the oven and bake for about 35 minutes, or until golden-brown. While it is still hot, brush the top generously with the ginger syrup. Allow to cool in the tin for 10 minutes before sliding a butter knife around the edge of the tin to release it.  Remove the baking paper and leave on a cooling rack until completely cool. ","ingredients":" 1 tbsp chai tea,  100g\/3½oz chopped dates,  60g\/2¼oz unsalted butter, plus extra for greasing ,  135ml\/4½fl oz full-fat milk, preferably organic,  60g\/2¼oz soft dark brown sugar,  2 large free-range eggs, beaten,  15g\/½oz fast-action dried yeast,  450g\/1lb strong white flour,  pinch salt,  50g\/1¾oz stem ginger in syrup, chopped, plus 2-3 tbsp syrup from the stem ginger for the glaze,  1 tbsp green cardamom pods, seeds only,  3 black cardamom pods, seeds only,  pinch black peppercorns,  1 whole star anise pods,  50g\/1¾oz unsalted butter ,  50g\/1¾oz jaggery (or palm sugar),  1 tbsp ground cinnamon,  1 tsp ground ginger,  1 tbsp vanilla bean paste","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chai-spiced_ginger_and_38256"}