{"recipe_name":"Apple, cinnamon and chestnut tart with a marshmallow sauce","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1-2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the topping, carefully melt the sugar in an ovenproof frying pan over a low heat (do not stir). When the sugar crystals have dissolved and it turns golden-brown, add the chestnuts, apple slices and cinnamon. Stir to coat, add the Kirsch and cook for one minute. For the pastry, place the flour, baking powder and salt into a food processor with the butter and sugar and blend until the mixture resembles breadcrumbs. Add the milk and blend until the mixture forms a smooth dough.  Turn out the dough onto a floured surface and roll out to the thickness of a pound coin. Cut a circle of pastry the same size as the frying pan and place over the caramelised chestnuts and apple slices in the pan. Push down the edges to seal. Place in the oven and bake for 15 minutes, or until the pastry is golden-brown. Run a knife round the inside of the pan and turn out onto a serving plate. For the sauce, melt the marshmallows with the cream in a small saucepan. To serve, slice the tart into pieces and place on two serving plates. Drizzle over the warm marshmallow sauce and serve immediately. ","ingredients":" 200g\/7oz caster sugar,  150g\/5½oz roasted chestnuts in syrup, drained,  1 apple, sliced,  pinch ground cinnamon,  1 tbsp Kirsch liqueur,  225g\/8oz self-raising flour, plus extra for dusting,  1 tsp baking powder,  ½ tsp salt,  55g\/2oz butter,  30g\/1oz caster sugar,  150ml\/¼ pint whole milk,  small handful marshmallows,  250ml\/9fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/applecinnamonandflam_87408"}