{"recipe_name":"Chargrilled sea bass summer rolls with pineapple dipping sauce","author":"Anh Vu & Van Tran","programme":"Nigel Slater's Simple Cooking","prep_time":"30 mins to 1 hour","cooking_time":"no cooking required","serves":"Makes 10 rolls","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chargrilled_seabass_62243_16x9.jpg","method":"Light a charcoal barbecue, or preheat a grill to high.  For the marinade, combine the garlic, chilli, ginger, dill, sugar and lemon juice with four tablespoons of water. Add the fish sauce, to taste.  Make three slits through the skin of the fish on either side. Pour a few teaspoons of marinade inside the fish and tuck in the lemongrass stalks, then rub the remainder of the marinade all over the skin. Allow to marinate for 20-30 minutes.  Grill the fish over medium-hot coals or under a hot grill for ten minutes either side, or until thoroughly cooked. Set aside to cool. For the dipping sauce, combine the pineapple, fish sauce, lemon juice and four tablespoons water. Add chilli to taste. Set aside. For the summer rolls, lay the rice paper sheet on a chopping board. Put a bowl of cold water next to it and with wet fingers, pat the rice paper sheet wet until pliable. They should be moist  but not too wet as they will tear.  Place a pinch of cooked noodles on the centre of the rice paper. Cut about a tablespoon of flesh from the seabass, removing any bones with your fingers, and place onto the rice paper with the noodles.  Fold the rice paper over once. Place a pinch of shredded carrot next to the fish and noodle parcel. Then add one or two pieces of cucumber, courgette, pineapple, and dill. Fold the sides of the rice paper in and roll up the fish and vegetables. Repeat until all the spring roll wrappers are used up. Serve with the dipping sauce.  ","ingredients":" 1 garlic clove, peeled and chopped,  1 red bird's-eye chilli, finely chopped,  50g\/2oz fresh ginger, peeled, roughly chopped,  2-4 sprigs fresh dill, chopped,  1 tbsp sugar,  4 tbsp lemon juice,  2 tbsp fish sauce,  1-2 stalks lemongrass, lightly crushed,  1 whole seabass, de-scaled, cleaned,  10 rice spring roll wrappers,  100g\/3oz rice vermicelli, cooked according to the packet instructions,  200g\/6oz carrots, shredded,  ½ pineapple, peel and core removed, cut into thin matchsticks,  1 cucumber, seeds removed, cut into thin matchsticks,  1 courgette, cut into thin matchsticks,  1 bunch fresh dill, torn into small sprigs,  250g\/8oz fresh pineapple, crushed or blended to a rough purée,  2 tbsp fish sauce,  1 tbsp lemon juice,  1 red bird's-eye chilli, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilled_seabass_62243"}