{"recipe_name":"Chargrilled lamb with rocket pesto, roasted tomatoes and crushed sweet potato","author":"Tony Tobin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/360F\/ Gas 4. For the chargrilled lamb, rub the lamb with olive oil and season well with salt and freshly ground black pepper. Place onto the hot griddle pan to chargrill for 2-3 minutes on both sides, or until cooked to your liking. Remove from the heat and leave to rest in a warm place for five minutes and then slice. For the rocket pesto, place the rocket, feta, olive oil, sesame seeds, garlic, salt and freshly ground black pepper into a food processor and blend until smooth. For the roasted tomatoes, place the halved tomatoes onto a baking sheet, drizzle with olive oil and season with salt and freshly ground black pepper. Sprinkle with the thyme leaves and place into the oven to roast for 10-12 minutes. For the crushed sweet potatoes, place the sweet potato cubes into a small pan of boiling salted water and boil for five minutes, or until tender. Drain and allow to steam dry. Add the yoghurt and coriander and roughly crush the potatoes with a fork. Season, to taste, with salt and freshly ground black pepper. To serve, spoon the crushed sweet potato onto a serving plate and top with the lamb slices. Place the roasted tomatoes alongside and drizzle over the rocket pesto. ","ingredients":" 200g\/7oz lamb fillet,  dash olive oil,  salt and freshly ground black pepper,  large handful fresh rocket leaves,  55g\/2oz feta cheese, crumbled,  2 tbsp sesame seeds, toasted in a hot pan,  2 garlic cloves,  3-4 tbsp olive oil,  salt and freshly ground black pepper,  2 fresh vine tomatoes, halved,  dash olive oil,  salt and freshly ground black pepper,  1 tsp fresh thyme leaves,  ½ sweet potato, peeled, finely chopped,  2 tbsp Greek-style yoghurt,  1 tbsp chopped fresh coriander,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledlambwitha_88296"}