{"recipe_name":"Chargrilled pears with spinach and coriander salad and tomato chutney","author":"James Martin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a griddle pan until smoking. Add the pear quarters and griddle on both sides for one minute to create grill lines, then remove from the heat and set aside. Place the ciabatta bread onto the griddle pan and cook for one minute on each side to create grill lines. Remove and set aside. To make the salad, take two of the griddled pear quarters and chop them into small dice. Place the spinach, coriander, croutons and diced pear in a large bowl and mix together well. Add the olive oil, season, to taste, with salt and freshly ground black pepper and set aside. To make the chutney, place the olive oil in a frying pan over a medium heat. Add the onion and garlic and fry for one minute. Add the brown sugar and cherry tomatoes and cook for a further minute. Add the white wine vinegar and heat to simmer and cook to reduce for five minutes. To serve, place the salad on a plate with the remaining chargrilled pear pieces and ciabatta placed around the salad. Pour the chutney into a small bowl and serve beside the salad. ","ingredients":" 1 pear, cut into quarters, cored and skin left on,  4 thin slices ciabatta brushed with olive oil,  100g\/3½oz baby leaf spinach,  small bunch fresh coriander, roughly chopped,  2 slices toast, cut into thick croutons and tossed in olive oil,  1 tbsp olive oil,  salt and freshly ground black pepper,  1 tbsp olive oil,  ¼ onion, chopped,  1 garlic clove, finely sliced,  50g\/1¾oz brown sugar,  150g\/5½oz cherry tomatoes, halved,  3 tbsp white wine vinegar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledpearswith_79476"}