{"recipe_name":"Chargrilled sea bass with potato rosti, sautéed vegetables and sauce vierge","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chargrilled sea bass, heat the oil in a griddle pan until hot. Season the fish with salt and freshly ground black pepper and fry for about three minutes, skin-side down. Turn the fillet over and remove from the heat. Squeeze over the lemon juice and allow to continue cooking in the residual heat, until cooked through.  For the potato rösti, place the grated potato into a clean tea towel and squeeze out the excess water. Season the potato with salt and freshly ground black pepper. Heat the oil in a small frying pan and pack the seasoned potato into the pan. Allow to cook through without stirring, turning once, until golden-brown on both sides, about 4-5 minutes per side. For the sautéed vegetables, heat the oil in a wok and stir fry the carrot and courgette for about 4-5 minutes. Season with salt and freshly ground black pepper. For the sauce vierge, place all the ingredients into a small pan and heat gently for about 3-4 minutes. To serve, place the rösti in the centre of a serving plate and top with the bass fillet. Arrange the vegetables to one side and spoon the sauce vierge around the edge. ","ingredients":" 1 tbsp olive oil,  1 sea bass fillet, skin scored,  salt and freshly ground black pepper,  ½ lemon, juice only ,  ½ large red potato, peeled and grated,  salt and freshly ground black pepper,  2 tbsp olive oil,  1 tbsp olive oil,  ½ carrot, cut into batons,  ½ courgette, cut into batons,  salt and freshly ground black pepper,  5 tbsp olive oil,  1 tomato, seeds removed, chopped,  1 garlic clove, finely chopped,  2 tbsp balsamic vinegar,  1 handful fresh basil leaves, torn","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledseabasswi_88624"}