{"recipe_name":"Chargrilled steak with sweet potato, green bean ragoût and red wine sauce","author":"Richard Phillips","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sweet potato, melt the butter in a hot frying pan and add the sweet potato, stock and fresh thyme. Slowly cook the potatoes until just tender, then remove the potatoes from the cooking liquid and set aside in a bowl.  For the red wine sauce, heat the oil in another frying pan. Add the shallot, mushrooms and wine and simmer until the liquid has reduced by half. Reserve half of this sauce in a small bowl and set aside.  For the green bean ragout, add the beef stock and double cream to the remaining red wine sauce in the frying pan and add the green beans and cheese. Stir together.   For the steak, rub the steak with the olive oil. Heat a frying pan until hot, then fry the steak for 1-2 minutes on each side, or until the steak is cooked to your liking. Remove from the heat and leave to rest.  Place half of the sweet potato onto a serving plate and spoon some of the green bean ragout on top. Top with the remaining potato and finish with ragout. Slice the steak into strips and serve next to the potatoes. Spoon the reserved red wine sauce around the plate. ","ingredients":" 55g\/2oz butter,  ½ large sweet potato, peeled and thinly sliced,  100ml\/3½fl oz chicken stock,  1 sprig fresh thyme,  1 tbsp olive oil,  1 shallot, chopped,  100g\/3½oz chestnut mushrooms, sliced,  4 tbsp white wine,  4 tbsp red wine,  100ml\/3½oz beef stock,  100ml\/3½fl oz double cream,  100g\/3½oz green beans, blanched,  100g\/3½oz red Leicester cheese, grated,  85g\/3oz rump steak,  1 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledsteakwith_87440"}