{"recipe_name":"Chargrilled steak with a brandy mushroom cream sauce, chips and honeyed carrots","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the steak and sauce, season the meat with salt and freshly ground black pepper and rub in the oil. Heat a griddle pan until smoking and sear the steak for 2-3 minutes on both sides (for rare), or for longer if you prefer your steak medium or well done. Remove from the pan and leave to rest on a warm plate.  Return the pan to the heat and fry the onion, garlic and mushrooms for 4-5 minutes, or until softened, then add the brandy and wine to deglaze. Simmer for 4-5 minutes, or until the liquid has reduced by about a third.  Pour in the stock, bring to a simmer and then stir in the cream and heat through for 2-3 minutes. Keep warm.  For the chips, heat the olive oil in an ovenproof frying pan and add the potato wedges. Season with salt and freshly ground black pepper and add the herbs and garlic, frying for 3-4 minutes, or until the wedges are golden-brown all over. Transfer to the oven to cook through for 10-12 minutes, turning once, or until the wedges are golden-brown and crisp. For the carrots, melt the butter in a pan and add the carrots and honey. Place over a low heat, cover with a lid and simmer for about 8-10 minutes, or until the carrots are tender. Stir in the coriander. To serve, spoon the mushroom sauce on a serving plate. Thickly slice the steak and place on top of the sauce, then place the fries and carrots alongside. ","ingredients":" 85g\/3oz sirloin steak,  salt and freshly ground black pepper,  2 tbsp olive oil,  ½ onion, sliced,  1 garlic clove, crushed to a paste in a mortar and pestle,  55g\/2oz button mushrooms, sliced,  2 tbsp brandy,  2 tbsp red wine,  100ml\/3½fl oz chicken stock,  100ml\/3½fl oz double cream ,  3 tbsp olive oil,  1 potato, cut into wedges,  salt and freshly ground black pepper,  1 sprig fresh rosemary ,  1 sprig fresh thyme,  2 garlic cloves, skin on and squashed,  25g\/1oz butter,  6 baby carrots,  2 tbsp honey,  2 tbsp chopped fresh coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledsteakwith_90683"}