{"recipe_name":"Chargrilled steak with mustard and peppercorn dressing, tempura shallots and green beans and a rosti","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the steak, season the steak with salt and freshly ground black pepper. Heat a griddle pan until hot, brush the steak with the olive oil and fry on the griddle for 3-4 minutes on both sides (for medium), or until cooked to your liking. Remove from the pan and leave to rest on a warm plate covered with foil. For the dressing, whisk all of the dressing ingredients together in a bowl and set aside. For the tempura, mix the flour with enough water in a bowl to make a batter with the consistency of single cream.  Half-fill a deep, heavy-based pan with the oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Dip the shallot rings and beans into the batter before deep-frying in the oil for 2-3 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. For the rösti, place the grated potato into a clean tea towel and wring out any excess moisture. Heat the olive oil and butter together in a small frying pan and pack the grated potato into the pan. Season well with salt and freshly ground black pepper and fry over a medium-low heat for 5-7 minutes on both sides, or until golden-brown and cooked through. To serve, place the tempura shallots and green beans alongside the steak. Place the rösti next to the steak, then drizzle over the mustard and peppercorn dressing. ","ingredients":" 100g\/3½oz rump steak,  salt and freshly ground black pepper,  1 tbsp olive oil,  1 tsp wholegrain mustard,  1 tbsp chopped fresh chives,  1 tbsp green peppercorns, crushed,  3 tbsp olive oil,  1 tbsp water,  1 tsp caster sugar,  salt and freshly ground black pepper,  150g\/5oz plain flour,  200ml\/7fl oz fizzy water,  vegetable oil, for deep frying,  1 shallot, peeled, cut into thick rings,  1 handful green beans, trimmed,  ½ baking potato, peeled, grated,  1 tbsp olive oil,  1 tbsp butter,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledsteakwith_92435"}