{"recipe_name":"Chargrilled Thai beef salad","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a dry frying pan, add the rice and toast until golden but not burnt. Grind the rice in a clean coffee-grinder or pound to a powder and set aside. Reheat the frying pan and add the dried red chillies. Toast until they are smoky, then grind or pound to a powder and set aside. Chargrill or pan-fry the beef for around 12 minutes, until well marked outside and rare to medium-rare inside. Place in a bowl and leave to rest for 10 minutes. Meanwhile, combine the sesame oil with the kecap manis and brush over the fillet. Marinate for two hours.  Dissolve the sugar in the lime juice and fish sauce. Combine half a teaspoon of the ground dried chilli powder with half a teaspoon of the ground rice and set aside. Combine the cucumber, shallots, cherry tomatoes, red chillies, herbs and spring onions in a large bowl. Add the lime juice and fish sauce mixture and toss to combine.  Slice the beef thinly. Toss the beef and ground rice mix through the salad with any cooking juices that have collected  in the be bowl. Pile high on a large platter and serve with a salad of crunchy raw lettuce. ","ingredients":" 1 tbsp jasmine rice, uncooked,  2 dried red chillies ,  500g\/1lb 2oz thick fillet steak,  2 tbsp sesame oil,  75ml\/2½fl oz kecap manis (Indonesian sweet soy sauce),  2 tsp sugar,  4 tbsp lime juice,  3 tbsp Thai fish sauce,  1 small cucumber, peeled, de-seeded, halved lengthways and cut into 1cm\/0.5in slices,  4 red shallots, finely sliced,  12 cherry tomatoes, halved,  2 red chillies, finely sliced,  1 handful fresh mint leaves,  1 handful fresh coriander leaves,  2 tbsp fresh basil leaves, ripped,  4 spring onions, finely sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledthaibeefs_73736"}