{"recipe_name":"Chargrilled tiger prawns with a crunchy nut dressing, egg fried rice and mango salsa","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chargrilled prawns, rub the prawns in the oil and season well with salt and freshly ground black pepper.  Heat a griddle pan until it is smoking hot.  Add the prawns to the pan and fry for three minutes or until coloured and cooked through.  For the crunchy nut dressing.  Place the soy sauce, lime juice and sugar into a small saucepan.  Grate the ginger onto the centre of a clean jay cloth or muslin.  Wrap the jay cloth or muslin around the ginger and squeeze the juice through the material into the saucepan.  Cook the mixture over a medium heat for five minutes.  Add the cashew nuts, spring onion, mint and coriander to the saucepan and mix well.  Then pour the mixture into a clean bowl. For the egg fried rice, heat the oil in a wok until smoking hot.  Add the spring onions to the wok and cook for three minutes. Add the cooked rice and cook for  one minute.  Add the egg to the wok and stir quickly.  Add the rest of the egg fried rice ingredients to the wok and mix well.  Place the rice into a lightly oiled, small bowl and press the rice down into the bowl.  Turn the rice out onto a clean serving plate. For the mango salsa, place all the mango salsa ingredients in a small bowl and mix well. To serve, place the chargrilled prawns on to the plate alongside the rice.  Pour the dressing over the rice and prawns and serve with the mango salsa in a bowl on the side for dipping. ","ingredients":" 4 tiger prawns,  2 tsp olive oil,  salt and freshly ground black pepper,  2 tbsp soy sauce,  1 lime, juice only,  1 tbsp caster sugar,  30g\/1oz root ginger, peeled,  30g\/1oz cashew nuts, crushed,  1 spring onion, chopped,  handful fresh mint, chopped,  handful fresh coriander, chopped,  2 tbsp vegetable oil,  2 spring onions, roughly chopped ,  250g\/9oz jasmine rice, cooked according to packet instructions,  1 free-range egg, beaten,  2 tsp soy sauce,  1 tbsp fresh parsley, chopped,  1 tbsp fresh coriander, chopped,  ½ mango, peeled and sliced into 1cm\/½ cubes,  2 tbsp fresh basil, chopped,  2 tbsp fresh mint, chopped,  2 tsp clear honey,  ½ lime, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledtigerpraw_84640"}