{"recipe_name":"Chargrilled tuna with roast red onion, tomato and coriander vinaigrette and shoestring potatoes","author":"Paul Rankin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to its highest setting. Place the tomatoes, red onion, light olive oil, coriander seeds, and salt into a bowl and mix together gently. Transfer the tomato mixture onto a baking sheet and place under the grlll for 10-12 minutes, until just turning golden-brown, turning occasionally. Transfer the grilled tomato mixture to a large bowl and add the extra virgin olive oil and lemon juice. Mix gently to combine and coat, then set aside. For the tuna, preheat a griddle pan until hot. Season the tuna lightly with salt. Mix the crushed coriander seeds and peppercorns together and sprinkle evenly onto a plate. Press the tuna steaks onto the spice mixture to evenly coat on both sides, then drizzle with the olive oil. Place the tuna steaks onto the griddle pan and cook for 1-2 minutes on each side, or until cooked to your liking. For the shoestring potatoes, preheat a deep fat fryer to 190C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place the potato strips into a bowl of cold water and soak for five minutes, then remove from the water and pat dry with kitchen paper. Place the potatoes into the deep fat fryer and cook for 2-3 minutes, or until golden and crisp. Carefully remove with a slotted spoon and drain onto kitchen paper. Season, to taste, with salt and black pepper. To serve, add the fresh coriander to the tomato and onion mixture. Spoon the tomato and onion mixture onto warmed plates, then place a pile of rocket leaves in the centre of each plate. Top each pile of rocket with a tuna steak, and place a large spoonful of shoestring potatoes on top. ","ingredients":" 6 plum tomatoes, peeled, cut into quarters,  2 red onions, roughly sliced,  2 tbsp light olive oil,  1 tsp coriander seeds, crushed,  ½ tsp salt,  125ml\/4½fl oz extra virgin olive oil,  2 tbsp lemon juice,  4 x 175g\/6oz tuna steaks,  pinch salt,  1 tbsp coriander seeds, crushed,  1 tbsp black peppercorns, cracked,  2 tbsp light olive oil,  2 large baking potatoes, finely sliced into strips,  salt and freshly ground black pepper,  2 tbsp fresh coriander, roughly chopped,  125g\/4½oz rocket leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chargrilledtunawithr_86657"}