{"recipe_name":"Ackee and saltfish","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a large frying pan. Add the onion and the red and green peppers and fry over a medium heat for 4-5 minutes, until softened. Add the chilli and stir well. Drain the salt cod of its soaking water and rinse with fresh water. Pat the cod dry, then add to the pan of fried peppers and onion. Add the ackee and fry for 5-6 minutes, until the cod and ackee are cooked through. Break the cod up with a wooden spoon as it cooks. Add the thyme and a little black pepper, to taste, and stir. For the callaloo, melt the butter in a separate pan over a medium heat. Add the callaloo and cook until the callaloo has wilted down. Add the nutmeg and season well with salt and freshly ground black pepper. To serve, place the salt cod and ackee mixture into the centre of a large serving dish. Serve the callaloo around the cod and ackee and drizzle, to taste, with some hot Jamaican sauce and garnish with the chopped tomatoes. ","ingredients":" 2 tbsp oil, for frying,  1 onion, finely chopped,  1 red pepper, seeds removed, chopped,  1 green pepper, seeds removed, chopped ,  1 scotch bonnet chilli, seeds removed, chopped ,  450g\/1lb salt cod, soaked in water overnight (water changed several times),  450g\/1lb canned ackee, drained,  1 tbsp fresh thyme leaves,  pinch black pepper,  100g\/3½oz butter,  400g\/14oz callaloo (substitute with fresh spinach leaves if unavailable),  1 tsp freshly grated nutmeg,  salt and freshly ground black pepper,  3 tomatoes, seeds removed, chopped,  ready-made hot Jamaican sauce, to serve,  3 tomatoes, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ackeeandsaltfish_86812"}