{"recipe_name":"Charred bananas and ice cream with passion fruit soufflé and sesame-toffee bananas","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4 (2 adults and 2 children)","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02ffy5n.jpg","method":"For the charred bananas and ice cream (the kids' dessert), preheat the oven to 200C\/180C Fan\/Gas 6. Using a sharp knife, make a small slit in one end of each banana. Stick a sprig of rosemary into each slit.  Heat a griddle pan over a high heat. Add the bananas and cook for 4-5 minutes on each side, or until blackened on all sides and heated through. To serve, split the bananas lengthways and open out slightly, then place onto serving plates (you can return them to their skins to serve, if desired). Top with a scoop of ice cream and sprinkle with the passion fruit seeds. For the sesame-toffee bananas (the adults' dessert), heat the oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Meanwhile, prepare a bowl of iced water. In a bowl, whisk together the cornflour and sparkling water until smooth and well combined. Add the banana halves and gently mix until coated.  Carefully lower the battered bananas into the hot oil and fry for 2-3 minutes, or until very light golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Meanwhile, heat the sugar, without stirring, in a heavy-based frying pan over a high heat. Swirl the pan until the sugar melts to a light golden-brown caramel. Stir in the sesame seeds, then dip the base of the pan into a sinkful of cold water to stop the caramel from cooking any further. Using a spoon, carefully roll the battered banana halves in the hot caramel, one at a time, until completely coated. (CAUTION: melted sugar is extremely hot.) Transfer to the bowl of iced water until completely cold, then set aside to drain.  For the soufflé, preheat the oven to 230C\/210C Fan\/Gas 8. Grease two large ramekins with butter, then dust the insides with a coating of sugar. Whisk the egg whites in a clean bowl until firm peaks form when the whisk is removed. Fold the custard and passion fruit seeds into the whisked egg whites, then spoon the mixture carefully into the ramekins, smooth the tops using a palette knife and place them on a baking tray. Bake the soufflés in the oven for 8-10 minutes, until risen and golden-brown. Dust the soufflés with the icing sugar and serve immediately, with a spoonful of custard, one of the sesame-toffee banana halves and a scoop of ice cream alongside.  ","ingredients":" 2 ripe bananas, unpeeled,  2 sprigs fresh rosemary,  2 scoops good-quality ready-made vanilla ice cream,  1 passion fruit, seeds scooped out,  vegetable oil, for deep-frying,  75g\/2½oz cornflour,  125ml\/4½fl oz sparkling water,  1 ripe banana, peeled and cut in half lengthways,  150g\/5oz caster sugar ,  2 tbsp sesame seeds ,  25g\/1oz butter, softened, for greasing,  2 tbsp caster sugar, for dusting,  3 free-range egg whites,  50ml\/2fl oz ready-made vanilla custard, plus extra to serve,  2 passion fruit, seeds scooped out,  1 tbsp icing sugar,  2 scoops good-quality ready-made vanilla ice cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/charred_bananas_and_ice_46997"}