{"recipe_name":"Chashu pork ramen ","author":"The Hairy Bikers","programme":"The Hairy Bikers' Asian Adventure","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chashu_pork_ramen_90056_16x9.jpg","method":"Cook the noodles following the instructions on the packet. Once cooked, drain and drizzle with a little sesame oil to stop the noodles from sticking.  Heat the stock in a large pan with the ginger, garlic, shiitake mushrooms and carrots. Simmer for 5-8 minutes. Add the shimeji mushrooms. Carefully arrange the warm noodles, beansprouts, bamboo shoots, enoki mushrooms, choi sum and sliced pork in four large serving bowls. Carefully pour the stock over the pork and vegetables with a ladle. Top with the spring onions and sliced chilli. Carefully half the eggs and place on the top of each serving.  Serve at once with a drizzle of chilli oil, a sprinkling of shichimi togarashi (Japanese seven-spice seasoning) and a flourish of dried tuna flakes (if liked). ","ingredients":" 750g\/1lb 10oz ramen noodles (alternatively use udon noodles) ,  drizzle sesame oil ,  2.5 litres\/4½ pints toridashi stock,  30g\/1oz fresh root ginger, cut into 4 thick slices ,  2 garlic cloves, cut into slithers ,  10 fresh shiitake mushrooms, cut into slithers,  1 carrot, cut into matchsticks,  100g\/3½oz shimeji mushrooms,  200g\/7oz soya beansprouts (or beansprouts),  50g\/1¾oz sliced bamboo shoots,  100g\/3½oz enoki mushrooms,  200g\/7oz choi sum, ends trimmed and cut in half,  500g\/1lb 2oz chashu pork, about 16 slices ,  4 spring onion, cut on the diagonal ,  1 long red chilli, finely sliced on a diagonal,  4 whole tomago eggs, halved ,  Japanese shop-bought chilli oil ,  shichimi togarashi (Japanese seven-spice seasoning),  dried tuna flakes ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chashu_pork_ramen_90056"}