{"recipe_name":"Apple pie","author":"The Hairy Bikers","programme":"The Hairy Bakers","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, blend the flour, salt, sugar and butter in a food processor until the mixture resembles breadcrumbs. Gradually add the beaten egg and the egg yolks and blend until smooth and well combined. Bring the dough mixture together with your hands, wrap it in cling film and transfer to the fridge to chill for 30-45 minutes. Meanwhile, grease a high-sided 20cm\/8in spring form cake tin with butter. Add a small amount of flour and turn the tin to coat the sides and bottom, shaking out any excess. Preheat the oven to 180C\/350F\/Gas 4. Roll out two thirds of the chilled pastry onto a clean, floured work surface, until it is almost twice as wide as the diameter of the cake tin. Using the rolling pin, lift the pastry and lay it over the cake tin to line the base and sides. Gently press the pastry into the corners of the tin, trimming off any excess pastry, then prick the base of the pastry case several times with a fork. Cover the pastry with a sheet of greaseproof paper and fill it with rice or dried beans. Bake in the oven for 12-15 minutes, or until the pastry is pale golden-brown. Remove from the oven, discard the beans and greaseproof paper and leave the pastry to cool. Reduce the oven temperature to 170C\/325F\/Gas 3. For the filling, place the sultanas and the orange juice into a bowl and leave for 30-40 minutes, or until the sultanas are plump. Sprinkle the semolina flour over the base of the cooled pastry case. Arrange half of the apple slices in a single layer on the base of the pastry case. Scatter the apple layer with the soaked sultanas, then sprinkle over half of the caster sugar and half of the cinnamon. Repeat the process with the remaining apple slices, sugar and cinnamon.  For the pastry lid, roll out the remaining one third of pastry onto a clean, floured work surface, until it is large enough to cover the cake tin. Brush the rim of the pastry case with some of the beaten egg and place the pastry lid on top of the pie. Trim off any excess pastry. Seal the pastry lid to the pastry case by crimping the edges of the pastry lid with a fork. With a knife, make two small holes in the centre of the pastry lid to allow steam to escape. Brush the pastry lid with the remaining beaten egg, then transfer to the oven and bake for 35-40 mins, or until golden-brown. To serve, place a slice of the apple pie onto a serving plate and spoon a portion of clotted cream alongside. ","ingredients":" 425g\/15oz plain flour, plus extra for dusting,  ½ tsp salt,  100g\/3½oz caster sugar,  250g\/9oz unsalted butter, plus extra for greasing,  1 free-range egg, beaten,  2 free-range egg yolks,  100g\/3½oz sultanas,  ½ orange, juice only,  1 tbsp semolina flour,  8 large cooking apples, peeled, core removed, flesh finely sliced,  100g\/3½oz golden caster sugar, plus extra for dusting,  1 tbsp ground cinnamon,  1 free-range egg, beaten,  clotted cream, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/applepie_89624"}