{"recipe_name":"Cheese-crusted razor clams with garlic, chilli and lemon thyme","author":"Adam Byatt","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to its highest setting. Heat a heavy-based frying pan until hot. Add 75g\/2½oz of the butter, the lemon thyme, leeks, fennel, chilli and garlic and fry over a low heat until the vegetables are softened, but not browned. Heat a deep-sided frying pan with a lid and add the remaining 75g\/2½oz of butter and the leek and fennel trimmings and fry for 2-3 minutes. Add the white wine, bring to the boil and cook to reduce by half the original volume. Add the razor clams. Cover with the lid and cook for 4-5 minutes, or until the clams are open and just cooked (discard any clams that haven't opened). Pour the contents of the pan into a sieve over a heatproof bowl. Reserve the cooked razor clams and discard the remaining sieve contents. Add 200ml\/7fl oz of the cooking juices to the softened fennel, leek and chilli mixture and boil to reduce the liquid by half. Meanwhile remove the clam flesh from the shells. Slice the clam meat on an angle into 1cm\/½in pieces, then add to the pan of reduced vegetable mixture. Wash the razor clam shells and place onto a baking sheet, then spoon the clam and vegetable mixture into the shells. Place the sourdough breadcrumbs and Pecorino into a food processor and blend to combine. Sprinkle the breadcrumb and cheese mixture over the filled shells then place under the grill and cook until the topping is golden-brown. Serve on plates with wedges of lime. ","ingredients":" 150g\/5oz butter ,  1 tbsp fresh lemon thyme leaves,  2 leeks, finely chopped, trimmings reserved,  2 fennel bulbs, finely chopped, trimmings reserved,  1 red chilli, finely chopped,  3 garlic cloves, lightly crushed,  300ml\/10½fl oz white wine,  1kg\/2lb 2oz fresh razor clams, washed and drained,  110g\/4oz fresh sourdough breadcrumbs,  20g\/¾oz Pecorino cheese,  lime wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cheesecrustedrazorcl_87656"}