{"recipe_name":"Buckwheat blinis with scrambled eggs and smoked salmon","author":"Sophie Dahl","programme":"The Delicious Miss Dahl","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/cheesesoufflebuckwhe_93524_16x9.jpg","method":"For the blinis, mix together the buckwheat flour, baking powder, a pinch of salt and freshly ground black pepper and the milk to make a smooth batter. Add the mustard powder, cheddar and chives and mix until well combined. In a seperate bowl, whisk the egg whites with a pinch of salt until soft peaks form when the whisk is removed. Gradually fold the whisked egg whites into the batter mixture using a metal spoon.  Melt the butter in a frying pan over a medium high heat, and spoon large tablespoons of the batter into the pan to make medium sized pancakes, about 10cm\/4in in diameter. Fry the blinis, in batches, for 2-3 minutes until small bubbles appear on the surface and the underside looks cooked. Turn the blinis over and cook on the other side for a further 1-2 minutes, or until golden-brown. Keep warm. Repeat until all of the mixture is used up. For the scrambled eggs, whisk the eggs in a bowl, and season, to taste, with salt and freshly ground black pepper. Melt the butter in a small saucepan over a medium heat, then pour in the eggs, stirring a little to break the eggs up slightly as they set. Cook for 1-2 minutes, then remove the pan from the heat and set the eggs aside to finish cooking for a further 1-2 minutes. To serve, place two blinis onto each of four serving plates, spoon on the scrambled eggs, and sprinkle over the chopped chives. Arrange the smoked salmon on the side, and finish with the lemon wedges. ","ingredients":" 85g\/3oz buckwheat flour,  1 tsp baking powder (gluten-free, if necessary),  salt and freshly ground black pepper,  150ml\/5fl oz full-fat milk,  1 tsp mustard powder,  70g\/2½oz cheddar cheese, grated,  small handful chopped fresh chives,  2 free-range egg whites, preferably organic,  pinch salt,  knob of unsalted butter,  4 free range or organic eggs (plus 2 free-range egg yolks),  sea salt and freshly ground black pepper,  knob of unsalted butter,  2 tbsp chopped fresh chives ,  250g\/9oz smoked salmon ,  1 lemon, cut into wedges","vegetarian":false,"calories":444.0,"protein":33.0,"carbs":20.0,"sugars":2.0,"total_fat":26.0,"saturated_fat":10.0,"fiber":0.6,"salt":3.2,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cheesesoufflebuckwhe_93524"}