{"recipe_name":"Cheesy sausage cakes on roasted field mushrooms","author":"Brian Turner","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/390F\/Gas 6. Place the mushrooms on a roasting tray, drizzle with the olive oil and season. Cook in the oven for 15 minutes then reduce the temperature to 140C\/285F\/Gas 4. Cook at this temperature for about one-and-a-half hours. Remove from the oven and drain well. Put to one side. Turn the oven up to 180C\/355F\/Gas 5. Meanwhile, to make the sausage cakes, take the sausage meat out of the sausage skins and put into a bowl. Discard the skins. Add the rest of the ingredients and mix well. Mould into four even-sized cakes. Heat a little olive oil in a frying pan and fry the sausage cakes for a few minutes on each side, or until nicely browned. Transfer to a baking tray and cook in the oven for about 20 minutes, or until cooked through. Just before they're finished cooking, return four of the roast mushrooms to the oven to reheat. Cut the remaining six roast mushrooms into strips and fry gently in the butter. Season and stir in the chives. Spoon the mushroom strips onto the centre of four serving plates. Top with one whole mushroom, a sausage cake and a fried egg. ","ingredients":" 10 large, even-sized field mushrooms,  1 tbsp olive oil,  salt and freshly ground black pepper,  30g\/1oz butter,  1 tbsp chopped fresh chives,  450g\/1 lb good quality pork sausages,  115g\/4oz cheddar cheese, chopped,  1 shallot, finely chopped,  2 cloves garlic, crushed,  1 tbsp chopped parsley,  1 tsp French mustard,  1 splash Worcestershire sauce,  2 splashes Tabasco sauce,  4 free-range eggs, fried according to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cheesysausagecakeson_74664"}