{"recipe_name":"Chef's saddle of wild rabbit with a spinach purée","author":"Richard Corrigan","programme":"Full on Food","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Prepare a stuffing for the rabbit by remove the skin from the black pudding from its skin and putting it in a food processor with the cream. Blend until soft and spoonable.   Overlap the slices of ham on your work surface so that together they are slightly wider than the rabbit fillet. Lay the fillet on top and season well. Spread the black pudding mixture over the fillet. Roll the ham to encase the rabbit and stuffing. Heat the oil in the pan and add the rolled fillet.  Fry for five minutes or until brown and crisp.   Toss in the carrot and celery and fry for 2-3 minutes.  Add the kidneys and fry for one minute, on both sides Remove the pan from the heat. Lay the rabbit on a board to rest and spoon the carrot and celery into a bowl. Prepare the spinach purée. Melt the butter in a small pan. Add the shallots and the spinach and fry until the spinach has wilted.   Transfer the spinach and shallot to a food processor, add a splash of stock or water and the cream and blend until smooth. Add more stock or water if the purée is too thick. Return the spinach to the pan and re-heat gently. Put the rabbit pan back on the heat. Add the verjus and stir to collect the cooking juices from the rabbit. Tip the carrot and celery back into the pan. Stir in the butter. Slice the kidneys in half and add to the pan.    Slice the rabbit into six pieces.  Place three rounds on each plate with a spoon of the spinach purée.  Scatter over the carrot, celery and kidneys and finish with a drizzle of the pan juices. ","ingredients":" 100g\/3½oz black pudding,  about 30ml\/1¼fl oz double cream,  2 slices of Serrano ham,  1 saddle of rabbit, boned, plus the kidneys,  salt and freshly ground black pepper,  4 tbsp olive oil,  1 carrot, peeled and diced,  2 celery sticks, trimmed and diced,  4 tbsp verjus or dry white wine,  1 tbsp butter,  1 tbsp butter,  2 shallots, finely chopped,  200g\/7¼ oz fresh spinach, stalks, removed and discarded,  spalsh of light stock or water,  4 tbsp cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chefssaddleofwildrab_74836"}