{"recipe_name":"Chervil stuffed roast chicken salad with shaved turnips, lardons and cider vinaigrette","author":"Oliver Rowe","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cider vinaigrette, place the sugar in a frying pan and cook over a medium heat until caramelised. Add the cider and cook until reduced and sticky. Remove from the heat. Whisk the cider vinegar, oil, mustard and garlic into the cider reduction. Season with salt and freshly ground black pepper. Set aside to cool. For the lardons, fry the bacon in a hot frying pan until crisp. Drain away the fat and set the bacon aside. For the herb butter, place the butter in a food processor and pulse to soften. Add the chervil and chives and season with salt and freshly ground black pepper. Pulse until well mixed. For the chicken, loosen skin of the chicken halves, and stuff the herb butter under the skin. Chill in the fridge until needed. Preheat the oven to 190C\/370F\/Gas 5. Heat an oven-proof frying pan, without oil, and dry fry the chicken halves, skin-side down, until crisp. Turn the chicken halves over and transfer the pan to the oven for 20-25 minutes, or until the chicken is cooked through - the juices will run clear when the chicken is pierced with a skewer at the thickest point. Remove the cooked chicken from the oven and pour off the excess fat. Set the chicken halves aside to rest. Deglaze pan with the chicken stock and cook to reduce the liquid. To serve, toss the shaved turnips, crisp leaves, parsley leaves and lardons with the cider vinaigrette. Cut the chicken into serving pieces and add to the salad. Arrange the salad on a plate, pour over the pan juices and sprinkle with some chopped chives and chervil. Serve. ","ingredients":" 2 tbsp sugar,  250ml\/8¾fl oz good-quality cider,  2 tbsp cider vinegar,  10ml\/4fl oz cold-pressed rapeseed oil or extra virgin olive oil,  ½ tsp mustard,  2 cloves garlic, crushed,  salt and freshly ground black pepper,  3 rashers bacon, sliced into lardons,  60g\/2¼oz butter,  small bunch fresh chervil, roughly chopped,  small bunch fresh chives, roughly chopped,  salt and freshly ground black pepper,  1 medium chicken, cut in half down the middle,  60ml\/2¼fl oz chicken stock,  4 baby turnips, shaved into strips with a vegetable peeler,  crisp leaves such as Little Gem, chicory and watercress,  handful fresh parsley leaves,  fresh chives and chervil, chopped, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chervilstuffedroastc_85257"}