{"recipe_name":"Chettinad crab curry ","author":"Rick Stein","programme":"Rick Stein's India","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crab, break off the tail flaps and discard. Break off the claws, then take a large-bladed knife and cut them in half at the joint; crack the shells of each piece with a hammer or the back of a knife. Chop the body section in half, then gently tug on the legs to pull the body pieces away from the back shell. Use a knife as an added lever if you need to, but the body pieces should come away quite easily with the legs still attached. Turn each piece over and pick off the dead man’s fingers (soft gills), then cut in half once more so you have two legs attached to each piece.  For the coconut paste, grind the fennel and cumin seeds in a pestle and mortar, then add to a mini-food processor with the coconut and a splash of water and blend to a smooth paste. For the masala, heat the oil in a heavy-based saucepan or karahi over a medium heat, add the fennel and fenugreek seeds, garlic, shallots and onion and fry for 10 minutes, or until the onion is golden-brown.  Stir in the curry leaves, chilli powder and turmeric, fry for 30 seconds and then add the tomatoes. Simmer for 5-10 minutes, stirring occasionally, until the tomatoes have reduced down to a pulp.  Stir in the coconut paste and fry for 2-3 minutes. Add 200ml\/7fl oz of water and the kokum, tamarind liquid, coriander, sugar and salt and bring to a boil. Add the crab, cover the pan, and cook over a high heat for 3-4 minutes, or until the sauce is rich and quite thick, adding a splash more water if it looks like catching on the bottom of the pan. Serve. ","ingredients":" 1 x 750g\/1lb 10oz cooked brown crab,  1 tsp fennel seeds,  1 tsp cumin seeds,  25g\/1oz fresh or frozen coconut flesh, blended in a food processor or grated,  2 tbsp vegetable oil,  1 tsp fennel seeds,  1 tsp fenugreek seeds,  10 garlic cloves, finely chopped,  3 shallots, thinly sliced,  1 onion, thinly sliced,  10–14 fresh curry leaves,  2 tsp Kashmiri chilli powder,  1 tsp ground turmeric,  4-5 tomatoes, finely chopped,  2 tbsp chopped dried kokum (available from specialist Indian stores),  1 tsp tamarind liquid ,  1 tbsp ground coriander,  1 tsp jaggery or soft brown sugar,  1 tsp salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chettinad_crab_curry_53083"}