{"recipe_name":"Mini-apple strudels with custard","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the custard, mix the egg yolks and sugar together in a large bowl. Place the milk, the vanilla pod and seeds into a saucepan over a medium heat. Bring the milk to just boiling, then remove from the heat and cool for one minute. Remove the vanilla pod. Gradually pour the warm vanilla milk into the yolk mixture, while whisking continuously and vigorously. Pour this mixture back into the saucepan and gently heat, stirring continuously. When the custard reaches a consistency that coats the back of a wooden spoon it is ready. To make the strudel, place the apple, cinnamon and sugar into a bowl and toss together.  Place the pastry squares onto a clean floured surface. Divide the apple mixture into three portions and place a portion into the centre of each pastry square. Brush around the edge of each pastry square with the beaten egg, then fold over to seal and create a stuffed triangle strudel. Brush over each triangle with egg wash. Heat the vegetable oil in a deep, heavy bottomed saucepan until a breadcrumb sizzles and turns brown when added to it. (CAUTION: hot oil can be dangerous, do not leave unattended.) Carefully add the strudels to the oil and deep-fry until crisp and golden, then carefully remove with a slotted spoon and drain on kitchen towels. Dust with icing sugar. To serve, arrange the apple strudels onto a plate and drizzle over some of the custard. ","ingredients":" 2 free-range egg yolks,  50g\/1¾oz caster sugar,  150m\/5fl oz milk,  1 vanilla pod, seeds scraped out and retained,  1 apple, peeled, cored and finely chopped,  1 tbsp cinnamon,  1 tbsp brown sugar,  3 x 20cm\/8in squares ready-made croissant pastry,  1 free-range egg, beaten ,  500ml\/18fl oz vegetable oil,  icing sugar, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/applestrudelswithcus_81383"}