{"recipe_name":"Chicken and cheese quesadillas with guacamole, sour cream and mango salsa","author":"The Hairy Bikers","programme":"The Hairy Bikers' Cook Off","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02c0wxl.jpg","method":"For the salsa, mix all of the salsa ingredients together in a bowl and season to taste with salt and freshly ground black pepper. Tip the avocado into a mixing bowl with the lime juice to prevent it from turning brown. Add the garlic, crème fraîche and coriander and mash everything together lightly with a fork, keeping plenty of texture. Season to taste with salt and freshly ground black pepper. For the quesadillas, lay two of the tortillas out on a flat surface. Top each with the cheese, followed by the chicken, peppers and coriander. Place the remaining tortillas on top and press down gently. Heat a frying pan over a medium hot and add one of the quesadillas to the pan. Fry, without adding any oil, for 2-3 minutes on each side or until the tortilla is crisp, the cheese melted and the chicken heated through thoroughly. Keep warm whilst you cook the second quesadillas. To serve, cut the quesadillas into quarters arrange on plates. Spoon a little soured cream on top, garnish with coriander and serve with the salsa and guacamole on the side. ","ingredients":" 1 yellow pepper, seeds removed, diced ,  1 small mango, peeled and diced ,  8 cherry tomatoes, cut into quarters ,  3 spring onions, chopped ,  1 tsp chopped jalapeño peppers (optional),  1 lime, juice only ,  salt and freshly ground black pepper ,  4 flour tortillas ,  150g\/5oz Monterey Jack or cheddar cheese, grated ,  leftover cooked chicken, shredded, or other cold meat such as turkey,  1 green or red pepper, seeds removed, finely diced ,  small handful coriander leaves, chopped, plus extra to garnish (optional),  soured cream and guacamole, to serve (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_and_cheese_65643"}