{"recipe_name":"Chicken and mushroom puff pastry pie ","author":"Robert Billington","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, sift the flour into a bowl with a pinch of salt. Rub the butter into the flour until the mixture resembles breadcrumbs. Add enough water to bring the mixture together and then turn the mixture onto a work surface and knead to a smooth dough. Wrap the pastry in cling film and chill in the fridge for 10 minutes. Roll the dough out on a floured work surface to a 20cm x 35cm\/8in x 14in rectangle, fold it into thirds then wrap in cling film and return it to the fridge for 10 more minutes. Remove the pastry from the fridge, turn it 90 degrees, then repeat step 2.  Repeat this process three more times. Meanwhile, make the filling. Melt butter in the pan and brown the meat on all sides. Cut the onion in half, stud each half with two cloves and add to the pan with the chicken. Add the mushrooms and garlic, fry briefly for a few minutes then season with salt and freshly ground black pepper and add the wine.  Bring the mixture to a boil, let it simmer until the wine has reduced then reduce the heat and add the cream. Cook very gently for about 10 minutes or until the chicken is cooked through then transfer the mixture to a pie dish about 23cm\/9in in diameter. Brush the edges of the dish with water. Preheat the oven to 200C\/400F\/Gas 6. Roll out the pastry  and drape it over the top of the pie dish, trim the edges and press it firmly around the edges. Bake for about 25-30 minutes or until golden-brown. ","ingredients":" 225g\/8oz plain flour,  pinch salt,  140g\/5oz butter, cut into 1cm\/½in cubes,  25g\/1oz butter,  4 free-range chicken breasts, roughly chopped,  1 onion,  4 cloves,  500g\/1lb 2oz chestnut mushrooms, chopped,  5 garlic cloves, chopped,  salt and freshly ground black pepper,  300ml\/10fl oz dry white wine,  300ml\/10fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_and_mushroom_pie_01035"}