{"recipe_name":"Chicken and truffle tortellini with a cream and chive sauce ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the pasta, put the flour and 2 of the eggs in a food processor and pulse until the mixture resembles breadcrumbs. Turn the mixture out onto a floured work surface and gently work the mixture together to form a dough. Lightly knead the dough for 2-3 minutes, or until it is smooth and elastic. Roll into a ball, cover with cling film and chill in the fridge for at least 20 minutes. Remove the dough from the fridge and discard the cling film. Lightly flour your pasta machine to prevent the dough from sticking. Flatten the dough ball slightly with a rolling pin, then starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. Repeat this process, flouring the machine and changing the setting down each time, until you reach the thinnest setting. You can cut the pasta into smaller individual sheets and work on them individually, keeping the remaining unused dough covered under cling film to prevent them from drying out. Place the chicken, half the cream, truffle shavings and salt and pepper into a food processor and blend unto smooth. Add more cream until you have a spoonable texture. Beat the remaining egg in a bowl. Cut out circles from the pasta sheets using a 4-5cm\/1.5-2in pastry cutter, then brush each circle with the beaten egg. Place a heaped teaspoon of the chicken and truffle filling onto one half of each circle, then fold the other half of the pasta over, so that it forms a half-moon shape. Press together to seal. Bring the bottom two corners of the half-moon together to create a circle and pinch to seal. Repeat with the remaining pasta, placing each completed tortellini on a tray lined with greaseproof paper. Set aside. For the cream and chive sauce, heat the butter in a saucepan until melted. Add the shallot and cook for 2 minutes, then add the garlic and cook for a further minute. Pour in the white wine and cook until the volume of liquid is reduced by half. Pour in the stock and reduce by half again. Pass through a fine sieve and pour into a clean pan, heat and add a touch of butter.  To finish, put a pan of boiling salted water on the hob and blanch the kale for a minute. Drain well. Melt the butter in a large frying pan and add the kale. Fry gently until tender. Cook the tortellini in a large pan of boiling salted water for 2-3 minutes. Drain well then add the tortellini and chives to the sauce and mix. Cut open one of the tortellini to check the chicken is cooked through, if not, continue to heat them in the pan. Place the wilted kale in the centre of serving bowls, top with the tortellini and freshly grated truffle. ","ingredients":" 200g\/7oz 00 pasta flour, plus extra for dusting,  3 free-range eggs,  ½ chicken breast, roughly chopped,  100-200ml\/3½-7fl oz double cream,  fresh truffle, to taste,  salt and freshly ground pepper,  2 tbsp unsalted butter, plus extra to finish,  1 shallot, finely chopped,  1 garlic clove, chopped,  150ml\/5fl oz white wine,  150ml\/5fl oz chicken stock,  2 tbsp unsalted butter,  2 tbsp fresh chives, chopped,  fresh truffle shavings, to taste,  1 head kale, leaves shredded,  2 tbsp unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_and_truffle_55068"}