{"recipe_name":"Chicken 'ayam sioh'","author":"Claude Bosi","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, bring the stock to the boil in a large pan. Add the chicken and make sure it is well covered with the stock. Simmer to poach until cooked through, this should take about 50 minutes to 1 hour.  For the tamarind paste, melt the palm sugar with the soy sauce in a pan. Add the tamarind, coriander seeds, and shallots to different pan. Once the palm sugar has melted add it to the shallot pan. Cook on a low heat for around 6 hours until thick and reduced in volume. Add the rice vinegar. Cook for a further 20 minutes then leave to cool. Add the cockles and 300ml\/10fl oz water to a large lidded pan. Cover and steam the cockles until they have opened. Drain the cockles reserving the cooking liquor. Discard any cockles that have not opened. Pass the cooking liquor through a fine sieve and set aside. Remove the cockle meat from the shells, cool over iced water and set aside.  For the vegetables, add the butter and stock to a large pan and mix well. Add the turnips and cook until tender.  For the shallots, add the shallots, butter, sugar, thyme and chicken stock to a large pan and cook over a low heat until the shallots are caramelised. This will take about 25 minutes.  For the sauce, place the chicken wings in a large roasting tray with the olive oil and cook over a high heat for 2-4 minutes until golden-brown.  Add the cockle meat, shallots, thyme and black peppercorns to the chicken wings.  When the shallots have caramelised, add the butter and reserved cockle cooking liquor and scrape the pan to de-glaze. When the sauce is reduced to a syrup, add the brown chicken stock and cook for 20 minutes. Pass through a chinois (fine sieve), return to the pan and cook until the volume of liquid has reduced by half.  Just before serving, portion the chicken and fry it in a little butter. To serve, place the chicken on a large plate along with the tamarind paste, shallots and sauce. Garnish with the turnip tops and oyster leaves. Drizzle with the coriander infused oil. ","ingredients":" 1 x 2kg\/4lb 8oz chicken,  chicken stock, enough to cover the chicken,  1 sheet palm sugar,  80ml\/3fl oz light soy sauce,  460g\/1lb 1oz tamarind,  25g\/1oz coriander seeds, bashed and wrapped in muslin,  240g\/8½oz shallots, diced and bashed with a pestle and mortar ,  135ml\/4½fl oz rice vinegar,  1kg\/2lb 4oz cockles, cleaned and drained (discard any cockles that remain open after cleaning),  1.5kg\/3lb 5oz turnip tops, discard the large outer leaves, keeping just the hearts,  100g\/3½oz butter,  200ml\/7fl oz chicken stock,  4 large banana shallots, halved,  100g\/3½oz butter,  25g\/1oz sugar,  2 sprigs thyme,  200ml\/7fl oz chicken stock,  2kg\/4lb 8oz chicken wings, each wing chopped into 3 pieces,  4 tbsp olive oil,  reserved cockle meat (from above),  2 shallots, sliced,  1 sprig thyme,  1 tsp black peppercorns,  50g\/1¾oz butter,  500ml\/18fl oz reserved cockle cooking liquor (from above),  200ml\/7fl oz brown chicken stock,  oyster leaf (available online),  oil infused with coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_ayam_sioh_02588"}