{"recipe_name":"Chicken, bacon and butternut squash pie","author":"Kimberley Wilson","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dough, combine the turmeric, flour and salt in a large bowl and add enough water to bring the dough together (approximately 330ml\/11fl oz water). Add the olive oil and knead until the dough is pliable. Divide into 30g\/1oz balls and place on a baking tray. Cover with cling film and set aside to rest for two hours in a cool place (ideally 15C\/60F). For the ras-el-hanout, toast the cinnamon, peppercorns, coriander seeds, cumin seeds and cardamom pods in a dry frying pan. Blend the toasted spices in a spice grinder with the remaining spice mix ingredients.  For the filling, preheat the oven to 180C\/160C(fan)\/Gas 4. Toss the butternut squash in a little of the oil on a roasting tin and bake until just tender (about 30 minutes). In a frying pan, heat the butter and remaining olive oil. When hot, fry the onions until caramelised. In a separate pan, fry the lardons until crisp. Add the chicken and fry for a further five minutes, or until just cooked. Remove from the heat and stir into the onion mixture along with the ras-el-hanout. Set aside to cool.  When the butternut squash is cooked, remove from the oven and set aside to cool. Mix the toasted pine nuts into the filling. Keep the oven at 200C\/fan oven 180C\/400F\/Gas 6. For the pastry, cover a table with a clean, cotton sheet dusted with cornflour. Using your hands, gently begin to stretch the dough until it is very thin and translucent. Place your hands underneath the dough and stretch and pull the dough thinner using the backs of your hands. Dust very lightly with flour and set aside for at least 30 minutes to dry out slightly.  When ready to assemble, dab the dough with melted butter and cut out 30cm\/12in squares of pastry. Arrange the pastry squares in a well-greased savarin mould, so that they overlap and cover the whole ring of the mould with lots left hanging over the outside edges. Pack the cooled filling round inside the ring. Lift up the edges of the pastry and fold over to cover the filling. Press to seal any joins in the pastry. Cover with a well-greased baking tray and turn the whole lot upside down. Remove the savarin mould. Brush the outside of the pastry with butter. Bake for 20-25 minutes, or until the pastry is golden-brown and crisp.  To decorate, fry the reserved chicken skin in a pan until crisp, set aside to cool and then tear into small pieces. Just before serving, combine the chicken skin with the remaining ingredients apart from the spinach and pomegranate.  To serve, sprinkle over the chicken skin mixture and fill the centre with baby spinach and sprinkle with pomegranate seeds. ","ingredients":" 2 tsp ground turmeric,  400g\/14oz plain flour, plus 2 tbsp flour, for dusting,  1 tsp salt,  2 tbsp olive oil,  cornflour, for dusting,  250g\/9oz unsalted butter melted,  1 cinnamon stick,  1 tsp black peppercorns,  1 tsp coriander seeds,  1 tsp cumin seeds,  1 tsp green cardamom pods,  ½ nutmeg, freshly grated ,  ½ tsp ground allspice,  1 tsp ground ginger,  1 tsp ground turmeric,  2 whole cloves,  2 blades mace ,  ½ tsp nigella seeds,  ½ tsp ground cayenne pepper,  1 tbsp rose petals ,  salt, to taste,  600g\/1lb 5oz butternut squash, peeled and cut into 3cm\/1¼in cubes,  3 tbsp olive oil,  3 large red onions, sliced into half rings,  knob of butter,  150g\/5½oz smoked lardons ,  900g\/2lb chicken thighs with skin removed and reserved, meat chopped into bite-sized pieces ,  100g\/3½oz pine nuts, toasted in a dry pan,  20g\/¾oz pork scratchings ,  10g fresh coriander, leaves chopped ,  2 tbsp pine nuts, toasted in a dry pan,  2 tsp grains of paradise (West African spice available from specialist spice suppliers),  handful baby spinach leaves,  ¼ pomegranate, seeds only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_bacon_butternut_06664"}