{"recipe_name":"Chicken caesar salad with crunchy grapes, spicy pecans and rosemary croutons","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rosemary croûtons, preheat the oven to its lowest setting. Place the sliced bread on a baking sheet and drizzle over the oil and sprinkle over the rosemary. Place in the oven for 1-3 hours, or until golden-brown and crisp. For the spicy pecans, preheat the oven to 160C\/325F\/Gas 3 In a large ovenproof frying pan, melt the butter with the sugar to make a caramel. Add the cayenne pepper then fold in the pecans. Gently fold in the whisked egg whites until all the nuts are coated. Transfer the pan to the oven and cook for 25 minutes, stirring two or three times, or until the nuts are crunchy. For the chicken Caesar salad, in a large pan add the chicken, carrot, celery, onion, thyme, rosemary, garlic and enough water to cover the chicken. Bring to a simmer on the hob and cook on a medium heat for 50 minutes to an hour. Leave to cool in the liquid. Once cool enough to handle, tear the meat from the carcass and set aside. To make the dressing preheat the oven to 200C\/400F\/Gas 6. Place the whole bulb of garlic in aluminium foil with a sprig of rosemary and cover. Place in the oven for 15-20 minutes. Place the egg yolks, mustard and white wine vinegar in a food processor and blend. Gradually add the rapeseed oil until you have a smooth mayonnaise then season with salt and pepper. For the crunchy grapes, crush together the seeds, wasabi peas, puffed rice cereal and pistachios. Put the sugar in a hot pan and when it dissolves, add the fresh grapes and the seed mixture. Stir it quickly to coat the grapes then set aside. To finish the dressing, in a bowl add the buttermilk, crème fraiche, honey and cooked garlic pulp. Whisk in a little oil and add the mayonnaise. To serve, in a large glass bowl add the Cos and baby gem lettuce, spicy pecans, crunchy grapes, croûtons, chicken and mix.  Pour over the dressing and toss to coat. ","ingredients":" 2 slices spelt loaf bread, sliced into thin croûtons,  2 tbsp olive oil,  2 sprigs rosemary, leaves picked and roughly chopped,  125g\/4½oz butter,  150g\/5½oz brown sugar,  two pinches cayenne pepper,  300g\/10½oz pecans,  50g\/1¾oz egg white, beaten until frothy,  1 whole chicken,  1 carrot, cut into chunks,  1 celery stick, cut into chunks,  1 onion, peeled and cut into chunks,  1 sprig thyme,  1 sprig rosemary,  2 garlic cloves, peeled and smashed,  1 Cos lettuce, roughly chopped ,  1 Little Gem lettuce, roughly chopped,  1 bulb of garlic, top cut off,  1 sprig of rosemary,  1 tbsp olive oil,  2 free-range egg yolks,  1 tsp Dijon mustard,  2 tsp white wine vinegar,  300ml\/10fl oz rapeseed oil,  salt and freshly ground black pepper,  2 tbsp buttermilk,  2 tbsp crème fraîche,  2 tbsp honey,  50ml\/2fl oz rapeseed oil,  10g black sesame seeds,  10g fennel seeds,  10g sunflower seeds,  10g wasabi peas,  20g\/¾oz puffed rice cereal,  10g shelled pistachios,  50g\/1¾oz sugar,  100g\/3½oz red seedless grapes,  100g\/3½oz green seedless grapes","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_caesar_salad_61098"}