{"recipe_name":"Chicken casserole with potato cobbler","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_casserole_with_67654_16x9.jpg","method":"To prepare the mash for the cobbler topping, peel the potatoes and cut into 2cm\/¾in chunks. Put in a medium saucepan and cover with cold water. Bring to the boil and simmer for 15 minutes, or until the potatoes are very tender.  Drain in a colander and mash with a potato masher or put through a potato ricer until smooth. Leave to cool for 10-15 minutes. You will need 250g\/9oz mashed potatoes for the cobbler topping. Any remaining mash can be set aside for another recipe. For the chicken casserole, trim the chicken thighs of any fatty bits and cut each one into four pieces. Season well with salt and pepper. Heat the oil in a large non-stick frying pan over a medium heat. Fry the chicken, in two batches, until lightly browned all over. Transfer to a large flame-proof casserole dish. Preheat the oven to 200C\/400F\/Gas 6. Put the bacon, onion and celery in the same frying pan used to brown the chicken and fry for 4-5 minutes over a medium-high heat until lightly browned, stirring often. Add the mushrooms and cook for one minute more, stirring.  Tip the vegetables into the casserole with the chicken pieces. Stir in the tomatoes, stock, bay leaf, thyme and carrots.  Bring to a simmer on the hob, cover loosely with a lid and cook in the oven for 30 minutes. While the chicken is cooking, finish making the cobbler topping. Put the flour and salt in a large bowl and rub in the butter using your fingertips until the mixture resembles coarse breadcrumbs. Add 250g\/9oz mashed potatoes and rub together with the butter and flour.  Stir in the milk and mix to form a soft, smooth dough. Turn the dough out onto a well-floured surface and roll into a thick sausage, about 24cm\/9½in long. Cut into 12 rounds, each around 2cm\/¾in thick. Take the chicken out of the oven and season to taste with salt and pepper. You won’t be able to season it again once the topping has been added. Mix the cornflour and water and stir into the casserole. Add the leeks and stir well. Top the chicken mixture with the potato dumplings, overlapping them slightly, so they almost cover the filling. Brush with a little extra mix to glaze. Season with a little ground black pepper and some sea salt. Return to the oven without a lid for a further 30 minutes, or until the cobbler topping is well risen, fluffy and golden-brown.  ","ingredients":" 350g\/12oz floury potatoes, such as King Edwards or Maris Piper,  250g\/9oz self-raising flour, plus extra for rolling,  1 tsp fine sea salt,  100g\/3½oz cold butter, cut into cubes,  125ml\/4fl oz full-fat milk, plus extra for brushing,  8 skinless, boneless chicken thighs,  flaked sea salt and freshly ground black pepper,  3 tbsp sunflower oil,  4 rashers rindless smoked streaky bacon, cut into 2cm\/¾oz wide strips,  2 medium onions, halved and sliced,  2 celery sticks, thinly sliced,  150g\/5½oz small button mushrooms, wiped and halved or quartered if large,  400g\/14oz can chopped tomatoes,  600ml\/20fl oz chicken stock, made with 1 stock cube,  1 bay leaf,  2 tsp dried thyme ,  375g\/13oz medium carrots, peeled and cut into 1.5cm slices,  2 slender leeks, trimmed and cut into 2cm\/¾in slices,  1 tbsp cornflour,  2 tbsp cold water,  flaked sea salt ,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_casserole_with_67654"}