{"recipe_name":"Chicken chasseur ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the brine, put all the ingredients into a large saucepan with 1 litre\/1¾pint of water and bring to the boil. Once boiled and the salt has dissolved, remove from the heat and allow to cool. For the chicken, place the chicken in a large bowl and pour over the brine. Cover and leave in the fridge for at least eight hours. Preheat the oven to 220C\/425F\/Gas 7. Place the chopped vegetables, garlic and thyme in a deep baking tray and place the chicken on top.  Roast in the oven for 40-50 minutes, depending on the size of the chicken – pierce the chicken in the thickest part with a skewer; when the juices run clear the meat is cooked. For the mashed potato, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until tender. Drain. Press the potato through a potato ricer into a saucepan. Return to the heat, then add the butter and cream and beat to a smooth purée. Season, to taste, with salt and freshly ground black pepper.  For the chicken chasseur, place the white wine in a large pan and cook until the volume of liquid has reduced by half. Add the chicken stock and tarragon and reduce by half again.   Add the morels and cook for two minutes and then, just before serving, add the diced tomato and fresh chives. To serve, cut the chicken into pieces and place in a serving dish. Place the mash next to the chicken and pour the sauce over the chicken and mash. ","ingredients":" 200g\/7oz salt,  2 bay leaves,  2 garlic cloves,  2 sprigs rosemary,  2 sprigs thyme,  1 tsp whole black peppercorns,  1 whole chicken,  1 onion, roughly chopped,  2 sticks celery, roughly chopped,  1 carrot, roughly chopped,  4 garlic cloves, smashed,  2 sprigs thyme,  500g\/1lb 2oz Maris Piper potatoes,  125ml\/4fl oz double cream,  125g\/4½oz unsalted butter,  300ml\/10fl oz white wine,  300ml\/10fl oz dark chicken stock,  ½ bunch fresh tarragon,  200g\/7oz fresh morel mushrooms,  4 tomatoes, peeled, seeds removed, finely chopped,  2 tbsp finely chopped fresh chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_chasseur_11639"}