{"recipe_name":"Chicken chasseur with mashed potato","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, season the chicken with salt and black pepper. Heat a large frying pan or sauté pan until hot. Add the oil and half the butter. Fry the chicken skin-side down for 1-2 minutes, or until golden-brown. Turn and fry on the other side for another 1-2 minutes, then remove from the pan. Add the remaining butter, the pancetta, carrot, mushrooms, shallots and garlic, and fry until golden-brown. Add the wine and bring to a simmer, stirring to deglaze the pan. Put the chicken back into the pan with the tomato purée and tarragon and bring to a boil. Reduce the heat to a simmer and cook for 30-40 minutes until the chicken is tender and the liquid slightly reduced in volume. Add the tomatoes, flatleaf parsley and season to taste with salt and pepper. Simmer for a further two minutes. For the mash, place the potatoes into a pan of cold, salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender. Drain and return to the pan, then place over a low heat for one minute to dry the potatoes slightly. Mash thoroughly, then add the butter and milk and beat to form a smooth mash. Season to taste with salt and black pepper. Serve each person two pieces of chicken with the sauce spooned over and a dollop of mash. ","ingredients":" 1.5kg\/3lb 5oz chicken, cut into 8 pieces,  salt and freshly ground black pepper,  2 tbsp olive oil,  110g\/4oz butter,  110g\/4oz pancetta, sliced into lardons,  1 carrot, diced,  150g\/5oz button mushrooms,  250g\/9oz shallots, thickly sliced,  2 garlic cloves, finely chopped,  175ml\/6fl oz white wine,  275ml\/10fl oz chicken stock,  2 tbsp tomato purée,  2 tbsp fresh tarragon, finely chopped,  2 tomatoes, skinned, seeded and chopped,  4 tbsp flatleaf parsley, finely chopped,  1kg\/2lb 2oz floury potatoes, peeled and cut into chunks,  110g\/4oz butter,  110ml\/4fl oz full-fat milk,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_chasseur_with_30427"}