{"recipe_name":"Chicken chasseur with straw fries","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken chasseur, season the chicken pieces with salt and freshly ground black pepper. Dredge in the flour to coat. Heat a large pan over a medium heat and add the oil and a third of the butter.  When the butter is foaming, add the chicken pieces and fry skin-side down for 1-2 minutes until golden-brown. Turn the chicken over and fry for another 1-2 minutes. Meanwhile, heat a separate frying pan over a medium heat and add another third of the butter. When the butter is foaming, add the mushrooms and fry, stirring occasionally, until golden-brown all over. Reserve a few mushrooms for a garnish and transfer the rest of the mushrooms to the chicken pan. In the pan used to fry the mushrooms, add the remaining third of the butter, the shallots and the caster sugar and fry for 2-3 minutes, or until the shallots are golden-brown and caramelised. Add the wine and bring to the boil, scraping the base of the pan with a wooden spoon to dislodge any brown bits. Reserve a few shallots for the garnish and pour the remaining shallots and wine mixture over the chicken. Add the stock, tomato purée and whole tarragon sprigs. Bring to the boil and then reduce the heat to simmer. Cook for 45-60 minutes, or until the chicken is completely cooked through and the sauce has reduced slightly. Add the tomatoes and the chopped tarragon and season, to taste, with salt and freshly ground black pepper. Simmer for a further two minutes. For the straw fries, pour the oil into a large, deep, heavy based saucepan and heat until a cube of bread sizzles and turns golden-brown when dropped in. (CAUTION: hot oil can be dangerous. Do not leave unattended.) In batches carefully lower the potatoes into the hot oil and fry for 3-4 minutes, or until crisp and golden-brown. Remove from the hot oil using a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt and freshly ground black pepper. Repeat the process with the remaining potatoes. To serve, place two pieces of chicken onto each plate, drizzle the sauce over and garnish with the reserved mushrooms and shallots. Serve the fries alongside. ","ingredients":" 1.5kg\/3lb 5oz whole chicken, jointed into eight pieces,  salt and freshly ground black pepper,  50g\/2oz plain flour,  2 tbsp olive oil,  110g\/4oz butter,  150g\/5½oz button mushrooms, left whole,  100g\/3½oz chestnut mushrooms, halved,  150g\/5½oz shallots, peeled and left whole,  40g\/1½oz caster sugar,  175ml\/6fl oz white wine,  500ml\/18fl oz chicken stock,  3 tbsp tomato purée,  ½ bunch fresh tarragon, half left as sprigs and half finely chopped,  2 plum tomatoes, peeled, seeds removed, finely chopped,  vegetable oil, for deep frying,  4 large potatoes, peeled and cut into skinny fries,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_chasseur_with_32863"}