{"recipe_name":"Chicken kebab wrap","author":null,"programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the chicken breasts on a chopping board and cover loosely with a sheet of cling film. Using a rolling pin or a meat mallet, pound the chicken breast to flatten the thickest parts so that the breast is relatively even in thickness all over. (It will cook quicker.) Mix the olive oil, cumin, grated garlic, the juice of half the lemon and some black pepper in a bowl and swish the chicken around to coat it completely. Marinade the chicken breasts for 10 minutes, if you have time. Meanwhile, you can prepare all the salad you want to put in. Heat a frying pan until very hot. Lift the chicken breasts from the marinade and allow the excess to drip off. Cook in the hot pan on a high heat for 2 minutes on each side.  Add the stock – it will bubble up rapidly. Reduce the heat to medium and partly cover, cooking the chicken for about 5 more minutes or until cooked through (you’ll need to remove it from the pan and cut into it to make sure it’s cooked). Put the cooked chicken breasts onto a warm plate and scrape all the juices out on the top.  To serve, heat the flatbreads in the frying pan over a medium-high heat for a minute either side until they are warmed through and a little toasty. Place the flatbreads on two plates and spread each with some hummous. Slice the chicken into thin strips and divide between the two flatbreads. Top with salad and sauces that you like and a squeeze of lemon juice. Roll up and serve. ","ingredients":" 200g\/7oz chicken breasts (one large or two small),  1 tbsp olive oil,  ½ tsp cumin,  1 garlic clove, grated,  ¼ stock cube, dissolved in a small glassful of hot water,  1 lemon, juice only,  2 large flatbreads or tortilla wraps,  4 tbsp hummus,  handful mixed salad leaves,  1 tomato, sliced,  1 carrot, grated,  Sprig fresh mint (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_kebab_wrap_35076"}