{"recipe_name":"Chicken kiev with a cucumber and spring onion salad","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the kievs, slit each chicken breast down its longer side, almost cutting through to the other side (the breast should open out like a book). Place the opened chicken breast between two pieces of clingfilm and flatten with a rolling pin. Set aside. Repeat with the remaining three chicken breasts.  Mix the butter, parsley, garlic, spring onions and grated cheese in a bowl. Divide this stuffing into four and form each portion into a sausage shape. Set aside.  Pour the beaten eggs into a bowl and spread the flour and breadcrumbs onto separate plates.  Meanwhile, for the salad, peel the cucumbers into thin ribbons using a vegetable peeler and mix with the spring onions, soured cream, mayonnaise and paprika. Season to taste with salt and freshly ground black pepper. Garnish with the slices of hard-boiled egg. Set the salad aside until ready to serve. Lay a chicken breast flat on a chopping board, season with salt and freshly ground black pepper, and place a portion of stuffing in the middle. Roll the chicken very tightly around the stuffing and then dip in the flour to coat the chicken evenly. Dip into the beaten egg, and then roll in the breadcrumbs. Repeat with the remaining chicken breasts and stuffing.  Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns light golden when dropped into it. Alternatively, use an electric deep-fat fryer heated to 160C\/325F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) NB: it’s important that the oil temperature isn’t too hot or the outside of the chicken will burn before the inside is cooked.  Cook the chicken for about 15 minutes until the coating is golden and crispy and the chicken is cooked through (test the chicken by removing to a plate and piercing with a skewer – the juices will run clear when the chicken is cooked).  Remove the chicken from the pan with a slotted spoon and set aside to drain on kitchen paper. Serve the chicken kievs with the cucumber salad alongside. ","ingredients":" 4 chicken breasts, preferably free-range, skin removed,  150g\/5½oz  butter, at room temperature,  bunch fresh parsley, finely chopped,  3 garlic cloves, crushed,  2 spring onions, finely chopped,  50g\/1¾oz Cheddar, grated,  salt and freshly ground black pepper,  2 free-range eggs, beaten,  3 tbsp plain flour,  3 tbsp golden breadcrumbs,  sunflower oil, for deep-frying,  2 cucumbers, peeled, core removed,  2 spring onions, chopped,  50g\/1¾oz soured cream,  1 tbsp mayonnaise,  large pinch paprika,  salt and freshly ground black pepper,  2 free-range eggs, hardboiled, peeled, sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_kiev_with_a_68028"}