{"recipe_name":"Chicken, leek and mushroom pie with cauliflower mash topping","author":"Hemsley + Hemsley","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_leek_and_17968_16x9.jpg","method":"Preheat the oven to 220C\/200C Fan\/Gas 7. Heat the ghee in a frying pan over a medium heat. Add the leeks and fry for 4-5 minutes, or until softened but not browned. Add the celery and bay leaf and increase the heat to high. Fry for 1-2 minutes. Add the chicken stock to the pan and bring to the boil, then add the carrots, fennel and mushrooms and reduce the heat until the mixture is simmering. Continue to simmer the mixture until the volume of liquid has reduced and thickened, and the vegetables are tender, about 12-15 minutes.             Meanwhile, for the topping, put the cauliflower, garlic cloves and half of the butter in a large, lidded saucepan. Add 4 tablespoons of water and cover. Bring the pan contents to a simmer over a medium heat and steam for 6-8 minutes, or until the cauliflower is tender when pierced with a knife (add a splash more water during cooking if necessary). Remove from the heat and transfer the contents to a food processor. Blend to your consistency of choice - either smooth and creamy or roughly textured. Season witth salt and pepper.  To finish the pie filling, remove the bay leaf and add the remaining filling ingredients to the pan. Season with salt and pepper. Stir well, then transfer the mixture to an ovenproof pie dish.                                 Spoon the pie topping over the filling and spread into an even layer using a palette knife. Use a fork to create a criss-cross pattern on top of the filling. Dot the top of the pie with the remaining butter.  Bake for 25-30 minutes, or until the filling is bubbling and the topping is golden-brown. ","ingredients":" 1 tbsp ghee,  2 leeks, trimmed, sliced,  2 large celery stalks, trimmed, diced,  1 bay leaf,  500ml\/17fl oz hot chicken stock, preferably homemade,  4 carrots, sliced,  1 small fennel bulb, outer leaves removed, flesh diced,  250g\/9oz mushrooms, sliced,  600g\/1lb 5oz cooked leftover roast chicken ,  large handful chopped fresh flatleaf parsley,  salt and freshly ground black pepper ,  1.2kg\/2lb 10oz cauliflower, outer leaves removed, florets chopped into 5cm\/2in pieces               ,  4 garlic cloves, peeled and left whole,  50g\/2oz butter,  salt and freshly ground black pepper ","vegetarian":false,"calories":522.0,"protein":61.0,"carbs":17.0,"sugars":14.0,"total_fat":23.0,"saturated_fat":11.0,"fiber":13.5,"salt":1.6,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_leek_and_17968"}