{"recipe_name":"Chicken, leek and wild mushroom parcels with a chicory and radish salad","author":"Daniel Galmiche","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken parcels, first clarify the butter. Put 250g\/9oz of the butter in a saucepan over a very low heat. Leave for 30 minutes until the butter has melted and the solids have fallen to the bottom. Remove from the heat and do not disturb the pan.  Mix the chicken, lemon zest and juice, yoghurt and half the tarragon in a bowl. Cover and marinate in the fridge for 30 minutes.  Bring a saucepan of water to the boil, add the leek, return to the boil and blanch for 1 minute. Lift out using a slotted spoon and refresh in ice-cold water. Transfer to a plate and pat dry with kitchen paper. Add the mushrooms to the boiling water, blanch for 1 minute, then lift out, refresh and pat dry.  Heat a large, non-stick frying pan over a high heat.  Add the remaining butter and sunflower oil. When the butter is foaming, add the mushrooms and fry for 2 minutes. Add the leek and chicken and fry for 2 minutes, or until starting to colour. Remove from the pan and leave to cool at room temperature. Don’t wash the pan as you will need it later. Preheat the oven to 180C\/160C Fan\/Gas 4.  Cut the filo into 16 rectangles 16x22cm\/6¼x8½in and cover with a clean, damp tea towel to prevent them drying out. For each filo pie, working quickly, one piece at a time, lay a sheet of filo on the work surface and brush lightly with clarified butter, then grate a little lemon zest from the whole lemon over the top. Lay a second sheet over the top and brush with butter as before, then season with a little salt. Put another sheet on top, brush with butter again and grate over a little lemon zest. Finish with a fourth sheet, then a little pepper.  Beat together the egg and 1 tablespoon water to make an egg wash. Brush the edges of the pastry with the egg wash, then spoon a quarter of the chicken mixture onto the bottom half of the pastry. Gently fold the pastry over the filling, press the edges together and tuck them under to seal and form a little parcel. Transfer to a baking tray and refridgerate while you make the remaining 3 parcels.  Brush the outsides of the finished parcels with the clarified butter and bake for 20-25 minutes until golden-brown and crisp.   Meanwhile, for the chicory and radish salad, toss the chicory leaves, radishes and parsley together in a bowl. In a small bowl, whisk the vinegar and oil together then season with salt and pepper. Just before serving, drizzle the dressing over the leaves and toss to coat.  Return the frying pan to a medium heat, add the sherry vinegar and deglaze by stirring to remove any caramelized bits stuck to the bottom. Add the stock and cream, turn the heat down to low and simmer for 10-12 minutes until the volume of liquid has reduced by half and the sauce is thick enough to coat the back of a spoon. Add the remaining tarragon and season with salt and pepper, to taste.   To serve, spoon the sauce over the parcels and arrange the salad alongside. ","ingredients":" 270g\/9½oz unsalted butter ,  2 boneless, skinless corn-fed chicken breasts (about 180g\/6¼oz each), cut into 2cm\/¾in cubes ,  2 lemons, 1 for zest and juice only, 1 whole ,  2 tbsp Greek yoghurt ,  2 tsp finely chopped tarragon leaves ,  1 small, young leek, green part only, cut in half lengthways and sliced,  200g\/7oz mixed wild or shiitake mushrooms ,  1 tbsp sunflower oil ,  2 x 270g packs fresh readymade filo pastry,  1 free-range egg, beaten ,  2 tbsp sherry vinegar ,  200ml\/7fl oz chicken stock ,  200ml\/7fl oz whipping cream ,  2 large heads chicory, halved lengthways and leaves separated ,  12 radishes, thinly sliced ,  3 tbsp chopped parsley leaves ,  1 tbsp Chardonnay vinegar (alternatively use white wine vinegar),  3 tbsp extra virgin olive oil ,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_leek_and_wild_27527"}