{"recipe_name":"Chicken liver parfait with pickled beetroot and toasted sourdough","author":"Jun Tanaka","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 120C\/250F\/Gas ½.  Put the Madeira, port, shallot, brandy, thyme and garlic in a pan and simmer gently until the onions are soft. Add the chicken livers and cook for 2-3 minutes. Transfer the livers and their cooking liquid to a food processor and blend until smooth. With the motor still running, gradually add the eggs and then the butter. Blend until well combined and completely smooth. Pass the parfait through a fine sieve into a bowl. Divide the parfait between four ramekins. Place the ramekins in a large deep roasting tin and pour boiling water into the tin to reach halfway up the ramekins. Cover the tin loosely with foil and carefully place in the oven for 20-25 minutes. Meanwhile, heat the sugar and vinegar in a pan until the sugar dissolves. Add the finely sliced beetroot to the mixture and simmer for 1-2 minutes. Drain the excess liquid and season to taste with salt and freshly ground black pepper. Mix with the finely sliced mint and set aside. Once the parfaits have cooked, remove from the oven set aside to cool. Soak the gelatine leaf in a bowl of cold water until soft, then squeeze out any excess water and add to the beetroot juice with 50ml\/1¾fl oz boiling water. Stir until the gelatine has dissolved. Pour the gelatine mixture over the parfait to form a thin layer and refrigerate until set. Serve with toasted sourdough and a spoonful of the pickled minted beetroot. ","ingredients":" 1 tbsp Madeira ,  1 tbsp port,  1 shallot, chopped,  1 tbsp brandy,  sprig thyme,  1 garlic clove, crushed,  250g\/9oz chicken livers (trimmed weight),  2 free-range eggs,  250g\/9oz unsalted butter,  50g\/2oz sugar,  50ml\/2fl oz red wine vinegar,  2 large fresh beetroot, 1 finely sliced, 1 juiced,  salt and pepper,  small bunch fresh mint, leaves picked and thinly sliced,  1 gelatine leaf,  sourdough bread, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_liver_parfait_98548"}