{"recipe_name":"Luxury chicken liver pâté","author":"Sophie Wright","programme":null,"prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_liver_pt_55821_16x9.jpg","method":"Heat the oil in a frying pan over a medium heat. Add the shallots and thyme and cook gently for five minutes, or until soft. Add the garlic, spices, orange zest and a good pinch of salt and pepper and cook for a further two minutes, or until fragrant. Add the chicken livers to the pan and fry for 6-8 minutes, or until just cooked through. To test, remove a piece of liver from the pan and cut it open; it should be moist but no longer bloody (a little tinge of pink is fine). Remove from the heat and spoon everything into a food processor. Blend until smooth. Add the brandy to the pan to deglaze, then add the cream and bring to a simmer. Cook for two minutes, stirring up any of the residue from the pan. Pour into the food processor and blend again until smooth. With the motor running, gradually add the cubed butter and blend until smooth. Pass the mixture through a fine sieve into a bowl and then divide between four ramekins. Smooth the tops down by banging the bottom of the ramekins against the work surface, then place in the fridge while you prepare the butter finish. Melt the butter in a saucepan with the ground mace and spoon over the pâtés. Sprinkle over the orange zest and thyme leaves to decorate. Refrigerate for two hours before serving with slices of toasted sourdough bread and cornichon pickles.  ","ingredients":" 1 tbsp olive oil,  2 shallots, finely chopped,  3 sprigs thyme, leaves only,  1 garlic clove, crushed,  pinch freshly grated nutmeg,  ½ tsp ground allspice,  1 orange, zest only,  sea salt and freshly ground black pepper,  400g\/14oz chicken livers, trimmed of any membrane and gristle, roughly chopped,  50ml\/2fl oz brandy,  100ml\/3½fl oz double cream,  120g\/4½oz unsalted butter, cubed,  80g\/3oz unsalted butter,  pinch ground mace,  ½ orange, zest only,  2 sprigs thyme, leaves only,  slices toasted sourdough bread ,  20 cornichon pickles","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_liver_pt_55821"}