{"recipe_name":"Chicken livers wrapped in a spiced omelette with a fennel and onion salad","author":"Cyrus Todiwala","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fennel and red onion salad, mix all of the ingredients together and set aside until ready to serve. Clean the chicken livers, taking care to remove all the membranes. Cut them into small pieces and put in a bowl.  Mix the ginger, garlic, chilli, turmeric, cumin, coriander and lime juice in with the livers. You can set this aside in the refrigerator for a few hours if you like.  Put the oil in a heavy-bottomed frying pan set over a high heat. When the oil begins to smoke, add the livers, spread them out and do not agitate the pan. After a few seconds shake the pan around or toss them, then let them settle again. (The pan has got to be really hot to prevent the livers from releasing too much liquid and losing their texture and flavour. Too much stirring introduces colder air to the base of the pan, thereby cooling it down.) If the pan remains hot enough the livers will cook within 2 minutes. To check the livers are cooked, remove a piece of liver from the pan and cut it open; it should be moist but no longer bloody (a little tinge of pink is fine). Season, to taste, with salt. Stir in half the coriander and mint (reserve the rest for the garnish). Immediately transfer to a colander set over a bowl to prevent any further cooking and to prevent the omelette from getting soggy from the juices from the livers. For the spiced omelette, break the eggs into a bowl and beat. Add the red onion, chillies, tomatoes and coriander. Season with salt and pepper and beat again.  Heat two small frying pans and add a tablespoon of oil to each. When the oil is hot, add half the egg mixture to each pan. Cook until browned on one side and cooked through. Remove from the heat. Divide the liver mixture between the two omelettes, sprinkle the sliced onion on top and garnish with the reserved coriander and mint. Roll up the omelettes. Cut the omelettes into two and serve with the salad alongside.  ","ingredients":" 1 small fennel, thinly sliced,  1 red onion, thinly sliced,  12-15 fresh mint leaves, finely shredded,  1 green chilli, finely chopped,  1 tomato, cut into four and sliced,  ½ lime, juice only,  1 tsp cider vinegar,  salt, to taste,  1 mango, peeled, stone removed, flesh chopped,  225g\/8oz chicken livers, trimmed,  1 x 2.5cm\/1in piece fresh ginger, peeled and finely chopped,  5-6 garlic cloves, peeled and finely minced,  1 green chilli, finely chopped,  ¼ tsp turmeric,  ½ tsp ground cumin,  1 tsp ground coriander,  ½ lime, juice only,  1-2 tbsp sunflower oil,  2 tbsp chopped fresh coriander,  1 tbsp chopped fresh mint,  salt, to taste,  4 medium free-range eggs,  1 medium red onion, finely chopped,  1-2 thin green chillies, finely chopped,  1 tomato, flesh only, finely chopped,  1 heaped tbsp finely chopped fresh coriander,  2 tbsp oil,  1 brown onion, sliced,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_livers_wrapped_23520"}