{"recipe_name":"Chicken meatballs in Asian-style noodle broth","author":"The Hairy Bikers","programme":"The Hairy Bikers' Cook Off","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02bzdpn.jpg","method":"For the meatballs, mix all of the meatball ingredients, apart from the oil, together in a large bowl then shape the mixture into small walnut-sized balls. Heat the oil in a large frying pan over a medium heat and fry the meatballs for 4-5 minutes, turning regularly, or until golden-brown all over. For the broth, bring the stock to the boil in a wok or large saucepan, then add the fish sauce, star anise and ginger and turn the heat down to a simmer. Add the noodles and cook for one minute, then stir in the spring onions, chilli and the browned chicken meatballs. Simmer for 2-3 minutes, or until the meatballs are completely cooked through. Stir in the Thai basil and add sesame oil and soy sauce, to taste.  To serve, transfer the noodles to two warm serving bowls using tongs. Place the meatballs on top and pour over the broth. Garnish with the chopped coriander and mint, the chilli slices and a squeeze of lime. ","ingredients":" 200g\/7oz chicken mince ,  1 lime leaf, shredded ,  1 lemongrass stalk, tough outer leaves discarded, soft inner core finely chopped ,  1 heaped tsp cornflour,  1 tbsp vegetable oil,  1 litre\/1¾ pints chicken stock ,  1 tbsp Thai fish sauce (nam pla),  2 star anise ,  2.5cm\/1in piece fresh root ginger, peeled and finely sliced,  50g\/2oz thin egg or rice noodles,  4 spring onions, thinly sliced,  1 red chilli, sliced, plus extra to garnish ,  8 Thai basil leaves, chopped,  toasted sesame oil, to taste,  soy sauce, to taste ,  1 small bunch fresh coriander, chopped ,  small handful mint leaves, chopped ,  1 lime, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_meatballs_in_27036"}