{"recipe_name":"Chicken pho","author":"Justine Pattison","programme":null,"prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_pho_97726_16x9.jpg","method":"Place the vegetables in the slow-cooker. Stir in the five-spice powder, 1 litre\/1¾ pints water and soy sauce until well combined.  Cut any string from the chicken, remove the skin by pushing your fingers between the breast meat and the skin and easing off the skin. Do the same with the legs, snipping off any skin around the wings or leg tips with scissors.  Place the chicken, breast-side up, in the slow-cooker, pushing it down among the vegetables. Season all over with salt and pepper.  Cover and cook on high for 4½ hours, or until the chicken is completely cooked through and very tender.  Drain the contents of the slow-cooker into a large bowl. Place the chicken on a chopping board and strip the meat from the carcass, thickly slice. Cover with foil.  Skim off the fat from the stock collected in the bowl using a large metal spoon. Pour the stock into a clean saucepan, stir in the fish sauce and place on a gentle simmer.  Half-fill a separate saucepan with water and bring to the boil. Add the noodles and cook until just tender, stirring regularly to separate them. Drain well. Divide the noodles equally among 4 deep serving bowls. Top each with chicken, spring onions, beansprouts and coriander. Ladle over the hot stock and season with soy. Garnish with the remaining sliced chilli and lime wedges. ","ingredients":" 1 onion, peeled, finely chopped,  4 garlic cloves, halved,  20g\/¾oz fresh root ginger, peeled, thinly sliced,  2 long fresh red chillies, sliced (or 1 tsp dried chilli flakes),  1 tsp Chinese five-spice powder ,  4 tbsp dark soy sauce, plus extra to serve,  1kg-1.2kg\/2lb 4oz-2lb 10oz whole chicken,  1 tbsp Thai fish sauce (nam pla),  200g\/7oz dried flat rice noodles,  6 spring onions, trimmed and thinly sliced,  100g\/3½oz beansprouts, rinsed and drained,  25g\/1oz fresh coriander sprigs,  1 long red chilli, thinly sliced,  1 lime, cut into wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_pho_97726"}