{"recipe_name":"Apricot frangipane tart","author":"Mary Berry","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 8-10","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/apricot_frangipane_tart_19845_16x9.jpg","method":"Preheat the oven to 190C\/170C Fan\/Gas 5. Heat a heavy, flat baking tray.  To make the pastry, either rub the flour and butter together using your fingertips until it resembles breadcrumbs or measure the flour and butter into a food processor and briefly process until just rubbed in. Add the sugar and mix, then add the egg and a tablespoon of water. Process until the mixture just holds together (do not over work as it will make the pastry tough). Wrap in cling film and chill for 20 minutes.  Roll the pastry out on a floured surface and use it to line a 28cm\/11in flan tin. Prick the base of the pastry using a fork then chill the pastry for 10 minutes.  Line the pastry case with parchment paper and fill with ceramic baking beans or uncooked rice. Place on the preheated baking tray and bake blind for about 15 minutes, or until the pastry is set and pale brown. Remove the beans and paper and return to the oven for about 10-12 minutes until the base is cooked.  For the filling, put the butter and sugar in a food processor and pulse until creamy (if you used a food processor for the pastry, there’s no need to wash it up). Add the eggs and blend, then mix in the ground almonds and almond extract.  Spread a thin layer of apricot jam over the base of the pastry and spoon the almond mixture on top. Bake for 30-40 minutes, until the filling is set. Remove from the oven and leave to cool. For the decoration, gently poach the apricot halves in water until tender. Set aside to cool slightly. Arrange the apricot halves in circles over the top of the tart. Warm the apricot jam over a low heat then pass through a fine sieve. Brush the warm apricot jam over the top of the fruit to glaze. Scatter over the flaked almonds. Serve the tart warm or cold. ","ingredients":" 225g\/8oz plain flour,  100g\/3½oz butter, cubed,  50g\/1¾oz caster sugar,  1 free-range egg,  175g\/6oz butter,  175g\/6oz caster sugar,  4 free-range eggs,  175g\/6oz ground almonds,  1 tsp almond extract,  200g\/7oz apricot jam,  8 ripe apricots, halved and stoned ,  4 tbsp apricot jam,  15g\/½oz flaked almonds, toasted","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/apricot_frangipane_tart_19845"}