{"recipe_name":"Chicken satay noodles","author":"Gregg Wallace","programme":"Eat Well for Less?","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_satay_noodles_95490_16x9.jpg","method":"Put the chicken in a bowl, add the soy sauce and cornflour and mix well. Cover and set aside for a few moments.  Meanwhile, bring a large pan of water to the boil, add the noodles and cook according to the packet instructions. Drain in a colander, rinse with cold water until they are cold, then drain once more and tip them back into the cold pan. Add half the rapeseed oil and toss. Heat a wok until hot, add the remaining rapeseed oil and the spring onions and stir-fry for 1 minute, or until softened. Add the peanut butter, chilli sauce and coconut milk and stir until combined. Bring to a simmer, then add the marinated chicken and poach for 4 minutes, or until cooked through. Add the sugar snap peas and simmer for another 2 minutes, or until nearly tender, then add the frozen peas, beans and sweetcorn. Return to the boil, stir in the lime juice and check the seasoning – you might want to add more lime juice or chilli, depending how hot you like it. Stir in the cooked noodles and heat for 1-2 minutes, or until hot through. Stir in the carrot shavings and spinach and remove from the heat. The heat from the dish will wilt the spinach down. Stir a couple of times. Serve in bowls, garnished with the cashews and coriander. ","ingredients":" 400g\/14oz chicken or turkey breast, cut into strips ,  2 tbsp soy sauce,  1 tsp cornflour,  375g\/13oz dried egg noodles,  2 tsp rapeseed oil,  6 spring onions, thinly sliced,  3 tbsp peanut butter,  2 tbsp sweet chilli sauce,  1 x 400ml tin reduced-fat coconut milk,  100g\/3½oz sugar snap peas,  150g\/5½oz mixed frozen beans and peas,  100g\/3½oz frozen sweetcorn,  1 lime, juice only,  1 carrot, shaved into thin slices using a vegetable peeler,  75g\/2¾oz baby spinach leaves,  2 tbsp roughly chopped cashew nuts,  2 tbsp freshly chopped coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_satay_noodles_95490"}