{"recipe_name":"Chicken leg tagine with prunes, apricots and roasted almonds","author":"Nassira Jmil","programme":"The Hairy Bikers: Mums Know Best","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 5","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_tagine_with_65235_16x9.jpg","method":"In a large bowl, mix half of the onion, half of the garlic, half of the coriander and half of the parsley. Add 2 tablespoons of the olive oil, the lemon juice, 1 teaspoon of the ginger, 1 teaspoon of cinnamon and the turmeric and season well with salt and freshly ground black pepper. Rub the chicken legs with the mixture to coat. Cover the bowl with cling film and leave to marinade for 2-3 hours, or, for best results, overnight in the fridge.  Preheat the oven to 180C\/350F\/Gas 4. Heat 1 tablespoon of olive oil in a frying pan. Fry the chicken on both sides until slightly brown and set aside.  Put the remaining olive oil, onion, garlic and 1 teaspoon of ginger into a tagine or into an ovenproof pot with a lid. Stir the mixture and place the chicken on top.  Heat the saffron in a dry pan and sprinkle it over the chicken. Sprinkle some freshly ground black pepper and 2 teaspoon cinnamon over the chicken and add a splash of water. Crumble the stock cube into the water and sprinkle with the remaining fresh parsley and coriander. Bake in the oven with the lid on for about 1 hour, or until tender. In a saucepan, cover the dried prunes with water and bring to the boil. Add half of the sugar and 1 teaspoon of cinnamon. Turn down the heat and let the prunes simmer until caramelised.  In another saucepan, cover the apricots with water and bring to the boil. Add the rest of the sugar and the rest of the cinnamon. Turn down the heat and let the apricots simmer until caramelised.  Check the tagine regularly, making sure that the sauce doesn’t dry.  To serve, garnish the tagine with the caramelised prunes and apricots and the toasted almonds. ","ingredients":" 2 medium onions, finely chopped,  3-4 garlic cloves, finely chopped,  few sprigs fresh coriander, finely chopped,  ½ bunch fresh flatleaf parsley, finely chopped,  4 tbsp olive oil,  ½ lemon, juice only,  salt and freshly ground black pepper,  2 tsp ground ginger,  5 tsp cinnamon,  ½ tsp ground turmeric,  10 chicken legs, skinned, rinsed under cold running water and patted dry,  pinch saffron,  1 chicken stock cube,  150g\/5½oz dried prunes,  6 tbsp sugar,  150g\/5½oz dried apricots,  100g\/3½oz almonds, blanched, skinned and toasted","vegetarian":false,"calories":632.0,"protein":50.0,"carbs":46.0,"sugars":44.0,"total_fat":26.0,"saturated_fat":4.0,"fiber":7.0,"salt":1.1,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_tagine_with_65235"}