{"recipe_name":"Chicken tagine with pomegranate tabbouleh","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 3-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01sdlmf.jpg","method":"For the chicken tagine, heat a large heavy-bottomed saucepan until hot. Add a little olive oil and the chicken thighs, skin-side down, and fry until golden-brown, then flip over and brown on the other side before transferring to a plate. Add the onion, garlic and ginger to the pan and gently fry for 2-3 minutes. Add all the spices and cook for a minute, then return the chicken to the pan and stir well to coat. Add the stock, chilli, tomatoes and honey and bring to the boil. Reduce the heat to a simmer, cover and cook for 20 minutes, or until the chicken is cooked through. Add the mint and coriander, then stir in the butter. Season, to taste, with salt and pepper. For the pomegranate tabbouleh, drain the bulgur wheat well, pressing down lightly to ensure all the water is removed, then place into a large bowl. Add all the other ingredients and mix well, then check the seasoning, adding salt and pepper to taste. To serve, pile the tabbouleh onto plates and spoon a chicken thigh and some sauce alongside. ","ingredients":" olive oil, for frying,  6 large chicken thighs,  1 onion, finely chopped,  2 garlic cloves, finely chopped,  5cm\/2in piece fresh root ginger, grated,  ½ tsp saffron,  1 tsp ground turmeric,  1 tsp ground coriander,  1 tbsp ras-el-hanout,  ½ cinnamon stick,  500ml\/18fl oz chicken stock,  1 red chilli, finely sliced,  2 tomatoes, roughly chopped,  2 tbsp clear honey,  2 tbsp roughly chopped mint leaves,  2 tbsp roughly chopped coriander,  25g\/1oz butter ,  salt and pepper,  150g\/5½oz bulgur wheat, soaked in cold water overnight,  3 tbsp roughly chopped mint ,  3 tbsp roughly chopped coriander,  ½ red onion, finely chopped,  50g\/1¾oz pistachio nuts, roughly chopped,  100g\/3½oz whole skinned almonds,  100g\/3½oz dried apricots, roughly chopped,  1 pomegranate, seeds only,  2 lemons, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_tagine_with_76052"}