{"recipe_name":"Chicken with asparagus and lemon crème fraîche sauce","author":"Mary Berry","programme":"Mary Berry's Absolute Favourites","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_with_asparagus_44206_16x9.jpg","method":"Preheat the oven to 180C\/160C Fan\/Gas 4.  Heat half the butter and half the oil in a large, deep, ovenproof frying pan. Season the chicken breasts with salt and pepper and fry, in batches if necessary, for 2 minutes on each side until golden-brown. Remove from the pan and set aside. Add the remaining butter and oil to the pan, tip in the shallots and fry over a high heat for 5–10 minutes or until lightly golden-brown. Put the flour in a bowl, whisk in 8 tablespoons of the stock and mix until smooth. Add to the pan and bring to the boil, then pour in the remaining stock. Add the lemon thyme and return the chicken to the pan. Cover with a lid and cook in the oven for about 20 minutes, or until the chicken is cooked through.  Just before serving, trim the tip from each asparagus spear and slice the stem into short, even lengths. Cook the tips and sliced stems in boiling salted water for 2-3 minutes. Drain, reserving the tips for a garnish. Stir the lemon juice, crème fraîche and parsley into the pan with the chicken. Add the sliced asparagus stems and bring to the boil. Remove the chicken, slice each breast into three and arrange on a plate. Spoon over the sauce and arrange two asparagus tips in a cross over the top. ","ingredients":" 50g\/1¾oz butter,  2 tbsp oil,  6 small chicken breasts, boned, skinned,  6 banana shallots, quartered lengthways,  30g\/1oz plain flour,  400ml\/14fl oz chicken stock,  1½ tbsp chopped lemon thyme leaves,  12 asparagus spears, woody ends snapped off,  1 large lemon, juice only,  200ml\/7fl oz full-fat crème fraîche,  2 tbsp chopped parsley,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_with_asparagus_44206"}