{"recipe_name":"Chicken with morels and a sherry wine sauce","author":"Raymond Blanc","programme":"Raymond Blanc: How to Cook Well","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_with_morels_and_97897_16x9.jpg","method":"Drain the morels, squeezing to extract as much of the soaking water as possible, making sure you reserve the water.  Pass the morel liquid through a fine sieve or muslin to remove any grit. Measure out 50ml\/2fl oz of the liquid for making the sauce later. Wash the morels again in plenty of water to remove any sand. Drain and squeeze any excess water from the morels. Chop them roughly and set aside. Season the chicken breasts with salt and pepper.  In a frying pan, melt the butter over a medium heat until it is foaming. Add the chicken breasts and colour lightly for three minutes on each side, remove from the pan and reserve. In the butter remaining in the pan used to cook the chicken, soften the soaked, cleaned morels and button mushrooms for 1-2 minutes and season with a pinch of salt.  Add the boiled wine or sherry, morel juice and double cream; bring to the boil and place the chicken breasts back into the pan. The cream sauce must cover the breasts. Lower the heat to barely a gentle simmer and cook for 7-10 minutes depending on the size of the chicken breasts.  Remove the chicken breasts from the pan and keep warm. Turn the heat up to boil the sauce and cook until the volume of liquid has reduced so that it coats the back of a spoon. Taste and add salt if necessary.    For the leeks, while the chicken breasts are cooking, bring 200g\/7oz of water, the salt and butter to the boil. Add the chopped leeks, cover with a lid and cook on full boil for three minutes. Drain the leeks. You can serve them as they are, or add them to the morel sauce at this stage. Place the chicken breasts into the sauce to reheat for two minutes. Taste and adjust the seasoning if required. To serve, place the chicken breasts and leeks on a large serving dish and pour the morel sauce generously over and allow your guests to help themselves.  ","ingredients":" 15g\/¼oz dried morel mushrooms, soaked in 250ml\/9fl oz water overnight ,  4 chicken breasts, preferably free-range and organic, skin off (about 180g\/6oz) ,  sea salt and freshly ground black pepper,  1 tbsp unsalted butter,  60g\/2¼oz button mushrooms, very firm, washed quickly, quartered,  100ml\/3½fl oz white wine or dry sherry, boiled for 30 seconds to remove the alcohol ,  200ml\/7fl oz double cream ,  pinch sea salt,  1 tbsp unsalted butter,  4 leeks, medium size, outer leaves removed, washed and cut into 2cm\/¾in pieces","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_with_morels_and_97897"}