{"recipe_name":"Chicken with tomato sauce","author":"Let's Get Cooking","programme":null,"prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chicken_with_tomato_23577_16x9.jpg","method":"Arrange the chicken fillets in a large microwave-safe dish using a fork and grind over some black pepper, if using. Drizzle with the oil and tuck in the fresh herbs or sprinkle with the dried herbs. Wash your hands. Cover with a lid or cling film, leaving a small area open, and cook on full power for two minutes. Remove the dish, peel back the cling film and turn the chicken so that any cooked parts on the outside are in the centre. Re-cover and cook for another minute. Remove the dish and transfer the chicken to a plate using a fork. Add the onion and garlic to the dish. Cook on full power for two minutes. Add the pepper and courgette to the onions, stir well and cook on full power for another two minutes. Add the tomatoes to the vegetables. Measure in the tomato purée, Worcestershire sauce and vinegar. Stir to combine. Add the chicken and any juices so that they are completely covered with tomato sauce. Cover the dish with cling film in the same way as before and cook on full power for three minutes. Carefully peel back the cling film, keeping your hands and wrists out of the way, as steam can cause burns. Stir the chicken fillets so that they can cook evenly. Re-cover and cook on full power for another five minutes. Remove the dish and leave to stand for two minutes. Carefully peel back the cling film and check that all the chicken is thoroughly cooked (no pink in the middle). If not, re-cover and cook for another 1–2 minutes each time until cooked. ","ingredients":" 400g\/14oz mini chicken fillets ,  black pepper (optional),  2 tsp vegetable oil,  2–3 sprigs rosemary or thyme (alternatively use ½ tsp dried herbs),  1 onion, chopped,  2 garlic cloves, finely chopped or crushed,  1 pepper (any colour), deseeded and chopped into 1cm\/½in chunks,  1 courgette, chopped into 1cm\/½in chunks,  1 x 400g\/14oz can chopped tomatoes,  1 tspspoon tomato purée,  1 tsp Worcestershire sauce,  1 tsp vinegar (balsamic or red wine)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chicken_with_tomato_23577"}