{"recipe_name":"Chicken alla Milanese","author":"Gino D'Acampo","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"With the help of a meat mallet, beat the chicken breasts between two sheets of cling film until thin.    Dust the chicken breasts in flour, then dip each into the egg and then in the breadcrumbs making sure each piece is well coated. Preheat the olive oil in a large frying pan and gently fry the chicken for approximately two minutes on each side, until they become golden and crisp. Place the browned breasts on some kitchen roll, allowing the excess oil to drain. Keep warm.  To make the sauce, in a large bowl, mix the tomatoes, olives and parsley together and season with some extra virgin olive oil and some salt and pepper. Allow this mixture to rest. In the meantime, shallow fry the garlic and the chilli in two tablespoons of olive oil for approximately 10 seconds.  Immediately add the spinach leaves, season with salt and cook for approximately three minutes, until softened. To serve, put some spinach in the middle of a plate, place a chicken breast on top and spread two tablespoons of the cold tomato mixture on top.  Serve immediately. ","ingredients":" 4 medium chicken breasts, skinless and boneless,  100g\/3½ plain flour,  1 handful of fine breadcrumbs, toasted,  2 eggs, beaten with salt and freshly ground black pepper,  4 tbsp Italian extra virgin olive oil,  4 fresh large plum tomatoes, chopped,  1 handful of pitted black olives, sliced,  3 tbsp flatleaf parsley, chopped,  10 tbsp Italian olive oil, for frying,  1 clove garlic, sliced,  2 pinches dried, crushed chilli,  500g\/1lb 1½oz spinach leaves, washed,  salt and freshly ground black pepper, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenallamilanese_72800"}