{"recipe_name":"Chicken Thai red curry","author":"Madhur Jaffrey","programme":null,"prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chickenandbambooshoo_90183_16x9.jpg","method":"If using tamarind paste, a couple of hours before you want to make the curry (or preferably the night before), place the tamarind pulp into a small bowl. Add hot or boiling water to cover (if the pulp is very dry, use boiling water). Soak the tamarind until it's very soft and pliable, for a few hours or preferably overnight. To obtain the pulp, remove the tamarind seeds and any tough fibres with your fingers. Discard. Place the pulp into a sieve set over a bowl and press the pulp through the sieve. For the curry paste, soak the chillies in five tablespoons of hot water for 1-2 hours. (You could also put them in a microwave oven for 2-3 minutes and then let them soak for about an hour.) Put the soaked chillies, together with their soaking liquid, into the bowl of a food processor, along with all the remaining paste ingredients in the order listed. Blend until you have a smooth paste. You may need to add a bit more water. This recipe will make about ten tablespoons of paste, so freeze or refrigerate what you don't use. For the curry, cut the chicken breasts crossways into 3mm\/1\/8in thick slices. Heat the oil in a wide, preferably non-stick, pan set over a medium-high heat. Carefully open the can of coconut milk without disturbing it too much. Remove four tablespoons of the thick coconut cream that will have settled at the top and place in a small bowl. Stir the remaining contents of the can well and set aside. When the pan is hot, add the coconut cream and stir. Add the curry paste and stir again. Stir fry for 3-4 minutes or until the oil separates and the paste is lightly browned. Reduce the heat to low and add the chicken, bamboo shoots, reserved coconut milk, lime leaves (or lemon zest), fish sauce, tamarind paste (or lemon juice) and the palm sugar (or brown sugar). Stir together well and bring to a simmer. The chicken should turn white and cook through by the time the first bubbles begin to appear. Simmer on a low heat for a further minute or two. Just before serving, sprinkle the basil leaves over the curry, stir gently and remove from the heat. Serve with jasmine rice. ","ingredients":" 30-55g\/1-2oz dried tamarind pulp, from a block,  hot water, to cover,  10-12 dried, hot red chillies (of the long, cayenne variety),  140g\/5oz shallots, chopped,  5 garlic cloves, peeled and chopped,  3 thin slices peeled fresh galangal, or fresh ginger,  1 tbsp fresh lemongrass that has been thinly sliced, crossways,  6-8 fresh coriander roots, washed well and coarsely chopped (use coriander leaves if unavailable),  1 thin slice of fresh kaffir lime rind, about 4cm x 0.5cm\/1½in x ¼in, or dried rind, soaked in water for 30 minutes (substitute ordinary lime rind, without the white pith, if unavailable),  ½ tsp freshly ground white pepper,  ¼ tsp shrimp paste, or 2 anchovies from a can, chopped,  ½ tsp ground cumin,  ½ tsp ground coriander,  2 tbsp bright red paprika,  450g\/1lb boned and skinned chicken breasts,  2 tbsp vegetable or groundnut oil,  400ml\/14fl oz can of coconut milk, left undisturbed for three hours or more,  5 tbsp red curry paste,  140g\/5oz sliced bamboo shoots from a can, drained and rinsed,  4 fresh kaffir lime leaves or 1 tsp lemon zest,  2 tbsp fish sauce, or to taste,  1 tsp thick tamarind paste or lemon juice,  1 tsp palm sugar or brown sugar,  15-20 fresh Thai (holy) basil leaves or ordinary basil leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenandbambooshoo_90183"}