{"recipe_name":"Chicken breasts with lemon and saffron","author":"Gennaro Contaldo","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, season the chicken breasts with salt and freshly ground black pepper.  Place in a dish together with the rest of the marinade ingredients. Mix together well, then cover and place in the fridge to marinate for two hours, turning the chicken breasts over from time to time. To cook the chicken, preheat the oven to 180C\/365F\/Gas 4. Heat a large ovenproof frying pan until hot, then add 90ml\/3fl oz of the extra virgin oil, the shallots, carrots and peas and gently fry over a low heat until the vegetables are just softened. Remove the vegetables from the pan with a slotted spoon and set aside.  Add the remaining 30ml\/1fl oz of olive oil to the pan and heat. Remove the chicken from the marinade and pat dry. Add the chicken breasts to the pan and fry for 2-3 minutes on both sides, until golden-brown all over.  Remove from the heat and add the vegetables, then, using a sieve, strain the marinade over the chicken. Discard the solid marinade ingredients. Transfer to the oven and cook for one hour, or until the chicken is cooked through and the sauce has reduced by half. About 15 minutes before the end of cooking time, pour in the saffron and its soaking liquid. To serve, remove the chicken from the oven and place onto plates. Place spoonfuls of vegetables alongside and spoon the sauce over. Garnish with freshly grated lemon zest sprinkled over the top. ","ingredients":" 4 chicken breasts, skins left on,  salt and freshly ground black pepper,  3 tbsp extra virgin olive oil,  1 lemon, zest only,  3 lemons, juice only,  175ml\/6fl oz white wine,  2 tbsp white wine vinegar,  1 small red chilli, finely chopped,  2 fresh bay leaves, torn,  120ml\/4fl oz extra virgin olive oil,  4 large shallots, cut into quarters,  2 carrots, cut into matchsticks,  150g\/5oz fresh peas ,  pinch saffron strands, soaked in 5 tbsp warm water,  1 lemon, zest only, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenbreastswithle_86699"}