{"recipe_name":"Chicken and pea risotto","author":"Simon Rimmer","programme":"Recipe for Success","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chickenbreastwithpea_87568_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6.  For the risotto, heat the oil in a pan and fry the onion until soft. Add the rice and stir well, then add the wine and simmer until reduced completely. Add a good ladleful of the hot stock and stir continuously. When all this has been absorbed, add more stock. Continue adding more stock, stirring continuously, until the rice is cooked. Season with salt and freshly ground black pepper and stir in the peas, asparagus, spinach, basil and cream For the chicken, season the chicken breasts well with salt and freshly ground black pepper. Heat the oil in a frying pan and place the chicken breasts skin-side down. Fry the chicken breasts on both sides until lightly browned.  Place the chicken breasts in an ovenproof dish and pour in enough stock to come one third of the way up the sides of the chicken breasts. Place in the oven for 15 minutes, or until completely cooked through. To serve, place the risotto into serving bowls. Slice the chicken and place on top of the risotto, then sprinkle with parmesan shavings. ","ingredients":" olive oil, for frying,  2 onions, sliced,  400g\/14oz arborio risotto rice,  splash white wine,  1 litre\/1¾ pint hot vegetable stock,  salt and freshly ground black pepper,  200g\/7oz fresh peas, blanched,  200g\/7oz asparagus, blanched ,  400g\/14oz baby spinach,  1 tbsp chopped fresh basil,  75ml\/2½fl oz double cream,  oil, for frying,  salt and freshly ground black pepper,  4 chicken breasts, skin on,  chicken or vegetable stock, to cover,  parmesan shavings, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenbreastwithpea_87568"}