{"recipe_name":"Chicken casserole with pilaff and green salad","author":"Rachel Allen","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/325F\/Gas 3.   For the chicken casserole, place the chicken into a large ovenproof pan or casserole. Add the carrot, onion, peppercorns, herbs, stock and white wine and bring to the boil. Season, to taste, with salt and freshly ground black pepper. Cover with a lid and place into the oven to cook for 1½-2 hours, or until the chicken is completely cooked. You can test if the chicken is ready by gently pulling the leg away from the carcass - it should come away easily and the juices should run clear when pierced with a skewer or sharp knife. (For a larger chicken, cook for 20 minutes per 450g\/1lb, plus 30 minutes extra.) Remove the chicken from the stock (reserving the stock) and place it onto a large plate. Remove all the meat from the carcass, discarding the skin and bones. Cut the chicken meat into strips approximately 1cm\/½in wide and 5cm\/2in long. Cover and keep warm. Strain the stock into a clean pan and discard the vegetables, peppercorns and herbs. Add the cream to the pan, bring up to the boil and boil, uncovered, for a few minutes. If the flavour is a little weak, boil for longer until reduced slightly. Season, to taste, with salt and freshly ground black pepper. Meanwhile, heat a saucepan over a medium heat and place the butter into the pan. When the butter has melted, add the flour, stirring continuously. Cook over a low heat for two minutes to form a roux. While the cream sauce is still boiling, gradually whisk in the roux - you need enough to thicken it so that it just coats the back of a spoon. Place the chicken and any juices back into the pan and season, to taste, with salt and freshly ground black pepper. Meanwhile, for the pilaff, heat the butter in a saucepan large enough to contain all of the rice. Add the chopped onion, put on the lid and cook over a low heat for about ten minutes, until the onion is soft. Add the rice and stir for about two minutes. Add the stock and season, to taste, with salt and freshly ground black pepper. Bring to the boil, then turn the heat right down and simmer gently for about ten minutes, or until the rice is just cooked and all the liquid is absorbed. For the salad, wash and dry the leaves and flowers and then tear them into bite-sized pieces. Place into a salad bowl. Place all of the remaining ingredients into a lidded jar, seal and shake to mix. Drizzle the dressing sparingly over the salad and stir to coat the leaves. To serve, pile the rice and salad onto serving plates and spoon the chicken casserole over the rice. ","ingredients":" 1 large chicken, about 2.5kg\/5½lb, giblets removed,  1 carrot, peeled and halved,  1 onion, peeled and halved,  6 black peppercorns,  large sprig fresh parsley,  large sprig fresh thyme,  750ml\/1¼ pints chicken stock,  250ml\/8fl oz white wine,  salt and freshly ground black pepper ,  250ml\/8fl oz single cream,  50g\/2oz butter,  50g\/2oz plain flour,  25g\/1oz butter,  1 small onion, chopped,  300g\/11oz basmati rice,  750ml\/1¼ pints vegetable or chicken stock,  salt and freshly ground black pepper ,  selection of edible leaves and herbs and edible flowers, such as wild garlic, nasturtium, edible chrysanthemum and chives,  3 tbsp extra virgin olive oil,  1 tbsp white wine vinegar,  1 tsp wholegrain mustard,  1 tsp clear honey,  1 large garlic clove, finely chopped,  sprig fresh parsley,  few fresh chives, chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickencasserolewith_88573"}