{"recipe_name":"Chicken chow mein","author":"Gordon Jones","programme":"Virgin Cooks","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the chicken strips into a bowl and season with the salt and Chinese five-spice powder.  In a small bowl, mix together the chopped chilli, grated ginger and chopped garlic. Add about a fifth of this mixture to the chicken and mix well, then set the chicken aside to marinate for a few minutes. Heat the groundnut oil in a wok until starting to smoke, then add the chicken and fry for 2-3 minutes, turning the chicken over once, until golden-brown all over. Transfer the seared chicken, along with any juices, from the wok into a bowl and set aside.  Return the wok to the heat and add the sesame oil. Fry the remaining chilli, ginger and garlic mixture for about 30 seconds, or until fragrant, then add the carrots, cabbage and broccoli and stir fry for 1-2 minutes.  Add the chicken back into the wok (reserving the juices).  In a small bowl, mix together the sake, Shaoxing rice wine, one teaspoon of the nam pla and the sweet chilli sauce, then add to the wok and stir well.  Add the chopped bok choi and spring onions to the wok along with the cooked egg noodles. Stir fry for 1-2 minutes to heat through, then add the beansprouts.  Add the light soy sauce, one tablespoon of sake, the remaining nam pla and the cornflour. Mix well to combine, then add to the wok and cook for one minute, or until the liquid has thickened slightly. To serve, season the chow mein with freshly ground black pepper and divide among four serving plates. Garnish with the fresh coriander leaves. ","ingredients":" 4 boneless skinless chicken breasts, sliced into thin strips,  salt, to taste,  Chinese five-spice powder, to taste,  1 red chilli, finely chopped,  1in\/2.5cm piece fresh root ginger, peeled and grated ,  4 cloves garlic, peeled and finely chopped,  1 tbsp groundnut oil,  1 tbsp sesame oil,  2 carrots, peeled and cut into matchstick pieces,  1 spring cabbage, core removed, leaves finely shredded,  ½ head broccoli, cut into small florets ,  2 heads bok choi, chopped,  4 spring onions, chopped,  400g\/14oz egg noodles, cooked according to packet instructions,  1 small bunch fresh coriander, leaves only, chopped,  60ml\/2fl oz sake, plus 1 tbsp ,  3 tbsp Shaoxing rice wine (available in some supermarkets or Asian grocers; substitute dry sherry if unavailable),  3 tbsp sweet chilli sauce,  1½tsp nam pla (Thai fish sauce),  1 tsp light soy sauce,  1 tsp cornflour,  1 handful beansprouts,  freshly ground black pepper, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenchowmein_92064"}