{"recipe_name":"Chicken kiev with sweet pepper sauce and fondant potatoes","author":"Tony Tobin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the kiev, divide the gorgonzola into two flat rounds and stuff inside the chicken breast pockets. Close over the chicken to seal the cheese within. Place the flour onto a plate and dredge the chicken breasts in flour, then dip them in the beaten egg and coat with the breadcrumbs. Repeat this again to ensure the chicken is completely cooked. Heat the oil in a deep pan until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.). Deep-fry the chicken breasts for four minutes until crisp and golden, then remove with a slotted spoon. Drain the chicken breasts on kitchen paper and place them on a baking tray. Bake for five minutes, or until the chicken is completely cooked through. For the fondant potatoes, melt the butter with the olive oil in a frying pan. Add the potato slices and sauté for two minutes on each side until golden. Season with salt and freshly ground black pepper. For the sauce, heat the olive oil in a frying pan and fry the red pepper.  Add the sugar and balsamic vinegar and boil to reduce until the sauce is thickened. To serve, place the chicken kiev onto the fondant potatoes on a plate and spoon around the sweet pepper sauce. ","ingredients":" 50g\/1¾oz gorgonzola,  1 chicken breast, cut in half, a pocket cut into the side of each piece,  50g\/1¾oz seasoned plain flour,  2 free-range eggs, beaten,  50g\/1¾oz white breadcrumbs,  500ml\/17½fl oz vegetable oil,  50g\/1¾oz unsalted butter,  1 tbsp olive oil,  2 thick slices of potato, blanched in boiling chicken stock,  salt and freshly ground black pepper,  1 tbsp olive oil,  ½ red pepper, chopped,  50g\/1¾oz caster sugar,  1 tbsp balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenkievwithsweet_85842"}