{"recipe_name":"Chicken koftas with yoghurt dressing","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to its highest setting. Heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry until softened. Remove from the heat and allow to cool. Place the chicken mince into a large bowl. Add the fried onion and garlic mixture. Add the chilli, cinnamon, nutmeg, paprika, cumin and parsley. Season with salt and freshly ground black pepper and mix together well. Shape small handfuls of the chicken mixture into walnut-sized balls. Thread three chicken balls onto a wooden skewer that has been soaked in water for ten minutes (to prevent burning). Repeat with the remaining mixture onto separate skewers, three balls to a skewer. Place the koftas under the grill to cook for 8-10 minutes. Turn regularly until golden-brown all over. Once golden-brown and crisp, baste all over with melted butter and lemon juice, and continue to grill until completely cooked through. For the yoghurt dressing, place all of the yoghurt dressing ingredients into a bowl and mix well. To serve, place a flatbread onto each plate. Add a couple of spoonfuls of cooked rice to each flatbread, then top with a kofta. Drizzle with the yoghurt dressing, sprinkle with chopped parsley and garnish with lemon wedges. ","ingredients":" 1 tbsp olive oil,  1 onion, finely chopped,  1 garlic clove, crushed,  450g\/1lb chicken mince,  1 bird's eye chilli, chopped,  ½ tsp ground cinnamon,  freshly grated nutmeg, to taste,  ½ tsp paprika,  ½ tsp ground cumin,  1 tbsp chopped fresh parsley,  salt and freshly ground black pepper,  butter, melted, to baste,  lemon juice, to baste,  200g\/7fl oz Greek-style yoghurt,  2 tbsp chopped fresh mint,  ½ cucumber, seeds removed, grated,  ½ lime, juice only,  flatbread,  rice, cooked according to packet instructions,  1 tbsp chopped fresh parsley,  lemon wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenkoftaswithyog_86636"}