{"recipe_name":"Chicken liver salad with bacon","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to high.  For the salad, lay the bacon rashers on a rack and place under the grill for 6-8 minutes, turning halfway through cooking, or until the bacon is golden-brown and crisp. Remove and drain on kitchen paper, then chop into small pieces. Set aside. Preheat the oven to 180C\/355F\/Gas 4. Place the bread cubes into a baking tray and drizzle over the olive oil. Mix well to coat, then season with salt and freshly ground black pepper. Bake in the oven for 15 minutes, or until the bread cubes are golden-brown and crisp. Remove from the oven and set aside to cool.  Heat the vegetable oil in a frying pan. Season the chicken livers with salt and freshly ground black pepper, then fry for 2-3 minutes on both sides, or until golden-brown but still slightly pink in the middle. Allow to cool slightly, then chop into bite-sized pieces. For the dressing, whisk the mustard and raspberry vinegar together in a bowl until well combined, then gradually add the olive oil, whisking continuously. Season with salt and freshly ground black pepper and stir in the chopped tarragon.  To serve, place the frisée lettuce, red onion, chicken livers and bacon into a large bowl and gently mix together. Drizzle with the dressing, then spoon onto serving plates. Garnish each salad with a few fresh raspberries. ","ingredients":" 250g\/9oz streaky bacon rashers,  250g\/9oz crusty bread, cut into 1cm\/½in cubes,  100ml\/3½fl oz olive oil ,  salt and freshly ground black pepper,  2 tsp vegetable oil,  400g\/14oz chicken livers, trimmed, sinew removed,  1 head frisée lettuce,  1 red onion, sliced,  fresh raspberries, to garnish,  1 tbsp Dijon mustard,  100ml\/3½fl oz raspberry vinegar,  300ml\/10½fl oz extra virgin olive oil,  salt and freshly ground black pepper,  1 tbsp chopped fresh tarragon","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenliversaladwit_91545"}