{"recipe_name":"Chicken salad with Thai basil and coconut dressing","author":"John Torode","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring the palm sugar, fish sauce and coconut milk to the boil in a pan. Reduce the heat until the mixture is simmering. Add the chicken thighs and poach in the liquid for 4-5 minutes, or until the chicken is just cooked through. (NB: The chicken is cooked through if the juices run clear when a skewer is inserted into the thickest part.) Remove the chicken thighs from the cooking liquid using a slotted spoon and pat dry with kitchen paper. Reserve the cooking liquid. Heat a griddle pan over a high heat. Add the poached chicken and cook for 3-4 minutes, turning regularly, until golden-brown griddle marks appear on all sides. Set aside.  Meanwhile, return the cooking liquid to the heat and bring to the boil. Continue to boil for 1-2 minutes, then transfer the cooking liquid to a bowl and place the bowl into a sink or large dish filled with ice, if using, or filled with cold water.  Add the sliced lime leaves to the hot coconut milk and whisk until the liquid has cooled and the lime leaves are fragrant. In a separate bowl, mix together the shallots, pepper, chillies and cucumber until well combined. Add one tablespoon of the coconut and lime mixture to the salad and mix to coat the ingredients in the dressing. When the chicken thighs are cool enough to handle, slice the meat into strips and add to the salad. Mix to combine.  Add the herbs and mix well to combine.  To serve, mix the teaspoon of vegetable oil with one teaspoon of water. Brush the squares of banana leaf with this mixture. Place one square of banana leaf into the centre of each of four serving plates. Divide the chicken salad equally among the squares of banana leaf. Drizzle over a little of the remaining coconut and lime dressing. Sprinkle over the peanuts and the coconut, if using. ","ingredients":" 50g\/2oz palm sugar,  50ml\/2fl oz fish sauce,  2 x 400ml\/14fl oz cans coconut milk,  8 boneless skinless chicken thighs,  ice cubes (optional),  8 lime leaves, very finely sliced,  4 red Thai shallots, peeled, thinly sliced,  1 red pepper, seeds removed, finely sliced,  3 small red chillies, finely sliced ,  1 cucumber, cut in half lengthways, seeds scooped out with a teaspoon, flesh julienned,  1 large bunch coriander, leaves only,  1 small bunch mint, leaves only,  1 small bunch Thai basil, leaves only,  1 tsp vegetable oil,  1 tsp cold water,  4 square pieces banana leaf, 15cm x 15cm\/6in x 6in (available from some Asian grocers),  50g\/2oz roasted salted peanuts, lightly crushed,  1 coconut, shell removed, flesh thinly sliced (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickensaladwiththai_91766"}