{"recipe_name":"Chicken stuffed with prosciutto, mascarpone and rosemary","author":"Theo Randall","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/390F\/Gas 6. Lay the chicken on a chopping board, skin-side down. Remove the two mini-fillets of chicken breast and set aside. Lay the slices of proscuitto over the chicken breast and stuff into the legs. In a small bowl, mix the mascarpone with the rosemary and lemon zest and juice. Place a spoonful of the mascarpone mixture onto both breasts and into the legs, reserving one spoonful. Flatten the mini-fillets slightly using a rolling pin and place back on top of the mascarpone-covered breasts. Roll the chicken over, tucking the legs back under and the skin around to neaten. Heat an ovenproof frying pan and add half of the olive oil. Season the chicken with salt and freshly ground black pepper, and place skin-side down in the frying pan. Fry for two minutes, or until the skin is golden-brown.  Place in the oven and roast for 18-25 minutes, until cooked through - test the chicken is cooked by piercing the meat with a skewer; if the juices run clear, the chicken is cooked. Remove the chicken from the oven and drain any excess fat out of the pan. Place the chicken onto a plate and rest, covered with aluminium foil, for five minutes. Add the final spoonful of the mascarpone mixture to the pan and whisk into the meaty juices. Meanwhile, bring a pan of salted water to the boil. Add the purple sprouting broccoli and Romanesco broccoli and cook for three minutes, or until just tender. Drain the broccoli and place back into the pan. Toss with the remaining olive oil and season with salt and freshly ground black pepper. To serve, carve the chicken in half and serve with the broccoli. ","ingredients":" 1 x 1.2-1.5kg\/2lb 9oz-3lb 4oz organic chicken, boned out (except the wing) - weight given is before bones are removed,  4 slices prosciutto ,  150g\/5oz mascarpone ,  2 sprigs fresh rosemary, finely chopped,  1½ lemons, zest and juice,  4 tbsp olive oil,  salt and freshly ground black pepper,  150g\/5oz purple sprouting broccoli, trimmed,  150g\/5oz Romanesco broccoli, cut into spears","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenstuffedwithpr_88077"}