{"recipe_name":"Chicken stuffed with Stilton served with sweet potato mash and Stilton sauce","author":"Brian Turner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, preheat the oven to 200C\/400F\/Gas 6. Slice the chicken lengthways to form a pocket and stuff with the Stilton.   Close and secure with cocktail-sticks and season with salt and freshly ground black pepper. Melt the butter with the oil in a non-stick pan and fry the chicken for two minutes on each side, or until pale and golden. Transfer the pan to the oven for 8-10 minutes, or until cooked through. (Test the chicken is cooked by piercing it with a knife or scewer. It is cooked when the juices run clear). For the mash, boil the sweet potato in salted water for ten minutes, or until soft. Drain and mash the potato with the butter. Season with salt and freshly ground black pepper. For the Stilton sauce, heat the oil and butter in a small pan. Add the onion and sauté for three minutes, or until soft. Add the garlic and cook for one minute. Add the white wine and simmer for 6-8 minutes, or until reduced to about one and a half tablespoons. Add the cream and simmer gently for two minutes. Add the Stilton, remove from the heat and stir until the Stilton has melted. Stir in the chervil and season with salt and freshly ground black pepper. To serve, fill a tall 5cm\/2in ring with mash placed in the centre of a dinner plate. Remove the ring and arrange the chicken breast on top of the mash. Spoon the sauce over the chicken and around the plate. Garnish with a sprig of chervil. ","ingredients":" 1 chicken breast,  55g\/2oz Stilton,  salt and freshly ground black pepper,  1 tbsp butter,  2 tsp olive oil,  200g\/7oz sweet potato, peeled, cut into cubes,  55g\/2oz butter,  1 tbsp olive oil,  1tbsp oz butter,  ½ onion, chopped,  1 garlic clove, chopped,  3 tbsp white wine,  5 tbsp double cream,  85g\/3oz Stilton,  1 tbsp chopped fresh chervil, plus an extra sprig, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenstuffedwithst_86015"}