{"recipe_name":"Chicken with caramelised walnuts","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the lemongrass, ginger and garlic into the base of a large steamer. Season the chicken breasts with salt and freshly ground black pepper and place on top of the flavourings. Place the lid on the steamer and place over a large pan of gently boiling water to steam for 25 minutes, or until the chicken is completely cooked through. Set aside to rest in a warm place. For the walnuts, place the water and sugar into a wok and bring to the boil. Cook for 5-6 minutes, or until thickened to a syrup, then add the walnuts. Stir well for 30 seconds, then drain off the liquid and set the walnuts aside. For the vegetables, place the stock in a pan and bring to the boil. Add the pak choi and broccoli and cook for 1-2 minutes. Drain the vegetables and plunge into ice cold water to stop the cooking process. In a separate pan, melt the butter. Add the pak choi and broccoli and fry for one minute, then add the soy sauce and sesame seeds.  To serve, slice the chicken breasts. Place a spoonful of pak choi and broccoli onto each plate and place a sliced chicken breast on top. Sprinkle with some caramelised walnuts and serve. ","ingredients":" 2 stalks lemongrass, bruised,  2.5cm\/1in piece fresh ginger, peeled, chopped into strips,  2 garlic cloves, sliced ,  4 x 175g\/6oz chicken breasts, skin removed,  salt and freshly ground black pepper ,  100ml\/3½fl oz water ,  100g\/3½oz sugar ,  150g\/5oz walnut halves,  500ml\/1 pint 2fl oz chicken stock ,  2 heads pak choi, cut in half ,  1 head of broccoli, cut into small florets ,  1 tbsp butter,  100ml\/3½fl oz light soy sauce,  1 tbsp sesame seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickenwithcaramelis_87588"}