{"recipe_name":"Chickpea and butternut squash casserole with scone topping","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chickpea_and_butternut_61022_16x9.jpg","method":"For the chickpea casserole, preheat the oven to 180C\/350F\/Gas 4. Place the butternut squash in a baking tray and drizzle it with one tablespoon of the vegetable oil. Roast the butternut squash for 8-10 minutes, or until tender. Meanwhile, heat the rest of the vegetable oil in a frying pan and fry the onion and garlic for 3-4 minutes, or until softened. Add the leeks and cook for a further 3-4 minutes. Add the cooked butternut squash and wine and cook for a further 5-6 minutes. Season with salt and freshly ground black pepper.  Stir in the crème fraîche, double cream, chickpeas and tarragon. Spoon the mixture into a casserole dish. Increase the oven temperature to 200C\/400F\/gas 6. Meanwhile, for the scone topping, boil the potatoes in pan of boiling salted water for 10-12 minutes, or until tender. Drain. Tip the cooked potatoes into a bowl and mash. Stir in the flour and butter until the mixture comes together as a dough. Roll the dough out on a floured surface to a 2.5cm\/1in thickness. Using a 10cm\/4in pastry cutter, cut out circles of the dough and place on top of the casserole. Bake in the oven for 10-12 minutes, or until golden-brown on top. ","ingredients":" 200g\/7oz butternut squash, cut into cubes,  2 tbsp vegetable oil,  1 onion, sliced,  2 garlic cloves, sliced,  2 leeks, cut into large pieces,  splash white wine,  salt and freshly ground black pepper,  200g\/7oz crème fraîche,  100ml\/3½fl oz double cream,  1 x 400g\/14oz can chickpeas, drained,  1 tbsp chopped fresh tarragon,  500g\/1lb 2oz potatoes, cut into small pieces,  100g\/3½oz self-raising flour,  50g\/1¾oz unsalted butter,  salt and freshly ground pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickpea_and_butternut_61022"}