{"recipe_name":"Chickpea curry with green mango and pomegranate","author":"Sejal Sukhadwala","programme":null,"prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the chickpeas into a large bowl, cover with the water and leave to soak overnight. The next day, drain the chickpeas, then place into a pan, cover with fresh water and boil until tender. Drain the chickpeas, reserving the cooking liquid. Place the onions, garlic and ginger into a food processor and pulse until very finely minced. Remove from the food processor and set aside. Place the tomatoes into the food processor and blend to make a purée. Heat a small frying pan and toast the whole spices over a medium heat, taking care not to burn them. When they begin to change colour and become fragrant, remove from the heat and allow to cool slightly. Crush the spices in a coffee grinder or pestle and mortar. Heat the sunflower oil in a large pan over a medium heat. Add the onion mixture and cook for 15 minutes, stirring frequently, until lightly browned. Reduce the heat, add the spice mixture and cook for five minutes. Add the puréed tomatoes and simmer for ten minutes, or until the oil floats to the surface and the sauce has thickened. Add the chickpeas, 750ml\/1.5 pints of the reserved cooking liquid, the chilli powder, ground turmeric, mango and pomegranate powders and salt. Bring to the boil, then reduce the heat and simmer the curry for 15 minutes. To serve, garnish the curry with chilli, ginger, mint leaves, pomegranate seeds and chopped green mango, if using. ","ingredients":" 250g\/10oz dried chickpeas,  1.5 litres\/3 pints water,  2 large onions, peeled and quartered,  4 garlic cloves, peeled,  5cm\/2in piece root ginger, peeled,  8 large tomatoes, blanched, peeled and halved,  1 tbsp coriander seeds,  1 tbsp white cumin seeds,  1 tsp black cumin seeds,  6 green cardamom pods,  2 black cardamom pods,  5cm\/2in piece cinnamon stick,  6 cloves,  ½ tsp fennel seeds,  ½ tsp mace blades ,  4 tbsp sunflower oil,  1 tsp red chilli powder,  ¼ tsp ground turmeric,  1 heaped tsp sun-dried mango powder (amchoor)(available from some specialist Asian stores), or 1 tbsp lemon juice,  1 heaped tsp sun-dried pomegranate powder (anardana) (available from some specialist Asian stores), or 1 tbsp pomegranate molasses or lemon juice,  salt, to taste,  1 red chilli, finely sliced,  2.5cm\/1in piece root ginger, finely sliced,  2 tbsp chopped fresh mint leaves,  2 tbsp fleshy pomegranate seeds,  1 small raw green mango, if available, stone removed, finely chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chickpeacurrywithgre_86124"}