{"recipe_name":"Arbroath smoked paté with green bean and roasted beetroot compôte","author":"Ed Baines","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Arbroath smoked pâté, preheat the oven to 200C\/400F\/Gas 6.  Line a terrine mould with clingfilm. Place the smoked haddock, gherkins, capers and wholegrain mustard in a food processor and blend.  Gradually add the softened butter, blending with each addition and finally add the parsley and lemon juice. Spoon the pâté in the terrine mould and place in the fridge to set. For the compôte, place the salt on a baking tray, put the beetroot on top and roast in the oven for 40 minutes.  Once cooked and cooled enough to handle, peel and dice the beetroot and set aside. Put the red wine vinegar, sugar, cumin seeds, coriander, green beans and chopped beetroot in a large saucepan and cook for 30-40 minutes on a low heat. Set the compôte aside to cool. Preheat the grill to high. Place the cherry tomatoes on a baking tray and roast in the oven for five minutes, or until slightly burst. Toast the walnut bread for one minute on each side under the hot grill. For the horseradish cream, put the crème fraîche and horseradish in a small bowl and mix. To serve, place a slice of the pâté on each of four rectangle plates with a spoonful of the compôte alongside. Top with a roast tomato. Spoon the horseradish cream in a line on one side of the plate and the toast next to the paste.  ","ingredients":" 1 Arbroath smoked haddock,  20g\/¾oz baby gherkins, drained,  20g\/¾oz capers, drained,  2 tsp wholegrain mustard,  150g\/5½oz unsalted butter, softened,  1 tbsp finely chopped flat-leaf parsley,  1 lemon, juice only,  walnut bread, frozen and thinly sliced,  200g\/7oz salt,  1 bunch beetroot, leaves removed, cut into quarters,  250ml\/9fl oz red wine vinegar,  125g\/4½oz caster sugar,  1 tsp cumin seeds,  1 tsp ground coriander,  100g\/3½oz green beans, cut into 1cm\/½in,  100g\/3½oz cherry tomatoes on the vine,  250g\/9oz crème fraîche,  2 tbsp creamed horseradish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/arbroath_smoked_pat_with_76550"}