{"recipe_name":"Childhood ice cream mousse cakes","author":"Andrew Smyth","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 12 individual cakes","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/childhood_ice_cream_94439_16x9.jpg","method":"First prepare the moulds for the mousses. Cut a strip of acetate long enough to just cover the inside circumference of a 7cm\/2¾in food ring. Using the inside of the food ring as a guide, stick the acetate together in a loop and secure with masking tape.  Create twelve loops and place them on a tray lined with baking paper (the tray needs to fit in your fridge or freezer). These will form the moulds for the mousse cakes. Preheat the oven to 200C\/180C Fan\/Gas 6. Grease and line a 33x22cm\/13x8½in Swiss roll tin with baking parchment. For the sponge, sieve the flour, sugar, cocoa powder and baking powder into a large bowl. Add the margarine and eggs and mix on high speed for 10 seconds using an electric mixer. Scrape down the sides of the bowl using a spatula and add the milk. Mix on high again for 20 seconds, or until fully combined. Pour the mixture into the lined Swiss roll tin and smooth the surface. Bake for 15–20 minutes on the middle shelf, until the middle of the sponge springs back when lightly pressed. Tip out the sponge onto a cooling rack and peel the greaseproof paper off. Set aside to cool. When the sponge is cool. Cut out twelve circles of sponge using a 7cm\/2¾in food ring as a guide. Press each circle neat-side down into the acetate guides and press to ensure the surface is flat and level. Plug any small gaps with offcuts of sponge, if necessary. For the mousse, put the chocolate in a large heatproof bowl over a saucepan half filled with gently simmering water (do not allow the water to touch the bowl). Stir with a spatula until almost melted, then remove from the heat and allow to melt completely. Set aside to cool (the chocolate should be as cool as it can be without setting). Add the whipping cream, double cream, egg whites and peppermint extract to a large bowl. Whisk using an electric mixer until soft peaks form when the whisk is removed. Add a drop of food colouring to make the cream pale green. Whisk to combine, add a little extra colouring if required.   When the chocolate has cooled as much as possible, but is still liquid, add a spoonful of the cream and quickly fold in to prevent lumps forming. Working quickly, gently fold the chocolate mixture into the cream until fully combined. Gently pour the mixture into a large disposable piping bag with a large hole cut at the tip. Pipe the mint mousse into the moulds to a depth of 3cm\/1¼in. Gently shake to level the top, if necessary. Chill in the fridge until the mousse is set (about 2 hours in the fridge or 30 minutes in a freezer).  For the honeycomb, grease and line a 20cm\/8in square loose-bottomed tin with non-stick baking paper. Add the caster sugar and golden syrup (use a tablespoon that has been sitting in boiling water to easily allow the syrup to slide off) to a deep saucepan over a medium heat (it’s important the saucepan is deep because the honeycomb will bubble up). Heat until the sugar is melted and the mixture has turned an amber caramel colour. Remove from the heat and quickly add the bicarbonate of soda. Beat vigorously until the bicarbonate of soda has dissolved and bubbles have started appearing. Pour the mixture into the prepared tin and leave to cool for at least 30 minutes. Once cool, peel away the baking paper and cut half of the honeycomb into triangular shards. Pulse the other half in a food processor to a rough crumb.   To assemble, remove the acetate collars carefully. If the mousse is sticking to the collar, return to the fridge or freezer and try again in 10 minutes. Neaten the edges by smoothing with a small offset palette knife if required.  Cover the top of each mousse with a layer of crushed honeycomb and finish with a shard of honeycomb. Place a mint leaf on top and brush with gold lustre dust, if using. ","ingredients":" 155g\/5½oz self-raising flour,  170g\/5¾oz caster sugar,  14g\/½oz cocoa powder,  1 tsp baking powder,  170g\/5¾oz baking margarine, plus extra for greasing ,  3 large free-range eggs,  1½ tbsp semi-skimmed milk ,  233g\/8¼oz white chocolate, grated or chopped into very small pieces ,  180g\/6¼oz whipping cream (at room temperature, but not warm as it won't whip),  180g\/6¼oz double cream (at room temperature, but not warm as it won't whip),  60g\/2¼oz pasteurized egg whites (1½ large free-range egg whites),  ¾ tsp American peppermint extract ,  green food colour gel,  unsalted butter, for greasing,  200g\/7oz caster sugar,  5 tbsp golden syrup ,  2 tsp bicarbonate of soda,  large bunch fresh mint, leaves picked ,  gold lustre dust (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/childhood_ice_cream_94439"}