{"recipe_name":"Chilled lobster consommé","author":"Jun Tanaka","programme":"Country Show Cook Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the consommé, fry the lobster shells in olive oil for five minutes, deglaze the pan with a small splash of the brandy and drain the shells in a colander.   In a separate pan, fry the carrots, fennel, garlic, star anise, coriander seeds and shallots in a dash of olive oil for five minutes.   Add the tomato purée and cook for three minutes.  Add the shells, chicken stock, brandy and tomatoes.  Bring to a simmer and cook for 40 minutes.  Remove from the heat, cool slightly and strain through a muslin cloth into a clean bowl. Leave to cool completely. To clarify the consommé, mix all the ingredients for the clarification in a blender and whisk it into the chilled lobster stock.   Place onto the heat and bring to a simmer.   Once a crust forms on the top, make a small hole with a ladle and simmer for 20 minutes. Remove from the heat and carefully strain through double muslin, taste and season if necessary.  Leave to chill in the fridge until ready to use. Cut the cooked lobster tails into segments and place in a chilled bowl.  Carefully arrange the garnish ingredients on top and then pour the chilled consommé over.  Finish with a drizzle of lemon oil. ","ingredients":" 4 lobster tail shells ,  dash olive oil,  50ml\/2fl oz brandy,  2 carrots, finely sliced,  ½ bulb fennel, finely chopped,  2 garlic cloves, chopped,  2 star anise,  1 tsp coriander seeds ,  2 shallots, finely sliced,  1 tbsp tomato purée,  1.5 litre\/2½ pints chicken stock,  3 plum tomatoes,  6 free-range egg whites,  ½ carrot,  ½ shallot,  sprig tarragon,  cooked tails and claws lobster meat from 4 lobsters,  1 bottle lemon oil,  100g\/3½ oz shelled broad beans, blanched and shelled again,  1 bunch baby carrots, blanched and cut into 1cm\/½in batons,  tarragon leaves, to taste,  1 bunch baby leeks, blanched and cut into batons,  100g\/3½oz samphire, blanched","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chilled_lobster_consomm_00047"}