{"recipe_name":"Arbroath-smokie cakes with chilli jam","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/arbroath_smokie_cakes_32036_16x9.jpg","method":"For the chilli jam, heat the sugar in a heavy-based saucepan over a medium heat until it melts and forms a golden-brown caramel. (Do not stir and keep an eye on it so that it doesn’t burn.) Blend all of the remaining chilli jam ingredients, except the crème fraîche, in a food processor to a smooth purée. Once the sugar has caramelised, pour in the puréed chilli jam mixture and stir well. Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool. Once the chilli jam mixture has cooled, stir in the crème fraîche until well combined. For the fish cakes, mix the Arbroath smokie, mashed potato, chilli and curry powder in a bowl until well combined. Season with salt and freshly ground black pepper and lime juice, to taste. Shape the mixture into 2cm\/¾in diameter balls. Sprinkle the flour onto one plate, beat the egg in a bowl then place the breadcrumbs on another plate. Dredge each ball in the flour, then dip it in the beaten egg and roll in the breadcrumb until completely coated. Heat the oil in a deep-fat fryer to 190C\/375F. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully lower the fish cakes into the hot oil and fry for 3-4 minutes, or until crisp and golden-brown and completely cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm until needed. Thread the cakes onto small skewers and arrange on a serving plate. Spoon the chilli jam into a bowl and serve alongside the cakes. ","ingredients":" 75g\/3oz caster sugar,  2 red chillies, roughly chopped,  3 plum tomatoes, roughly chopped,  8 lime leaves,  2 lemongrass stems, tough outer leaves removed, finely chopped,  25g\/1oz roughly chopped fresh ginger,  2 garlic cloves, peeled, left whole,  2 small shallots, roughly chopped,  4 tbsp Thai fish sauce (nam pla),  40ml\/1½fl oz sesame oil,  50ml\/2fl oz dark soy sauce,  2 tbsp clear honey,  3 limes, juice and zest,  110g\/4oz crème fraîche,  110g\/4oz Arbroath smokie, skinned, boned and flaked into small pieces,  110g\/4oz mashed potato,  1 red chilli, finely chopped,  1 tsp medium curry powder,  salt and freshly ground black pepper,  1 lime, juice only,  75g\/3oz plain flour ,  2 free-range eggs, beaten,  90g\/3½oz Panko breadcrumbs,  vegetable oil, for deep frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/arbroath_smokie_cakes_32036"}