{"recipe_name":"Chilli beef cornbread pies","author":"Paul Hollywood","programme":"Paul Hollywood's Pies & Puds","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chilli_beef_cornbread_76029_16x9.jpg","method":"To make the filling (which you can do ahead of time), first heat your oven to 170C\/325F\/Gas 3. Heat a tablespoon of oil in a flameproof casserole over a high heat. Add half the beef and brown it well.  Remove and set aside in a dish. Add the remaining meat, and a little more oil if necessary, brown it and set aside with the rest of the beef. Reduce the heat to medium-low and add a little more oil to the pan. Add the onion and garlic and cook for 5–8 minutes, until softened. Add the chilli, oregano, cocoa powder and tomato purée to the onions and stir in. Return the meat to the pan, along with any juices that have seeped from it, and cook for a few minutes. Season with salt and pepper. Add the tomatoes and beef stock, bring to a simmer, then cover and cook in the oven for an hour. Add the kidney beans and peppers and return to the oven for a further hour or until the meat is tender.  Check the seasoning (if it’s not hot enough for you, you can spice it up with a little chilli powder) then spoon the mixture into 4–6 deep, individual pie dishes, leaving about 2cm\/¾in below the rim. Turn the oven up to 180C\/350F\/Gas 4. To make the cornbread batter, mix the flour, cornmeal and salt in a large bowl. In a jug, combine the melted butter, eggs, buttermilk, green chilli and baking powder. Add to the dry ingredients and mix just until combined - don’t overmix. Top the chilli beef with the cornbread batter, then sprinkle cheese over each dish. Bake for about 30 minutes, until golden-brown. If you like, you can finish the pies under the grill for a few minutes to get a really nice golden-brown top. Serve immediately. ","ingredients":" 2 tbsp sunflower oil,  500g\/1lb 2oz shin of beef, trimmed and cut into 1cm\/½in cubes,  1 large onion, chopped,  2 garlic cloves, crushed,  1 red chilli, finely chopped,  1 tsp dried oregano,  ½ tsp cocoa powder,  1 tbsp tomato purée,  1 x 400g\/14oz tin chopped tomatoes,  200ml\/7fl oz rich beef stock,  salt and black pepper,  1 x 400g\/14oz tin kidney beans, drained and rinsed,  3 large roasted red peppers from a jar, deseeded and roughly chopped ,  125g\/4½oz plain flour,  125g\/4½oz cornmeal,  ½ tsp salt,  115g\/4oz unsalted butter, melted and slightly cooled,  2 free-range eggs, beaten,  250ml\/8fl oz buttermilk,  1 green chilli, deseeded and very finely chopped,  ½ tsp baking powder,  120g\/4¼oz strong Cheddar cheese, grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chilli_beef_cornbread_76029"}