{"recipe_name":"Chilli beef rendang","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chilli_beef_rendang_47873_16x9.jpg","method":"Blend the shallots, ginger, lemongrass, lime leaves, garlic, red chillies and 5 tablespoons water to a paste in a food processor. Scoop the mixture out into a large bowl and add the beef, mixing well until the meat is coated in the paste. Cover and set aside to marinate for at least 2 hours, and preferably overnight in the fridge. Put the dried chillies into a bowl and cover with boiling water from the kettle. Set aside for 30 minutes to soften. Heat the oil in a casserole over a medium heat. Add the cardamom, star anise, cinnamon, ground cumin and ground coriander and stir the spices into the oil until fragrant. Add the marinated beef and stir well to coat it in the spices.  Add all of the remaining ingredients except the lime juice (and the rice) and bring the mixture to the boil. Reduce the heat until the mixture is simmering. Drain the dried chillies, reserving the soaking water, and chop them finely. Add the chillies and 50ml\/2fl oz of the soaking water to the casserole and stir well. Cover with a lid and simmer for 2 hours, or until the beef is tender. Remove the lid and stir the curry, then simmer for a further 15-20 minutes, or until the sauce has thickened. Stir in the lime juice and season, to taste, with salt and freshly ground black pepper. Serve the beef rendang with jasmine rice. ","ingredients":" 2 large banana shallots, roughly chopped,  5cm\/2in piece fresh root ginger, peeled, roughly chopped,  2 lemongrass stalks, tough outer leaves discarded, core roughly chopped,  3 lime leaves, roughly chopped,  6 garlic cloves, peeled, roughly chopped,  4 long red chillies, roughly chopped,  1kg\/2lb 4oz stewing beef, cut into cubes,  1-2 small dried chillies, to taste,  1 tbsp rapeseed oil,  5 cardamom pods, lightly crushed,  3 star anise,  2 cinnamon sticks,  1 tbsp ground cumin,  1 tbsp ground coriander,  1 x 400ml tin coconut milk,  200ml\/7fl oz beef stock,  1 tbsp fish sauce,  1 tbsp palm sugar,  2 tbsp tamarind paste,  2 limes, juice only,  salt and freshly ground black pepper,  boiled jasmine rice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chilli_beef_rendang_47873"}