{"recipe_name":"Chilli beef with jacket potatoes","author":"Gregg Wallace","programme":"Eat Well for Less?","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6.  Rub the potatoes with 2 teaspoons of the oil then season with a little salt and black pepper. Prick the potatoes all over with a fork – this will let the steam escape and prevent the potato exploding! If you own metal skewers, push them lengthways through the potatoes – this makes them cook a little quicker (about 10-15 minutes, depending on the size of the potato). If using, make 4 little piles of salt on a shallow-sided baking tray equally spaced out over the tray. Rest a potato on top of each pile (this acts as a seat for the potato so that it doesn’t roll all over the tray, and also allows the heat to get all the way around the potato to cook it evenly). Bake for 45-60 minutes, or until crisp on the outside and fluffy and tender inside. To check that the potato is cooked all the way through, insert the tip of a knife into the potato – there should be little resistance. If there is, return to the oven for another 10 minutes, then try again. Meanwhile, mix the spices together in a medium bowl. Remove 2 teaspoons of the spice mix and set aside. Add the steak to the bowl and toss to coat. Heat a large frying pan until very hot. Add the remaining oil and the beef. Fry for 30-40 seconds on both sides until browned but not cooked through, then set aside. Add the onion and pepper to the pan, cover with a lid and gently fry for 2-3 minutes until just softened. Add the garlic, chilli and the reserved spice mix and fry for another 2 minutes, then add the chopped tomatoes. Bring to the boil then reduce the heat to a simmer, cover and cook for 4-5 minutes – by now the vegetables will be tender and the sauce slightly reduced. Add the beef and any juices, and cook for another minute until hot through. Season with salt and pepper then stir in the coriander. When the potatoes are tender, cut them in half lengthways and divide between the serving plates. Spoon the chilli beef over the top then finish with a dollop of soured cream, some grated cheese and a few jalapenos. ","ingredients":" 3 baking potatoes, washed and dried,  4 tsp rapeseed oil,  salt, to bake the potatoes on (optional),  1½ tsp ground cumin,  1½ tsp ground coriander,  ½ tsp ground cinnamon,  1½ tsp mild chilli powder,  300g\/10½oz sirloin or rump steak, fat removed, cut into 1cm\/½in thick strips,  1 red onion, thinly sliced,  1 red pepper, sliced,  2 garlic cloves, finely chopped or grated,  ½ - 1 red chilli (depending on how hot you like your food), seeds removed, sliced ,  1 x 400g tin chopped tomatoes,  1 tbsp roughly chopped coriander leaves,  sea salt and freshly ground black pepper,  100g\/3½oz soured cream,  45g\/1½oz grated mature cheddar,  30g\/1oz sliced jalapenos","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chilli_beef_with_jacket_37003"}