{"recipe_name":"Chilli cheese toast","author":"Cyrus Todiwala","programme":"The Incredible Spice Men","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes enough topping for 6–8 slices","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Melt the butter in a saucepan on a medium heat and mix in the flour with a wooden spatula, stirring continuously. Cook for two minutes, stirring all the while, to make a roux. Remove from the heat. Gradually whisk in the beer or milk, and stir briskly for a few seconds until there are no unmixed bits of roux about, and return to a medium heat. Cook, stirring often, until the sauce starts to thicken, then simmer gently for 3–4 minutes.  Remove the pan from the heat. Add the cheeses, egg yolks, salt, chopped chilli, garlic, pepper and chopped coriander, return to a low heat and cook gently until all the cheese has melted and the mixture starts to bubble at the edges – it will be very thick at this stage which is correct. Taste and adjust the seasoning if needed.  Heat the grill to maximum. Toast the bread, either under the grill on both sides or in a toaster. Dollop the rarebit mixture generously over the toast, place under the grill until bubbling and golden-brown in places. Serve hot with chutney. ","ingredients":" 50g\/2oz salted butter,  50g\/2oz plain flour,  about 250ml\/9fl oz beer or milk,  100g\/4oz mature Cheddar, grated,  100g\/4oz Caerphilly or other mature cheese, grated,  25g\/1oz Shropshire blue or other blue cheese, crumbled, or more to taste,  3 free-range egg yolks,  pinch salt,  2–3 mild fresh green chillies, seeds removed, finely chopped ,  1 garlic clove, finely crushed (optional),  1 tsp crushed black peppercorns,  1 heaped tbsp chopped fresh coriander,  2–3 tbsp English mustard,  6–8 thick slices bread,  chutney, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chilli_cheese_toast_71091"}