{"recipe_name":"Chilli tomato pizza and lobster calzone","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01sh1jt.jpg","method":"For the pizza dough, place the flours, salt, sugar and yeast into a large bowl and stir. Make a well in the centre of the flour and gradually pour in 650ml\/22fl oz water, gradually mixing in the flour to form a soft dough. Tip out and knead the dough on a work surface until smooth and elastic. Divide into four and roll into balls, then place in a tray, cover and leave to rise for 24 hours. When you’re ready to cook the pizzas, preheat the oven to 240C\/475F\/Gas 9 (or as high as it will go). Place a heavy baking tray or pizza stone in the oven to heat. Roll out the dough pieces until about 5mm thick then place onto an upturned, floured tray. Place the tinned tomatoes into a food processor and blend to a purée. Spoon the tomato purée thinly over two of the pizzas, just to the edges. Scatter over half the mozzarella and pecorino. Scatter over the chilli, then drizzle over half the peanut oil. Finish with a few basil leaves and season with salt and black pepper. Transfer to the oven, pushing the pizza onto the heated pizza tray or stone and cook for 5-8 minutes, or until cooked through and bubbling. For the calzone, cover half of each of the other two pizza bases with the tomato sauce, then top with the pieces of lobster and the rest of the mozzarella and pecorino. Drizzle over the mango chilli sauce and the rest of the peanut oil along with a scattering of basil and season with salt and black pepper. Fold the other half of the pizza over the top then crimp the edges and place on the heated pizza stone or tray. Cook for 5-10 minutes until golden-brown and crisp. Serve immediately. ","ingredients":" 800g\/1lb12oz Italian ‘00’ white flour,  200g\/7oz semolina flour, plus extra for dusting ,  1 tsp salt,  1 tbsp caster sugar,  14g\/½oz dried yeast ,  2 x 400g\/14oz tins San Marzano tomatoes,  2 large balls mozzarella, roughly torn,  50g\/1¾oz pecorino cheese, finely grated,  3 tbsp peanut oil,  1 large handful basil leaves,  2 chillies, finely sliced,  1 small cooked lobster, meat removed and cut into chunks,  1 tbsp mango chilli sauce,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chilli_tomato_pizza_and_84481"}