{"recipe_name":"Chilli and lemon roasted salmon with roasted plum tomatoes and chilli and fennel salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/365F\/Gas 4.  Line a baking tray with baking parchment. Cut the tomatoes in half lengthways and place onto the lined tray, cut-side up. Drizzle with olive oil, season lightly with salt and freshly ground black pepper. Sprinkle with the thyme leaves and place into the oven to roast for about 1½ hours, until they colour and shrink a little (if after an hour the tomatoes start to colour too much, cover them with foil). Increase the oven temperature to 200C\/400F\/Gas 6. Season the salmon fillets with salt and freshly ground black pepper, the chilli flakes and lemon juice. Place an ovenproof frying pan onto a high heat and add the olive oil. When very hot, place the salmon into the pan, skin-side down, and fry for 2-3 minutes, until the skin is crisp and browned. Turn the salmon over and transfer to the oven to bake for 5-8 minutes, or until the salmon is completely cooked through. To make the salad, place the fennel in iced water to crisp up. Mix the beans with the sliced onion, chilli, parsley leaves and lemon juice and season lightly with salt and freshly ground black pepper. For the dressing, mix together the soy sauce, olive oil, truffle oil and lemon juice in a large bowl. Drain the fennel and add to the dressing. Mix well and season, to taste, with salt and freshly ground black pepper. Divide the bean salad between four plates and sit the tomato halves on top. Place the salmon on top of the tomatoes and place a spoonful of fennel salad on top. ","ingredients":" 8 plum tomatoes,  1½ tbsp extra virgin olive oil,  salt and freshly ground black pepper,  3 sprigs fresh thyme, picked and chopped,  4 x 175g\/6oz salmon fillets, skin on,  salt and freshly ground black pepper,  1 lemon, juice only,  ½ tsp chilli flakes,  1 tbsp olive oil,  2 heads fennel, thinly sliced,  400g\/14oz can of flageolet beans, drained and rinsed,  1 red onion, thinly sliced,  2 red chillies, thinly sliced,  small handful fresh flatleaf parsley,  2 tbsp lemon juice,  salt and freshly ground black pepper,  2 tbsp soy sauce,  1½ tbsp extra virgin olive oil,  1 tbsp truffle oil,  2 tbsp lemon juice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chilliandlemonroaste_83847"}