{"recipe_name":"Chilli con carne","author":"Paul Merrett","programme":"Economy Gastronomy","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the braised mince, heat half of the vegetable oil in a large pan over a high heat. Add the onions, garlic and herbs and fry for 3-4 minutes, or until softened and golden-brown. Turn off the heat and set the pan aside. Heat a third of the remaining oil in a separate pan over a medium heat. Add a third of the beef mince and fry for 4-5 minutes, or until browned.  Transfer the browned mince to the pan containing the onions, garlic and herbs.  Repeat the process twice more with the remaining oil and the remaining batches of mince. (NB: Overloading the pan will not speed things up because the pan will lose heat, so take your time.) Return the pan containing the cooked mince and vegetables to a medium heat. Add the canned tomatoes and Worcestershire sauce and stir the mixture well to combine. Bring the mixture to a simmer. Meanwhile, crumble the stock cubes into a large heatproof jug and add 500ml\/18fl oz of boiling water. Stir until the stock cubes have dissolved. Add the stock to the beef and tomatoes mixture and bring to a simmer. Simmer for one hour, uncovered, or until the volume of liquid has reduced slightly and the sauce has thickened. Set aside to cool.  Meanwhile, for the chilli con carne, heat the oil in a large heavy-based pan over a medium heat. Add the onions and garlic and fry for 3-4 minutes, or until softened and slightly browned. Stir in all the ground spices until they coat the onions and garlic, then pour in the red wine and bring the mixture to a simmer, stirring occasionally. Simmer for 6-8 minutes, or until the volume of liquid has reduced by half. Add the chopped tomatoes, Worcestershire sauce and chopped red chillies and continue to simmer for 4-5 minutes, or until the sauce has thickened slightly.  Add the braised mince, mushrooms, kidney beans and beef stock, stir well, then simmer over a low heat, uncovered, for 40-45 minutes, stirring occasionally, or until the sauce has thickened and the flavours have intensified. To serve, divide the rice equally among four serving plates. Spoon over the chilli con carne. Place one tortilla alongside each serving. Place the soured cream and cheese into small bowls and serve alongside. ","ingredients":" 1½ tbsp vegetable oil,  2 small onions, peeled, chopped,  3 garlic cloves, peeled, chopped,  1 tsp chopped fresh thyme,  1 tsp chopped fresh rosemary,  500g\/1lb 2oz beef mince ,  200g\/7oz canned chopped tomatoes,  ½ tbsp Worcestershire sauce,  1½ beef stock cubes,  2 tbsp vegetable oil,  1 onion, peeled, finely chopped,  2 garlic cloves, peeled, finely chopped,  1 tsp ground cumin,  1 tsp ground coriander,  1 tsp chilli powder,  1 tsp smoked paprika,  350ml\/12fl oz red wine,  1 x 400g\/14oz can chopped tomatoes,  splash Worcestershire sauce,  2 red chillies, finely chopped,  800g\/1¾lb braised mince (see above),  250g\/9oz mushrooms, thickly sliced,  1 x 410g\/14¼oz can red kidney beans, rinsed, drained,  1 stock cube, dissolved in 250ml\/9fl oz boiling water,  300g\/10½oz long-grain rice, cooked according to packet instructions, drained,  4 warmed tortilla wraps,  1 x 142ml\/5fl oz pot soured cream,  100g\/3½oz mature cheddar, grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chilliconcarne_91965"}