{"recipe_name":"Chilli-stuffed chicken with tomato salsa and crushed potatoes","author":"Tony Tobin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Heat the oil in a deep heavy-bottomed saucepan, until very hot or until a breadcrumb sizzles in it. (CAUTION: Hot oil is very dangerous. Do not leave unattended.) To make the herby butter, place the butter, chilli, parsley and basil into a bow and mash together with a fork. For the chicken, divide the herby butter into two pieces and stuff into each of the chicken pockets. Place the flour into a bowl and dredge the chicken in the flour. Dip the chicken into the egg to coat, then dip into the breadcrumbs to coat. Repeat the dipping and coating with the egg and breadcrumbs. Carefully lower the chicken pockets into the hot oil and fry until crisp and golden. Remove with a slotted spoon and drain on kitchen paper. Place the chicken onto a baking sheet and transfer to the oven to cook for 5-6 minutes, or until completely cooked through. For the salsa, place the tomato, onion, chilli, coriander, oil and lime juice into a bowl, mix together and season, to taste, with salt and freshly ground pepper. For the potatoes, add the butter and olive oil to the cooked sweet potatoes, season, to taste, with salt and freshly ground black pepper and mash to your prefered consistency.  To serve, spoon the mash onto a plate with the chicken placed alongside, then spoon around some of the salsa. ","ingredients":" 500ml\/18fl oz vegetable oil, for deep frying,  55g\/2oz unsalted butter, softened,  ½ red chilli, chopped,  1 tbsp fresh parsley, chopped,  1 tbsp fresh basil, chopped,  1 chicken breast, cut in half (pockets cut into the side of each with a sharp knife),  50g\/1¾oz flour, seasoned with salt and freshly ground black pepper,  2 whole free-range eggs, beaten,  100g\/3½oz white breadcrumbs,  2 tbsp tomato, chopped,  1 tbsp onion, chopped,  1 tsp chilli, chopped ,  1 tbsp fresh coriander, chopped,  1 tbsp olive oil,  ½ lime, juice only,  ½ sweet potato, peeled, chopped and boiled until tender,  25g\/1oz unsalted butter,  1 tbsp olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chillistuffedchicken_84289"}