{"recipe_name":"Chinese duck noodle soup and wontons","author":"John Torode","programme":"Celebrity MasterChef","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make a duck stock, heat a large casserole or heavy-based saucepan and add the duck bones and any duck trimmings. Brown them and render out any fat and juices.  Add the vegetables to the pan with the star anise and black peppercorns. Pour in the chicken stock and cover with 600ml\/21fl oz water. Bring to the boil and cook for about 30 minutes. Meanwhile, remove the duck breasts from the crowns and score them. Season with Chinese five-spice and set aside in the fridge until ready to cook. Preheat the oven to 200C\/400F\/Gas 6 For the dumplings. chop the duck leg meat and place in a bowl. Mix with the chopped spring onion whites, soy sauce and sesame oil. Take the wrappers and moisten with a little cold water, place a small teaspoon of the mixture into the centre of each wrapper and fold together to form a dumpling. Make 20 dumplings. Place the duck breasts into a cold, ovenproof frying pan and gradually heat until the fat begins to render. Turn over and cook in the oven for six minutes. Remove after this time and allow to rest while you finish the soup. To finish the stock, put the root ginger, chilli, coriander root, whole spring onions and remaining four star anise in a clean pan. Strain the stock and pass through a fine sieve, then add it into the pan. Flavour with the fish sauce. Bring to a simmer and skim off any excess fat that rises to the surface. Add the dumplings and cook for 2-3 minutes. Pass the stock through a sieve again and reserve for serving. Cook the egg noodles according to packet instructions. To serve, arrange some egg noodles in each serving bowl along with five dumplings and a sliced duck breast. Pour over about a quarter of the stock, garnish with the greens from the spring onions, coriander leaves and sliced chilli. ","ingredients":" 500g\/1lb 2oz duck bones and trimmings, chopped,  1 carrot, chopped,  1 stalk celery, chopped,  1 onion, chopped,  1 leek, chopped,  2 star anise ,  1 tbsp black peppercorns,  600ml\/21fl oz chicken stock,  2 x duck crowns (or 4 duck breasts),  2 tsp Chinese five-spice,  2 duck legs, bones removed,  4 spring onions, white parts chopped, green parts reserved for garnish,  2 tsp dark soy sauce,  2 tsp sesame oil,  20 round dim sum (gyoza) wrappers,  1 piece root ginger, unpeeled, sliced,  2 red chillies,  6 coriander roots,  4 whole spring onions,  3 tbsp fish sauce,  4 star anise,  300g\/10oz fresh egg noodles,  small handful coriander leaves,  2 red chillis, seeds removed, sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chinese_duck_noodle_soup_76266"}