{"recipe_name":"Ching’s mala crispy Sichuan sausage with pickled chillies and wood ear mushrooms","author":"Ching-He Huang","programme":"Exploring China: A Culinary Adventure","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2-4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the sausages in boiling water and cook for 15 minutes, then drain. Slice the sausages on the diagonal into 1cm\/½in slices.  Slice the wood ear mushrooms and pickled chillies on the diagonal to resemble the long oval shape of the sausage pieces.  Heat a wok over high heat and add 1 tbsp of the vegetable oil. Add the wood ear mushrooms, garlic chives (or spring onions) and picked chillies and toss together in the oil. Stir fry for less than one minute on high heat, then spoon out onto a plate.  Place the wok back on high heat and add the remaining vegetable oil. Add the chilli bean paste, Sichuan peppercorns, Sichuan pepper oil, vinegar, light soy sauce and sugar.  Return the sausages, wood ear mushrooms, pickled chillies and garlic chives to the wok and toss together a few times in the fragrant hot oil to combine all the flavours. Take off the heat, spoon out onto a serving plate and eat immediately. ","ingredients":" 2 spicy Sichuan wind-dried sausages (or lap cheong, Cantonese dried sausage),  small handful of Chinese dried wood ear mushrooms, soaked in hot water for 20 minutes until soft and pliable, then drained ,  2 pickled long chillies,  2 tbsp vegetable oil,  1 small bunch of Chinese garlic chives (or baby spring onions), inner stems sliced on the diagonal into 4cm\/1½in pieces,  1 tsp chilli bean paste ,  1 tsp Sichuan peppercorns ,  1 tbsp Sichuan pepper oil,  1 tbsp black rice vinegar (or balsamic vinegar),  1 tbsp light soy sauce ,  pinch sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chings_mala_crispy_22564"}