{"recipe_name":"Chocolate, almond praline and saffron opera cake ","author":"Ruby Tandoh","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes 1 large cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Grease and line 3 x 23x31cm\/9x12.5in Swiss roll tins. For the sponge cake, whisk the egg whites until soft peaks form when the whisk is removed. Add the caster sugar and whisk to stiff peaks. Set aside. In a separate bowl, beat the almonds, icing sugar and eggs until doubled in volume. Fold in the flour, then stir in the melted butter and vanilla extract.  Fold in the stiff egg whites until incorporated and then quickly divide the batter equally between the prepared tins (approximately 275g\/9¾oz per tin). Bake in the preheated oven for five minutes, or until springy to the touch and lightly golden-brown.  When the cake is cooked set it aside to cool. For the praline buttercream, make a caramel. Melt 400g\/14oz of the caster sugar in a heavy-based pan until it is a deep golden-brown (CAUTION: do not leave unattended). Add the flaked almonds then spread in a thin layer on a silicon mat.  Set aside to cool. When the praline is cold and hard, break it into chunks and place in a food processor. Blend the praline to a powder. Add the remaining caster sugar and 80ml\/2½fl oz of water to a pan and slowly heat to 113C\/235F (use a sugar thermometer for this). Meanwhile, whisk the egg yolks in a freestanding mixer until light and fluffy.  When the sugar syrup reaches 113C\/235F add it to the egg yolks in a large bowl in a slow stream, whisking all the time. Keep whisking until the mixture has cooled. Beat the butter until soft then gradually add it to the yolk mixture. Stir in the crushed praline and set aside.  For the ganache, warm the cream over a low heat, then add the saffron and set aside to infuse for a few minutes.  Heat the cream to boiling point, then remove it from the heat and add the chocolate. Set aside for five minutes to let the chocolate melt.  Stir the cream to incorporate the melted chocolate. Mix in the soft butter and set aside to cool. Meanwhile, for the syrup, gently heat 150ml\/5½fl oz of water and the sugar in a pan to make a syrup. When all the sugar has dissolved bring the syrup to a boil for a few minutes. Remove from the heat and add the coffee essence, amaretto and saffron. Set aside. For the decoration, melt the dark chocolate and pour into a piping bag fitted with a plain nozzle. Pipe an 'O' for opera onto a rectangular piece of acetate\/greaseproof paper (approximately 7x5cm\/2¾x2in) and place it in the freezer to set. Meanwhile, melt half of the white chocolate in a heatproof bowl set over a pan of simmering water. When the chocolate reaches 45C\/113F add the saffron. Add 50g\/1¾oz of the remaining white chocolate and allow it to melt before stirring to combine.  When the dark chocolate ‘O’ is set hard, quickly smooth the melted white chocolate over the top and return to the freezer to set. When the white chocolate is almost set, peel away the acetate\/greaseproof paper and place the chocolate rectangle onto a chopping board (you'll see the dark 'O' against the white chocolate background). Tidy the edges using a sharp knife, if necessary, then return to the freezer to set completely.  To construct the cake, place one of the cakes on a serving plate. Drizzle over a third of the syrup, spread over half the buttercream and top with half the ganache. Place another layer of cake on top and repeat the process, using the same amount of syrup, half the remaining buttercream and all the ganache. Place the final layer of cake on top and drizzle with the remaining syrup. Cover the top with a thin, smooth layer of buttercream (a crumb coat) then place the whole cake in the freezer to set the buttercream (so it doesn’t melt when you add the dark chocolate glaze).  For the dark chocolate glaze, heat the cream until scalding. Pour the cream over the chocolate and leave to sit for a minute. Gently stir until the chocolate is completely melted and smooth, then add the liquid glucose. For the chocolate decoration, melt the remaining white chocolate and pour into a piping bag with a small plain nozzle attached.  When the buttercream is chilled, pour a smooth layer of the dark chocolate glaze on top of the cake, taking care not to let it run down the edges. Place the chocolate decoration in the middle and pipe the melted white chocolate into shapes to decorate.  ","ingredients":" 7 free-range eggs, whites only (yolks reserved for buttercream),  50g\/1¾oz caster sugar,  260g\/9½oz ground almonds,  260g\/9½oz icing sugar,  7 free-range eggs,  85g\/3oz plain flour,  55g\/2oz unsalted butter, melted and cooled, plus extra for greasing,  1-2 tsp vanilla extract,  700g\/1lb 9oz caster sugar,  200g\/7oz flaked almonds, toasted,  8 free-range egg yolks (partly from above) ,  300g\/10½oz butter, at room temperature,  230ml\/8fl oz double cream,  pinch saffron threads,  140g\/5oz dark chocolate (minimum 70% cocoa solids), broken into small pieces ,  140g\/5oz milk chocolate, broken into small pieces ,  1 tbsp soft butter,  150g\/5½oz caster sugar,  1 tsp coffee essence,  3-4 tbsp amaretto liqueur,  pinch saffron threads,  50g\/1¾oz dark chocolate,  300g\/10½oz white chocolate,  pinch saffron threads,  240ml\/8½fl oz cream,  225g\/8oz dark chocolate, finely chopped ,  1 tbsp liquid glucose (or butter) ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_almond_praline_58078"}