{"recipe_name":"Chocolate and ale cake with muscovado malt cream  ","author":"Tom Kerridge","programme":"Tom Kerridge's Proper Pub Food","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chocolate and ale cake, grease and flour a 25cm\/10in loaf tin. Preheat the oven to 180C\/350F\/Gas 4. Slowly mix the dark ale into the cocoa powder to form a paste.  In a separate bowl, beat the butter and soft dark brown sugar together until smooth and creamy, then add the eggs one at a time beating between each addition.  Stir in the cocoa and ale mixture. Sift in the flour, baking powder and bicarbonate of soda in batches, stirring between each addition. Pour the cake batter into the prepared tin and bake for 30-35 minutes, or until springy to the touch. Cool on a wire rack. Melt the chocolate in a heatproof bowl suspended over a pan of simmering water.  Beat the icing sugar and butter together to form a soft paste. Add four tablespoons of dark ale and then fold in the melted chocolate. For the muscovado and malt cream, whip all the ingredients together in a large bowl until thick and smooth. When the cake has cooled completely, cut it into slices.  Serve with the beer and chocolate icing spread over the cake and a dollop of muscovado and malt cream on the side. ","ingredients":" 200ml\/7fl oz dark ale, plus 4 tbsp for the icing,  50g\/1¾oz cocoa powder,  110g\/4oz butter, softened,  275g\/9¾oz soft dark brown sugar,  2 large free-range eggs,  175g\/6oz plain flour,  ¼ tsp baking powder,  1 tsp bicarbonate of soda,  220g\/8oz good-quality dark chocolate (minimum 70% cocoa solids) ,  220g\/8oz icing sugar,  100g\/3½oz soft butter,  250ml\/9fl oz double cream,  50g\/1¾oz muscovado sugar,  50g\/1¾oz malt extract,  pinch salt","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_and_ale_cake_72348"}