{"recipe_name":"Chocolate and bay tart","author":"Ian Cumming","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Makes 1 large tart","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the caramel, add the double cream and bay leaves to a saucepan and gently heat. Remove from the heat just before it comes to the boil and set aside to infuse. For the pastry, beat the butter with a wooden spoon in a mixing bowl. Mix in the icing sugar, ground almonds and salt. Beat in the egg then sift in the flour and cocoa. Mix until evenly combined. Shape the dough into a disc, wrap it in cling film and chill in freezer for 10 minutes, then in the fridge for another 5 minutes. Roll out the dough to 3–4mm thick and use it to line a 23cm\/9in tart tin. Chill in the freezer for 5 minutes.  Preheat the oven to 200C\/180C Fan\/Gas 6.  Line tart tin with baking parchment and fill with baking beans. Bake for 10 minutes, then remove the paper and baking beans and bake for another 5 minutes. Set aside to cool and reduce the oven temperature to 180C\/160C Fan\/Gas 4. For the caramel, heat the sugar in medium saucepan with about 3 tablespoons water (just enough to just soak the sugar). When the sugar is melted and a caramel has formed remove the pan from heat. Vigorously stir in the butter until melted and well combined. Stir in the bay infused cream bit by bit then add the sea salt. Return to the heat briefly to just warm though, then strain the caramel through a fine sieve and set it aside to cool to room temperature. Pour it into the pastry case and chill.  For the chocolate filling, gently heat the double cream in a saucepan. Put the chocolate in a heatproof bowl and pour the hot cream over. Wait a few minutes to allow the chocolate to melt then stir to combine. Whisk the eggs and caster sugar until pale and doubled in volume. Gently fold the eggs into the chocolate mixture then pour into the pastry case. Bake for 15 minutes, or until the filling is just set. Set aside to cool, then place in the fridge to chill. For the mirror glaze, bring the cream, sugar and 100ml\/3½fl oz water to the boil. Add the cocoa powder and boil for a few minutes, stirring all the time. Cool the mixture to 60C (use a kitchen thermometer for this), then add the gelatine leaves. When the gelatine is dissolved pour the glaze on top of the chilled tart. Transfer to the fridge to chill. For the chocolate bay leaves, melt the chocolate and paint it onto the back of the bay leaves using a pastry brush. Leave to cool at room temperature. When set, carefully peel the chocolate from the bay leaves. When the tart is fully chilled, place it on a serving plate and arrange the chocolate bay leaves on top of the tart. ","ingredients":" 150ml\/5fl oz double cream,  25 fresh bay leaves ,  300g\/10½oz golden caster sugar,  100g\/3½oz unsalted butter,  ½ tsp fine sea salt,  120g\/4oz unsalted butter, softened,  70g\/2½oz icing sugar,  25g\/1oz ground almonds,  pinch of salt,  1 large free-range egg,  175g\/6oz plain flour,  40g\/1½oz cocoa powder,  200ml\/7fl oz double cream,  200g\/7oz dark chocolate (minimum 80% cocoa solids), chopped,  2 large free-range eggs,  35g\/1¼oz caster sugar,  ⅓ tsp fine sea salt ,  80ml\/2¾fl oz double cream,  120g\/4oz caster sugar,  40g\/1½oz cocoa powder,  2 leaves gelatine, soaked in cold water for 10 minutes,  50g\/1¾oz good-quality white chocolate,  10 bay leaves ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_and_bay_tart_21002"}