{"recipe_name":"Chocolate and blackberry mousse cake with vanilla ice cream and blackberry sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the vanilla ice cream, whisk the egg yolks with 60g\/2¼oz caster sugar in a large bowl until thick and creamy. Place the remaining caster sugar, milk, cream and vanilla seeds and pods in a pan and bring to the boil. Pour the hot milk into the whisked yolks and stir well. Return the mixture to the pan and cook over a very low heat, stirring constantly with a spatula, until the mixture is thick enough to coat the back of a spoon. Cool the vanilla mixture, then refrigerate for at least one hour. Strain the mixture into an ice cream maker and churn until frozen, following the manufacturer's instructions.  For the chocolate and blackberry mousse cake, preheat the oven to 180C\/350F\/Gas 4. Grease a 24cm\/9½in springform cake tin and line it with greaseproof paper. Scatter the blackberries evenly over the base of the prepared cake tin. Place the chocolate and butter into a heatproof bowl set over a pan of simmering water (make sure the bowl doesn't touch the water) and allow the chocolate to melt, stirring occasionally. Remove from the heat and set aside to cool slightly. Place the egg yolks in a large mixing bowl with two tablespoons of the sugar and whisk lightly to combine. Place the egg whites in a separate bowl and whisk until soft peaks form when the whisk is removed from the bowl. Gradually add the remaining sugar to the egg whites, whisking continuously, until firm peaks are formed when the whisk is removed. Pour the melted chocolate into the bowl with the egg yolks and stir to combine. Fold one-third of the stiff egg whites into the egg yolk and chocolate mixture until combined, and then gently fold in the remaining egg whites. Pour the mixture into the cake tin and gently smooth over the top. Bake in the oven for 20-25 minutes, or until the cake is golden-brown and springy to the touch. The cake is done when a skewer inserted into the middle comes out clean. Remove the cake from the oven and leave to cool on a wire rack. To serve, melt the butter in pan and add the blackberries. Cook for 1-2 minutes. Place slices of the cake on serving plates along with a scoop of ice cream and a spoonful of the cooked blackberries. ","ingredients":" 6 medium free-range egg yolks,  120g\/4¼oz caster sugar,  250ml\/9fl oz full-fat milk,  250ml\/9fl oz double cream,  1 vanilla pod, split lengthways, seeds scraped out,  150g\/5½oz fresh blackberries,  300g\/10½oz dark chocolate, in pieces,  150g\/5½oz unsalted butter,  6 medium free-range eggs, separated,  50g\/1¾oz caster sugar,  50g\/1¾oz unsalted butter,  125g\/4½oz blackberries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_and_blackberry_33426"}