{"recipe_name":"Chocolate and chilli buns","author":"Mary-Anne Boermans","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Makes 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the roux, mix the flour and water in a small saucepan. Cook over a low to medium heat until it starts to thicken, then continue to cook for one more minute, then remove from the heat. Cover the paste with cling film and leave until it has cooled to room temperature. To make the dough, sift the dry ingredients into a large bowl. Stir in the yeast then add the beaten eggs, softened butter, chopped chilli and the roux mixture. Gradually add enough lukewarm water to form a soft dough then turn it out onto a floured board and knead for 10 minutes. Form the dough into a ball, place it in an oiled bowl and cover with cling film. Set it aside to rise in a warm place until it has doubled in size. Turn the dough onto a floured board, knock it back then knead in the chocolate chips and divide into 12 portions. Form the dough into balls, place on a greased baking sheet and set aside to rise for 20 minutes. Preheat the oven to 190C\/375F\/Gas 5. To glaze the buns, mix the egg with the water, brush onto the buns and scatter over the sliced chillies. Bake in the oven for about 12 minutes. ","ingredients":" 2 tbsp strong white bread flour,  150ml\/5fl oz water,  275g\/9¾oz strong white bread flour,  2 tbsp custard powder,  70g\/2½oz cocoa powder,  5 tsp chilli powder,  55g\/2oz caster sugar,  ¾ tsp salt,  1 sachet instant dried yeast,  3 free-range eggs, lightly beaten,  40g\/1½oz butter, softened,  1 large fresh red chilli, seeds removed and finely chopped,  about 225ml\/8fl oz lukewarm water,  200g\/7oz good quality chocolate chips,  1 free-range egg, beaten,  1 tbsp water,  2 large fresh red chillies, seeds removed and sliced","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_and_chilli_25191"}