{"recipe_name":"Chocolate and orange cake","author":"Candice Brown","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 20","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chocolate_and_orange_26890_16x9.jpg","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. Grease and line 3 x 20cm\/8in round cake tins. For the chocolate sponge, mix together the flour, cocoa, bicarbonate of soda and baking powder in a mixing bowl. Stir in the sugars, orange zest and ground almonds. Make a well in the middle. Using an electric handheld whisk, mix in the eggs, melted coconut oil, milk and syrup until well-combined and smooth.  Divide equally between two tins and bake for 30 minutes, or until springy to the touch. Leave to cool for a few minutes in the tin, then turn out onto a cooling rack. Remove the paper and allow to cool completely. For the orange sponge, put the flour, baking powder, butter, sugar and eggs, orange zest and the ground cardamom seeds in a bowl with half the orange juice. Mix well using an electric handheld whisk until smooth. Spoon into the prepared tin, smooth the surface out evenly and bake for 25 minutes, or until springy to the touch. Leave to cool in tin for few minutes then turn out onto cooling rack and leave to cool completely. Put the remaining orange juice and 2 tablespoons of sugar for the syrup in a saucepan. Cook over a low heat, stirring, until the sugar is dissolved and the syrup is thickened slightly. Set aside. For the ganache filling, put the cream into a saucepan over a medium heat until just approaching a boil. Take the cream off the heat and add the chopped chocolates and orange zest. Leave to melt for a few minutes before mixing until smooth and shiny. Cool until the mixture is a thick spreadable consistency.  For the chocolate icing, put the plain chocolate in a heatproof bowl over a pan of simmering water (ensure the bottom of the bowl does not touch the water). Melt until smooth then add the butter, stirring until the butter is melted and incorporated. Cool until the mixture is just pourable. To assemble the cake, trim the tops of the cakes so the layers are flat. Spread one quarter of the ganache filling over the top of one of the chocolate sponges. Brush the orange sponge with the orange syrup and place on top. Spread another quarter of the ganache over the orange sponge and place the second chocolate sponge on top. Use the remaining ganache to cover the outside of the cake completely, making a smooth surface.  Set the cake on a rack placed over a sheet of newspaper. Pour the chocolate icing over the top of the ganache and use an offset palette knife to push the icing over the whole cake. Carefully transfer the cake to a serving plate before the icing has set completely. Put the melted white chocolate into a disposable piping bag and drizzle over the cake. Scatter with flaked almonds to decorate.  ","ingredients":" 275g\/9¾oz plain flour,  3 tbsp cocoa powder ,  1½ tsp bicarbonate of soda,  1½ tsp baking powder,  150g\/5½oz golden caster sugar,  65g\/2¼oz soft brown sugar,  1 orange, zest only, finely grated,  25g\/1oz ground almonds,  3 large free-range eggs,  225ml\/8fl oz coconut oil, melted and slightly cooled,  225ml\/8fl oz whole milk,  3 tbsp golden syrup,  115g\/4oz self-raising flour,  1 tsp baking powder,  115g\/4oz soft unsalted butter,  115g\/4oz golden caster sugar, plus 2 tbsp for the syrup,  2 large free-range eggs,  1 orange, finely grated zest and juice,  10 cardamom pods, seeds only, crushed,  300ml\/10½fl oz double cream,  200g\/7oz orange and almond dark chocolate ,  200g\/7oz plain chocolate,  1 orange, zest only, finely grated,  500g\/1lb 2oz dark chocolate ,  225g\/8oz unsalted butter,  50g\/1¾oz white chocolate, melted,  toasted flaked almonds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_and_orange_26890"}