{"recipe_name":"Chocolate and orange panna cotta ","author":"Mary Berry","programme":"Mary Berry Cooks","prep_time":"overnight","cooking_time":"less than 10 mins","serves":"Serves 10","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01vqy2d.jpg","method":"Very lightly oil the pudding basins or ramekins. Heat the double cream in a small pan until it comes to the boil. Remove from the heat, then stir in the chocolate and stir continuously until the chocolate has completely melted.  Grate the zest of four oranges and add it to the chocolate cream. Squeeze the juice from two oranges and add eight tablespoons of the juice to the chocolate mixture with the sugar. Set aside all the remaining oranges. When the gelatin has softened, remove it from the water, shake off any excess water and place the gelatine into the hot chocolate mixture - stir until dissolved.  Strain the mixture through a sieve and then divide equally between the oiled pudding basins Place in the fridge and allow the panna cotta to set overnight or for at least six hours. Meanwhile, prepare the orange segments. Using a serrated knife, cut off all the peel and white pith from the remaining oranges (including the one that you have zested), working over a bowl to catch the juices. Cut between the orange membranes to remove the segments. Place the orange segments into the juice and chill in the fridge with the panna cottas. To turn out, fill a bowl with boiling water, then dip the moulds for just a second into the boiling water - no longer or the mixture will melt too much. Invert the moulds onto a plate to serve, with a few orange segments on each plate. ","ingredients":" sunflower or vegetable oil, for greasing,  1 litre\/1¾pints pouring double cream,  200g\/8oz plain chocolate, finely chopped (50% cocoa solids is fine),  7 oranges,  100g\/3½oz caster sugar,  4 leaves platinum grade gelatine or 9 leaves regular gelatin, soaked in water for 10 minutes.","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_and_orange_61942"}