{"recipe_name":"Chocolate and raspberry doughnuts","author":"Paul Hollywood","programme":"The Great British Bake Off","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Makes 18 doughnuts","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chocolate_and_raspberry_74498_16x9.jpg","method":"For the doughnuts, put the flour into the bowl of a freestanding mixer fitted with a dough hook. Add the salt and sugar to one side of the bowl and the yeast to the other. Add the milk and eggs and mix on a low speed for two minutes, then on a medium speed for a further 6-8 minutes, until you have a soft, glossy, elastic dough.  Add the softened butter to the dough and continue to mix on a medium speed for a further 4-5 minutes, scraping down the sides of the bowl occasionally to ensure that the butter is incorporated. The dough will be very soft. Place the dough in a plastic bowl, cover with cling film and place in the fridge overnight (or for at least seven hours), until it has firmed up and you are able to shape it. Tip the dough out onto a very lightly floured work surface, and knead it a few times. Divide the dough into 18 equal portions (approximately 30g\/1oz each) and flatten each portion slightly.  Place a piece of chocolate or a raspberry in the centre of each piece of dough. Then gently fold the dough up and over the raspberry or chocolate and shape each portion into a ball. Keep the two flavours separate and place on a large baking tray in a plastic bag and leave to prove for 20 minutes.  Preheat a deep-fat fryer, filled with sunflower oil, to 170C\/340F (CAUTION: hot oil can be dangerous. Do not leave unattended).  Lower the chocolate doughnuts carefully into the fryer, cooking each side for about three minutes, or until golden-brown. Using a slotted spoon, carefully remove the doughnuts from the fryer and set aside to drain on kitchen paper and cool completely. Lower the raspberry doughnuts carefully into the fryer, cooking each side for about three minutes, or until golden-brown. Remove from the oil with a slotted spoon and immediately roll in caster sugar so that the hot fat helps the sugar stick to the sides. Set aside and leave to cool. To decorate the chocolate doughnuts, spoon the melted dark and white chocolate into two small, disposable piping bags. Snip off the ends and pipe a zigzag pattern of dark chocolate, then of white chocolate, over each chocolate doughnut. Leave to set. Once set, serve and enjoy.  ","ingredients":" 250g\/9oz strong white flour, plus extra for dusting,  4g salt,  25g\/1oz caster sugar, plus extra for rolling,  5g instant yeast,  70ml\/2⅓fl oz full-fat milk, warmed,  2 large free-range eggs,  125g\/4½oz unsalted butter, softened,  9 large raspberries,  100g\/3½oz plain chocolate (36% cocoa solids), broken into 9 squares,  sunflower oil, for deep-fat frying,  50g\/1¾oz white chocolate, melted,  50g\/1¾oz dark chocolate, melted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_and_raspberry_74498"}