{"recipe_name":"Chocolate and raspberry two-tier opera cake","author":"Mary-Anne Boermans","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 20","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the raspberry syrup, preheat the oven to its lowest setting.  Place the raspberries into an ovenproof bowl, cover with the sugar and place in the oven for an hour. Press the softened fruit with a spoon to release the juice. Stir the mixture until the juice and sugar are well combined, then press the mixture through a sieve. Stir in the lemon juice and raspberry vodka, allow to cool, then place in the fridge. For the joconde sponge, preheat the oven to 220C\/425F\/Gas 7. Grease and line two 46cm x 33cm\/18in x 13in baking trays. Whisk the egg white in a clean bowl until soft peaks form when the whisk is removed. Slowly whisk in the sugar and continue to whisk until stiff peaks form. Cover the bowl with cling film and set aside. Beat the almonds, icing sugar and eggs together in a separate bowl for 3-5 minutes, or until the mixture has doubled in volume. Fold in the flour and cocoa powder. Gently fold the whisked egg whites into the mixture.  Spoon a little of the mixture into the melted butter and mix until well combined.  Tip the butter mixture into the cake mixture and fold together until just combined. Divide the mixture evenly between the two tins, spreading it smooth, especially at the corners. Bake for 5-7 minutes, or until pale golden-brown and cooked through. Remove the cakes from the oven, cover with a large piece of greaseproof paper and carefully turn out the cakes. Peel off the greaseproof paper from the bottom of the tin. Cut each cake in half and set aside to cool completely. Meanwhile, for the French buttercream, whisk the egg yolks for five minutes in a bowl, or until pale and foamy. Heat the sugar and water in a saucepan until it reaches 120C\/250F (use a sugar thermometer to check this). While whisking the egg yolks, slowly pour the syrup down the sides of the bowl. Continue to whisk for a further five minutes, or until the bowl is no longer warm to the touch. Beat the butter into the mixture, one piece at a time, then add the vanilla essence and melted chocolate. Gently fold the raspberries into the buttercream. Set aside. For the chocolate buttercream, beat the butter and icing sugar together in a bowl until pale and fluffy. Beat in the melted chocolate and liqueur. For the chocolate ganache, break the chocolate into small pieces and place into a bowl. Heat the golden syrup and double cream in a saucepan until just boiling. Pour the cream mixture onto the chocolate and set aside for two minutes. Whisk the ganache until smooth, then whisk in enough hot water to loosen the ganache into a pouring consistency. To assemble the cake, place one cake square onto a serving plate and generously brush with raspberry syrup. Spread over half of the French buttercream. Top with another cake square and generously brush with more raspberry syrup. Spread over the chocolate buttercream. Place another cake square on top and generously brush with the raspberry syrup. Spread over most of the remaining French buttercream (reserving three tablespoons for the top).  Top with the final cake square and generously brush with the raspberry syrup. Spread with the remaining French buttercream.  Finally, spread the chocolate ganache over the top of the cake, right to the edges.  Leave the cake to chill in the fridge for 30 minutes, or until the icing has hardened, then trim the edges with a sharp knife. ","ingredients":" 300g\/10½oz raspberries,  150g\/5½oz caster sugar,  ¼ lemon, juice only,  50ml\/2fl oz raspberry vodka,  6 free-range egg whites ,  25g\/1oz granulated sugar,  225g\/8oz ground almonds,  225g\/8oz icing sugar, sifted,  6 free-range eggs,  40g\/1½oz plain flour,  40g\/1½oz cocoa powder, sifted,  85g\/3oz butter, melted,  3 free-range egg yolks, room temperature,  55g\/2oz caster sugar,  2 tbsp water,  225g\/8oz unsalted butter, cubed, softened,  1 tsp vanilla essence,  125g\/4½oz white chocolate, melted,  300g\/10½oz raspberries,  115g\/4oz unsalted butter, softened,  115g\/4oz icing sugar,  115g\/4oz plain chocolate (minimum 70% cocoa solids), melted,  30-50ml\/1-2fl oz raspberry liqueur,  250g\/9oz plain chocolate (minimum 70% cocoa solids),  125ml\/4fl oz golden syrup,  125ml\/4fl oz double cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_and_raspberry_84016"}