{"recipe_name":"Chocolate, cardamom and hazelnut babka","author":"Rav","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 1 loaf","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chocolate_cardamom_and_62885_16x9.jpg","method":"For the dough, combine the milk, half the sugar and the yeast in a jug. Add the egg and lightly beat to combine. In a large bowl, mix the flour, salt, cardamom and the remaining sugar until well combined. Add the milk mixture and combine. Knead in the bowl until you have a smooth dough. Rub about 10g\/¼oz of the butter onto a clean work surface. Tip the dough out and knead in another 20g\/¾oz butter until well combined and the dough forms a smooth ball. Transfer the dough to a lightly buttered bowl and cover with cling film. Prove in a warm place until doubled in size. For the glaze, heat the caster sugar and 112ml\/3¾fl oz water in a saucepan. When the sugar has dissolved, set it aside to cool.    Tip the dough out onto the work surface and roll out into a rectangle approximately 26x35cm\/10½x14in. Spread the remaining butter on the dough and sprinkle over the chocolate and hazelnuts. Roll it up like a sausage and pinch the edges together to seal. Using a sharp knife, cut the dough lengthways to make two strands. Pinch the two pieces together at one end and then tightly braid together. Transfer to a loaf tin, cover with a proving bag and put in a warm place to prove until doubled in size. Preheat the oven to 190C\/170C Fan\/Gas 5. Whisk the egg yolk with 2 teaspoons water then brush onto the proved loaf. Bake for 27 minutes, or until golden-brown. Leave to cool a little in the tin, then  brush the sugar syrup onto the loaf. Remove from the tin and leave to cool completely on a wire rack. ","ingredients":" 120ml\/3¾fl oz full-fat milk,  50g\/1¾oz caster sugar,  1½ tsp fast-action yeast,  1 large free-range egg,  280g\/10oz strong white flour, plus extra for dusting,  ½ tsp salt,  1 tsp ground green cardamom seeds,  60g\/2¼oz unsalted butter, softened, plus extra for greasing,  60g\/2oz dark chocolate, chopped into small pieces,  15g\/½oz white chocolate, chopped into small pieces,  25g\/1oz hazelnuts, chopped into small pieces,  1 large free-range egg yolk,  130g\/4⅔oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_cardamom_and_62885"}