{"recipe_name":"Chocolate, cherry and hazelnut brownies","author":"Beca Lyne-Pirkis","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 12-16 brownies","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/160C fan\/350F\/Gas 4. Grease and line the bottom and sides of a 30x23cm\/12x9in baking tin with butter. Put the dark chocolate and butter in a small saucepan and heat until just melted.  Remove from the heat and leave to cool slightly.   In a large mixing bowl, beat the sugar and eggs together until light and frothy. In a separate bowl, combine the flour with the salt.   Once the chocolate has cooled slightly, add it to the sugar and egg mixture and mix until combined.  Gradually add the flour and salt mixture, mixing well between each addition.   Stir in the cocktail cherries, hazelnuts and 150g\/5½oz of the white chocolate. Mix until evenly distributed then pour into the greased and lined tin and smooth the mixture into the corners.   Melt the remaining 50g\/1¾oz white chocolate and place evenly distributed blobs of chocolate on top of the brownie mixture. Use a cocktail stick to swirl the blobs of chocolate into the mixture. Place a fresh cherry at the base of each swirl.  Place on the middle shelf in the oven and bake for approximately 35-40 minutes, or until just set.  Be careful not to overbake the brownies. Leave to cool in the tin for 10 minutes, then remove carefully and place on the wire rack to cool.  When cooled cut into 12-16 pieces  and arrange in a mound of fudgy goodness on a pretty plate liberally dusted with icing sugar. ","ingredients":" 300g\/10½oz unsalted butter, plus knob for greasing,  300g\/10½oz dark chocolate (minimum 70% cocoa solids),  450g\/1lb caster sugar,  5 large free-range eggs,  200g\/7oz plain flour,  1 tsp salt,  1 x 225g\/8oz jar maraschino cocktail cherries, drained, chopped,  150g\/5½oz blanched hazelnuts, roughly chopped,  200g\/7oz white chocolate, chopped into rough chunks,  15 fresh cherries ,  icing sugar, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_cherry_and_80567"}