{"recipe_name":"Chocolate fondant puddings with lime syrup and coconut custard","author":"The Hairy Bikers","programme":"Hairy Bikers Everyday Gourmets","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chocolate_fondant_78091_16x9.jpg","method":"For the chocolate fondants, generously grease six 175ml\/6fl oz dariole moulds with butter, then line the base of each with a small circle of baking parchment. Mix together the cocoa powder and plain flour in a bowl and sift a little into each dariole mould, rolling them around to coat the base and sides. Shake out any excess. Bring a little water to a simmer in a saucepan. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the surface of the water). Add the chocolate and butter to the bowl and stir until smooth and melted. Remove the bowl from the heat and set aside to cool for 10 minutes. Meanwhile, whisk the eggs, egg yolks, caster sugar and lime zest together in a bowl, using an electric whisk. (When the mixture is pale and thick, and the whisk leaves a trail across the mixture when lifted out, the mixture is ready.) Gently fold in the melted chocolate mixture using a large, metal spoon, until just combined. Sift in the self-rising flour and carefully fold in until just combined. Pour the fondant mixture into the prepared dariole moulds, cover each with cling film and chill in the fridge for at least 30 minutes and up to eight hours. Meanwhile, for the lime syrup, gently heat the lime marmalade and lime juice in a small saucepan until just simmering. Continue to simmer for 3-4 minutes, or until the volume of syrup has reduced by about one-quarter, stirring occasionally. (The syrup will thicken further while cooling.) Remove the lime syrup from the heat, and set aside to cool completely but do not chill. (If the syrup thickens too much on cooling, stir in a little cold water and warm through gently before using.) For the coconut custard, gently heat the coconut milk and double cream in a saucepan until just simmering. Whisk the egg yolks and cornflour together in a bowl until smooth, pale and well combined.  Pour the warm coconut and cream mixture over the egg-yolk mixture and whisk until smooth and well combined. Return the custard mixture to the saucepan and heat gently, stirring constantly, until the custard thickens enough to coat the back of a spoon. Remove from the heat and keep warm. To cook the chocolate fondants, preheat the oven to 200C\/400F\/Gas 6. Remove the fondants from the fridge to bring them up to room temperature, and discard the cling film. Place the dariole moulds onto a sturdy baking tray. Bake the chocolate fondants for 11 minutes, or until the sponge has risen but the puddings retain a slight wobbly (they should still be liquid in the very centre; see tip below). Remove the chocolate fondants from the oven. To serve, spoon a circle of coconut custard into the centre of each of four dessert plates. Decorate the custard with dots of lime syrup, using the point of a knife. Using a folded, dry tea towel or oven glove to protect your hand, loosen the chocolate fondant from the sides of each dariole mould using a blunt, round-edged knife and turn out onto the dessert plates. Remove the circle of baking parchment and top the fondants with quenelles of crème fraiche, clotted cream or vanilla ice cream, if using.  Sprinkle with lime zest and serve immediately. ","ingredients":" 1 tsp cocoa powder,  1 tsp plain flour,  150g\/5oz plain chocolate, minimum 70% cocoa solids, broken into pieces,  150g\/5oz butter, plus extra for greasing,  3 large free-range eggs,  3 large free-range egg yolks,  50g\/2oz caster sugar,  2 limes, finely grated zest only,  25g\/¾oz self-raising flour,  225g\/8oz lime marmalade,  1 lime, zest and juice, plus 1 lime, juice only,  300ml\/10½fl oz coconut milk,  100ml\/3½fl oz double cream,  3 free-range egg yolks,  2 tsp cornflour,  clotted cream, crème fraiche or vanilla ice cream, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_fondant_78091"}