{"recipe_name":"Chocolate mint cake ","author":null,"programme":null,"prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 170C\/325F\/Gas 3. Grease and line three 20cm\/8in sandwich tins. Using an electric whisk,  beat the butter and shortening together until light and fluffy. Add the two sugars and beat for about 5 minutes. Slowly beat in the eggs (one at a time) and vanilla extract until well combined. Mix the cocoa powder, hot water and soured cream together in a bowl. Sift the flour, baking powder, bicarbonate of soda and salt together in a separate bowl. Fold half of the flour mixture into the cake batter then fold in half of the cocoa mixture. Fold in the remaining flour mixture and remaining cocoa mixture until well combined. Divide the cake mixture equally among the three sandwich tins and bake for 40-45 minutes, or until springy to the touch. Remove the cakes from the oven and cool in the tins for 20 minutes, then remove from the tins and set aside to cool completely on a wire rack. Meanwhile, for the mint meringue buttercream, whisk the egg whites in a bowl with an electric whisk until frothy. Add the cream of tartar then whisk until stiff peaks form when the whisk is removed. Heat the water and sugar in a saucepan until the temperature reaches 115C\/238F (use a sugar thermometer to check this).  Pour the hot syrup down the side of the bowl of egg whites and continue whisking for about 3 minutes. Set the mixture aside for 10 minutes to cool, then slowly beat in the butter until thick and smooth. Add the peppermint extract, to taste. For the chocolate ganache, heat the chocolate and cream over a gentle heat for 1-2 minutes or until the chocolate has melted. Beat in the butter until thick and glossy. Cover the bowl, set aside to cool, then chill in the fridge until it begins to thicken slightly. Whisk the thickened mixture until fluffy and smooth. For the chocolate leaves, paint half of the mint leaves with white chocolate and the other half with dark chocolate using a pastry brush. Prop the painted leaves against something (such as the handle of a wooden spoon) to create slightly curved leaves. Chill in the fridge for 10 minutes, or until set. Use tweezers to peel the chocolate leaf from the mint leaf and discard the mint leaf. To ice the cake, place one cake onto a serving plate and top with half of the mint filling. Add the second cake and top with the remaining filling; finish with the final cake. Ice the top and sides of the cake with the chocolate ganache and decorate with the chocolate leaves. ","ingredients":" 170g\/6oz unsalted butter, softened, plus extra for greasing,  115g\/4¼oz vegetable shortening,  300g\/10½oz granulated sugar,  250g\/8¾oz dark brown sugar,  3 free-range eggs,  1 tbsp vanilla extract,  70g\/2½oz cocoa powder,  300ml\/10½fl oz hot water,  150ml\/5fl oz soured cream,  370g\/13oz plain flour,  2 tsp baking powder,  1 tsp bicarbonate of soda,  ½ tsp salt,  125g\/4½oz sugar ,  80ml\/2¾fl oz water,  3 free-range egg whites, at room temperature,  ½  tsp cream of tartar ,  150g\/5fl oz unsalted butter, softened,  ½ tsp peppermint extract,  225g\/8oz dark chocolate, minimum 70% cocoa solids, broken into pieces,  175ml\/6¼fl oz whipping cream,  25g\/1oz unsalted butter, cut into cubes,  2 large bunches fresh mint leaves,  75g\/3oz white chocolate, melted,  75g\/3oz dark chocolate, minimum 70% cocoa solids, melted","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_mint_cake_53708"}