{"recipe_name":"Chocolate New York pie","author":"Tamal Ray","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Makes 1 large tart","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Grease a 25cm\/10in loose bottomed tart tin. For the chocolate pastry, add the dry ingredients to a food processer and pulse briefly to mix. Add the butter and pulse until the mixture resembles breadcrumbs. Add the beaten egg and pulse until the dough comes together (do not over process). Briefly knead the dough, then wrap in cling film and place on a plate in the freezer for a few minutes. Roll out the pastry to 3mm thick and use it to line the tart tin. Prick all over with a fork and place in the freezer for 10 minutes. Line the pastry case with baking parchment and fill with baking beans. Bake for 12 minutes, then remove the beans and parchment, brush with the egg wash and return to the oven for 5 minutes. Set aside to cool in the tin. For the filling, heat the butter in a saucepan over a low heat. When melted add the dark chocolate and stir to combine. Stir in the sugars, syrup and salt. Add the soured cream, cocoa powder and egg yolks and mix until well combined. Pour into the pastry case and bake for 12 minutes, then turn the tart around and bake for a further 10 minutes. Set aside to cool on a wire rack for a few minutes then transfer to the fridge to chill. For the raspberry coulis, break up the raspberries in a food processor and pass through a sieve to remove the seeds. Heat the purée, sugar and pectin in a saucepan over a medium heat until it reaches 104C on a sugar thermometer. Allow to cool and thicken slightly before pouring onto the chilled pie filling. Chill in the fridge until ready to serve. For the pecan praline, place the pecans on a baking tray and roast for about 8 minutes. Set aside to cool. Meanwhile line a baking tray with non-stick baking paper or a silicone mat. In a medium saucepan, dissolve the caster sugar in 50ml\/2fl oz water and heat to 160C on a sugar thermometer. Add the pecans and coat in the caramel, then turn out onto the lined baking tray to cool completely. Once cooled, chop the praline and arrange on top of the tart. Serve cold. ","ingredients":" 100g\/3½oz icing sugar (golden icing sugar if available),  200g\/7oz plain flour,  45g\/1⅔oz cocoa powder,  40g\/1½oz ground oats,  2 pinches table salt,  150g\/5½oz unsalted butter, chilled, plus extra for greasing,  50g\/1¾oz beaten free-range egg,  1 medium free-range egg, for egg wash,  140g\/5oz unsalted butter,  210g\/7½oz dark chocolate (minimum 70% cocoa solids), chopped,  140g\/5oz white caster sugar,  110g\/4oz light muscovado sugar,  50g\/1¾oz golden syrup,  ¾ tsp fine sea salt,  125g\/4½oz full-fat soured cream,  45g\/1⅔oz cocoa powder,  6 large free-range egg yolks,  420g\/15oz raspberries (to make 300g\/10½oz purée after sieving),  75g\/2½oz granulated sugar,  2 tbsp apple pectin ,  150g\/5½oz pecan nuts,  200g\/7oz white caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_new_york_pie_55792"}