{"recipe_name":"Chocolate, orange and marshmallow shortbread","author":"Jameela Jamil","programme":"Series 2","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 24 shortbread sandwiches","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/170C Fan\/Gas 4.  Grease two baking trays and line with parchment.  Put the butter, orange zest and orange blossom water in a free-standing mixer and mix until soft. Add the sugar and beat until light and fluffy. Add the flour and bring the mixture together with your hands.   Generously flour a work surface and roll the dough to 5mm\/¼in thick. Use a cutter to cut out 48 star shapes. Use a palette knife to transfer the shortbread to the prepared baking trays. Prick each star with a fork and place in the fridge for 15 minutes.  Bake for 15 minutes, or until golden brown. Leave to cool on the tray for 5 minutes before transferring to a wire rack. For the marshmallow filling, put the sugar, liquid glucose, salt and 2½ tablespoons water in a small, heavy bottomed saucepan. Place over a high heat and stir until all the sugar has dissolved. Use a sugar thermometer to monitor the temperature, once it has reached 115C remove from the heat (CAUTION: boiling sugar is extremely hot. Handle very carefully). Whisk the egg whites and vanilla bean paste in a free-standing mixer until they form soft peaks. With the whisk going, add 2 tablespoons of the sugar syrup. Gradually add the rest of the syrup and continue to beat for about 5 minutes, or until a stiff consistency is achieved. Pour into a piping bag and place in the fridge. Melt the chocolate in a glass bowl over a pan of simmering water, making sure the bowl doesn't touch the water, then set aside to cool. To assemble, pipe the marshmallow into the middle of a shortbread and use a blowtorch to brown. Gently place another shortbread on top to make a sandwich. Repeat this process with the remaining shortbread and marshmallow to make 24 sandwiches.  Using a fork, drizzle chocolate over each sandwich in lines. Leave to cool.  ","ingredients":" 275g\/9¾oz unsalted butter,  1 large orange, zest only,  2 tsp orange blossom water,  165g\/5¾oz caster sugar,  540g\/1lb 4oz plain flour, plus extra for dusting,  180g\/6¼oz granulated sugar,  170ml\/5¾fl oz liquid glucose,  pinch fine salt,  2 large free-range egg whites,  1½ tsp vanilla bean paste,  85g\/3oz milk chocolate","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_orange_and_13220"}