{"recipe_name":"Chocolate panettone baked Alaska with a cherry compôte and chocolate sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cherry compôte, place the cherry stones in a small square of muslin, gather into a bag and tie with string. Put the cherries in a preserving pan or a large heavy saucepan with the bag of cherry stones and pour in 300ml\/10fl oz water. Bring to a boil then reduce to a simmer and cook for 10–15 minutes, or until the cherries are tender and are beginning to soften. Discard the stones. If you prefer some of the cherries to remain chunky in the compôte, don’t cook them for too long. Pour in the lemon juice and add the jam sugar. Heat gently, stirring until all the sugar has dissolved. Bring to a boil and keep at a steady rolling boil, stirring occasionally, for about 10 minutes, or until the jam reaches setting point.  To test if the jam has reached setting point, first remove the pan from the heat while you test the jam – this is very important. Spoon a little of the jam onto a cold saucer, leave to cool for a few minutes, then push your finger into the jam. If it wrinkles, it is ready. If not, return the pan to the heat and cook the jam for a minute or two more and test again. Allow to cool. Preheat the oven to 220C\/450F\/Gas 7. For the chocolate sauce, place the sugar and 75ml\/2½fl oz water in a saucepan and cook until the sugar is melted. Add the chocolate and continue to cook for a couple of minutes, stirring well until you have a glossy sauce. For the chocolate panettone baked Alaska, whisk the egg whites with the caster sugar in a clean bowl until the mixture forms stiff peaks when the whisk is removed.  Add the icing sugar and whisk again until the mixture is smooth and shiny. Transfer to a piping bag. Slice the panettone and, using an 8cm\/3¼in round pastry cutter, cut out four discs (each baked Alaska will serve two people. Use a smaller cutter if you want individual portions). Place onto serving plates and drizzle over the kirsch. Top with a large scoop of ice cream. Pipe the meringue around the ice cream, ensuring it is completely covered from top to bottom. Glaze the meringue briefly in a hot oven (alternatively use a chef’s blowtorch). To serve, spoon the chocolate sauce around the edge of each baked Alaska. Dust with icing sugar and serve with the cherry compôte alongside. ","ingredients":" 500g\/1lb 2oz dark cherries, pitted, stones reserved,  2 lemons, juice only,  500g\/1lb 2oz jam sugar,  75g\/2½oz caster sugar,  200g\/7oz dark chocolate, chopped,  3 medium free-range egg whites,  90g\/3¼oz caster sugar,  90g\/3¼oz icing sugar, plus extra to serve,  1x 200g\/7oz chocolate panettone,  2 tbsp kirsch,  500ml\/18fl oz vanilla ice cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_panettone_34099"}