{"recipe_name":"Chocolate whoopie pies and salted peanut brittle","author":"Allegra McEvedy","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Line a baking tray with a silicone sheet. Line another tray with baking parchment. Place the sugar in a large frying pan over a medium heat. Melt the sugar and cook, without stirring, until it turns golden brown, then add the peanuts. Pour the mixture onto the silicone sheet. Leave to set. For the whoopie pies, place the flour, cocoa, baking powder, bicarbonate of soda, salt, butter, sugar, eggs, vanilla extract, buttermilk and coffee in a free-standing food mixer and mix until well combined. Place the mixture in a piping bag with a plain round nozzle and pipe 4cm\/1½in circles, leaving a 3cm\/1¼in gap between them on the baking parchment. Bake the whoopie pies for 10 minutes until springy to the touch. Leave to cool on a wire rack. For the filling, whisk the cream with the sugar in a large bowl and stir in the marshmallows. For the peanut butter milkshake, place all the milkshake ingredients in a blender and blend until smooth. To serve, take one of the whoopies and spoon on a tablespoon of the cream and sandwich with another whoopie. Smash the brittle and serve some on the side. Pour the milkshake in a shot glass and serve alongside. ","ingredients":" 200g\/7oz caster sugar,  350g\/12oz salted peanuts,  230g\/8oz plain flour,  65g\/2¼oz cocoa powder,  1 tsp baking powder,  ¼ tsp bicarbonate of soda,  ¼ tsp fine salt,  170g\/6oz butter, softened,  150g\/5½oz caster sugar,  1 large free-range egg, beaten,  1 tsp vanilla extract,  4 tbsp buttermilk,  100ml\/3½fl oz strong coffee,  400ml\/14fl oz double cream,  50g\/1¾oz icing sugar,  100g\/3½oz marshmallows, roughly chopped,  4 tbsp smooth peanut butter,  2 scoops vanilla ice cream,  280ml\/9½fl oz full-fat milk","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolate_whoopie_pies_37636"}