{"recipe_name":"Agnello alla menta con insalata calda (Italian lamb casserole with warm salad)","author":"Gino D'Acampo","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a bowl, marinate the lamb steaks with the rosemary, mint, vinegar, honey, salt and freshly ground black pepper. Leave to marinate in the fridge for approximately four hours. Heat the olive oil in a large pot and fry the onions, mushrooms, celery and potatoes for about five minutes. Add the marinated lamb with any juices from the marinade, mix well and cook for further two minutes. Add the wine and the water, allowing the wine to evaporate for 2-3 minutes. Season with salt and pepper.   Cover the pot with the lid and leave to cook on a low heat for about one and a half hours, stirring occasionally. While the casserole is cooking, make the warm salad. Heat the olive oil in a pan and fry the courgettes, carrots and leeks for 2-3 minutes. Add the pine kernels and season with salt and freshly ground black pepper. To serve, divide the warm salad between plates, creating a nest in the centre. Serve the lamb in the centre of the vegetables. ","ingredients":" 4 lamb steaks weighing about 400g\/14oz in total, cut into 2cm\/1in cubes,  4 tbsp finely chopped fresh rosemary ,  4 tbsp finely chopped fresh mint ,  3 tbsp white wine vinegar ,  3 tbsp honey ,  salt and freshly ground black pepper,  5 tbsp Italian olive oil,  2 large onions, cut into 2cm\/1in cubes,  100g\/3oz button mushrooms ,  3 celery sticks, cut into 2cm\/1in cubes,  2 large white potatoes, peeled and cut into 2cm\/1in cubes,  1 glass dry red wine,  1 glass water,  3 courgettes, finely sliced,  2 carrots, peeled and finely sliced,  2 leeks, finely sliced ,  5 tbsp Italian olive oil,  6 tbsp toasted pine kernels","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/agnelloallamentaconi_76385"}