{"recipe_name":"Chocolate and hazelnut torte","author":"Sophie Grigson","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 8-10","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chocolateandhazelnut_90185_16x9.jpg","method":"Preheat the oven to 190C\/375F\/Gas 5. Prepare a 23cm\/9in cake tin by lining it with non-stick baking parchment and greasing the sides. Place the chopped chocolate in a bowl set over a pan of gently simmering water, ensuring the bowl doesn't touch the water. Separate the egg whites from the egg yolks, placing each into separate bowls. As the chocolate melts, stir it gently with a wooden spoon, until the last lumps have disappeared. Once the chocolate has melted, remove it from the heat and beat the butter into the chocolate, bit by bit, until all the butter is incorporated. Add the sugar to the bowl with the egg yolks and whisk together with an electric whisk until pale, thick and fluffy. Stir the chocolate mixture into the egg yolk mixture with a metal spoon. Add the ground hazelnuts and the flour to the mixture and gently fold in. Finally, add the orange liqueur. Using an electric whisk, whisk the egg whites with the salt until stiff peaks form (ensure the beaters are scrupulously clean and dry). Stir a spoonful of egg white into the chocolate batter mixture until completely incorporated, then gently fold the remaining egg whites into the cake mixture with a metal spoon. Pour the cake mixture into the prepared tin and bake for 40-50 minutes, until firm to the touch. (It will still be moist in the centre so the usual skewer test won't work.) When the cake is cooked, remove and cool for 5-10 minutes, then turn out onto a cake rack to finish cooling. (At this stage, you can wrap the cake in foil or cling film and keep for up to three days, before glazing and eating.) When cool, remove the cake from the tin and place on a serving plate. To make the glaze, place the chocolate into a bowl set over a pan of gently simmering water and allow it to slowly melt. Don't allow the water to touch the bottom of the bowl. Just before all the chocolate is melted, remove the bowl from the heat and beat in the butter bit by bit with a wooden spoon. Add the liqueur, if using. Leave the glaze to cool for 5-10 minutes, until it begins to thicken, but is still runny. Spread the glaze over the cake and down the sides, using a palette knife. Decorate the top with the whole hazelnuts before the glaze sets. Serve with some freshly whipped cream. ","ingredients":" 200g\/7oz dark chocolate, chopped,  3 large free-range eggs,  110g\/4oz unsalted butter, diced,  150g\/5oz caster sugar,  90g\/3oz ground hazelnuts,  60g\/2oz self-raising flour,  3 tbsp orange liqueur,  pinch salt,  freshly whipped cream, to serve,  100g\/3½oz dark chocolate (70% cocoa solids), chopped,  60g\/2oz unsalted butter, diced,  1 tbsp orange liqueur (optional),  10-12 whole toasted hazelnuts, to decorate","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolateandhazelnut_90185"}