{"recipe_name":"Chocolate and mango mousse cake with sesame brittle and caramelised chilli mango","author":"James Martin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the mousse cake, place the eggs, flour, sugar, cocoa powder and chilli into a food processor and blend to combine. Lightly grease a 6cm\/2½in chefs' ring and place onto a non-stick baking sheet. Place the sliced mango into the base of the ring, top with the chocolate mousse mixture and smooth the top using the back of a spoon.  Transfer to the oven and bake for 12-15 minutes.  Remove the cake from the oven and place the ring onto a serving plate. Warm the outside of the ring with a mini-blowtorch to loosen it, then remove it and dust the cake with cocoa powder. For the sesame brittle, gently melt the sugar in a frying pan until golden-brown and completely melted.  Pour the hot caramel onto a non-stick baking sheet, sprinkle over the sesame seeds and leave to cool for a few minutes. Cut out a small disc of sesame brittle using a metal pastry cutter. For the caramelised chilli mango, place the sliced mango onto a baking sheet, sprinkle with the chopped chilli and dust heavily with icing sugar. Using a mini-blowtorch, caramelise the mango all over. To serve, place the caramelised chilli mango onto a serving plate with the chocolate and mango mousse cake. Serve with the sesame brittle and pour over some double cream. ","ingredients":" 2 free-range eggs, beaten,  55g\/2oz plain flour,  15g\/½oz caster sugar,  30g\/1oz cocoa powder, plus extra for dusting,  ¼ red chilli, seeds removed, chopped,  butter, for greasing,  ¼ mango, peeled, sliced,  100g\/3½oz caster sugar,  1 tbsp sesame seeds,  ½ mango, sliced,  ½ red chilli, seeds removed, chopped,  icing sugar, to dust,  double cream, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolateandmangomou_85176"}