{"recipe_name":"Gluten-free chocolate and pear torte","author":"Michelle Berriedale-Johnson","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sift the flour or flours with the xanthan gum into the bowl of a food processor.  Cut the margarine or butter into the flour and blend it until it resembles breadcrumbs. Add the water and blend again; if it looks dry, add a little more water. Blend until the dough forms a ball. Remove from the processor, wrap and chill for 30 minutes. Pre-heat the oven to 180C\/350F\/Gas 4.  Remove the pastry from the fridge. Roll it out onto a well floured board and line a 20-25cm\/8-9in loose-bottomed flan tin. The pastry will be quite soft, so you may need to patch any bits that tear. Line the pastry with greaseproof paper and weight with baking beans.  Bake for 15 minutes then remove the beans and paper and bake for a further 10 minutes to crisp the pastry. Cool. Meanwhile, gradually mix whichever milk you are using into the cornflour and heat slowly, stirring continually until it thickens. Cook for a minute or two then remove from the heat.  Break up 60g\/2½oz of the chocolate and add it to the cornflour mix, stirring until it is all melted.  Stir in the liqueur or brandy. Quarter the pears, core and peel them and arrange them, pointed side to the middle, in the flan dish. Spoon the chocolate sauce over the pears and allow to cool entirely. Grate over the remaining chocolate before serving. ","ingredients":" 100g\/3½oz gram flour and 100g\/3½oz rice or potato flour, OR 200g\/7oz gluten-free and wheat-free flour,  1 level tsp xanthan gum (available in health food stores and in some supermarkets),  110g\/4oz dairy-free margarine OR butter (cow or goat) if you can eat it,  30ml\/1fl oz cold water,  350ml\/12fl oz cows', soya or rice milk (rice milk will be rather thinner and sweeter),  15g\/½oz cornflour,  80g\/3oz dark dairy-free chocolate (70% cocoa solids minimum),  2 tbsp Cointreau, Grand Marnier or brandy ,  3 ripe pears","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolateandpeartort_77306"}