{"recipe_name":"Chocolate bread and butter pudding","author":"Delia Smith","programme":null,"prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Begin by removing the crusts from the slices of bread, which should leave you with nine pieces aboutcm\/4in square. So now cut each slice into four triangles. Next, place the chocolate, whipping cream, rum, sugar, butter and cinnamon in a bowl set over a saucepan of barely simmering water, being careful not to let the bowl touch the water, then wait until  the butter and chocolate have melted and the sugar has completely dissolved. Next, remove  the bowl from the heat and give it a really good stir to amalgamate all the ingredients. Now in a separate bowl, whisk the eggs and then pour the chocolate mixture over them and  whisk again very thoroughly to blend them together. Then spoon about acm\/½in layer of the chocolate mixture into the base of the dish  and arrange half the bread triangles over the chocolate in overlapping rows. Now, pour half  the remaining chocolate mixture all over the bread as evenly as possible, then arrange the  rest of the triangles over that, finishing off with a layer of chocolate. Use a fork to  press the bread gently down so that it gets covered very evenly with the liquid as it  cools. Cover the dish with clingfilm and allow to stand at room temperature forhours before  transferring it to the fridge for a minimum of 24 (but preferably 48) hours before cooking.   When you're ready to cook the pudding, preheat the oven toC\/350F\/Gas 4.  Remove the  clingfilm and bake in the oven on a high shelf for 30-35 minutes, by which time the top  will be crunchy and the inside soft and squidgy. Leave it to stand for 10 minutes before serving with well-chilled double cream poured over. ","ingredients":" 9 slices, each 5mm\/¼in thick, good-quality white bread, one day old, taken from a ,  large loaf ,  150g\/5oz dark chocolate (75 per cent cocoa solids) ,  75g\/3oz butter ,  425ml\/15fl oz whipping cream ,  4 tbsp dark rum ,  110g\/4oz caster sugar ,  good pinch cinnamon ,  3 eggs ,  double cream, well chilled ,  You will also need a shallow ovenproof dish 18x23cm\/7x9in base by 5cm\/2in  deep, lightly buttered.","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolatebreadandbut_67343"}