{"recipe_name":"Chocolate caramel tart with salted crumble ice cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salted crumble ice cream, preheat the oven to 180C\/350F\/Gas 4. Mix the butter and sugar together until well combined. Mix in the flour until the mixture resembles breadcrumbs, then sprinkle the mixture onto a baking tray. Bake the sugar and flour mixture in the oven for 12-15 minutes, or until crisp and golden-brown. Set aside until completely cooled. Transfer the crumble mixture to a food processor. Add the sea salt and blend the mixture until it resembles fine breadcrumbs.  Turn the blended crumble mixture out onto a plate and set aside.  Meanwhile, for the tart, suspend a heatproof bowl over a saucepan of simmering water (do not allow the base of the bowl to touch the water). Add the chocolate and stir occasionally until melted. Place the caramel condensed milk into a separate bowl and beat in the sea salt until well combined. Whisk the whipped double cream into the caramel mixture until the mixture is well combined and stiff peaks form when the whisk is removed. Taste the mixture, adding a little more salt, if desired. Divide the caramel mixture equally among the pastry cases. Pour some of the melted chocolate over each tart until it just coats the caramel filling. Set aside until the filling mixture has cooled slightly and the chocolate has hardened. Just before serving, remove the ice cream balls one by one from the freezer and roll each in the salted crumble mixture until completely coated.  To serve, place one chocolate caramel tart into the centre of each of four serving plates. Top each tart with a ball of salted crumble ice cream. Serve immediately. ","ingredients":" 75g\/3oz butter,  75g\/3oz demerara sugar,  75g-110g\/3-4oz plain flour,  ½tsp sea salt, or to taste,  200g\/7oz good-quality dark chocolate, roughly chopped,  200g\/7oz caramel condensed milk (or dulce de leche),  2-3 pinches sea salt, to taste,  50ml\/2fl oz double cream, whisked until soft peaks form when the whisk is removed,  4 x 12cm\/5in diameter ready-made pastry cases (each 2cm\/1in high),  4 scoops ready-made vanilla ice cream (about 300g\/11oz in total), returned to the freezer, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolatecarameltart_93446"}