{"recipe_name":"Artichoke and three cheese pizza","author":"James Martin","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dough, place the flour, salt and sugar into a large bowl and stir to combine. Crumble the yeast into a small bowl and add four tablespoons of the water. Whisk to combine and set aside for one minute. Pour the yeast mixture into the centre of the flour mixture, and add the remaining the water. Mix well to form a soft dough. Tip the dough out onto a floured work surface and knead until smooth and elastic. Place the dough into a lightly greased bowl, cover with cling film and leave to rise for one hour. Remove the dough from the bowl and knead for a minute on a floured work surface, then divide into four pieces and roll into circles, 0.5cm\/¼in thick. For the topping, heat a frying pan until hot, then add the oil, onions and garlic and fry for 3-4 minutes. Add the tomatoes, sugar and the chopped basil and bring to the boil. Reduce the heat and simmer for 20 minutes, until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper and leave to cool. Preheat the oven to 220C\/425F\/Gas 7. Place a heavy baking tray or a pizza stone into the oven to preheat. Place the pizza bases onto an upturned, floured baking tray. Spoon the cooled tomato sauce thinly over the pizza. Sprinkle over the artichokes, mozzarella, parmesan, goats' cheese and Parma ham and season with salt and freshly ground black pepper. Carefully transfer the pizzas into the oven, pushing the pizzas from the floured tray onto the hot tray pizza stone. Cook for 15 minutes, or until the base is crisp and the topping is cooked through. Remove from the oven and sprinkle with the basil leaves. Serve immediately. ","ingredients":" 500g\/1lb 2oz strong white flour, plus extra for dusting,  ½ tsp salt,  1 tsp caster sugar,  7g dried yeast (or 4g fresh yeast),  300ml\/11fl oz water,  oil, for greasing,  2 tbsp olive oil,  1 onion, finely chopped,  2 garlic cloves, finely chopped,  2 x 400g\/14oz cans chopped tomatoes,  2 tsp caster sugar,  1 bunch fresh basil, leaves chopped,  12 violet baby artichokes, peeled, trimmed and finely sliced,  350g\/12oz buffalo mozzarella, thickly sliced,  1 chunk parmesan,  4 x 115g\/4oz Little Wallop, or similar hard goats' cheeses, skinned and cut into chunks,  12 slices Parma ham,  1 bunch fresh basil, leaves only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/artichokeandthreeche_89363"}