{"recipe_name":"Chocolate orange pots with caramel mascarpone","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chocolate pots, place the wine, orange juice and zest and 100g\/3½oz caster sugar into a pan over a medium heat. Stir to dissolve the sugar and bring to the boil. Reduce the heat and simmer to reduce the liquid by two thirds, then remove from the heat and allow the mixture to cool. Meanwhile, place the chocolate into a bowl suspended over a pan of barely simmering water until melted. Gradually add the wine syrup to the melted chocolate, whisking constantly. Add the egg yolks and stir well. Meanwhile, place the milk, cream and extra 50g\/2oz of sugar into a clean pan over a medium heat and bring to scalding point (don't boil). Remove the milk and cream mixture from the heat and gradually add the chocolate mixture, whisking constantly. Add the butter and stir until melted and combined, then pour the mixture into eight ramekins. Place onto a tray and allow to cool, then transfer to the refrigerator to chill for at least two hours, preferably overnight. For the caramel mascarpone, place the water and sugar into a clean pan and heat gently until the sugar has dissolved. Bring to the boil and cook for 15 minutes, or until the liquid is a golden-brown caramel. Remove from the heat and allow to cool a little. Add the orange segments (don't add straight away as they will break down too much). When the sauce has cooled to lukewarm, add the cream and mascarpone to the mixture and fold in gently. To serve, remove the pots from the fridge and spoon a quenelle of sauce on the top of each pot. ","ingredients":" 200ml\/7fl oz red wine,  1 orange, juice and zest only,  100g\/3½oz caster sugar, plus 50g\/2oz extra,  500g\/1lb 2oz dark chocolate (70 per cent cocoa solids),  8 free-range egg yolks,  275ml\/10fl oz whole milk ,  225ml\/8fl oz double cream,  1 tbsp butter,  100ml\/3½fl oz water,  150g\/5oz caster sugar,  1 orange, peeled, segmented,  splash double cream,  200g\/7oz mascarpone","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chocolateorangepotsw_86843"}