{"recipe_name":"Chorizo and lemongrass pastry puff scrolls","author":"Lorraine Pascale","programme":"Lorraine Pascale: How to be a Better Cook","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 32","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/chorizo_and_lemongrass_30901_16x9.jpg","method":"Line a large baking tray with baking parchment and set aside. Lightly dust a clean work surface with flour and roll the pastry out to a 25x35cm\/10x14in rectangle. Arrange six chorizo slices in a slightly overlapping layer in a row down one long side. Repeat to make three rows and completely cover the pastry. Top and tail the lemongrass stick and then remove one or two outer layers. Slice the stick very thinly and then sprinkle this evenly over the chorizo. Season with a little twist of pepper. With the longest side facing you, roll up the pastry away from you, really tightly like a Swiss roll to be about 4cm\/1½in thick. Carefully lift onto the baking tray and then pop it into the fridge to firm up for about 20 minutes.  Preheat the oven to 220C\/425F\/Gas 7 (fan 200C) Once the pastry is nice and firm, use a sharp knife to cut the roll into 32 slices about 1cm\/½in thick each. Lay each one down on the baking tray, spaced apart, as you go. Brush the sides facing upwards with the beaten egg. Bake in the oven for about 15-20 minutes, or until the pastry has puffed up and turned golden-brown. Once baked, remove from the oven, leave to cool for a couple of minutes and then serve on a party platter. ","ingredients":" a little plain flour, for dusting,  340g\/11¾oz pack puff pastry (not ready-rolled as it usually breaks up when you open it) ,  18 pieces pre-sliced chorizo (about 7cm\/2¾in wide pieces),  1 stick lemongrass,  freshly ground black pepper,  1 free-range egg, lightly beaten","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chorizo_and_lemongrass_30901"}