{"recipe_name":"Artichokes with scallops and beurre blanc","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the artichokes with scallops, pour the lemon juice into a bowl of cold water. Snap off and discard any tough outer leaves from the artichokes. Using a sharp paring knife, peel off the outer layer of the artichokes, including the stem, until you reach the whitish inner layer. Cut the artichokes in half lengthwise, and place them in the lemon water. Set aside.  For the beurre blanc, add the shallots, white wine vinegar and white wine to a saucepan and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until only two tablespoons of liquid are left in the pan.  Add a tablespoon of cold water and continue to simmer until the volume of liquid remaining in the pan is approximately one tablespoon.  Reduce the heat to low, then gradually whisk in the butter, 25g\/1oz at a time, waiting until the butter has melted and is incorporated into the mixture before adding more.  Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it through a fine sieve into a clean saucepan. Season, to taste, with salt and freshly ground black pepper, then stir in the chives and tomatoes. Set aside until needed  For the artichokes with scallops, heat two tablespoons of olive oil in a large frying pan and gently fry the artichokes until crisp. Season, to taste, with salt and pepper.  Heat another frying pan and add the remaining oil. Once hot, add the scallops and cook for two minutes on each side. Add the butter and, when melted, glaze the scallops. To serve, place the scallops and artichokes on serving plates and spoon over the beurre blanc. ","ingredients":" 1 lemon, juice only,  450g\/1lb baby artichokes,  5 tbsp olive oil,  salt and freshly ground black pepper,  6 scallops, cleaned,  25g\/1oz butter,  2 shallots, finely sliced,  1 tbsp white wine vinegar,  4 tbsp white wine,  225g\/8oz salted butter, cubed ,  4 tbsp chopped fresh chives,  2 tomatoes, peeled, seeds removed, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/artichokes_with_scallops_46921"}