{"recipe_name":"Chorizo and brandy chicken","author":"Dave Myers","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, heat the oil in a pan over a medium heat and cook the chicken portions, turning frequently, for about 5-6 minutes, or until browned on all sides. Meanwhile, bring the stock to the boil in a large saucepan. Stud one of the onion quarters with the two cloves and add to the pan along with the remaining onion quarters, the chicken, carrot, celery, bay leaves, thyme, paprika and garlic. Simmer very gently, uncovered, for 30-45 minutes, or until the chicken just starts to fall apart. Remove the chicken from the pan and place into a roasting tin. Strain the stock through a sieve into a bowl. Preheat the oven to 180C\/350F\/Gas 4. For the sauce, return the strained stock to the pan, bring to the boil and simmer until the liquid has reduced by half. In a bowl, for the sauce, mash the flour and butter together to make a paste (this, in chef terms, is a beurre manié). Whisk this paste into the stock along with the brandy and simmer for 3-4 minutes, until thickened and smooth. Add the chorizo and season, to taste, with salt and freshly ground black pepper. Pour this sauce over the chicken in the roasting tin and sprinkle over the grated cheese. Transfer to the oven and bake for 10-15 minutes, or until the cheese is bubbling and lightly browned. To serve, place portions of the chicken onto four serving plates and serve with the jacket potatoes and green beans. ","ingredients":" 2 tbsp vegetable oil,  1 chicken, jointed (you can ask your butcher to do this or buy chicken portions if you prefer),  570ml\/1 pint hot chicken stock,  1 onion, peeled and quartered,  2 cloves,  1 large carrot, halved ,  1 celery stick, halved,  2 bay leaves,  few sprigs fresh thyme,  1 tsp smoked paprika,  4 garlic cloves, skin on, slightly bruised using a rolling pin,  1 tbsp plain flour,  1 tbsp unsalted butter,  4 tbsp brandy,  110g\/4oz cured chorizo sausage, finely chopped,  salt and freshly ground black pepper ,  110g\/4oz Manchego cheese, grated (use parmesan instead if not available),  4 jacket potatoes, baked,  225g\/8oz green beans, cooked","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chorizoandbrandychic_86376"}