{"recipe_name":"Christmas barbecued coconut prawns and chicken tikka","author":"James Martin","programme":"Home Comforts at Christmas","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03b2jdx.jpg","method":"For the coconut prawns, blend all of the coconut prawn ingredients, except for the prawns, to a smooth paste in a food processor. Thread the prawns onto 4 large metal skewers, place them onto a baking tray, then spoon the marinade mixture over the top, turning to coat the prawns completely. Cover and marinate for at least 2 hours in the fridge. For the chicken tikka, blend all of the chicken tikka ingredients except for the chicken to a smooth paste in a clean food processor.  Place the chicken pieces in a bowl, spoon over the marinade mixture and stir to coat. Cover and marinate for at least 2 hours in the fridge. When marinated, thread the chicken pieces onto large metal skewers. When you’re ready to start cooking, light your barbecue. Allow the flames to flare up and die down, until the coals are glowing red and starting to turn white.  While the barbecue is warming up, make the dip by blending all of the dip ingredients to a coarse salsa in a clean food processor.  When the barbecue is ready, lay the prawn skewers over the coals and cook for 5-8 minutes, turning once, until slightly charred on both sides. Cook the chicken skewers at the same time, for 12-15 minutes, or until the chicken is cooked through. (The chicken is cooked through when the juices run clean when the meat is pierced with a knife and no trace of pink remains.) Alternatively, heat a griddle pan until hot and cook the prawns and chicken until cooked through. To serve, slide the prawns and chicken from the skewers onto plates and serve with a dollop of the dip alongside, garnished with the lime halves. ","ingredients":" 5cm\/2in piece fresh root ginger, peeled and roughly chopped,  2 garlic cloves, roughly chopped,  2 green chillies, roughly chopped,  1 tbsp ground coriander,  1 tbsp ground cumin,  1 x 160ml tin coconut cream,  2 limes, juice only plus 2 limes, cut into wedges, to garnish,  small bunch fresh coriander, roughly chopped,  1 onion, roughly chopped,  8 large Madagascan prawns, shells left on,  5cm\/2in piece ginger, peeled and grated,  1 tbsp tomato purée,  1 green chilli, finely chopped,  2 garlic cloves,  1 tsp ground turmeric,  1 tsp red chilli powder,  1 tsp ground cumin,  1 tsp garam masala,  400g\/14oz Greek-style yoghurt,  2 limes, juice only,  4 boneless skinless chicken breasts, cut into chunks,  4 ripe tomatoes,  1 lime, juice only,  ½ tsp ground cumin,  ½ tsp ground coriander,  small bunch fresh coriander, roughly chopped,  small bunch fresh mint, leaves only, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/christmas_barbecued_39176"}