{"recipe_name":"Artichoke salad with beef carpaccio","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the beef carpaccio, season the beef fillet with salt and freshly ground black pepper. Heat a frying pan until smoking, add the olive oil and sear the beef for 2-3 minutes on all sides, or until golden-brown. Remove the beef from the pan and roll in the chopped oregano to coat. Cover in cling film and roll into a barrel shape, twisting tightly at both ends to seal, then place into the freezer for one hour, or until firm. For the artichoke salad, thinly slice the baby violet artichokes and Jerusalem artichokes, placing them into a bowl of water with half of the lemon juice to prevent them from browning. Whisk the mustard, vinegar and remaining lemon juice together in a small bowl, then whisk in the extra virgin olive oil until well combined. Season, to taste, with salt and freshly ground black pepper. Heat a frying pan until smoking, then add the olive oil and fry the bread cubes for 3-4 minutes, shaking the pan frequently, until the bread is golden-brown and crisp. Drain on kitchen paper.  Drain the artichokes and mix in the parsley and pine nuts. Drizzle over the dressing and mix well to coat, then scatter over the crisp bread cubes.  To serve, slice the beef as thinly as possible, then arrange around the edges of a serving plate. Pile the artichoke salad into the centre of the plate. Drizzle the beef with a little extra virgin olive oil and season, to taste, with salt and freshly ground black pepper. ","ingredients":" 300g\/11oz beef fillet, trimmed,  1 tbsp olive oil,  2 tsp chopped fresh oregano,  1-2 tbsp extra virgin olive oil,  4-6 baby violet artichokes, trimmed,  250g\/9oz Jerusalem artichokes, peeled ,  2 lemons, juice only,  2 tsp Dijon mustard,  2 tbsp white wine vinegar,  6 tbsp extra virgin olive oil,  2 tbsp olive oil,  4 slices white bread, crusts removed, cubed,  4 tbsp flatleaf parsley, roughly chopped,  3 tbsp toasted pine nuts","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/artichokesaladwithbe_91506"}