{"recipe_name":"Christmas mini meringues","author":"Becca Spry","programme":null,"prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Makes 38 meringue kisses","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/christmas_mini_meringues_81206_16x9.jpg","method":"To make the meringues, preheat the oven to 120C\/100C Fan\/Gas ½. Line 2 baking trays with baking paper. Whisk the egg whites in a clean glass bowl until soft peaks form. Whisk in the sugar a tablespoon at a time until the mixture is thick, smooth and glossy. Sift over the icing sugar then fold in. Fold in the rosewater and food colouring.  Place teaspoonfuls of the mixture on to the prepared baking trays to make about 40 small meringues. Bake for 2 hours then remove from the oven and leave to cool. To make the raspberry filling, heat the cream in a small saucepan until just boiling. Remove from the heat and stir in the white chocolate. Mix in the raspberries. Leave to cool a little. Make the meringues kisses by using a teaspoon of raspberry filling to sandwich together 2 meringues.  You can also use chocolate or lemon curd to stick the meringues together. For the chocolate, melt the chocolate in the microwave, or in a glass bowl over a pan of boiling water. Leave it to cool a little, then dip a flat side of a meringue into the chocolate and sandwich 2 meringues together. For lemon curd, stir the lemon curd into the whipped cream and use this to sandwich the meringues together. ","ingredients":" 3 medium free-range egg whites,  110g\/4oz caster sugar,  50g\/1¾oz icing sugar,  1 tsp rosewater,  couple of drops of red or pink food colouring ,  2 tbsp double cream,  50g\/1¾oz white chocolate, broken into pieces,  25g\/1oz raspberries, finely chopped,  40g\/1½oz dark chocolate (optional),  1 tbsp lemon curd (optional),  150ml\/5fl oz whipped cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/christmas_mini_meringues_81206"}