{"recipe_name":"Christmas morning waffles","author":"James Martin","programme":"Home Comforts at Christmas","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03c0kd0.jpg","method":"Preheat a waffle maker to a medium setting and preheat the oven to 140C\/120C Fan\/Gas 1. Melt the butter in a saucepan over a low heat, then set aside to cool slightly. In a bowl, whisk together the flour, half of the milk, 3 eggs, baking powder and salt. Whisk in most of the melted butter and the remaining milk until smooth and well combined, then stir in 3 tablespoons of the chives. Grease the waffle maker with some of the remaining melted butter. Ladle some of the waffle batter into each well of the waffle maker, close the lid and cook for 4-5 minutes, or until golden-brown and crisp. Remove from the waffle maker and transfer to a baking tray, then keep warm in the oven. Repeat the process with the remaining butter and batter. Meanwhile, bring a pan of water to the boil and prepare a bowl of iced water. Add the white wine vinegar to the pan, then swirl the boiling water and crack one duck egg into the vortex. Reduce the heat until the water is just simmering and poach for 2-3 minutes, or until firm on the outside, but runny in the middle. Remove from the pan using a slotted spoon and lower into the iced water. Repeat the process with the remaining eggs.  When ready to serve, heat the pan containing the remaining melted butter and add the spinach; cook until wilted. Season with salt and pepper, then set aside to drain on kitchen paper. Return the pan of poaching water to the boil, then return the poached eggs to the water for 1 minute to heat through. Meanwhile, mix the crème fraîche with the remaining tablespoon of chopped chives, then season with salt and pepper. To serve, divide the waffles among 4 plates. Top each with some of the spinach, a few slices of smoked salmon and a duck egg, plus a dollop of the chive crème fraîche. ","ingredients":" 125g-150g\/4½-5½oz butter,  250g\/9oz plain flour,  425ml\/15fl oz milk,  3 free-range eggs,  1½ tsp baking powder,  1 tsp salt,  4 tbsp finely chopped fresh chives,  1 tbsp white wine vinegar,  4 duck eggs,  150g\/5½oz baby spinach leaves,  200g\/7oz crème fraîche,  150g\/5½oz sliced smoked salmon, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/christmas_morning_26289"}