{"recipe_name":"Christmas seafood platter","author":"Emily Angle","programme":"Eat Well for Less?","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the smoked salmon pâté, put the salmon, cream cheese, soured cream, lemon juice and black pepper in a food processor and blend until you have a rough paste. Transfer to a serving bowl, or a small terrine lined with cling film if you want to turn it out later. Refrigerate for at least 1 hour or up to 1 week.  For the mayonnaise, preheat the oven to 180C\/160C Fan\/Gas 4. Wrap the garlic in a piece of foil and scrunch up to seal. Roast for 20-30 minutes until the garlic is softened and brown. Set aside to cool. Put the mayonnaise into a mixing bowl and squeeze each clove of garlic out of its papery skin like squeezing out a toothpaste tube. Mix together with a fork to mash up the garlic. Season with salt and pepper. Cover with cling film and set aside in the fridge for up to 3 days. Shortly before serving, put the prawns into a bowl and squeeze over the lemon juice, tossing to combine. Arrange the lemony prawns in a serving bowl, sprinkle with parsley and season with salt and pepper. Serve the garlic mayonnaise alongside for dipping. Immediately before serving, heat the oven to 200C\/180C Fan\/Gas 6. Place the blinis on a tray and heat in the oven for 5 minutes. Meanwhile warm a serving plate (the trick with these blinis is to serve them just warm - cold blinis are doughy). Make sure that the salmon trimmings are cut into manageable pieces ready to top the blinis.  Remove the blinis from the oven and transfer to the warmed serving plate. Working quickly, spoon a half a teaspoon of soured cream on each blini. Add a little smoked salmon to the top of 18 of the blinis and a quarter of a teaspoon of caviar onto the remaining 18.  Squeeze lemon over the salmon blinis and grind over some black pepper. Serve immediately. To serve the smoked salmon pâté, turn out and remove the cling film if shaped in the terrine. Garnish with the cucumber slices, fresh dill and serve spread on mini toasts. ","ingredients":" 200g\/7oz smoked salmon trimmings,  100g\/3½ oz cream cheese,  75g\/2½ oz soured cream or crème fraîche,  ½ lemon, juice and grated zest ,  freshly ground black pepper,  cucumber slices,  small bunch fresh dill (optional),  24 crostini or mini Melba toasts,  ½ bulb of garlic, unpeeled,  150g\/5½ oz good-quality mayonnaise,  250g\/9oz cooked, peeled, jumbo king prawns,  1 lemon, juice only,  small bunch flatleaf parsley, chopped,  36 canapé blinis,  100g\/3½ oz smoked salmon trimmings,  75ml\/2½fl oz soured cream,  1 x 50g jar lumpfish caviar,  ½ lemon, for squeezing","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/christmas_seafood_89090"}