{"recipe_name":"Asian-braised shin of beef with hot and sour shredded salad","author":"Nigella Lawson","programme":"Nigella Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/asian-braised_shin_of_98140_16x9.jpg","method":"Preheat the oven to 150C\/300F\/Gas 2.  For the beef, blend the onions, ginger, garlic and coriander in a food processor until well combined and finely chopped. Heat the oil in a large casserole or ovenproof frying pan and fry the mixture over a medium heat, stirring regularly, until soft and beginning to catch in the pan; this should take about 10 minutes. Pour in the Chinese wine (or sherry) and let it bubble up. Add the soy sauce, brown sugar, stock, oyster sauce and rice wine vinegar and bring to a boil, then drop in the cinnamon sticks and star anise. Add the pieces of beef shin and let everything come up to a bubble again, then clamp on a lid and put into the oven for 2 hours (or longer if using regular stewing steak). Take the casserole carefully out of the oven and, using a slotted spatula, remove the beef to an ovenproof dish. Cover with foil and keep warm in the oven while you vigorously boil the sauce in the casserole (or pan) on the hob, without a lid, until it has reduced by about half. For the salad, combine all the julienned vegetables and the chopped coriander in a bowl.  For the salad dressing, mix the lime juice, fish sauce and caster sugar in another bowl and dress the vegetables with this. To serve, arrange the beef on a serving platter and pour the reduced sauce over the meat. If you are using cubes of stewing steak, rather than slices of shin, you’d probably do better to use a deeper dish. Dress the top of the beef with the hot and sour shredded salad.  ","ingredients":" 2 onions, peeled, quartered,  5cm\/2in piece fresh root ginger, peeled, sliced,  4 garlic cloves, peeled,  2 tsp ground coriander,  3 tbsp vegetable oil,  250ml\/9fl oz Chinese cooking wine (or dry sherry),  4 tbsp soy sauce,  4 tbsp dark brown sugar,  2 litres\/3½ pints beef stock, preferably organic,  2 tbsp oyster sauce,  4 tbsp rice wine vinegar,  2 cinnamon sticks,  2 star anise,  3.5kg\/7½lb beef shin, on the bone, cut by the butcher into thick slices (or 1kg\/2¼lb beef shin off the bone, cut into large cubes),  3 carrots, peeled, cut into matchsticks,  4 spring onions, cut into matchsticks,  1 long red chilli, seeds removed, cut into matchsticks,  1 long green chilli, seeds removed, cut into matchsticks,  20g\/¾oz bunch fresh coriander, finely chopped,  1 lime, juice only,  4 tbsp Thai fish sauce,  1 tsp caster sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/asian-braised_shin_of_98140"}