{"recipe_name":"Christmas bubble and squeak-style burgers with poached egg and cranberry relish","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the burgers, place the turkey, Brussels sprouts and egg into the bowl of a food processor and blend to combine. Season well with salt and freshly ground black pepper. Dust a little flour onto your hands and shape the mixture into four patties. Add more flour to your hands if necessary. Heat the butter and oil in a frying pan over a medium heat. Add the burgers to the pan and fry for one minute on each side. Place the burgers onto a baking sheet, transfer to the oven and bake for about five minutes, or until cooked through. For the relish, place all the relish ingredients into a small frying pan and cook gently for about eight minutes, until the cranberries have softened. For the poached eggs, add the vinegar to a small frying pan filled with simmering salted water. Crack the eggs, one at time, carefully into the pan - take care not to break the yolk. Place a lid on the pan and cook for two minutes, or until cooked to your liking. Remove the eggs with a slotted spoon and drain on kitchen paper. Serve two burgers on each plate with a poached egg and a drizzle of the relish around each serving. ","ingredients":" 100g\/3½oz turkey slices,  100g\/3½oz cooked Brussels sprouts,  1 free-range egg, beaten,  salt and freshly ground black pepper ,  50g\/1½oz plain flour,  25g\/1oz unsalted butter,  1 tbsp olive oil,  25g\/1oz butter,  1 tbsp olive oil,  100g\/3½oz cranberries ,  2 tbsp brown sugar,  ½ orange, juice and zest,  1 tbsp white wine vinegar,  2 free-range eggs,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/christmasbubbleandsq_84976"}