{"recipe_name":"Gluten-free Christmas cake","author":"Michelle Berriedale-Johnson","programme":null,"prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Makes 20cm\/8 in cake","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/christmascake_77307_16x9.jpg","method":"Preheat the oven to 160C\/300F\/Gas 3. In a food processor beat the butter\/margarine with the banana and the lemon juice and rind. Pour into a bowl. Mix in the dried fruit and nuts or seeds.  Beat the eggs if you are using them.  Sieve which ever flours you are using with the baking powder (if you are substituting it for the eggs) and the spices.  Fold the eggs (if you are using them) into the fruit mixture alternately with the flours. Add some brandy if you like. Line a 20cm\/8in cake tin with greased greaseproof paper. Spoon the mixture in and level off the top.  Bake for about two hours or until a skewer inserted in the middle comes out clean. Remove from the tin and cool on a rack.  Eat as it is or store to be iced for Christmas. You can also decorate this cake with whole nuts such as almonds. ","ingredients":" 100g\/3½oz soya margarine (or whatever kind of butter you like),  1 large ripe banana,  2 large lemons, finely grated rind and juice only,  100g\/3½oz soft prunes, stoned and halved,  75g\/3oz raisins,  75g\/3oz sultanas,  75g\/3oz currants,  150g\/5oz soft dried apricots, chopped in fairly large pieces,  50g\/2oz mixed peel,  75g\/2½oz walnuts, halved and 25g\/¾oz hazelnuts, chopped OR 75g\/3oz large pumpkin seeds and 25g\/¾oz sunflower seeds,  2 eggs (or 2 level tsp gluten-free baking powder to make an egg-free cake) ,  75g\/2½oz coarse polenta and 75g\/2½oz rice flour and 1 level tsp xanthan gum OR 150g gluten-free flour that already includes xanthan gum ,  2 heaped tsp ground nutmeg,  1 heaped tsp ground cinnamon,  1 heaped tsp ground ginger,  ½ teaspoon ground cloves,  2 tbsp brandy (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/christmascake_77307"}