{"recipe_name":"How to make Christmas pudding","author":"Lesley Waters","programme":null,"prep_time":"overnight","cooking_time":"over 2 hours","serves":"Makes 2 x 1.2 litre puddings","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/christmaspudding_90194_16x9.jpg","method":"Place the dried fruit into a large bowl (cut up any large pieces of apricot or fig so that all the fruit pieces are roughly the same size). Pour over the brandy or whisky. Add the grated orange zest to the fruit, then pour over the orange juice.  Mix all of the bowl contents together until well combined. Cover the bowl with cling film and set aside in a cool place overnight. The next day, lightly grease two 1.2 litre\/2 pint pudding basins with the melted butter and place a disc of greaseproof paper into the base of each. In a very large mixing bowl, cream together the softened butter and sugar until pale and fluffy using an electric whisk (this will take about five minutes). Whisk in the beaten eggs, a little at a time, incorporating each addition into the batter before adding the next. (NB: If the mixture starts to curdle, just whisk in a spoonful of flour.) When all of the eggs have been incorporated into the mixture, add the soaked fruit and soaking juices and stir well to combine. Add the flour and the breadcrumbs to the mixture and stir to combine. Add the nuts and spices and mix gently until well combined. (NB: The mixture should be of dropping consistency.) Spoon the mixture into the prepared pudding basins and cover with a double layer of greaseproof paper and a single sheet of aluminium foil. Tie with string. Prepare a steamer and steam the puddings for four hours. You can eat the puddings at this stage, or you can cool them completely and store them, in their basins, for 2-3 months, in a cool dark place, re-steaming them for two hours before serving. To serve, carefully remove the puddings from the basins and turn each out onto a serving plate. Garnish the top of the puddings with the cherries. Carefully set the brandy alight using a match. Allow the flames to flare up, then pour the brandy over the puddings. (CAUTION: Keep the flame well away from the eyes, hair and face.) Garnish each serving with a few extra cherries and serve with custard, thick cream or ice cream. ","ingredients":" 900g\/2lb mixed dried fruit (such as figs, apricots, sour cherries, raisins, dates, cranberries or sultanas),  150ml\/5fl oz brandy or whisky,  1 large orange, grated zest and juice,  225g\/8oz butter, softened, plus extra, melted, for greasing,  225g\/8oz dark brown sugar,  4 large free-range eggs, beaten,  110g\/4oz self-raising flour,  110g\/4oz fresh breadcrumbs,  85g\/3oz chopped nuts (almonds, hazelnuts or pecans),  1 tsp freshly grated nutmeg,  1 heaped tsp cinnamon,  brandy, for flaming,  fresh cherries,  custard, thick cream or ice cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/christmaspudding_90194"}