{"recipe_name":"Chump of lamb hotpot-style with pickled red cabbage","author":"Paul Merrett","programme":null,"prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/320F\/Gas 2. Heat a large casserole dish until hot, then add the olive oil. Add the onions, garlic and thyme and cook for 3-4 minutes. Remove from the casserole dish and set to one side. Place the chops into the casserole dish and seal on each side until golden brown. Place the onion mixture on top of the browned chops. Pour over the stock - just enough to cover the lamb and onions. Meanwhile, heat the vegetable oil or clarified butter in a large pan. Add the potato slices and blanch for 30 seconds. Drain and arrange the slices on top of the onions and lamb. Dot the butter over the top of the potatoes. Place in the oven for one and a half hours, until golden and tender. For the cabbage, place the vinegar and sugar into a saucepan and bring to the boil, stirring occasionally.  Reduce the heat and simmer for 5-10 minutes, until the liquid is reduced by a third.  Place the cabbage in a large bowl and pour over the vinegar and sugar.  Toss to coat and place in the fridge for 24 hours, stirring every couple of hours.  Serve with the lamb. ","ingredients":" 4 x 280g\/10oz lamb chump chops,  2 tbsp olive oil,  4 onions, finely sliced,  8 garlic cloves, finely chopped,  1 tbsp fresh thyme leaves,  750ml-1litre\/1 pint 7fl oz-1 pint 15fl oz lamb stock ,  6-8 Maris Piper potatoes, finely sliced on a mandolin,  1 litre\/1 pint 15fl oz clarified butter or vegetable oil, for blanching,  50g\/1¾oz butter,  ,  1 large red cabbage, very finely sliced ,  100ml\/3½fl oz malt vinegar,  150g\/6oz brown sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/chumpoflambhotpotsty_74658"}