{"recipe_name":"Cider-baked Coxes with a maize crust","author":"Lesley Waters","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Sieve the flour, salt and polenta or semolina into a large bowl. Add the butter and gently rub the ingredients together using your fingertips until the mixture resembles fine breadcrumbs.  Add the egg and a splash of cold water. Mix together, adding a splash more cold water if necessary, until the ingredients bind together to form a smooth pastry. Wrap in cling film and refrigerate for half an hour. Meanwhile, place the apple slices in a shallow, round ovenproof dish, approximately 23cm(9in) in diameter. Combine the melted butter with the cider and pour over the apples. Sprinkle over the brown sugar and tuck in the sprig of rosemary. Remove the pastry from the fridge. Roll it out on a lightly floured surface until it is large enough cover the apples like a blanket. Carefully lift the pastry and lay it over the apples. Roughly trim away any excess and tuck the edges inside the dish. Sprinkle the pastry with a little caster sugar. Bake the pie for ten minutes, then reduce the temperature to 170C\/350F\/Gas 4. Bake for a further 30-35 minutes until the apples are soft and the pastry is golden brown. Serve hot with a slice of cheese, or, if you prefer, with double cream or vanilla ice cream. ","ingredients":" 140g\/6oz plain flour,  pinch salt,  55g\/2oz instant dried polenta or semolina,  115g\/4oz butter, cubed,  1 large free-range egg,  cold water,  6 Coxes or other small dessert apples, peeled, cored and halved,  55g\/2oz unsalted butter, melted,  150ml\/5fl oz fruity cider,  25g\/1oz soft brown sugar,  sprig rosemary,  caster sugar for sprinkling,  a piece of cheese, such as cheddar, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ciderbakedcoxeswitha_76885"}