{"recipe_name":"Cinnamon and apple iced buns and toffee and marmalade iced buns ","author":"Tamal Ray","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Makes 16 iced buns","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dough, combine the milk with 175ml\/6fl oz boiling water in a jug, then beat in the eggs. Add the dry ingredients to a bowl of a freestanding mixer fitted with a dough hook and mix briefly to combine. Add the butter and the egg mixture, and mix for 5 minutes. Turn the dough out onto a lightly floured work surface and knead by hand for another few minutes. Transfer to a large bowl and cover with cling film. Prove the dough in a warm place for about an hour, or until doubled in size. Once proved, divide the dough into 16 pieces. Roll into sausage shapes and place on 2 baking trays lined with non-stick baking paper. Prove again for about an hour or until doubled in size.  Preheat the oven to 210C\/190C Fan\/Gas 6. Once proved, bake the dough for 9 minutes, then swap the trays around in the oven and bake for another 4 minutes (this is to ensure the colour is even). Set aside to cool.  To make the toffee crème pâtisserie, line a large roasting tin with non-stick baking paper.  Add the sugar, glucose and 4 tablespoons water to a saucepan. Heat gently until the sugar melts, then increase the heat and boil until it turns a deep caramel colour. (CAUTION: Boiling sugar is very hot. Do not leave unattended.) Carefully pour into the prepared roasting tin and set aside to cool. When the caramel is cool and hard, break it into chunks and transfer a food processor. Pulse until you have a coarse powder.  In a large saucepan, mix the milk, cream, egg yolks, cornflour and 135g\/5oz of the powdered caramel over a medium heat. Cook until the mixture is thick (or until it measures 85C on a kitchen thermometer). Set aside to cool, covering the surface with cling film to stop a skin forming. When cooled spoon into a piping bag fitted with a large plain nozzle. For the marmalade, add all the ingredients to a large, deep saucepan and cook on a low-medium heat for 1½ hours, or until the mixture reaches 104C on a sugar thermometer and the peel has softened. Set aside to cool. For the spiced apple compôte, mix all the ingredients together in a large saucepan and cook on a low heat for about 20 minutes, or until the apple has softened and most of the liquid has evaporated. For the crème Chantilly, put all the ingredients in a large bowl and whip until stiff peaks form when the whisk is removed. Transfer to a piping bag fitted with a large plain nozzle. To assemble the iced buns, slice all the buns in half lengthways. Spread a layer of marmalade on 8 of the rolls and then pipe the crème pâtisserie on top. Place the other half of the roll on top. Spread a layer of apple compôte on the remaining rolls and then pipe the crème Chantilly on top. Place the other half of the roll on top. For the royal icing, beat the icing sugar with 2-3 tablespoons water using a wooden spoon until smooth and thick. Put half the icing in a separate bowl and add the green food colouring. Add the orange food colouring to the remaining icing. Transfer to separate piping bags fitted with wide flat-tipped nozzles. Pipe the green icing on top of the spiced apple buns and the orange icing on the marmalade buns. Serve once the icing has set. ","ingredients":" 200ml\/7fl oz full-fat milk,  2 medium free-range eggs, lightly beaten ,  735g\/1lb 9½oz very strong bread flour, plus extra for dusting ,  80g\/2¾oz caster sugar,  1¼ tsp salt,  3 tsp fast-action dried yeast ,  80g\/2¾oz unsalted butter, softened ,  200g\/7oz caster sugar,  20g\/¾oz liquid glucose,  180ml\/6½fl oz full-fat milk,  180ml\/6½fl oz double cream,  4 large free-range egg yolks,  3 tbsp cornflour,  6 clementines, juice and peel only (250ml\/9fl oz juice required), peel sliced into thin strips,  300ml\/10fl oz blood orange juice,  175ml\/6fl oz lemon juice (about 6 lemons),  225g\/8oz caster sugar,  6 tbsp apple pectin,  500g\/1lb 2oz Bramley apples, peeled, cored and grated,  125g\/4½oz caster sugar,  75ml\/2½fl oz cloudy apple juice,  1 tsp ground cinnamon,  pinch ground cloves,  400ml\/14oz double cream,  2 tsp vanilla paste,  60g\/2¼oz icing sugar,  250g\/9oz fondant icing sugar,  green food colouring,  orange food colouring","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cinnamon_and_apple_iced_95601"}