{"recipe_name":"Cinnamon and soft cheese rolls with a maple and whisky glaze","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dough, grease a round 23cm\/9in springform cake tin with butter and line with baking parchment.  Mix the flour, sugar, salt and yeast in a bowl until well combined. Make a well in the centre, then slowly pour in 450ml\/16fl oz of tepid water, stirring well and bringing the edges of the dry ingredients towards the water as you mix. (You may not need to use all of the water - keep adding the water until the dough starts sticking to the edge of the mixing bowl and feels elastic.) Alternatively, mix the dough using a free-standing mixer fitted with a dough hook.  Cover the bowl with a clean tea towel and set the dough aside to prove for 18-20 minutes, or until it has doubled in size.  When the dough has risen, turn it out onto a lightly floured work surface and knock it back. Roll the dough out to a rectangle measuring 60x30cm\/24x12in.  Cover half of the dough with the slabs of butter, then fold the other half of the dough over the butter, pressing down lightly at the edges to seal.  Dust the work surface with flour again. Beat the dough with a rolling pin to flatten it, then roll it out to another rectangle measuring 60x30cm\/24x12in rectangle again.  Fold the short sides of the rectangle inwards so that the edges of the rectangle meet in the middle. Fold again, lengthways. Repeat the beating, folding and rolling process twice more, then wrap the dough in cling film and chill in the fridge for 1 hour.  Roll the chilled dough out onto a lightly floured work surface to a rectangle measuring 30x45cm\/12x8in with a thickness of approximately 1cm\/½in.  For the filling, in a bowl, mix together the cream cheese, vanilla seeds and cinnamon until well combined. Spread the filling mixture all over the dough rectangle, then, starting with a long edge, roll the dough like a Swiss roll. Cut the roll into 9 slices, each about 5cm\/2in thick.  Turn the Swiss roll slices onto their sides so that the swirl faces upwards. Place one swirl into the centre of the prepared cake tin, then arrange the remaining swirls around the edge, making sure they are not too tightly packed. Set aside to prove for 35-40 minutes, or until the swirls have doubled in size. Preheat the oven to 200C\/180C Fan\/Gas 6. Brush the dough all over with the egg wash, then bake in the oven for 45 minutes, or until the rolls are golden-brown and have expanded and joined together. Meanwhile, for the glaze, in a bowl, mix together the icing sugar, maple syrup and bourbon until smooth and well combined.  To serve, remove the edge of the cake tin, separate the rolls and place them onto a serving plate. Drizzle the glaze over the top of each, moving back and forth so that the rolls are covered in criss-cross lines of glaze. Serve warm. ","ingredients":" 625g\/1lb 6oz strong white bread flour, plus extra for dusting,  75g\/2½oz caster sugar,  1 pinch salt,  20g\/¾oz dried yeast,  500g\/1lb 2oz chilled butter, cut into 1cm\/½in-thick slices, plus extra for greasing,  300g\/10½oz full-fat cream cheese,  1 vanilla pod, split in half lengthways, seeds scraped out using a sharp knife,  1 tsp ground cinnamon,  2 egg yolks, lightly beaten, for egg wash,  200g\/7oz icing sugar, sifted,  100ml\/3½fl oz maple syrup,  25ml\/1fl oz bourbon whiskey","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cinnamon_and_soft_cheese_54104"}