{"recipe_name":"Cinnamon cream cheese swirls with bourbon glaze","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Makes 8 buns","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/180C fan\/Gas 6. Place the flour, salt, sugar and crumbled yeast into a free-standing mixer fitted with a dough hook and slowly mix in about 450ml\/16fl oz of lukewarm water, a little at a time. You may not need all the liquid, or you may need a little more. Mix until the dough is soft and starts sticking to the edge of the mixing bowl. Remove the bowl from the mixer and cover with clingfilm. Set aside. Let the dough rise for about 20 minutes, or until it doubles in size. When the dough has risen, knock the air out of it and roll out onto a floured surface into a rectangular shape measuring 60cm x 30cm\/24in x 12in. Slice the butter into rectangles about 1cm\/½in thick and lay them down end-to-end on the dough, covering two thirds of the surface. Leave a margin large enough to fold the shorter edges of the dough over the butter so that the two edges meet in the middle. The dough will look like the pages of an open book. Fold the dough in half again as though you are closing the book. Place the dough onto a well-floured surface. Knock and roll the dough out into a 60cm x 30cm\/24in x 12in rectangular size again. Repeat the knocking, folding and rolling process three times. Wrap the dough in cling film and leave to rest in the fridge overnight. After the dough has rested, roll the out into a square approximately 5mm\/¼in  thick. For the filling, mix together the cream cheese and vanilla seeds in a bowl. Cover the bottom twothirds of the dough in the cream cheese mixture and sprinkle with cinnamon. Roll the dough up and cut into slices 4cm\/1½in thick. Grease and line a round 23cm\/9in springform tin. Place the buns around the edge and one in the middle, making sure they are not too tightly packed. Leave to prove until double in size. Brush the buns with egg wash and bake in the oven for 20 minutes. For the glaze, while the cake is cooling, add sugar and maple syrup, plus 25ml\/1fl oz water to a pan and heat gently, stirring until the sugar dissolves. Add the bourbon and simmer until the glaze is reduced and sticky. Generously brush the glaze mixture all over the cake. Mix together the icing sugar and one tablespoon of water in a bowl until the mixture forms a runny icing. (You may need a little bit more water.) Put into a piping bag and drizzle the cake with the icing. Undo the spring catch and transfer the buns to a bread board or plate. Tear and share, preferably with a strong cup of tea or coffee. ","ingredients":" 650g\/1lb 7oz strong white flour, plus extra for dusting,  12g salt,  75g\/2½oz caster sugar,  20g\/¾oz dried yeast, crumbled,  500g\/1lb 2oz cold butter,  300g\/10½oz cream cheese,  1 vanilla pod, seeds scraped out,  2 tsp ground cinnamon,  1 free-range egg, lightly beaten (egg wash),  25g\/1oz sugar,  25ml\/1fl oz maple syrup,  25ml\/1fl oz bourbon whiskey,  200g\/7oz icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cinnamon_cream_cheese_48034"}