{"recipe_name":"Citrus-crusted chicken breasts with potato latkes","author":"The Hairy Bikers","programme":"The Hairy Bikers' Twelve Days of Christmas","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the citrus-crusted chicken breasts, place the lime zest, black pepper, garlic, sea salt and thyme into a mortar and pound to a paste with a pestle. Add four tablespoons of the olive oil and all of the lime juice. Mix well and set aside. Heat the remaining two tablespoons of olive oil in a frying pan over a medium heat. Add the chopped bacon and fry until the fat is released.  Add the chicken breasts and fry for 2-3 minutes on each side, or until browned on both sides. (When the chicken has browned, discard the cooked bacon or reserve it for another recipe. In this recipe it is only used as cooking fat, for flavour.) Transfer the browned chicken breasts to a roasting tray, skin-side up, then brush each all over with the citrus paste. Roast the chicken breasts in the oven for 18-20 minutes, basting frequently with the cooking juices and any remaining citrus paste, until cooked through. (NB: The chicken is cooked through when the juices run clear when the chicken breasts are pierced in the thickest part with a skewer.)  Remove the citrus-crusted chicken breasts from the oven and set aside to rest for 10 minutes before serving.  Meanwhile, for the potato latkes, grate the potatoes and onions into a clean tea towel. Gather up the edges of the tea towel, then squeeze any excess moisture from the potatoes and onions. Place the potato and onion mixture into a bowl and add the beaten eggs, salt and freshly ground black pepper. Mix well.  Heat the vegetable oil in a frying pan over a medium heat. Place a large spoonful of the potato and onion mixture into the pan and spread it out into a round approximately 6cm\/2.5in in diameter. Cook for 4-5 minutes on each side, or until golden-brown and crisp all over.  To serve, place one citrus-crusted chicken breast onto each of six serving plates and spoon the potato latkes alongside. Serve with a lightly dressed green salad. ","ingredients":" 1 lime, zest and juice only, plus zest of 1 extra lime,  2 tsp cracked black pepper,  2 garlic cloves, crushed to a paste with the edge of a knife,  1 tsp sea salt flakes,  2 tsp thyme leaves,  6 tbsp olive oil,  100g\/3½oz smoked streaky bacon, chopped,  6 chicken breasts, skin scored three to four times,  1kg\/2lb 3oz floury potatoes, such as King Edward or Maris Piper, peeled,  2 onions, peeled, chopped,  2 large free-range eggs, beaten,  2 tsp salt,  1 tsp freshly ground black pepper,  1-2 tbsp vegetable oil, for shallow frying,  green salad","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/citruscrustedchicken_93143"}