{"recipe_name":"Asian quail salad","author":"Matt Tebbutt","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/365F\/Gas 4. For the marinade, mix the chillies, garlic, coriander roots, salt, sugar and rice wine vinegar together in a bowl. For the quail, place the spatchcocked quail into the marinade and marinate for a minimum of two hours, preferably overnight, in the fridge. Remove the quail from the marinade and cut the quail in half lengthways (so that each portion has one leg and one breast). Heat a large ovenproof griddle pan until very hot. Thread a metal skewer through each quail half and place onto the griddle pan, skin-side down. Chargrill for 3-4 minutes, until brown griddle marks appear on the skin. Transfer the quail to the oven to roast for 5-10 minutes, or until completely cooked though.  For the salad, place the spring onions, coriander, mint, parsley and red onion into a clean bowl and mix together. For the salad dressing, mix together the soy sauce, lemon juice and sake (or dry sherry) in a separate bowl. Drizzle most of the dressing over the salad.  To serve, spoon a small amount of the salad onto each plate and top with two  quail halves. Drizzle a little extra dressing over. ","ingredients":" 4 red chillies, chopped,  4 garlic cloves, chopped,  1 bunch coriander, roots only, finely chopped,  1 tsp salt,  4 tsp caster sugar,  8 tsp rice wine vinegar,  4 quail, spatchcocked ,  2 spring onions, sliced at an angle,  small bunch fresh coriander, leaves only,  small bunch fresh mint, leaves only,  small bunch fresh parsley, leaves only,  1 red onion, sliced into rings,  2 tbsp soy sauce,  1 tbsp lemon juice ,  2 tbsp sake (or dry sherry)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/asianquailsalad_89471"}