{"recipe_name":"Clam udon with dashi","author":"Elizabeth Allen","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the dashi, put the kombu and shiitake mushrooms in a medium saucepan with about 800ml\/1⅓ pint cold water. Bring to a gentle simmer for 30 minutes. Remove the kombu and add the bacon and simmer for 30 minutes. Season the dashi with mirin, sake, soy sauce, and salt to taste. Set aside, keep warm and add the bonito flakes just before serving.  For the pickled vegetables, put the vinegar, sugar, coriander seeds and 200ml\/7fl oz water in a saucepan and bring to the boil. Cook until the sugar has dissolved then chill. Put the sea vegetables in a sterilised jar, pour in the pickling liquor and set aside until picked, around 5–10minutes.  For the clams, discard any open shells that don’t close after a good tap.  Heat the oil in a saucepan over medium heat, sweat the garlic and shallots until they turn translucent. Increase the heat and quickly add the clams. Add the wine and cover. Give it a couple of shakes to spread the clams around and help them open. Once the clams have opened, about 2–3 minutes, scoop them out with a slotted spoon and set aside. Continue to cook until the liquid has reduced by half. Add the butter and mix.  Add the udon to the sauce and cook for 2–3 minutes, add the clams and mix. Season with salt. Divide the udon and clams between bowls, sprinkled over the togarashi and top with the pickled sea vegetables. Pour the dashi gently over the udon, garnish with edible flowers and serve.  ","ingredients":" 1 sheet kombu seaweed (about 100g\/3½oz in weight) ,  10g dried shiitake mushrooms ,  250g\/9oz smoked bacon, such as pancetta, skin on ,  3 tbsp mirin, or to taste,  2 tbsp sake, or to taste,  2 tbsp soy sauce, or to taste,  10g bonito flakes (available online),  salt,  100ml\/3½fl oz rice vinegar ,  50g\/1¾oz caster sugar,  1 tsp coriander seeds ,  50g\/1¾oz samphire,  50g\/1¾oz sea aster ,  500g\/1lb 2oz palourde clams, washed,  1 tbsp vegetable oil,  1 garlic clove, finely diced,  2 banana shallots, finely diced,  125ml\/4fl oz dry white wine,  1 tbsp unsalted butter,  2 packs (about 600g\/1lb 5oz) fresh udon noodles,  500g\/1lb 2oz palourde clams, washed,  1 tbsp vegetable oil,  1 garlic clove, finely diced,  2 banana shallots, finely diced,  125ml\/4fl oz dry white wine,  1 tbsp unsalted butter,  2 packs (about 600g\/1lb 5oz) fresh udon noodles,  edible flowers","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/clam_udon_with_dashi_35620"}