{"recipe_name":"Clams and mussels with an asparagus, pea and broad bean nage","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a large lidded saucepan and add the clams, mussels, half of the shallots, white wine and parsley. Cook for 2-3 minutes, or until the clams and mussels have opened, discard any clams and mussels that remain closed. Drain the shellfish and reserve the cooking liquid. Pick some of the meat out of the cooked shellfish and keep some in their shells for presentation.  Bring a pan of water to the boil and cook the asparagus, baby carrots, peas and broad beans for 2 minutes. Add the samphire, sea aster and sea purslane for the final minute. Drain and pat dry. Set aside. Heat a frying pan until hot, add half the butter, once hot add the remaining shallot and cook for 1-2 minutes. Add the reserved cooking liquid and boil until the volume of liquid has reduced by half. Finish with the cream and allow to reduce by half once more. Add the meat removed from the clams and mussels to the pan. Heat a frying pan and add the olive oil, once hot add the scallops, cook on each side for 1-2 minutes (depending on how large they are - take care not to overcook them). Add a little butter at the end.  In a frying pan, add the remaining butter and fry the asparagus, baby carrots, peas, broad beans, samphire, sea aster, sea purslane and Jersey royals for about 1-2 minutes. To serve, spoon the vegetables onto a large serving plate and top with the scallops. Pour the sauce over and garnish with the clams and mussels in their shells and the chopped chervil. ","ingredients":" 400g\/14oz clams, scrubbed and debearded,  400g\/14oz mussels, scrubbed and debearded (Discard any mussels with broken shells and any that refuse to close when tapped),  2 shallots, finely chopped,  150ml\/5fl oz white wine,  1 tbsp chopped fresh parsley,  8 asparagus spears, trimmed,  1 bunch baby carrots, peeled and trimmed,  100g\/3½oz fresh peas,  100g\/3½oz fresh broad beans,  100g\/3½oz samphire,  20g\/¾oz sea aster,  1 handful sea purslane,  75g\/2¾oz butter,  5 tbsp double cream,  2 tbsp olive oil,  8 scallops, shelled, cleaned, roe removed,  150g\/5½oz Jerseys Royal potatoes, cooked and cut into quarters,  3 tbsp chopped fresh chervil or parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/clams_and_mussels_with_60911"}