{"recipe_name":"Classic pasty with green salad","author":"James Martin","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 4 pasties","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, rub the lard, butter and salt lightly into the flour until it resembles breadcrumbs. Add the water and beat in a food mixer until the pastry is well mixed and becomes elastic. This will take longer than normal pastry but it gives the pastry the strength that is needed to hold the filling and retain a good shape. Leave to rest for three hours in a refrigerator. This is a very important stage as it is almost impossible to roll and shape the pastry when fresh. Once rested, divide the pastry into four equal parts and roll each part out into a circle, so the pastry is about ½cm\/¼in thick. To assemble the pasty, preheat the oven to 180C\/350F\/Gas 4 Chop the meat and vegetables finely then add to the rolled out circles of pastry. Layer the vegetables and meat, adding plenty of seasoning.  Put a dollop of cream or a knob of butter on top. Then bring the pastry around and crimp together.  Brush the outside of the pasty with the egg then place on a tray in the oven for 25 minutes. Remove and brush with egg wash again then place back in the oven and cook for another 15 minutes, or until golden and cooked through. For the salad, place all the leaves into a bowl and toss to combine. Whisk the mustard, vinegar and olive oil together in a small bowl then season to taste. Toss the salad leaves with the dressing. Serve the pasty with a pile of salad alongside. ","ingredients":" 125g\/4½oz lard,  25g\/1oz butter,  500g\/1lb 2oz strong bread flour ,  1 tsp salt,  175g\/6oz cold water,  1 free-range egg, lightly beaten,  450\/1lb good quality beef, such as skirt,  450g\/1lb potato,  250g\/9oz swede,  200g\/7oz onion,  salt and freshly ground black pepper to taste,  40g\/1½oz clotted cream or butter (optional),  2 heads little gem, leaves separated,  1 handful baby spinach leaves,  1 handful watercress, leaves picked,  3 tbsp mint leaves, picked,  1 tsp English mustard,  1 tbsp sherry vinegar,  3 tbsp olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/classic_pasty_with_green_79085"}