{"recipe_name":"Classic victoria sponge cake with strawberry jam","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the jam, heat the sugar, lemon juice and zest and three tablespoons water in a large pan, slowly, until the sugar has melted. Add the strawberries and stir gently.  Bring the jam up to the boil and cook for 3-4 minutes, or up to 10 minutes if you prefer a thicker jam. Check the temperature with a sugar thermometer – it should reach 105C\/220F. Remove the jam from the heat and leave to cool slightly. Skim off any froth with a clean spoon, to stop the jam from going cloudy. Spoon the jam into a sterile jam jar, seal and label. For the cake, preheat the oven to 190C\/375F\/Gas 5.  Grease and flour two 20cm\/8in sandwich tins.  Combine the butter, sugar and vanilla essence in a bowl or food processor, and mix well to a creamy consistency.  Slowly beat in the eggs one by one.  Fold in the sifted flour then pour the mixture into the prepared tins.  Bake for 20-25 minutes until the sponge is well-risen, golden-brown and springs back when pressed.  Remove the cakes from the oven, turn them out of their tins onto a wire rack and leave to cool.  Spread one cake with strawberry jam, followed by a layer of whipped cream. Layer on the fresh strawberries then place the other cake on top. Dust with icing sugar to finish. ","ingredients":" 500g\/1lb 2oz jam sugar,  1 lemon, zest and juice,  500g\/1lb 2oz fresh strawberries, hulled, cut in half only if large,  oil, for greasing the tins,  flour, for dusting the tins,  250g\/9oz butter,  250g\/9oz caster sugar,  ½ tsp vanilla essence,  4 free-range eggs,  250g\/9oz self-raising flour, sifted,  175ml\/6fl oz double cream, whipped,  250g\/9oz strawberries,  2-3 tbsp icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/classic_victoria_sponge_54621"}