{"recipe_name":"Classic chicken Caesar salad","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the salad, season the chicken well with salt and freshly ground black pepper. Heat the oil in a frying pan over a medium heat and add the chicken breasts, skin-side down. Fry for 4-5 minutes, until the skin is crisp and golden-brown. Turn the breasts over and fry for 1-2 minutes. Transfer the breasts, skin-side up, to an ovenproof dish and pour the stock around the meat. Try not to pour the stock over the meat. Place into the oven to cook for 20 minutes, or until completely cooked through. Test the meat with a skewer at the thickest part- the juices should run clear. Remove from the oven and allow to cool slightly. Meanwhile, for the croutons, place the cubes of bread onto a baking tray, sprinkle with salt and drizzle with the oil. Place into the bottom of the oven and bake for 5-6 minutes, or until the croutons are golden-brown. For the dressing, place the parmesan and vinegar into a food processor and blend until very smooth. Add the mayonnaise, mustard, anchovy fillets, salt, garlic and olive oil and blend again until smooth. To serve, place the lettuce into a large bowl, pour on some dressing and gently turn the leaves to coat. Add the croutons and transfer the salad to four separate bowls. Add three anchovies to each bowl and drizzle over a little more dressing. Carve each chicken breast into thick slices and place half of the chicken over each bowl of salad. Sprinkle with parmesan shavings and serve. ","ingredients":" 2 x chicken breasts, skin and knuckle bone still attached,  salt and freshly ground black pepper,  1 tbsp olive oil ,  150ml\/5fl oz chicken stock,  200g\/7oz white bread, cut into small cubes ,  pinch salt,  80ml\/3fl oz olive oil,  150g\/5oz parmesan, grated ,  2 tbsp white wine vinegar,  250g\/10½oz ready-made mayonnaise,  3 tbsp Dijon mustard,  2 anchovy fillets, rinsed,  pinch salt,  1 garlic clove, crushed,  50ml\/2fl oz olive oil,  1 cos lettuce, torn up,  12 anchovies (stored in vinegar) ,  50g\/2oz parmesan shavings","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/classicchickencaesar_86187"}