{"recipe_name":"Classic cottage pie","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"2-3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a large frying pan until smoking, add half of the olive oil and fry the minced beef, in batches, for 4-5 minutes, or until browned all over.  Heat a separate pan over a gentle heat, add the remaining olive oil and fry the shallots and thyme for 2-3 minutes, or until just softened. Stir in the tomato purée and flour and cook for a further minute, then add the cooked beef. Deglaze the frying pan used to cook the beef with the red wine, scrapingup any caramelised bits with a wooden spoon. Cook for 3-4 minutes, or until the wine has reduced by half, then pour the wine into the pan with the beef.  Add the stock to the pan and leave to simmer for 45 minutes, or until the beef is tender and the mixture is thickened. Season, to taste, with salt, freshly ground black pepper and a few dashes of Worcestershire sauce. Keep warm over a very low heat. Preheat the grill to high. For the mash, place the potatoes into a pan of salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender.  Drain and return the potatoes to the pan, then place over the heat for about one minute to drive off any excess moisture. Mash well with a potato masher or ricer, then add the butter and milk, beating to form a smooth mash. Season, to taste, with salt and freshly ground black pepper. Spoon the mash into a piping bag. Place the mince mixture into a baking dish and pipe the mash over the top. Place under the grill for 8-10 minutes, or until the top is golden-brown. Serve spooned onto serving plates. Place the peas in water in a small saucepan and cook for 3-4 minutes, drain and add the butter. To serve, serve a spoonful of the cottage pie on plates with the peas alongside.  ","ingredients":" 50ml\/2fl oz olive oil,  650g\/1lb 7oz minced beef,  3-4 banana shallots or 7-8 small round shallots, finely chopped,  4 sprigs fresh thyme, leaves only,  2 tbsp tomato purée,  1 tbsp plain flour,  150ml\/5fl oz red wine,  400ml\/14fl oz beef stock,  salt and freshly ground black pepper ,  Worcestershire sauce, to taste,  900g\/2lb King Edward potatoes, peeled and chopped,  115g\/4oz butter,  125ml\/4½fl oz double cream,  salt and freshly ground black pepper,  150g\/5½oz frozen peas,  50g\/1¾oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/classiccottagepie_90765"}