{"recipe_name":"Clotted cream rice pudding with berry sauce and mini doughnuts","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the clotted cream rice pudding, preheat the oven to 180C\/350F\/Gas 4. Lightly grease a 1 litre\/1¾ pint pudding basin or ovenproof dish. Wash the rice under cold water and drain. Place the milk and cream in a saucepan with the vanilla pod and bring slowly to the boil. Add the rice and sugar and stir well. Pour the mixture into the pudding basin or dish and grate over a little nutmeg. Cut the butter into small pieces and place over the top of the rice mixture. Transfer the dish to the oven and bake for about 15 minutes, add the clotted cream and mix and then lower the temperature to 150C\/300F\/Gas 2. Bake for another hour, or until golden-brown on top and creamy underneath. For the berry sauce, place all the ingredients in a saucepan with 50ml\/2fl oz water and cook for 3-4 minutes. For the mini doughnuts, combine the flour, salt, and caster sugar in a large bowl. Mix in the butter, 150ml\/5½fl oz water and yeast until the mixture comes together to form a smooth dough. Cover with clingfilm and set aside in a warm place for about an hour, or until doubled in size. Divide the dough into 12 equal portions and roll each into a ball. Line a baking tray with baking parchment and place the dough balls onto it, leaving plenty of room between each ball. Cover and set aside in a warm place to prove for a further 20 minutes. When the dough has proved, heat the oil in a deep-fat fryer to 150C\/300F. Alternatively, heat the oil in a deep, heavy-based saucepan. (Caution: Hot oil can be dangerous. Do not leave it unattended.) Carefully lower the doughnuts into the hot oil in batches and deep-fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. When the excess oil has drained off the doughnuts, put them on a plate and dust with the caster sugar until completely coated. To serve, place a spoonful of rice pudding in shallow serving bowls with the berry sauce and mini doughnuts. ","ingredients":" 200g\/7oz pudding rice,  600ml\/21fl oz full-fat milk,  500ml\/18fl oz double cream,  1 vanilla pod, split,  125g\/4½oz caster sugar,  freshly grated nutmeg,  30g\/1oz butter, plus extra for greasing,  110g\/4oz clotted cream,  125g\/4½oz raspberries,  125g\/4½oz strawberries ,  2 tbsp icing sugar,  250g\/9oz strong white flour,  pinch salt,  50g\/1¾oz caster sugar,  30g\/1oz butter, softened,  7g instant yeast,  vegetable oil, for deep frying,  50g\/1¾oz caster sugar, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/clotted_cream_rice_37046"}