{"recipe_name":"Cocoa cinnamon bread and butter pudding with butterscotch pears, Chantilly cream and a warm chocolate sauce","author":"James Tanner","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the cocoa bread and butter pudding, remove all the crusts from the bread and spread one side of each slice with butter. Cut into triangles and lay them, overlapping, in the bottom of an ovenproof dish lightly greased with butter. Place the milk, cream, vanilla, cinnamon and cocoa powder in a large saucepan and warm through. Put the eggs and sugar in a large bowl and whisk until pale and doubled in size. Gradually add the liquid to the eggs whisking all the time. Pour back in to the pan and gently cook until the custard is thick enough to coat the back of a spoon. Pour the custard mixture over the bread and leave to sit for 30 minutes, then bake in the oven for 20-30 minutes. For the butterscotch roasted pears, place the sugar and butter in a medium frying pan and heat until melted. Add the cream and cook for 3-4 minutes, then add the pears and cook for a further 10 minutes. To make the Chantilly cream put in the cream, icing sugar and vanilla extract in a large bowl and whisk until stiff peaks form when the whisk is removed. For the chocolate sauce, place the cocoa and water in a small saucepan and cook until it thickens. Add the cream.  To serve, place a square of the pudding in bowl, pour over the sauce and top with a spoonful of the cream. ","ingredients":" 1 loaf sliced white bread,  110g\/4oz unsalted butter, softened,  300ml\/10fl oz full-fat milk,  300ml\/10fl oz double cream,  1 drop vanilla extract ,  1 tsp ground cinnamon,  20g\/1oz cocoa powder,  5 free-range eggs,  100g\/3½oz caster sugar,  100g\/3½oz caster sugar,  100g\/3½oz unsalted butter,  100ml\/3½fl oz double cream,  2 pears, core removed and sliced  ,  200ml\/7fl oz double cream,  25g\/1oz icing sugar,  1 drop vanilla extract ,  50g\/2oz cocoa powder,  100ml\/3½fl oz water,  2 tsp double cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cocoa_cinnamon_bread_and_32214"}