{"recipe_name":"Coconut and lime traybake","author":"Victoria Wood","programme":"Series 2","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 1 x 12-slice traybake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/170C Fan\/Gas 4 and line a 30x23x4cm\/12x9x1½in baking tin with two pieces of aluminium foil, overlapping in the middle. In a bowl, mix the lime juice, zest, the spices and desiccated coconut together and leave to soak. Sift the flour and baking powder into a separate large bowl and set aside. Put the sugar, butter and coconut butter in a food processor and pulse until smooth. Transfer to the bowl of dry ingredients and mix until well combined. Fold in the eggs and soaked coconut mixture.     Spoon the mixture into the prepared tin and bake for about 30 minutes, or until a skewer inserted into the middle comes out clean. Leave to cool in the tin for about 5 minutes then turn out onto a wire rack. Remove the foil and leave to cool completely. For the icing, put all the ingredients into a food processor and pulse until smooth. When the cake is completely cool, spread the icing all over the top. Trim the cake and cut into 12 equally-sized squares. For the decoration, roll out both coloured fondants.  Use the green to cut out 48 ‘leaves’ and the brown to cut out 12 ‘trunks’. Decorate each square of cake with the fondants to make a palm tree ‘trunk’ and ‘leaves’. Use the chocolate beans to represent coconuts and finish by sprinkling over a little lime zest. ","ingredients":" 4 limes, juice and zest only,  1 tsp ground cinnamon,  1 tsp ground mixed spice,  ½ tsp ground cloves,  100g\/3½oz desiccated coconut,  230g\/8oz self-raising flour,  2 tsp baking powder,  230g\/8oz golden caster sugar,  230g\/8oz butter,  70g\/2½oz coconut butter,  4 large free-range eggs, lightly whisked,  50g\/1¾oz unsalted butter,  175g\/6oz icing sugar,  250g\/9oz mascarpone cheese,  green fondant icing,  brown fondant icing,  chocolate beans,  1 lime, zest only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coconut_and_lime_56467"}