{"recipe_name":"Coconut, raspberry and lemon meringue trifle ","author":"Ali Imdad","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 1 large trifle","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the raspberry and coconut lady fingers, preheat the oven to 190C\/170(fan)\/Gas 5.  In a large bowl, whisk the egg yolks with half of the sugar until light and fluffy. In a separate bowl, whisk the egg whites until soft peaks form when the whisk is removed from the bowl. Gradually add the salt and remaining sugar until firm peaks form when the whisk is removed. Fold the egg whites into the egg yolk mixture. Sieve the flour and baking powder over the mixture and fold until just incorporated. Fold in the crushed raspberries and the coconut. Fill a piping bag with the mixture and pipe 10cm\/4in lengths onto a greased baking tray.  Bake for 15 minutes, or until golden-brown. Remove from the oven and cool on a wire rack. For the lemon curd, zest and juice the lemons. Add the zest and juice, butter and sugar to a heatproof bowl. Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl. Stir until the butter is melted. Lightly whisk the eggs and yolk in a bowl. Whisk them into the lemon mixture and then cook for 10-13 minutes, or until thickened, stirring occasionally. Remove the lemon curd from the heat and set aside to cool. Any lemon curd that isn’t used for this recipe can be spooned into sterilised jars, sealed and stored in the fridge. For the strawberry and raspberry glaze, add the sugar to 50ml\/1¾fl oz of water in a pan and dissolve the sugar over a simmering heat. Simmer until the mixture has thickened, then pour it over the soft fruit in a bowl. Set aside. For the custard, heat the milk, cream and vanilla in pan until just below the boiling point.. Mix together the cornflour and two tablespoons of cold water together in a small bowl. Set aside. Whisk the egg yolks and sugar in large bowl. Slowly add the milk mixture and, once combined, pour the mixture back into the pan and return to the heat. Cook for 8-10 minutes, or until thick enough to coat the back of a spoon. Quickly whisk in the cornflour mixture. Cook for 1-2 minutes more, or until really thick. Set aside to cool. For the coconut and raspberry cream, whisk the cream in a large bowl. Crush in the raspberries and stir in the coconut milk. For the lemon and raspberry macaroons, blend the icing sugar and ground almonds in a food processor. Whisk the egg whites on high in a large bowl using an electric whisk. When frothy, add a pinch of cream of tartar. Slowly add the caster sugar, whisking with each addition, until firm peaks form when the whisk is removed from the bowl. Fold in the food colouring and blended icing sugar and ground almonds. Pipe circles of the mixture onto a baking tray lined with baking paper, about the size of a 50p coin. Allow to sit at room temperature (in a non-humid setting) for at least half an hour, until a skin forms over the macaroons. Preheat the oven to 160C\/325F\/Gas 3. Bake for 5-12 minutes (depending on size). The macaroons should not catch any colour. For the meringue topping, whisk the egg whites in a bowl on high and then gradually add the caster sugar, whisking as you go, until stiff peaks are formed when the whisk is removed from the bowl. To assemble, arrange half the lady fingers in the bottom of a glass trifle bowl. Top with half the lemon curd, followed by all the custard, the remaining half of the lady fingers, the strawberry and raspberry glaze, coconut and raspberry cream and the remaining lemon curd. Finish with the meringue topping. Use a blowtorch to brown the meringue topping. Place the macaroons around the top and add some raspberries in the centre to decorate. ","ingredients":" 8 medium free-range eggs, separated,  250g\/9oz caster sugar,  ½ tsp salt ,  230g\/8oz plain flour,  1 tsp baking powder,  50g\/1¾oz raspberries, crushed ,  2 tbsp desiccated coconut,  butter, for greasing,  4 unwaxed lemons,  100g\/3½oz unsalted butter,  200g\/7oz unrefined caster sugar ,  3 whole free-range medium eggs, plus 1 free-range egg yolk,  50g\/1¾oz sugar ,  3 punnets raspberries, chopped,  3 punnets strawberries, chopped ,  600ml\/20fl oz full-fat milk,  600ml\/20fl oz double cream,  1 vanilla pod,  3 tbsp cornflour,  4 large free-range egg yolks,  75g\/2½oz caster sugar,  600ml\/20fl oz double cream,  1 punnet raspberries,  50ml\/2fl oz coconut milk,  13 tbsp icing sugar,  10 tbsp ground almonds,  2 medium free-range egg whites,  pinch cream of tartar,  3⅓ tbsp caster sugar ,  yellow gel colouring,  2 free-range egg whites,  100g\/3½oz caster sugar,  10-15 raspberries, to decorate ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coconut_raspberry_and_77291"}