{"recipe_name":"Coconut and raspberry biscuits","author":"Darina Allen and Rosemary Kearney","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 24","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. To make the base, cream the butter and gradually add the caster sugar. Beat until pale, soft and light. Add the egg, a little at a time, beating well after each addition, before adding the vanilla extract. Sift together the dry ingredients and stir gently into the creamed mixture.  Mix everything together lightly and add the milk to moisten. Spread the mixture into the prepared tin, smoothing it out to the edges. Spread the jam gently over the cake mixture and sprinkle with the raspberries. You may need to press them down gently into the cake mixture. Make the topping. Cream the butter and sugar together as before until pale, soft and light. Add the beaten eggs gradually, beating well after each addition. Mix together the coconut and rice flour and fold into the mixture. Spread gently but evenly over the raspberries and bake in the oven for about 35-40 minutes or until a skewer comes out cleanly.  Leave to cool in the tin and cut into 24 biscuits. ","ingredients":" 140g\/4½oz butter, softened,  60g\/2½oz caster sugar,  1 egg, preferably free-range, beaten,  1 tsp pure vanilla extract,  100g\/3½oz rice flour,  75g\/3oz tapioca flour,  1 tsp gluten-free baking powder,  1 tsp xanthan gum,  50ml\/2fl oz milk,  175g\/6oz raspberry jam,  250g\/9oz raspberries,  100g\/3½oz butter, softened,  150g\/5oz caster sugar,  2 eggs, preferably free-range, lightly beaten,  225g\/8oz desiccated coconut,  60g\/2½oz rice flour,  Swiss roll tin, 20x30cm\/8x12in, lined with parchment paper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coconutandraspberryb_74768"}