{"recipe_name":"Asian sweet and sour duck with sautéed broccoli and plum salsa","author":"Alex Mackay","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the sweet and sour duck, place the duck breast, skin-side down, into a cold, ovenproof frying pan and fry over a medium heat. When the duck begins to sizzle, add the remaining sweet and sour duck ingredients, except the cornflour and water, and transfer the pan to the oven to roast for 7-8 minutes, or until cooked to your liking.  Remove the pan from the oven and set the duck aside on a warm plate to rest.  Add the cornflour mixture to the same pan and cook over a low heat, stirring the juices in the pan until they thicken. For the sautéed broccoli, heat the olive oil and sesame oil in a frying pan over a medium heat, then add the onion and broccoli and stir fry for 4-5 minutes. Stir in the sesame seeds. For the plum salsa, mix all the ingredients in a bowl. To serve, spoon the broccoli onto a serving plate. Cut the duck into three pieces and arrange it on top of the broccoli. Pour the sweet and sour duck sauce over the duck, then drizzle the plum salsa around the edge of the plate. ","ingredients":" ½ duck breast, skin on,  1 tbsp soy sauce,  1 tbsp maple syrup,  2 tbsp honey,  2 tbsp red wine,  1 tsp sesame oil,  1 tsp cornflour mixed with a splash of cold water,  1 tbsp olive oil,  1 tbsp sesame oil,  ½ red onion, sliced,  ½ head broccoli, cut into florets,  1 tbsp sesame seeds,  1 tbsp sesame oil,  ¼ red onion, finely chopped,  1 orange, zest and juice,  1 plum, stone removed, chopped,  1 tbsp soy sauce,  2 tbsp fresh coriander, leaves only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/asiansweetandsourduc_89460"}