{"recipe_name":"Cod in parsley sauce with cockles and mashed potato","author":"Tom Kerridge","programme":"Spring Kitchen with Tom Kerridge","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cod, preheat the oven to 330F\/450F\/Gas 8. Lightly salt the cod, wrap in cling film and leave for twenty minutes. Wash the salt off and cut the cod in half. For the mashed potato, cook the potatoes in a large pan of boiling water until soft. Drain and return to the pan to dry out a little.  For the parsley sauce, give any open cockles a sharp tap on the work surface, discard any that do not close immediately. Heat a heavy-based pan until hot. Add the cockles, parsley stalks, shallots and wine. Put the lid on and steam until the cockles open. Drain in a colander, reserving the stock. Discard any cockles that have not opened. Pass the stock through a muslin cloth.   In a clean pan, melt the butter and then stir in the flour to make a roux.  Cook for a few minutes, then gradually add the stock, stirring all the time. Then add the cream, milk and crème fraîche. Season, to taste, with salt, cayenne pepper and lemon juice. For the cod, heat the butter in an ovenproof frying pan. Add the cod then transfer to the oven for eight minutes. Meanwhile, for the parsley sauce, pick the cockles from their shells and add to the sauce along with the parsley. Keep warm, but do not boil.  For the mashed potato, push the potatoes through a potato ricer or a drum sieve (alternatively use a vegetable masher). In a pan, melt the butter and cream together. Fold through the mash and season with salt and white pepper. To serve, add the mash to serving bowls. Top with the cod and parsley sauce.  ","ingredients":" 350g\/12oz centre-cut cod fillet, pin boned and skinned ,  40g\/1½oz sea salt,  knob of butter,  2 large potatoes, peeled and cut into chunks,  125g\/4½oz unsalted butter,  125ml\/4½fl oz double cream,  100g\/3½oz cockles, thoroughly washed to remove any sand or silt,  1 large bunch curly parsley, leaves picked, stalks reserved, both chopped ,  2 shallots, chopped,  150ml\/5½fl oz glass white wine,  25g\/1oz butter,  25g\/1oz flour,  150ml\/5½fl oz double cream,  150ml\/5½fl oz whole milk ,  30g\/1oz crème fraîche,  salt,  1 tsp cayenne pepper,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cod_in_parsley_sauce_47876"}