{"recipe_name":"Cod with mango and curry ","author":"Daniel Galmiche","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Heat a small frying pan until medium hot. Add the sugar and vinegar and cook until the sugar has dissolved - about 1-2 minutes. Add the onion, the mango and ginger and cook over a low heat for about six minutes, or until the mango has softened but still is holding its shape. Add the chilli, stir gently to combine then remove from the heat and set aside to cool while you fry the fish.  Season the cod on both sides with salt, black pepper and the curry powder. Heat a medium non-stick frying pan over a medium-high heat. Add the butter and olive oil and, when foaming, add the cod, skin-side down and fry for 3-4 minutes, or until the skin is golden-brown and crisp. Put four 46x25cm\/18x10in rectangles of greaseproof paper on a clean work surface. Arrange your ingredients on one half of the paper, so that you will be able to fold the other half over them afterwards: start with the mango mixture, dividing it equally between the four sheets, then place the cod, skin-side up on top.  Fold the paper over the filling and then fold along the edges to seal securely. Make sure the parcels are well sealed so that none of the liquid is lost. Put the parcels on a baking tray and bake for 8-10 minutes. Remove from the oven and leave to rest for two minutes before opening.  While the fish cooks, make the sauce. Heat a small pan over a medium heat, pour the fish stock and coconut milk in and bring to the boil, then reduce the heat and simmer gently until reduced by half, for about 4-5 minutes. By now, the fish should be ready, carefully open one side of each parcel and pour out the cooking juices into the sauce, then place the parcels straight onto serving plates. Whisk the whipped cream into the sauce, return to the boil, then remove from the heat and check the seasoning. Add the chervil and finish with the lemon juice. Serve the fish parcels with the sauce, along with the baby gem and cucumber.   ","ingredients":" 1 tbsp brown sugar,  4 tbsp chardonnay vinegar,  1 small red onion, finely sliced,  1 firm mango, peeled, roughly chopped, stone discarded,  1 tbsp grated ginger,  1 small red chilli, halved, seeds removed, julienned,  4 x 150g\/5½oz cod loin, skin on, pin boned,  sea salt and freshly ground black pepper,  1 tsp mild curry powder,  20g\/¾oz butter,  1 tbsp olive oil,  60ml\/2fl oz fish stock,  60ml\/2fl oz coconut milk,  100ml\/3½fl oz whipping cream, lightly whipped, plus 2 tbsp cream,  1 tbsp chopped chervil,  1 tsp lemon juice,  1 baby gem lettuce, cut in four,  ½ cucumber, peeled, seeds removed, in large julienne","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cod_with_mango_and_curry_37791"}