{"recipe_name":"Cod and crab with a spiced sauce","author":"Tim Bates","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Mix together the cheese, crab, egg yolk, lemon, chopped ginger and spring onion. Season well.   Cut a slit in the middle of each piece of fish and fill with the cheese mixture. Plunge the lettuce leaves into boiling water and then into cold water. When the leaves are cold, wrap up the fish in them to make four parcels.   Pour the fish stock into a shallow dish and add the five spice and balti paste. Put the fish parcels into the stock and cover with foil. Cook for about 20-30 minutes in a medium hot oven, 190C\/375F\/Gas 5. Fry the strips of ginger in a little butter until crisp. Drain and put to one side.   When the fish parcels are cooked, remove them from the stock. Keep the parcels warm, in the cooking oven, covered in foil should be fine. Put the stock into a saucepan and bring to the boil over a high heat. Continue cooking the stock until it is reduced by about half.   With the stock still boiling add the butter, whisking in a couple of pieces at a time. The sauce will thicken and go shiny. Serve the fish parcels surrounded by the sauce, with the crispy ginger sprinkled on top. ","ingredients":" 1 pot of ricotta cheese,  1 tin of white crab meat,  1 egg yolk,  lemon juice,  1 tsp ginger, finely chopped,  1 spring onion, finely chopped,  4 chunky pieces of cod ,  4 large lettuce leaves ,  500ml\/16fl oz fish stock,  2tsp five spice powder,  2tsp bottled balti paste ,  root ginger peeled and cut into fine matchsticks,  125g\/4oz butter, cut into small pieces ,  Note: Instead of the lettuce leaves you could use savoy cabbage leaves, stems removed or 4 large leek leaves, flattened out.","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/codandcrabwithaspice_11932"}