{"recipe_name":"Cod and parsley flan","author":"Ed Baines","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sift the flour and salt into a bowl, then rub in the chopped, softened butter, followed by the egg yolk and iced water.   Knead lightly until smooth.   Chill the pastry while you make the filling.   Preheat the oven to 200C\/400F\/Gas 6. Place the cod fillets in a pan, add the bay leaf, a twist of black pepper and the mustard.   Pour over the milk, bring just to the boil and simmer gently for three minutes.  Remove from the heat and leave to cool to room temperature. In a bowl, whisk the egg yolks and whole egg until well beaten.  Add the cream, cheese, salt and pepper, and a dash of Worcestershire sauce.   Flake in the cod and gently stir in the cooled milk, followed by the parsley and sun-dried tomatoes.  Allow to cool and then chill for 30 minutes. Roll out the pastry and use to line a 30cm\/12in flan ring. Prick the base of the pastry case with a fork.  Line the pastry case with baking paper, cover with baking beans or dried beans and bake blind in the preheated oven for 15 minutes.  Remove the beans and paper and return to the oven for a further five minutes to finish cooking the base.  Reduce the oven setting to 180C\/350F\/Gas 4. Allow the pastry case to cool a little, then pour in the filling and bake in the oven for about 30 minutes, until risen and golden brown. ","ingredients":" 225g\/8oz plain flour,  a pinch of salt,  100g\/4oz butter,  1 egg yolk,  3 tbsp iced water,  Or use shop bought short crust pastry,  4 cod fillets, each about 175g\/6oz, skinned and any pin bones removed,  1 bay leaf,  freshly ground black pepper,  1 teaspoon English mustard,  600ml\/1 pint milk,  4 egg yolks, plus 1 whole egg,  125ml\/4fl oz double cream,  100g\/4oz mature cheddar cheese, grated,  a dash of Worcestershire sauce,  a bunch of fresh parsley, finely chopped,  60g\/2oz sun-dried tomatoes, drained, patted dry and finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/codandparsleyflan_70897"}