{"recipe_name":"Cod with parsley sauce and mash","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the parsley sauce, slowly bring the milk, onion, nutmeg, bay leaf and white peppercorns to a simmer in a pan. Remove the pan from the heat and set aside to cool for 8-10 minutes. Meanwhile, melt 25g\/1oz of the butter in a heavy-based pan. Whisk in the flour to create a smooth paste (this is called a roux), then cook, whisking continuously, for one minute, or until the paste has thickened. Remove the pan from the heat. Strain the milk mixture into the roux mixture, then whisk well until completely incorporated.  Return the pan to the heat and gradually bring the mixture to the boil, whisking continuously, until the sauce has thickened enough to coat the back of the spoon. Stir in the remaining 10g\/½oz of butter until the sauce is glossy, then simmer for 2-3 minutes. Stir in the parsley and season, to taste, with salt and freshly ground black pepper. Meanwhile, for the mash, crush the cooked potatoes and celeriac cubes in a pan with the butter and cream until smooth and well combined. Season, to taste, with salt and freshly ground black pepper. Keep warm. For the cod, sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Dredge the cod fillets in the seasoned flour until completely coated. Heat the oil in a frying pan over a medium heat. When the oil is hot, add the coated cod fillets and fry for 2-3 minutes on each side, or until crisp and golden-brown on both sides and cooked through. (NB: The cod is cooked through when the flesh is opaque.)  When the cod is almost cooked through, dot the cod fillets with the butter, then squeeze over the lemon. When the butter has melted, remove the pan from the heat.  To serve, spoon a portion of the mash into the centre of each of four serving plates. Place one fried cod fillet on top of each serving. Drizzle over the pan juices, then pour over the parsley sauce. Garnish each plate with a lemon wedge. ","ingredients":" 300ml\/10½fl oz full-fat milk,  ½ onion, peeled, finely sliced ,  pinch freshly grated nutmeg,  1 fresh bay leaf,  4 whole white peppercorns,  35g\/1½oz butter,  25g\/1oz flour,  3 tbsp chopped fresh parsley leaves,  salt and freshly ground black pepper,  200g\/7oz new potatoes, cooked until tender, drained,  200g\/7oz celeriac, peeled and cut into cubes, cooked until tender, drained,  75g\/3oz butter,  1 tbsp double cream,  salt and freshly ground black pepper ,  50g\/1¾oz flour,  salt and freshly ground black pepper,  4 x 175g\/6oz cod fillets,  1-2 tbsp vegetable oil,  75g\/3oz butter,  1 lemon, juice only, plus extra lemon wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/codwithparsleysauce_92631"}