{"recipe_name":"Coffee and cardamom cake with peanut ice cream ","author":"James Martin","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the peanut ice cream, whisk the yolks with 60g\/2¼oz of the caster sugar in a large bowl until thick and creamy. Place the milk, cream and remaining caster sugar in a pan and bring to the boil.  Pour the hot milk into the whisked yolks and stir well. Return the mixture to the pan and cook over a very low heat stirring constantly with a spatula until the mixture is thick enough to coat the back of a spoon. Cool the mixture, then refrigerate for at least one hour. Strain the mixture into an ice cream maker and mix in the peanuts. Churn until frozen, following the manufacturer's instructions. Set aside in the freezer until ready to serve. For the cake, preheat the oven to 190C\/375F\/Gas 5. Grease and line a 23cm\/9in deep cake tin. Place the butter and sugar into a bowl and whisk until light and fluffy. Add the eggs, one at a time, beating between each addition until well incorporated. Add the coffee and ground cardamom seeds and mix well, then fold in the flour. Pour the mixture into the cake tin, transfer to the oven and bake for 20-25 minutes, or until golden-brown and well risen. Remove from the oven and allow to cool. For the filling, place the cream in a bowl and whisk until soft peaks form when the whisk is removed. Add the icing sugar, ground cardamom seeds and pistachios and whisk gently until the mixture forms firm peaks. For the icing, place the icing sugar in a bowl, add the coffee and mix together until smooth.  To assemble the cake, carefully cut the cake in half horizontally with a bread knife and place the bottom half on a plate. Spread the pistachio cream over the bottom half of the cake, then top with the other half. Spoon over the icing, allowing it to drizzle down the sides of the cake. For the toffee popcorn dust, blend the toffee popcorn in a food processor to a powder. To serve, using a pastry brush paint a semi-circle of oil onto each plate and sprinkle over the popcorn dust. Shake any excess off the plates. Cut the cake into slices and place on the plates with a scoop of ice cream and a sprig of mint. ","ingredients":" 6 medium free-range egg yolks,  120g\/4¼oz caster sugar,  250ml\/9fl oz full-fat milk,  250ml\/9fl oz double cream,  100g\/3½oz plain shelled peanuts,  200g\/7oz butter, softened, plus extra for greasing,  200g\/7oz caster sugar,  4 free-range eggs,  3 tbsp strong coffee,  8 cardamom pods, seeds removed and ground,  250g\/9oz self-raising flour,  250ml\/9fl oz double cream,  1 tbsp icing sugar,  5 cardamom pods, seeds removed and ground,  60g\/2¼oz pistachios, shells removed, roughly chopped,  110g\/4oz icing sugar,  1 tbsp warm coffee,  150g\/5½oz toffee popcorn,  1 tbsp vegetable oil,  4 sprigs fresh mint","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coffee_and_cardamom_cake_58811"}