{"recipe_name":"Coffee and chocolate baklava and breakfast baklava","author":"Nancy Birtwhistle","programme":"The Great British Bake Off","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the breakfast baklava, preheat the oven to 180C\/350F\/Gas 4 and grease a large baking tray with butter. Trim eight sheets of filo so they fit neatly in the tray.  Place one sheet of filo in the tray and brush with melted butter then place another sheet of filo on top. Sprinkle a layer of oats, nuts, dried fruits, spices, honey, dried apple and stem ginger over. Repeat this process two more times, brushing the filo with butter as you go, then top with a double layer of filo.  Before buttering the final sheet of filo, use a sharp pointed knife to cut the baklava in half lengthways. Then cut it in thirds widthways  to make six pieces. Cut each piece on the diagonal to make 12 triangles. Brush the top with butter then add a sprinkling of demerera sugar.  Bake for 25-30 minutes, or until golden-brown.   While the baklava is cooking, make a syrup. In a saucepan, heat the apple juice and sugar over a low heat until the sugar is dissolved then bring to the boil. Using a cook’s thermometer, keep measuring the temperature of the syrup until it reaches 108C\/226F, then remove from the heat and allow to cool. When the baklava is cooked, pour over the cooled syrup.  Set aside to cool completely before removing from the tin. For the coffee and chocolate baklava, combine the chopped hazelnuts, cocoa, coffee, chocolate, star anise and demerera sugar in a bowl to make the filling. Preheat the oven to 200C\/400F\/Gas 6. Grease a large baking tray with butter.  Cut the remaining six sheets of filo in half to create 12 squares and brush one piece with melted butter.  Lay another square over the top and brush with more butter.  Spread a third of the filling over the top then add another piece of filo, brush with butter and finish with another piece of filo, buttering as before.   Using a wooden spoon handle as an aid, gently roll the filo into a sausage then squash it slightly and place in the prepared tin.  Repeat to make two more filo rolls.   Cut each roll into quarters to make 12 portions.  Brush butter all over. Bake for 15 minutes, then reduce the oven temperature to 180C\/350F\/Gas 4 and bake for another 10-15 minutes.   Meanwhile, make a syrup. Heat the orange juice and caster sugar in a pan until the sugar is dissolved then bring to the boil.  Using a cook’s thermometer, keep measuring the temperature of the syrup until it reaches 108C\/226F, then remove from the heat. Stir in the orange blossom extract and set aside to cool. When the baklava is cooked, scatter the orange zest on top and pour over the cooled syrup. Set aside to cool completely before serving. ","ingredients":" 14 sheets ready-made filo pastry ,  200g\/7oz unsalted butter, melted,  50g\/1¾oz milled porridge oats, soaked overnight in 100ml\/3½fl oz apple juice,  75g\/2½oz roasted chopped hazelnuts ,  75g\/2½oz flaked almonds ,  100g\/3½oz dried cranberries, cherries and strawberries,  100ml\/3½fl oz honey,  10 slices dried apple, chopped,  ½ tsp ground star anise,  2 tsp ground ginger ,  2 tsp ground cinnamon,  2 pieces stem ginger, chopped ,  50g\/1¾oz demerera sugar,  400ml\/14fl oz apple juice ,  200g\/7oz caster sugar,  125g\/4½oz roasted chopped hazelnuts ,  2 tbsp cocoa powder ,  2 tbsp instant espresso coffee,  50g\/1¾oz chocolate chips ,  1 whole star anise,  30g\/1oz demerera sugar ,  300ml\/10½fl oz orange juice ,  150g\/5½oz caster sugar,  1 tbsp orange blossom extract ,  1 orange, zest only","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coffee_and_chocolate_14427"}