{"recipe_name":"Coffee cake with coffee buttercream, coffee glacé icing and candied walnuts","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the coffee cake, preheat the oven to 180C\/350F\/Gas 4. Grease and line a 23cm\/9in loose-bottomed cake tin. Place the butter and sugar in a large bowl and beat until light and fluffy. Gradually add the eggs, continually beating, then the coffee essence. Sieve in the flour and fold in. Pour into the prepared cake tin and level off with a palette knife. Bake for 20-25 minutes, or until golden-brown and risen. Remove from the tin and allow to cool on a cooling rack. For the coffee buttercream, place the softened butter in a bowl and mix with a hand-held electric mixer. Add the sifted icing sugar and beat together. Dissolve the coffee in the water and add to the buttercream and stir. Set aside. For the glacé icing, place the coffee and boiling water into a bowl to dissolve, then add the icing sugar and beat until smooth. Add a little more boiling water if needed until the mixture comes to a spreadable consistency. For the candied walnuts, place the sugar and 110ml\/3½fl oz water into a saucepan and bring to a simmer. Add the walnuts and cook for a couple of minutes, or until just tender. Drain and place onto a large sheet of greaseproof paper.  Heat 2.5cm\/1in of vegetable oil in a saucepan until just shimmering. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully add the candied walnuts to the oil and cook for 1-2 minutes, or until just golden-brown. Lift out and drain on a fresh sheet of greaseproof paper. Leave until cool. To assemble the cake, cut the cake in half horizontally. Spread the buttercream over one half of the cake and place the other half on top. Spread the glacé icing over the top and decorate with candied walnuts. ","ingredients":" 200g\/7oz unsalted butter, softened, plus extra for greasing the tins,  200g\/7oz caster sugar,  4 medium free-range eggs,  3 tbsp coffee essence, such as Camp,  250g\/9oz self-raising flour,  100g\/3½oz unsalted butter,  200g\/7oz icing sugar,  2 tsp coffee granules,  1 tbsp boiling water,  2 tsp coffee granules,  1 tbsp boiling water,  100g\/3½oz icing sugar,  110g\/4oz caster sugar,  18 walnut halves,  vegetable oil, for frying","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coffee_cake_with_coffee_65414"}