{"recipe_name":"Coffee Swiss roll with caramel and nut filling","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 1 Swiss roll","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Grease and line a 33x23cm\/13x9in Swiss roll tin with baking parchment. Whisk the eggs and 100g\/3½oz of the sugar in a bowl until the mixture becomes light and leaves a trail when you remove the whisk from the bowl. This will take about 10-15 minutes. Whisk in the coffee essence. Sieve the flour into the egg mixture and carefully fold it in. Pour the mixture into the tin and give it a shake to level it, so that it spreads evenly. Bake for 8-10 minutes, or until the cake turns golden-brown. Then set aside to cool in the tin. Place the remaining 200g\/7oz sugar in a frying pan set over a medium heat. Melt the sugar, without stirring, until it forms a golden-brown caramel. (CAUTION: melted sugar is very hot. Take care not to burn yourself.) Remove from the heat and stir in the nuts. Pour the praline onto a large sheet of baking parchment or silicon paper and set aside until completely cool and hard.  In a food processor, blend the praline to a coarse powder. Set aside until you are ready to assemble the Swiss roll. Tip the still warm Swiss roll out onto a clean tea towel. Starting at one of the longest edges, roll up the Swiss roll and then set aside to cool completely.  While the cake is cooling, prepare the filling. Pour the cream into a large bowl and add the sugar. Whisk until soft peaks form when the whisk is removed from the bowl. Add the dulce de leche and mix well. Lay a tea towel on the work surface and sprinkle the blended praline over the tea towel in an even layer.  Carefully unroll the Swiss roll onto the blended praline, then spread the caramel cream over the cooled sponge, leaving a 2cm\/1in gap around the edge. Using the tea towel to help you, roll the sponge quite tightly, making sure the filling stays inside. Roll the sponge off the tea towel. The blended praline should stick to the outside of the cake, but any patches can be filled by pressing any excess praline onto the sponge. Decorate the Swiss roll with the marrons glacées and serve in slices. ","ingredients":" 4 large free-range eggs,  300g\/10½oz caster sugar, plus extra for dusting,  75ml\/2½fl oz coffee essence,  100g\/3½oz self-raising flour,  50g\/1¾oz blanched almonds,  50g\/1¾oz pistachio nuts,  50g\/1¾oz blanched hazelnuts ,  300ml\/10½fl oz double cream,  25g\/1oz icing sugar,  50g\/1¾oz dulce de leche,  8-10 marrons glacés","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coffee_swiss_roll_with_63858"}