{"recipe_name":"Coffee parfait","author":"Raymond Blanc","programme":"Raymond Blanc's Kitchen Secrets","prep_time":"overnight","cooking_time":"no cooking required","serves":"Makes 1.4litres\/2 pints 10fl oz","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Whisk the egg yolks, sugar and dessert wine together in a large heatproof bowl until pale and fluffy. Set the bowl over a pan of barely simmering water and continue to whisk for 3-4 minutes, or until the mixture is pale and has thickened (the temperature of the mixture should reach about 78-80C\/175F). Remove from the heat, set the bowl in a larger bowl of iced water and whisk again until cool. Whisk in the cayenne pepper and lemon juice. Set aside until completely cold. Whisk one-third of the whipped cream into the cooled sabayon mixture, then carefully fold in the remaining cream until just combined. Fold the coffee essence carefully into the sabayon until combined. Spoon the mixture into a 1.2kg\/2lb 10¼oz loaf tin, levelling the top with a palette knife. Chill in the freezer for at least 12 hours, or until solid. When ready to serve, remove the coffee parfait from the freezer and dip the loaf tin into hot water to loosen the parfait from the tin. Run a blunt knife around the parfait, then turn it out onto a long rectangular plate. To serve, slice the coffee parfait and serve with caramel sauce or vanilla cream, if using. Sprinkle with chopped roasted nuts and dust with cocoa powder. ","ingredients":" 8 free-range egg yolks,  100g\/3½oz caster sugar,  250ml\/9fl oz sweet, fruity dessert wine, such as Monbazillac or Beaume de Venice,  small pinch cayenne pepper,  1-2 tsp freshly squeezed lemon juice,  200ml\/7fl oz whipping cream, whisked until soft peaks form when the whisk is removed,  50ml\/2fl oz coffee essence or cooled strong coffee,  caramel sauce (optional),  vanilla cream (optional),  chopped roasted nuts,  cocoa powder, for dusting","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coffeeparfait_93225"}