{"recipe_name":"Cold lobster salad with tarragon vinaigrette","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the vinaigrette, whisk the mustard and lemon juice in a bowl.  Gradually whisk in 6 tablespoons of the olive oil.  Add the tarragon and garlic clove and leave to infuse.  Season, to taste, with salt and freshly ground black pepper.  Pick the meat from the lobsters and set aside in a bowl in the fridge, reserving the shells.  Heat a saucepan over a medium heat.  Add the remaining two tablespoons of  the oil, chopped fennel, celery and onion and fry until softened. Add the lobster shells and fry for 2-3 minutes. Add the white wine and bring to a simmer. Add the stock or water, return to a simmer for an hour, then strain the stock through a fine sieve.  Place the liquid back into a saucepan and add the cream.  Simmer for 30 minutes, or until the volume of the liquid has reduced by half and thickened. Season with salt and pepper and leave to cool. Chill the lobster cream in the fridge until ready to serve. Slice the new potatoes into thin rounds. Arrange the rounds in a chefs’ ring onto each serving plate to create a circular base. Remove the chefs’ ring. Place a Baby Gem leaf onto the potatoes. Lightly dress the lobster meat with a little of the tarragon vinaigrette, then spoon into the Baby Gem. Place a small handful of mixed cress on top of the lobster. Place the diced tomato around the edge of the plate then dress with a little of the cold lobster cream. ","ingredients":" 1 tsp Dijon mustard,  1 lemon, juice only,  8 tbsp olive oil ,  2 sprigs tarragon,  1 garlic clove, peeled ,  salt and freshly ground black pepper,  2 x 600g\/1lb 5oz cooked lobsters,  1 bulb fennel, trimmed and finely chopped,  2 sticks celery, finely chopped,  1 onion, finely chopped,  lobster shells (from above),  150ml\/5fl oz white wine,  300ml\/10fl oz chicken stock or water,  200ml\/7fl oz cream,  8 cooked new potatoes, cooled and peeled,  4 Baby Gem leaves,  a mix of cress or micro leaves,  2 tomatoes, peeled and seeds removed, diced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cold_lobster_salad_with_50725"}