{"recipe_name":"Cold poached chicken steeped in a tomato and smoked garlic dressing with asparagus and new potato","author":"Rob Kirby","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the stock in a deep frying pan and gently poach the chicken for 10-15 minutes. Place in a bowl. While the chicken is cooking, put the shallots, garlic and herbs into a blender and pulse until finely chopped. Add the tomato ketchup and slowly incorporate the oil, lemon juice and Worcestershire sauce. Blend until combined and season to taste. Pour the tomato and tarragon dressing over the chicken, leave to cool and marinate. Bring a large pan of salted water to the boil. Cook the new potatoes until tender. Drain and chill. Bring a large pan of salted water to the boil. Blanch the asparagus for 2-3 minutes. Drain and chill. Chop the shallots, dice the new potatoes and add the asparagus and snipped chives. Gently fold in the mayonnaise, season to taste and refrigerate. Remove the chicken from the dressing and put on a large serving plate or bowl.  Pour over the dressing and spoon the potato and asparagus salad on to the plate. Finish with fried vine cherry tomatoes and basil leaves and serve. ","ingredients":" 4 x corn-fed chicken breasts, wing bone trimmed and skinned,  500ml\/17fl oz chicken stock,  4 shallots,  2 bulbs smoked garlic,  15g\/½oz fresh tarragon,  15g\/½oz fresh coriander,  15g\/½oz fresh basil,  400ml\/14½fl oz tomato ketchup,  125ml\/4½fl oz sunflower or light olive oil,  ½ lemon, juice only,  6 drops Worcestershire sauce,  salt and freshly ground black pepper,  500g\/1lb 2oz new potatoes,  225g\/8oz asparagus, trimmed,  4 shallots ,  ½ bunch fresh chives, snipped,  150ml\/¼ pint mayonnaise,  vine cherry tomatoes fried in olive oil and balsamic vinegar,  deep fried basil leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coldpoachedchickenst_11734"}