{"recipe_name":"Duck confit with lentils","author":"Daniel Galmiche","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the duck confit, put the duck legs in a small shallow tray, skin-side down, and season with the salt, pepper, garlic and thyme. Cover with cling film, press down and leave to marinate for 2-3 hours in the fridge. Preheat the oven to 140C\/275F\/Gas 1. Take the duck out of the tray, discarding the marinade. Rinse under cold running water and pat dry with kitchen paper.   Put the duck in a large heavy-based casserole or cast iron pan and pour the melted goose fat on top. Cover with a lid or greaseproof paper sealed with foil, place in the oven and bake for 3-4 hours, or you can gently simmer the duck on the stove, covered with a lid, for 3-4 hours. Remove from the oven, or take off the heat if you're cooking on the stove, skim off any fat then cover with foil and set aside. Meanwhile, cook the lentils. Place them in a small saucepan and cover with cold water. Bring to the boil and skim the white foam from the surface. Add the shallot, carrot, bouquet garni and garlic, reduce the heat and simmer for a further 10 minutes or until al dente.  Strain the lentils, reserving two tablespoons of the cooking liquid. Discard the shallot, bouquet garni and garlic. Add the vinaigrette, the reserved cooking liquid and the chervil. Season, to taste, with salt and freshly ground black pepper.  Brush the duck legs with the honey and pan-roast them, skin-side down, in a non-stick pan over a medium heat for five minutes or until crisp and golden-brown. The honey will caramelize very quickly, so be careful not to let it burn. To serve, spoon the lentils onto serving plates and top with the duck legs. Alternatively, arrange the duck legs on top of the lentils in a large pot and serve at the table.  ","ingredients":" 4 duck legs, preferably from corn-fed, free range Barbary ducks, each about 175g\/6oz, including fat,  40g\/1½oz sea salt,  freshly ground black pepper,  4 garlic cloves, unpeeled and crushed with the flat edge of a knife,  4 thyme sprigs, leaves only,  1kg\/2lb 4oz goose or duck fat, melted,  2 tbsp honey,  200g\/7oz Puy lentils, rinsed,  1 shallot, finely chopped,  1 small carrot, peeled and diced,  1 bouquet garni made with 1 thyme sprig and 1 parsley sprig, tied together with kitchen string,  1 garlic clove, unpeeled,  2-3 tbsp vinaigrette ,  1 handful chervil, leaves only, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/confit_de_canard_aux_68185"}