{"recipe_name":"Cookies and cream fudge brownies","author":"Lorraine Pascale","programme":"Baking Made Easy","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 16","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/cookies_and_cream_fudge_48648_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease a 20cm\/8in square baking tin with butter, then line with baking paper with the paper overlapping the sides a little. Melt the butter in a pan over a medium heat. When the butter has melted, remove the pan from the heat and add the grated (or chopped) chocolate. Leave to stand for a few minutes, or until the chocolate melts, and then stir together. Alternatively, you can put the chocolate and butter in a bowl and melt in the microwave in 25-second blasts, stirring well each time. Whisk the eggs, egg yolks and vanilla together in a large bowl until the eggs begin to get light and fluffy. Add the sugar in two additions, whisking between each. Pour it around the side of the egg mix so as not to knock out the air that has been whisked in. Keep whisking until the mixture becomes stiffer. Once the egg mixture is ready, pour the chocolate into it - again around the sides so as not to knock the air out. Add the flour, cocoa powder, salt and a third of the biscuits and stir until fully combined, then pour the mixture into the prepared tin. Scatter the remaining biscuits over the top, pressing them in slightly. Bake on the middle shelf of the oven for 25–30 minutes. The middle should be very so slightly gooey. Leave the brownies to cool in the tin - the top will sink and crack a little. Pull the brownies out using the overlapping paper and cut into squares. Dust with icing sugar. ","ingredients":" 165g\/5½oz butter, plus extra for greasing,  200g\/7oz dark chocolate, grated or finely chopped,  3 free-range eggs,  2 free-range egg yolks,  1 vanilla pod, seeds only (or alternatively 2 tsp vanilla extract),  165g\/5½ oz soft light brown sugar,  2 tbsp plain flour,  1 tbsp cocoa powder,  pinch salt,  154g\/5½oz pack chocolate biscuits, such as Oreos, broken into quarters,  icing sugar, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cookies_and_cream_fudge_48648"}