{"recipe_name":"Coq au Pouilly-Fumé","author":"The Hairy Bikers","programme":"Hairy Bikers - Chicken & Egg","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/coq_au_riesling_85117_16x9.jpg","method":"Tie the bay leaves, thyme and parsley into a bouquet garni and put in a large bowl. Add the chicken and season with salt and pepper. Pour over the wine. Leave to marinate in the fridge, covered, for at least 12 hours.  Heat the oil in a large lidded casserole dish over a medium heat, then add the bacon and onion. Cook until the onion has softened and browned slightly. Add the butter and, when it has melted, add the mushrooms and cook until golden brown. Transfer the bacon, onions and mushrooms to a plate and set aside. Remove the chicken from the marinade and pat dry with kitchen paper. Place in the casserole dish skin side-down and cook for 15 minutes on each side, or until well browned. Add the garlic and cook for 1–2 minutes. Return the bacon, onion and mushrooms to the casserole. Pour over two-thirds of the marinade (discard the rest) and bring to the boil. Turn down to a simmer and cover. Cook for 45 minutes, or until the chicken is cooked through and almost falling off the bone.  Carefully remove the chicken from the casserole and set aside. Whisk the egg yolk with the cream and pour this into the casserole. Cook very gently for a few minutes, until the sauce has thickened a little, then return the chicken to the pan. Serve, garnished with the parsley, with buttered noodles. ","ingredients":" 3 bay leaves, fresh or dried,  1 sprig fresh thyme ,  1 sprig fresh parsley,  1 chicken, jointed into 8 pieces, or 8 chicken pieces, bone in,  750ml bottle Pouilly-Fumé or other Sauvignon Blanc,  1 tbsp olive oil,  100g\/3½oz unsmoked bacon lardons,  1 onion, finely chopped,  15g\/½oz butter, plus extra to serve,  200g\/7oz button mushrooms,  3 garlic cloves, finely chopped,  1 egg yolk,  100ml\/3½fl oz single cream,  salt and freshly ground black pepper,  handful fresh parsley, roughly chopped, to serve,  egg noodles, cooked and buttered, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coq_au_riesling_85117"}