{"recipe_name":"Coq au vin","author":"Simon Hopkinson","programme":"The Good Cook","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/coq_au_vin_15354_16x9.jpg","method":"Place the marinade ingredients into a casserole dish and bring to the boil. Allow the volume of liquid to reduce by one-third and strain into a clean, non-reactive bowl and set aside to cool. Place the chicken pieces into the marinade, cover and leave to chill in the fridge for at least 5-6 hours or, preferably, overnight. Warm the olive oil in the casserole dish and gently fry the pancetta until golden-brown. Remove with a slotted spoon and reserve.  Remove the chicken joints from the marinade, setting the liquid aside. Season the chicken joints with salt and freshly ground black pepper. Dredge the joints in the flour, and then fry until golden-brown in a little olive oil. Remove with a slotted spoon and set aside. Add the butter to the dish and place the onions and mushrooms into the casserole and fry gently for 10 minutes, or until golden-brown. Remove any excess fat with a spoon and return the chicken and bacon to the pot, turn up the heat and pour over the cognac. Set alight, allow the flames to die down and then add the reserved, reduced wine. Gently simmer for one hour. (Alternatively, cook the casserole in an oven preheated to 170C\/325F\/Gas 3.) Heat 2.5cm\/1in depth of vegetable oil in a heavy-based frying pan. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Shallow fry the bread triangles for 2-3 minutes on each side, or until golden-brown. Remove with a slotted spoon. Finally, dip one edge of the fried bread into the hot coq au vin sauce, then into the parsley. Serve the coq au vin with simply boiled or steamed potatoes and with the bread triangles. ","ingredients":" 1 bottle good-quality red wine (preferably Pinot Noir),  1 tbsp redcurrant jelly,  1 small onion, chopped ,  2 sticks celery, chopped,  1 carrot, chopped,  4 garlic cloves, un-peeled, bruised,  3-4 sprigs fresh thyme,  2 bay leaves,  2 cloves,  4 large chicken joints (thigh or leg), skinned,  1 tbsp olive oil, plus extra for shallow frying ,  100g\/3½oz smoked pancetta, rind removed, cut into large cubes ,  salt and freshly ground black pepper,  1 tbsp plain flour,  25g\/1oz butter,  20 button onions, peeled ,  20 button mushrooms,  3 tbsp cognac,  olive oil, for shallow frying,  4 thick slices of good-quality white bread, crusts removed, cut into triangles,  3-4 tbsp chopped fresh parsley,  boiled or steamed potatoes, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coq_au_vin_15354"}