{"recipe_name":"Coq au vin","author":"Bill Granger","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/coq_au_vin_87115_16x9.jpg","method":"For the coq au vin, preheat the oven to 220C\/430F\/Gas 7. Arrange the chicken pieces in a large roasting tin and scatter with the bacon, shallots, thyme, rosemary and chilli flakes. Season, to taste, with sea salt and freshly ground black pepper.  Drizzle the contents of the roasting tray with two tablespoons of the olive oil and roast in the oven for 20 minutes. When the chicken has been roasted, add the wine to the tin and cook for another 20-25 minutes. Remove from the oven. Heat the butter and remaining tablespoon of oil in a large frying pan over a medium heat. When the butter is foaming, add the mushrooms and garlic and fry for 3-5 minutes. Tip the mushrooms and garlic into the tin and scatter with the parsley. Meanwhile, for the crème fraîche mash, boil the potatoes in a pan of salted water until tender. Remove from the heat, drain well and return to the hot pan.  Mash the potatoes until smooth.  Heat the milk and butter in a small pan over a medium heat, until the butter has melted (do not allow the mixture to boil). Beat the hot butter and milk into the potatoes, then fold in the crème fraîche or cream. Season, to taste, with sea salt. To serve, pile some of the crème fraîche mash onto each of four serving plates and spoon the coq au vin on top. ","ingredients":" 1.5kg\/3¼lb chicken, jointed ,  150g\/5oz diced bacon or lardons,  10 French shallots, peeled,  a few thyme sprigs,  1 rosemary sprig,  1 tsp dried chilli flakes,  3 tbsp olive oil,  250ml\/9fl oz white wine,  small knob of butter,  350g\/13oz mixed mushrooms (such as oyster and chestnut), sliced,  3 garlic cloves, crushed,  small handful chopped fresh flatleaf parsley,  800g\/1¾Ib potatoes, peeled and chopped,  150ml\/5fl oz milk,  25g\/1oz butter,  110g\/4¼oz crème fraîche (or 110ml\/4¼fl oz single cream),  sea salt, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coq_au_vin_87115"}