{"recipe_name":"Coq au vin","author":"Mike Robinson","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/325F\/Gas 3. Place the seasoned flour into a bowl and dredge the pieces of chicken in the flour. Reserve the remaining the flour. Heat the duck fat and 25g\/1oz of the butter in a large, heavy casserole over a medium heat. Once the fat is hot, add the chicken pieces and fry on each side, until golden-brown on all sides. Cook the chicken pieces in two batches so as not to overcrowd the pan. Remove the browned chicken and put to one side. In the same pan, adding in a little more duck fat and butter if necessary, add the shallots or onions. Stir well, and add the garlic cloves. Add the lardons or pancetta and fry until all the ingredients start to turn golden brown. Add the tomato purée and stir well. Return the meat to the pan and stir well. Pour over enough wine to cover the ingredients, add the thyme, and bring the liquid to a simmer.  Place the lid onto the casserole, then transfer to the oven and cook for one hour. Check after 30 minutes that the meat is not falling apart. Remember that a chicken cooks in about an hour, so be careful. When the chicken pieces are completely cooked through and tender, lift them out of the casserole and place into a large heatproof bowl, then cover with foil.  Place the pot of sauce back on the hob over a high heat and bring it to a simmer. In a bowl mix the remaining 25g\/1oz of the butter with a tablespoon or two of the leftover seasoned flour. Add this butter mixture to the simmering sauce to thicken it, making sure it dissolves properly without lumps. Season, to taste, with salt and freshly ground black pepper, then add the sauce to the bowl of chicken, making sure you include all the bits of shallot, bacon and garlic. Serve at the table in the bowl with fresh crusty bread and boiled, buttered new potatoes. ","ingredients":" 50g\/2oz flour, seasoned with salt and freshly ground black pepper,  1 whole chicken, cut into 12 pieces (or use a selection of chicken thighs and drumsticks),  1 tbsp duck fat (available canned in many supermarkets),  50g\/2oz butter,  24 small shallots or baby onions, peeled,  4 garlic cloves, lightly crushed but unpeeled,  200g\/7oz dry-cured smoked bacon lardons or pancetta cubes,  1 tsp tomato purée ,  1 - 2 bottles Pinot Noir wine,  3 fresh thyme sprigs,  salt and freshly ground black pepper,  fresh crusty bread,  new potatoes, boiled and buttered","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coqauvin_83680"}