{"recipe_name":"Asparagus, pea and parsley broth with sautéed asparagus and soft boiled egg","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the broth, bring a pan of salted water to the boil, add the parsley and blanch for 30 seconds, drain, then refresh in iced water. Drain the blanched parsley, squeeze dry then roughly chop and set aside. Heat a frying pan until hot, add the butter and onion and fry gently for a few minutes until just softened. Add the peas, asparagus and stock and bring to the boil. Add the chopped blanched parsley. Ladle the broth, in batches, into a blender and blend to a fine broth. Strain through a fine sieve into a clean saucepan, and heat again up to a simmer – check the seasoning, and add salt and freshly ground pepper to taste. For the garnish, bring a large pan of water to the boil. Add the vinegar and a pinch of salt. Set a bowl of iced water alongside. Boil the eggs in the water for five minutes exactly, then remove from the pan with a slotted spoon and chill in iced water briefly. Remove the eggs from the ice-water, one by one, gently crack the shell, and carefully peel the egg, removing all the shell.  Heat a frying pan until medium hot, add half the olive oil and the salsify and stir fry for 3-4 minutes until tender and golden-brown. Bring a pan of salted water to the boil, add the asparagus spears and blanch for 2 minutes. Drain the asparagus spears and toss with a little olive oil. Heat a griddle pan until hot, add the asparagus and char on each side for a couple of minutes. To serve, pile the asparagus and salsify into the centre of a soup plate then ladle the broth around. Carefully place the egg in the centre of the pile of asparagus and cut the top off. Garnish with the parsley cress and a drizzle of olive oil. ","ingredients":" 50g\/2oz flat leaf parsley leaves, picked,  50g\/2oz butter,  1 shallot, finely chopped,  250g\/9oz frozen peas,  150g\/5oz asparagus trimmings,  500ml\/18fl oz vegetable stock,  75ml\/3fl oz double cream,  2 tbsp parsley cress,  2 tbsp extra virgin olive oil,  1 tbsp white wine vinegar,  4 eggs,  4 tbsp olive oil,  200g\/7oz salsify, peeled and cut into 2cm\/1in batons, kept in acidulated water,  300g\/11oz asparagus spears","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/asparagus_pea_and_00682"}