{"recipe_name":"Coral trout poached in milk, lemon, basil and white wine served with potato and ricotta dumplings","author":"Ben O'Donoghue","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dumplings, boil the whole potatoes in their skins until cooked through (about 30 minutes). Drain and peel while hot, then press through a sieve into a large bowl. While still hot, add the egg, beating lightly until combined. Season with salt, pepper and nutmeg. Gradually incorporate the flour, until a firm but light dough forms. Knead for about 30 seconds, until just smooth. In a clean bowl, mix the ricotta with the basil. Roll the dough out onto a floured surface to a thickness of 3mm\/0.12in. Using a cookie cutter, or an upturned glass, cut out 5cm\/2in circles. Place a small teaspoon of ricotta mix into the centre of the dough. Gather the edges of the dough together to form a parcel and press the edges to seal. When ready to serve, bring a large saucepan of salted water to boil and cook the dumplings a few at a time for one minute, until they float to the surface. Remove with a slotted spoon and serve with the trout. For the poached trout, warm the oil in a saucepan large enough to accommodate the fish fillets in a single layer. Season the fillets with salt and pepper and place in the pan. Seal on both sides over the heat, without colouring the fish. Add the zest, chilli and garlic, and fry gently to allow the flavours to develop (about 1-2 minutes). Add the wine and milk, and increase the heat to bring to the boil. Immediately reduce to a very gentle simmer and cover with the lid slightly off. Poach the fillets until just cooked through - 4-8 minutes, depending on their thickness. When done, the flesh will flake gently and the sauce will appear slightly curdled. Remove from the heat and transfer the fish to warm serving plates. Add the mascarpone to the pan and stir into the sauce. Taste for seasoning and add the basil at the last minute. Serve the trout with plenty of the sauce over the top and the dumplings alongside. ","ingredients":" 500g\/1lb 2oz floury potatoes, scrubbed and left whole,  1 large free-range egg,  salt and freshly ground black pepper,  freshly ground nutmeg, to taste,  100g\/3½oz plain flour,  75g\/3oz ricotta,  1 tbsp chopped basil,  1 tbsp vegetable oil,  4 fresh coral trout fillets, weighing about 180g\/6½oz each (you can also use sea bass or scorpion fish fillets),  salt and freshly ground black pepper,  1 lemon, freshly grated zest only,  1 dried chilli,  1 garlic clove, finely sliced,  125ml\/4½fl oz dry white wine,  500ml\/18fl oz skimmed milk,  2 tbsp mascarpone cheese,  4 tbsp chopped basil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coraltroutpoachedinm_74654"}