{"recipe_name":"Coriander-marinated spatchcock chicken with coconut and coriander salad ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the coriander-marinated spatchcock chicken, place all the spices in a dry frying pan and cook for 2-3 minutes, or until the spices start to pop and realise their oils and aroma. Place the spices in a spice grinder and grind to a powder. Put the coriander, yoghurt, oil and powdered spices in a bowl and mix. Spread the marinade all over the chicken and leave to marinate for at least two hours. Preheat the oven to 200C\/400F\/Gas 6. Heat a large griddle pan and place the chicken breast-side down and cook for 4-5 minutes, or until bar marks appear. Turn over and cook for a further 4-5 minutes. Cook in the oven for 20-25 minutes, depending on the size of the chicken. The chicken is cooked when the juices run clear when the thickest part is pierced with a skewer. Once cooked, remove from the oven, cover and allow to rest in a warm place. For the coconut and coriander salad, place the mitzuna and lettuce leaves in a bowl and add the strips of coconut. Place the remaining salad ingredients into a pestle and mortar and pound to a paste. Add the paste to the bowl of leaves and toss to coat. To serve, cut the chicken into portions and place on a serving plate alongside the coriander salad. ","ingredients":" 2 tbsp coriander seeds,  2 tbsp fenugreek seeds,  1 tsp cumin seeds,  ½ tsp fennel seeds,  1 tsp black peppercorns,  1 cinnamon stick,  5 cloves,  3 cardamom pods, seeds removed,  1 tbsp ground turmeric,  2 bay leaves, crushed,  2 tbsp fresh coriander,  400g\/14oz natural yoghurt,  2 tbsp vegetable oil,  1 chicken, spatchcocked,  50g\/1¾oz mitzuna leaves,  2 head Little Gem lettuce, leaves separated,  ½ fresh coconut, flesh only, cut into strips,  4 tbsp palm sugar,  4 garlic cloves,  2 tbsp grated fresh root ginger,  3 red chillies, finely chopped,  1 bunch fresh coriander,  3 limes, juice only,  2 tbsp fish sauce","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coriander-marinated_56361"}