{"recipe_name":"Coriander baked sea bass with steamed purple sprouting broccoli and a coriander raita","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/160C Fan\/Gas 5. For the baked sea bass, put the coriander (leaves and stalks), garlic, chilli, palm sugar, oil, salt, sugar and lemon juice in a food processor and blend to a paste consistency. Put the sea bass on a baking tray lined with aluminium foil. Cover the fish with the coriander paste and another sheet of foil. Bake for 10 minutes then remove the top sheet of foil to uncover the fish and cook for a further 10-15 minutes. For the coriander raita, mix all of the raita ingredients together in a bowl. Season with salt and pepper. For the purple sprouting broccoli, put the purple sprouting broccoli into a steamer and steam for 4-7 minutes. Keep warm and finish with the butter. To serve, place the broccoli in the centre of serving bowls. Peel the skin off the sea bass and top the broccoli with some of the sea bass meat and a spoonful of coriander raita. Garnish with coriander cress and baby red sorrel cress, if using. ","ingredients":" 120g\/4oz coriander, washed thoroughly ,  3 garlic cloves, peeled,  1 green chilli, stalk removed,  25g\/1oz palm sugar,  3 tbsp vegetable oil,  1 tsp salt,  ½ tsp sugar,  1 lemon, juice only,  1 whole wild sea bass (or 2 farmed), fins removed, cleaned and gutted,  200g\/7oz yoghurt,  2 tsp ground cumin, toasted in a dry frying pan until fragrant,  ½ cucumber, finely chopped,  2 tbsp finely chopped fresh coriander leaves,  salt and freshly ground black pepper,  1 bunch (about 225g\/8oz) purple sprouting broccoli,  50g\/1¾oz unsalted butter,  2 tbsp coriander cress,  2 tbsp baby red sorrel cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coriander_baked_sea_bass_66447"}