{"recipe_name":"Coriander seared tuna on pickled bean sprouts","author":"David Laris","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Roll the tuna in crushed coriander seeds and the sechuan pepper seeds. Roll the tuna in cling film to keep its's hape and refrigerate for an hour, this stops the seeds from falling off. Sear tuna on all sides, keep at room temperature, the tuna should be pink. Slice the tuna into 4 pieces. To make the pickled bean sprouts, heat the rice wine vinegar and sugar. Pour over the bean sprouts and allow to cool. To prepare the tumeric oil, Heat the oil, add the tumeric and allow to cool. To prepare the balsamic vinegar, reduce by a half  by heating for approximately 5 minutes. To serve, mix pickled bean sprouts with basil, mint, sliced shallots, spring onions and deep fried chilli\/garlic. Arrange neatly on to four flat plates. Place one piece of the tuna on each of the plates. Garnish with coriander, drizzle tumeric oil and reduced balsamic vinegar around the plate. ","ingredients":" 400g\/14oz fresh tuna (must be fresh),  30g\/1oz coriander seeds,  20g\/¾oz sechuan peppercorns,  salt and pepper to taste,  180g\/6oz bean sprouts,  20ml\/1 tsp rice wine vinegar (any other is too strong),  40ml\/2tsp brown sugar,  20g\/¾oz Thai basil, ripped,  20g\/¾oz mint, ripped,  50g\/2oz spring onion, thinly sliced,  60g\/2¼oz shallots, thinly sliced,  20g\/¾oz chilli julienne (large red chillies - not too hot - sliced),  20g\/¾oz deep-fried garlic\/chilli (can make yourself or buy from an Asian store),  20g\/¾oz coriander (fresh),  tumeric oil,  reduced balsamic vinegar,  100ml\/4fl oz olive oil,  1 tsp tumeric (fresh or powder),  100ml\/3½fl oz balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coriandersearedtunao_10343"}