{"recipe_name":"Corned beef hash with poached eggs","author":"Momma Cherri","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/cornedbeefhashwithfr_78048_16x9.jpg","method":"For the corned beef hash, place the potatoes into a saucepan and cover with water. Bring to the boil and simmer until just tender. Drain and set aside. Heat a frying pan until hot. Add one tablespoon of the olive oil, the onion and garlic and fry for two to three minutes. Add the potatoes and fry for a further minute. Crumble in the corned beef and mix together. Spoon the mixture into a soup dish then place under the grill for three to four minutes, until crusty. Bring a pan of water to the boil, add the vinegar and whirl the water around. Crack an egg into a ladle. Pour the egg into the pan and simmer for two minutes, until ready. Remove from the pan and drain. Remove the hash from the grill and top with the egg. Top with a squeeze of ketchup and serve with hot, buttered corn bread. For the cornbread, mix together the flour, cornmeal, icing sugar and baking powder. Make a well in the centre of the dry ingredients and add the milk and egg. Mix together from the centre outwards, incorporating the dry ingredients into the wet gradually to create a dough-like paste. Add the melted butter last. Place in a hot baking tin. Place in a hot oven for about 15 minutes until golden brown. Remove from the oven, allow to cool slightly. Turn out, cut into slices and serve with the corned beef hash. ","ingredients":" 4 potatoes, diced into cubes,  3 tbsp olive oil,  1 onion, finely diced,  1 garlic clove, crushed,  340g\/12oz corned beef, tinned,  Salt and freshly ground black pepper, to taste,  1 tbsp vinegar,  1-2 free-range eggs (per person),  Tomato ketchup, to serve,  300g\/10½oz plain flour,  315g\/11oz cornmeal,  200g\/7oz icing sugar,  1 tbsp baking powder,  1 free-range egg,  250ml\/9fl oz milk,  200g\/7oz butter, melted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cornedbeefhashwithfr_78048"}