{"recipe_name":"Corned beef hotpot with runner beans","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/390F\/Gas 6. For the hotpot, grease the insides of a medium ovenproof dish with a little of the butter, then place a layer of corned beef into the bottom. Seasoning with salt and freshly ground black pepper between each layer, top with a layer of onions, sprinkle over the thyme and cover with a layer of potatoes. Repeat the layers, finishing with the potatoes on top.  Pour the stock over the top, then dot with the remaining butter. Cover the dish with aluminium foil and place into the oven to bake for one hour, or until the potatoes are just tender. Remove the foil and return to the oven to cook for 15 minutes, or until golden-brown on top. For the beans, bring a pan of salted water to the boil, add the beans and cook for 2-3 minutes, or until tender.  Melt the butter in a frying pan, then add the shallots and fry for 1-2 minutes, or until softened. Add the cooked beans and fry for a further minute, then season with salt and freshly ground black pepper. Add the parsley and toss well to coat.  To serve, spoon the corned beef hotpot onto a serving plate and arrange the beans alongside. ","ingredients":" 50g\/2oz butter,  1.5kg\/3lb 3oz corned beef, thickly sliced,  salt and freshly ground black pepper,  1-2 onions, finely sliced,  8 sprigs fresh thyme, leaves picked,  1kg\/2lb 2oz waxy potatoes, such as Cara and Charlotte, peeled and thinly sliced,  175ml\/6fl oz chicken stock,  300g\/11oz runner beans, trimmed and cut into 6cm\/2.5in diagonal pieces,  50g\/2oz butter,  2 shallots, finely sliced,  salt and freshly ground black pepper,  5 tbsp chopped fresh flatleaf parsley,  50g\/2oz butter,  1.5kg\/3lb 3oz corned beef, thickly sliced,  salt and freshly ground black pepper,  1-2 onions, finely sliced,  8 sprigs fresh thyme, leaves picked,  1kg\/2lb 2oz waxy potatoes, such as Cara and Charlotte, peeled and thinly sliced,  175ml\/6fl oz chicken stock,  300g\/11oz runner beans, trimmed and cut into 6cm\/2.5in diagonal pieces,  50g\/2oz butter,  2 shallots, finely sliced,  salt and freshly ground black pepper,  5 tbsp chopped fresh flatleaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cornedbeefhotpotwith_90598"}