{"recipe_name":"Coronation chicken","author":"Antony Worrall Thompson","programme":"Saturday Brunch","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/coronationchicken_72328_16x9.jpg","method":"Place the chicken into a saucepan with a tight-fitting lid, cover with water and add the spring onions, garlic, salt and peppercorns.  Bring to the boil and simmer for 30 minutes, turning the chicken once during the cooking process. Cover with a lid and switch off the heat. Leave for one hour, then remove the chicken, allow to cool completely, and tear the chicken from the bones into rough pieces. Meanwhile, for the sauce, heat the oil in a pan over a medium heat. Add the onion and cook gently for 3-4 minutes.  Add the curry powder and cook for a further two minutes, stirring well. Add the tomato purée, wine, water and bay leaf.    Bring the mixture to the boil. Season with salt and freshly ground black pepper, then add the sugar, lemon slices and lemon juice, to taste. Reduce the heat until the mixture is simmering and simmer, uncovered, for 5-10 minutes.  Strain the sauce through a fine meshed sieve and set aside to cool. Gradually fold in the mayonnaise and apricot purée, to taste. Add more lemon juice, as necessary. Fold in the whipped cream. To serve, arrange the portioned chicken on a large platter, pour the sauce over the top, sprinkle with the coriander and serve immediately, with rice. ","ingredients":" 1.5kg\/4lb free-range chicken,  4 spring onions, sliced,  6 garlic cloves, peeled, left whole,  1 tbsp sea salt,  10 whole black peppercorns,  1 tbsp vegetable oil,  1 onion, chopped,  1 tbsp curry powder,  1 tbsp tomato purée,  85ml\/3fl oz red wine,  150ml\/¼pint water,  1 bay leaf,  salt and freshly ground black pepper,  caster sugar,  2 slices lemon,  squeeze of lemon juice,  425ml\/15fl oz good-quality  mayonnaise ,  2 tbsp apricot purée (made by blending 4-5 stoned, dried apricots with 3 tbsp water),  3 tbsp whipped cream,  1 tbsp roughly chopped coriander,  rice, cooked according to packet instructions","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/coronationchicken_72328"}