{"recipe_name":"Cottage pie to feed a crowd","author":"The Hairy Bikers","programme":"Hairy Bikers' Meals on Wheels","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 40","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Heat the sunflower oil in a large deep pan over a medium heat and gently fry the onion and carrots for 7-8 minutes, or until the onions are softened and lightly coloured.  Add the beef mince to the pan and cook with the vegetables for 4-5 minutes, stirring frequently, until the meat is browned all over. Sprinkle over the flour and stir well for a few minutes to prevent any lumps from forming. Gradually add the beef stock to the pan, then add the cold water, tomato purée and bay leaves. Bring the mixture to a gentle simmer, then cover with the lid and cook over a low heat for 25-30 minutes, stirring occasionally, until the mince is tender and the sauce has thickened.  Season with Worcestershire sauce, salt and freshly ground black pepper and stir in the parsley. Remove from the heat, spoon into several ovenproof dishes and set aside. Half-fill a very large pan, or two smaller pans, with cold water. Add the potatoes and bring to the boil, then reduce the heat to a simmer and cook for about 15 minutes, or until the potatoes are very soft. Drain the potatoes, then return to the pan set over a medium heat. Cook for a few seconds to steam off any excess moisture, then remove the potatoes from the heat. Add the butter and milk and mash until smooth and creamy. Season with a little salt. Spoon the mash over the mince mixture, working towards the middle from the outside. Smooth with a palette knife then create patterns on the surface using a fork. Place the dishes on baking trays and bake in the centre of the oven for around 25 minutes, or until the potatoes are golden-brown and the filling is bubbling up around the edges.  ","ingredients":" 150ml\/5fl oz sunflower oil,  10 large onions, peeled, chopped,  1kg\/2lb 4oz carrots, peeled, finely chopped,  5kg\/11lb lean beef mince,  300g\/10½oz plain flour ,  4.5 litres\/8 pints beef stock,  2.8 litres\/5 pints cold water,  300g\/10½oz tomato purée,  4 dried bay leaves,  4 tbsp Worcestershire sauce,  8 tbsp finely chopped parsley,  salt and freshly ground black pepper,  8kg\/18lb floury potatoes, peeled and cut into even-sized pieces,  400g\/14oz butter, cubed,  450ml\/16fl oz milk","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cottage_pie_46881"}