{"recipe_name":"Cottage pie with cheesy mash","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the sunflower oil in a large deep lidded pan over a medium heat and gently fry the onion, celery and carrots for 7-8 minutes, or until the onions are softened and lightly coloured. Add the garlic and cook for 2-3 more minutes. Add the beef mince to the pan and cook with the vegetables for 4-5 minutes, stirring frequently, until the meat is browned all over.  Pour the wine into the pan, bring the mixture to the boil and cook for 4-5 minutes, or until most of the liquid has evaporated, then sprinkle over the flour and stir well for a few minutes to prevent any lumps from forming.  Gradually add the beef stock to the pan, then add the cold water, tomato purée and dried herbs. Bring the mixture to a gentle simmer, then cover with the lid and cook over a low heat for 25-30 minutes, stirring occasionally, until the mince is tender and the sauce has thickened. Season with a splash of Worcestershire sauce and salt and freshly ground black pepper. Remove from the heat, spoon into a 1.5 litre\/2 pints 13fl oz ovenproof dish and set aside. Preheat the oven to 200C\/400F\/Gas 6.  Half-fill a large pan with cold water. Add the potatoes and bring to the boil, then reduce the heat to a simmer and cook for about 15 minutes, or until the potatoes are very soft.  Drain the potatoes, then return to the pan set over a medium heat. Cook for a few seconds to drive off any excess moisture, then remove the potatoes from the heat. Add the butter, milk and cheese and mash until smooth and creamy. Season with salt and freshly ground black pepper.  Spoon the mash over the mince mixture in the ovenproof dish, working towards the middle from the outside. Smooth with a palette knife. When all the mince is covered with mash, create patterns on the surface using a fork.  Place the dish on a baking tray and bake in the centre of the oven for around 25 minutes, or until the potatoes are golden-brown and the filling is bubbling up around the edges. Serve with freshly cooked green beans or shredded Savoy cabbage. ","ingredients":" 1 tbsp sunflower oil,  1 large onion, peeled, chopped,  2 celery sticks, finely chopped,  2 carrots, peeled, finely chopped,  2 garlic cloves, peeled, finely chopped,  500g\/17½oz lean beef mince,  150ml\/5fl oz red wine,  2 tbsp plain flour,  500ml\/17½fl oz beef stock,  300ml\/10½fl oz cold water,  2 tbsp tomato purée,  ½ tsp mixed dried herbs ,  1 dried bay leaf,  splash Worcestershire sauce,  salt and freshly ground black pepper,  800g\/1lb 12oz floury potatoes, such as King Edward or Maris Piper, peeled and cut into even-sized pieces,  40g\/1½oz butter, cubed,  3 tbsp milk,  100g\/3½oz mature cheddar, grated,  salt and freshly ground black pepper,  green beans or shredded Savoy cabbage, cooked","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cottagepiewithcheesy_93216"}