{"recipe_name":"Country captain chicken curry","author":"Atul Kochhar","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a large frying pan until hot then add half of the butter and all of the chicken pieces. Fry the chicken, stirring frequently, until golden-brown on all sides, then remove from the pan and set aside. Melt the remaining butter in another large frying pan over a medium heat. Add the onion and fry for 3-4 minutes, until softened and golden-brown. Add the ginger and garlic and fry for one minute.  Add the cloves, bay leaves, cassia stick, turmeric, black pepper and chillies and fry for 1-2 minutes to release the flavours. Add the chicken pieces and half of the stock. Reduce the heat and simmer for about 20 minutes until the chicken is tender and completely cooked through. (If necessary, add more stock during cooking to prevent the chicken from sticking to the pan.) Add the lemon juice, season, to taste, with salt and freshly ground black pepper and garnish with chopped coriander leaves. To serve, place a spoonful of cooked rice onto each of four plates and spoon the curry alongside. Sprinkle with red onion rings, crispy bacon, coconut, peanuts and hard-boiled egg. ","ingredients":" 1 large roasting chicken, cut into 8 pieces,  120g\/4oz butter,  3 large onions, thinly sliced,  2 garlic cloves, finely chopped,  1 tbsp grated fresh ginger root,  2 cloves,  2 bay leaves,  2.5cm\/1in cassia stick,  1 tsp turmeric,  2 tsp freshly ground black pepper,  ¾ tbsp finely chopped fresh green\/red chilli,  200ml\/7fl oz chicken stock,  ½ lemon, juice only,  salt and freshly ground black pepper,  fresh coriander leaves, to garnish,  200g\/7oz rice, cooked according to packet instructions,  red onion, sliced into rings,  bacon, cut into thin strips and fried until crisp,  fresh coconut, grated,  peanuts,  1 free-range egg, hard-boiled and chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/countrycaptainchicke_84737"}