{"recipe_name":"Courgette and cheddar tart","author":"Tom Kerridge","programme":"Spring Kitchen with Tom Kerridge","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the parmesan pastry, in a food processor blend the flour, salt, butter and parmesan together and then add the yolks and two teaspoons of water. Pulse until it comes together in a dough. Wrap the dough in cling film and rest in the fridge for an hour. To make the filling, place the courgette into a sieve set over a bowl. Sprinkle with salt and leave for 30 minutes to remove some of the moisture.  Heat the butter in a frying pan. When foaming, add the onions and cook until soft.  Wash the courgette thoroughly in running water and squeeze out any excess water. Add the courgette and chilli to the onions and cook for a further 3-4 minutes. For the parmesan pastry, roll out the chilled pastry on a floured work surface to the thickness of a pound coin.  Line a 20cm\/8in tart ring with the pastry, taking care to push the pastry into the corners and leaving any excess hanging over the edge. Place in the fridge for an hour to rest.  Preheat the oven to 170C\/340F\/Gas 3½. When rested, line the pastry case with baking parchment and baking beans (alternatively use uncooked rice or lentils). Bake the pastry blind until fully cooked and a light golden-brown colour, approximately 15-20 minutes. If the rim of the pastry cooks too quickly, remove the tart from oven and set aside with the baking beans left in place (the residual heat in the beans will allow the pastry to finish cooking without colouring further). Remove the baking beans from the base. Once the pastry is cooked, use a sharp serrated knife to trim off any excess pastry from the side of the tart. Remove any crumbs from the base and brush with egg wash. For the filling, reduce the oven temperature to 160C\/320F\/Gas 3. In a mixing bowl, mix the cheddar and onion mixture together. Add to the pastry case. Put the cream in a saucepan and bring to the boil. Whisk in the egg yolks and cook until they reach 82C\/180F on a cook’s thermometer, then whisk in the whole egg and the nutmeg. Pour the cream and egg mixture into the tart base to fill. Bake for 20-25 minutes, or until the filing is just set. To finish, scatter the parmesan over the cooked tart and use a cook’s blow torch to brown the filling. Place the courgette flowers in a steamer and cook for 2-3 minutes. Drizzle with a little rapeseed oil and season with salt and pepper. To serve, leave the tart to cool slightly before slicing and serving with the courgette flowers. ","ingredients":" 200g\/7oz plain flour ,  pinch salt,  85g\/3oz cold butter, diced,  80g\/2¾oz parmesan (or a similar vegetarian hard cheese),  2 free-range egg yolks,  1 free-range egg, beaten for egg wash,  2 courgettes, cut into a large dice   ,  salt,  knob of butter,  1 onion, finely sliced ,  1 red chilli, diced (leave the seeds in to add a little heat) ,  200g\/7oz cheddar, grated,  200ml\/7fl oz double cream ,  6 free-range egg yolks,  1 free-range egg,  pinch nutmeg,  50g\/1¾oz parmesan, grated (or a similar vegetarian hard cheese),  4 courgette flowers,  rapeseed oil, to taste,  salt and cracked black pepper ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/courgette_and_cheddar_33978"}