{"recipe_name":"Courgette risotto with deep-fried courgette flowers","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the courgette risotto, melt 25g\/1oz of the butter in a large pan until foaming. Fry the onion and garlic for 2-3 minutes, or until softened. Add the Arborio rice and stir well to coat in the butter.  Cook for 1-2 minutes, or until the rice grains start to turn translucent, then add the wine and cook for 3-4 minutes, or until nearly all of the liquid has evaporated. Add a ladleful of the chicken stock to the pan and stir well. Cook for 1-2 minutes, or until nearly all of the stock has been absorbed, then add another ladleful of the stock. Repeat the process until the rice is cooked but still al dente (retaining bite). Add the courgette during the last 2-3 minutes of cooking and then stir in the mascarpone, 25g\/1oz of the parmesan and the remaining butter. Season with salt and freshly ground black pepper. For the deep-fried courgette flowers, heat a deep-sided frying pan filled two-thirds full with the oil until hot but not smoking, or heat a deep-fat fryer to 190C\/375F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Mix the ricotta with the lemon zest and juice, then spoon the mixture into the courgette flowers and twist the end to seal. In a bowl, mix together the yeast, salt, sugar, tonic water, flour, vodka and vinegar. Set aside until the batter starts to bubble, then dip in the flowers to coat and deep-fry in the hot oil for two minutes. Remove with a slotted spoon and drain on a plate lined with kitchen paper. For the basil oil, blend the basil and oil in a blender until smooth, then pass through a sieve. To serve, place the risotto in serving bowls and top with the courgette flowers. Drizzle the basil oil around the risotto and top with the remaining parmesan. ","ingredients":" 50g\/2oz butter ,  1 onion, finely chopped,  1 garlic clove, finely chopped,  250g\/9oz Arborio rice,  150ml\/5fl oz white wine,  1 litre\/1¾ pint chicken or vegetable stock,  150g\/5½oz courgette, diced,  3 tbsp mascarpone ,  40g\/1½oz parmesan (or a similar vegetarian hard cheese), freshly grated,  flavourless oil (such as vegetable oil), for deep frying,  225g\/8oz ricotta,  1 lemon, zest and juice,  8 courgette flowers,  1 tbsp fresh yeast,  pinch salt,  pinch sugar,  175ml\/6fl oz tonic water,  200g\/7oz plain flour,  25ml\/1fl oz vodka,  1 tsp cider vinegar,  10g\/¼oz basil,  100ml\/3½fl oz olive oil","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/courgette_risotto_with_70160"}