{"recipe_name":"Courgette rösti with poached egg, beurre blanc and deep-fried courgette flowers","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the courgette rösti, generously season the grated potatoes and then mix with the courgette. Shape the mixture into flat patties, then cover and chill for 20 minutes. In a frying pan, heat the oil and butter over a medium heat. Fry the rösti for four minutes each side, or until crisp and golden-brown. Drain on a plate kitchen paper and keep warm until ready to serve. For the poached egg, heat a pan of water to a very gentle simmer (the water should be just trembling and there should be a few bubbles rising up from the bottom of the pan). Add the vinegar, break in the eggs and poach for three minutes. Lift out with a slotted spoon and drain briefly on kitchen paper. For the beurre blanc, add the shallots, white wine vinegar and white wine to a saucepan and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until only two tablespoons of liquid are left in the pan.  Add a tablespoon of cold water and continue to simmer until the volume of liquid remaining in the pan is approximately one tablespoon.  Reduce the heat to low, then gradually whisk in the butter, 25g\/1oz at a time, waiting until the butter has melted and is incorporated into the mixture before adding more. Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it through a fine sieve into a clean saucepan. Season, to taste, with salt and freshly ground black pepper, then stir in the chives and tomatoes. Keep warm until needed. For the courgette flowers, heat a deep-fat fryer to 190C\/375F (Caution: hot oil can be dangerous. Do not leave unattended.) Mix the flour, cornflour and salt in a bowl. Whisk in enough sparkling water to form a smooth batter (you may not need all of the water). Dip the courgette flowers into the batter and place in the deep fat fryer, taking care not to overcrowd the fryer (you may need to do this in batches). Once cooked, carefully remove from the heat using a slotted spoon and drain on a plate lined with kitchen paper. Season with salt and pepper. To serve, place a rösti in the centre of each plate and top with the poached eggs. Garnish with the courgette flowers and beurre blanc. ","ingredients":" 2 large baking potatoes, coarsely grated,  salt and pepper,  1 courgette, grated,  2 tbsp olive oil,  2 tbsp unsalted butter,  2 tsp white wine vinegar,  4 free-range eggs,  2 shallots, finely sliced,  1 tbsp white wine vinegar,  4 tbsp white wine,  225g\/8oz salted butter, cubed ,  4 tbsp chopped fresh chives,  2 tomatoes, peeled, seeds removed, finely chopped,  50g\/1¾oz plain flour,  50g\/1¾oz cornflour,  pinch salt,  150ml\/5½fl oz sparkling water,  8 courgette flowers","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/courgette_rosti_with_32093"}