{"recipe_name":"Courgette, tomato, olive and mozzarella tart","author":"Alex Mackay","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to medium. For the tart, place the flour, olive oil, egg yolk, salt and freshly ground black pepper into a food processor and pulse until well combined. Gradually add a little cold water, just enough to bring the mixture together into a dough.  Place the dough out onto a floured work surface and lightly knead, then roll out into a 5mm\/¼in thick round, big enough to fit inside an ovenproof frying pan.  Heat the pan and place the dough into the bottom. Arrange the courgette and tomato slices in a spiral pattern on top, then place under the grill and cook for 4-5 minutes, until the pastry is golden-brown and the courgette and tomato begin to soften. Remove from the grill and arrange the mozzarella and black olives on top. Return to the grill and cook for another 1-2 minutes, until the mozzarella is melted.  For the tomato sauce, place the tomato purée and water in a pan and heat through, stirring well. For the parsley purée, place the parsley and oil together in a mini food processor and blend until smooth. Carefully place the tart onto a serving plate and drizzle over the tomato sauce and parsley purée. Serve. ","ingredients":" 100g\/3½oz plain flour, plus extra for dusting,  2 tbsp olive oil,  1 free-range egg, yolk only,  salt and freshly ground black pepper,  2-3 tsp cold water, to bind,  ½ courgette, sliced into rounds,  2 vine tomatoes, sliced into rounds,  55g\/2oz mozzarella cheese, sliced,  6 pitted black olives,  2 tbsp tomato purée,  2 tbsp water,  1 handful fresh parsley leaves,  2 tbsp olive oil","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/courgettetomatoolive_88922"}