{"recipe_name":"Couscous-crusted turbot with roasted tomatoes, wilted spinach and sauce vierge","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the couscous-crusted turbot, press the couscous onto the skin of the fish. Heat the oil and butter in a frying pan and fry the turbot for 1-2 minutes on each side, or until it is cooked through and the skin is crisp. Remove from the pan and set aside to keep warm. For the roasted tomatoes, heat the oil in an ovenproof frying pan and fry the tomatoes, turning once, until they have taken on some colour. Season with salt and freshly ground black pepper and add the thyme sprigs and garlic to the pan. Place the pan into the oven to roast the tomatoes for 10-12 minutes. For the wilted spinach, gently fry the garlic for one minute in the remaining oil in the pan used to cook the turbot. Add the spinach to the pan and fry for a further 1-2 minutes, until wilted. For the sauce vierge, gently heat the tomato, olive oil and lemon juice in a small pan for about five minutes. Season with salt and freshly ground black pepper and add the torn basil leaves, stirring to combine. To serve, place a bed of the wilted spinach onto a serving plate and top with the turbot. Place the roasted tomatoes on the side and spoon over the sauce vierge. Garnish with chopped chives. ","ingredients":" 35g\/1¼oz couscous,  150g\/5½oz turbot fillet, skin on,  1 tbsp olive oil,  25g\/1oz butter,  2 tbsp olive oil,  2 plum tomatoes, halved,  salt and freshly ground black pepper ,  2 sprigs fresh thyme,  2 garlic cloves, coarsely chopped,  1 garlic clove, finely chopped,  100g\/3½oz baby spinach, washed,  1 plum tomato, seeds removed, finely sliced,  2 tbsp olive oil,  ½ lemon, juice only,  salt and freshly ground black pepper ,  3 sprigs fresh basil, torn,  1 tbsp chopped fresh chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/couscouscrustedturbo_88211"}