{"recipe_name":"Cow crumble","author":"Nigel Slater","programme":"Nigel and Adam's Farm Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/325F\/Gas 3. Heat four tablespoons of olive oil in a large oven-proof dish. Brown the cubed beef on a moderate to high heat, in roughly four batches, reserving the meat in a bowl as you go. Add a couple of ladlefuls of stock to the dish and scrape the base of the dish with a wooden spoon to release the caramelised sediment. Pour into the bowl with the browned meat. Heat two more tablespoons of olive oil in the same dish and soften the roughly chopped carrots, celery and onion. Return the meat to the dish and scatter over the flour. Allow to cook for a couple of minutes. Pour over enough stock to almost cover the meat, season with salt and freshly ground black pepper and then stir the contents well. Add the thyme and bay leaf and leave to simmer on a low heat. For the crust, using a course grater or the grater setting of a food processor, grate the potatoes and peeled parsnips. In another pan, melt the butter with the mustard seeds. Toss the potatoes and parsnip in the melted butter and mustard seeds, evenly coating every strand. Spread the parsnip potato crust over the stew. Make a little gap in the middle of the crust and poke the bone into it, so that it stands upright. Cover in foil and bake for two hours, removing the foil after one hour so to allow the crust to go crisp. ","ingredients":" 6 tbsp olive oil,  2kg\/4lb 8oz cubed beef (mixture of chuck, skirt and shin),  about 500ml\/18fl oz beef stock,  3 carrots, roughly chopped,  3 celery sticks, roughly chopped ,  3 white onions, roughly chopped,  3 tbsp plain flour,  salt and freshly ground black pepper,  8 sprigs thyme,  2 bay leaves,  20cm\/8in piece beef shin bone,  2 large potatoes,  4 large parsnips, peeled,  125g\/4½oz butter,  2 tbsp black mustard seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cow_crumble_76025"}