{"recipe_name":"Crab and scallop Mornay","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p017qst1.jpg","method":"Slice each scallop into three discs, put on a plate, cover with cling film and chill in the fridge while the sauce is being prepared. Scrub the deeper part of each scallop shell well with hot water and place on a rack over a baking tray, and grease the inside with butter. If you don’t have scallop shells available, use shallow gratin dishes instead. Preheat the oven to 220C\/425F\/Gas 7. To make the sauce, pour the milk into a small saucepan and add the bay leaf and onion. Stir well and bring to a gentle simmer. Remove from the heat and leave to stand for 15 minutes. Strain through a fine sieve into a jug. Melt the butter in a non-stick saucepan and stir in the flour and mustard powder. Cook for 30 seconds, stirring constantly. Gradually start adding the infused milk, stirring well between each addition. When all the milk is added, stir in the wine, cream and cheese and bring to a gentle simmer. Cook for 3-4 minutes, stirring constantly until the sauce is thick and smooth. Use a silicone whisk to stir the sauce if it has any lumps appearing. Remove the pan from the heat and stir in the scallops and chives and season to taste.  Divide the crabmeat between the buttered shells or gratin dishes. Spoon the scallop mixture evenly into the prepared shells, making sure each one gets three slices of scallop. Mix the breadcrumbs with the grated cheese and parsley, if using, and season with salt and pepper. Sprinkle the breadcrumbs over the scallop mixture. Bake in the hot oven for 18-20 minutes until golden-brown and bubbling. (The scallops should have turned opaque, but remain sweet and tender.) Serve the scallops and crab Mornay with a crisp green salad and a glass of chilled white wine. ","ingredients":" 6 large diver-caught scallops, shucked (keep the shells),  knob of butter,  100g\/3½oz white or brown (or a mixture) handpicked crabmeat,  500ml\/18fl oz whole milk,  1 bay leaf,  ½ small onion, finely sliced,  30g\/1oz butter, plus extra for greasing,  30g\/1oz plain flour,  1½ tsp English mustard powder,  3 tbsp white wine,  2 tbsp single cream,  25g\/1oz Gruyère cheese, finely grated,  2 heaped tbsp snipped chives,  25g\/1oz white breadcrumbs, made with crust-less day-old bread,  25g\/1oz Gruyère cheese, finely grated,  3 heaped tbsp finely chopped curly parsley (optional),  flaked sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crab_and_scallop_mornay_42821"}