{"recipe_name":"Crab and sweetcorn beignets with celeriac soup","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the celeriac soup, heat the oil in a large pan over a medium heat. Add the celeriac, shallots and garlic and gently fry for a few minutes, to soften without browning. Add the white wine, bring to the boil and cook to reduce the volume of liquid by half. Add the chicken stock and bring to the boil. Reduce the heat and simmer for 10-15 minutes, until the celeriac is tender. Remove from the heat and allow to cool for five minutes. Transfer the soup to a blender and blend until smooth. Return the soup to the saucepan, add the cream and heat through. Season, to taste, with salt and freshly ground black pepper. For the crab and sweetcorn beignets, heat the oil in a deep-fat fryer to 180C\/350F. Alternatively, heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.) Melt the butter and 125ml\/4fl oz water in a saucepan until the mixture boils, then boil for another minute. Remove the pan from the heat and beat in the flour and cayenne pepper with a wooden spoon until smooth, or until the mixture comes away from the side of the pan. Return the pan to the heat and cook for 1-2 minutes, stirring continuously. Remove the pan from the heat and beat in the eggs, one at a time, beating well before adding the other egg. Stir in the white and brown crabmeat and sweetcorn until well combined, then season with salt and freshly ground black pepper. Spoon the mixture into a piping bag fitted with a large plain nozzle. Carefully pipe 1.5cm\/½in long sections into the oil and fry for 1-2 minutes, or until golden-brown and crisp. Remove the beignets from the pan with a slotted spoon and set aside to drain on kitchen paper and season with salt. To serve, ladle the soup into bowls, scatter over some crab and sweetcorn beignets. Drizzle the soup with olive oil and garnish with the baby watercress and apple. ","ingredients":" 1 tbsp olive oil,  475g\/1lb 1oz celeriac, peeled and cut into cubes,  2 shallots, sliced,  1 garlic clove, chopped,  50ml\/2fl oz dry white wine,  1 litre\/1¾ pints chicken stock,  75ml\/2½fl oz double cream,  vegetable oil, for frying,  50g\/1¾oz butter, diced,  75g\/2½oz plain flour,  ½ tsp cayenne pepper,  2 free-range eggs,  55g\/2oz white crabmeat,  25g\/1oz brown crabmeat,  25g\/1oz tinned sweetcorn,  salt and freshly ground black pepper,  olive oil,  2 tsp baby watercress,  1 eating apple, cut into thin strips","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crab_and_sweetcorn_26371"}