{"recipe_name":"Crab balls with tomato sauce","author":"Jun Tanaka","programme":"Country Show Cook Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":null,"pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato confit, put the olive oil and white balsamic vinegar in a pan and heat. Add the stalks from the cherry tomatoes, a pinch of the sugar and a little salt and simmer for a few minutes.  Add the cherry tomatoes and the turn off the heat. Carefully remove the stalks. Add the remaining sugar and the black pepper and gently simmer for 8-12 minutes, or until softened slightly. Transfer to a sterilised jar and leave to cool. For the tomato sauce, heat the olive oil in a frying pan, add the onion, chilli and garlic and fry until softened but not browned.  Add the tomato purée and stir to combine. Add the tomatoes, salt and pepper to taste and then cook until the tomatoes have softened completely. Add the sherry vinegar and sugar and cook until pulpy. Remove from the heat and cool slightly and blend until smooth in a food processor or blender. Pass through a sieve into a clean bowl to make a smooth sauce. For the crab balls, heat the olive oil in a frying pan and fry the shallot, chilli and ginger until soft. Remove from the heat and set aside. Push the baked potatoes through a sieve into a bowl, discarding the skins and add the brown and white crabmeat. Add the fried shallots, chilli and ginger. Stir in the lemon zest, chives, salt and freshly ground black pepper and butter and mix well. Once firm, wet your hands and then form into balls. Place the crab balls on a plate and leave to set in fridge.  Heat the oil in a heavy-based saucepan or deep-fat fryer to 180C\/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place the flour, egg and breadcrumbs on separate plates and gently dip each ball first into the flour, followed by the egg and then the breadcrumbs. Deep fry the crab balls in the oil until golden-brown and cooked through. Remove with a slotted spoon and transfer to a plate lined with kitchen paper.  Serve the tomato sauce and confit tomato with the crab balls. ","ingredients":" olive oil, to cover a small pan ,  4 tbsp white balsamic vinegar,  500g\/1lb 1oz cherry tomatoes on stalk ,  1 tsp sugar ,  salt, to taste,  ½ tsp black pepper,  2 tbsp olive oil,  1 onion, finely chopped,  1 red chilli, finely chopped,  2 garlic cloves, finely chopped,  1 tbsp tomato purée,  3 skinned tomatoes ,  2 tbsp sherry vinegar ,  good pinch sugar ,  2 tbsp olive oil,  1 banana shallot, finely chopped,  1 red chilli, finely chopped,  1 thumb-sized piece root ginger, peeled and finely grated ,  2 large potatoes, baked ,  2 tbsp brown crabmeat,  250g\/9oz white crabmeat,  1 lemon, zest only,  1 tbsp chopped chives ,  salt and freshly ground black pepper ,  50g\/2oz softened butter ,  vegetable oil, for deep fat frying,  75g\/2½oz plain white flour, seasoned with salt and pepper,  2 whole free-range eggs, beaten,  100g\/3½oz breadcrumbs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crab_balls_with_tomato_02638"}