{"recipe_name":"Crab rarebit on grilled sourdough with a green salad and French dressing","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to high. Heat a griddle pan. Drizzle the sliced sourdough with olive oil and place on the hot griddle. Cook on each side for 2-3 minutes, or until the bar marks appear. Place the cheese and beer in a frying pan and heat gently until the cheese is melted, and the sauce is bubbling and smooth. Stir in the mustard, Tabasco and Worcestershire sauce. Add the white and brown crab meats, flour and egg yolk. Cook until just thickened then season, to taste, with salt and black pepper. Finish with the chopped chives. Spread the mixture on the griddled sourdough and place under a hot grill for 1-2 minutes or until golden-brown and bubbling. For the green salad and French dressing, put the salad leaves in a large bowl. In a small bowl or jug whisk the egg yolk, vinegar and mustard together. Gradually add the oil in a thin steady stream whisking all the time until all the oil is incorporated. Add the chopped shallots. Just before serving pour the dressing over the leaves and mix. To serve, place the crab rarebit on a serving board with the green salad alongside. ","ingredients":" 2 large slices sourdough bread,  2 tbsp olive oil,  350g\/12oz Lincolnshire Poacher cheese, grated (alternatively use a good cheddar),  50ml\/2fl oz beer,  1 tsp English mustard ,  3-4 dashes Tabasco,  1 tsp Worcestershire sauce,  150g\/5½oz white crab meat,  50g\/1¾oz brown crab meat,  2 tbsp plain flour,  1 free-range egg yolk,  1 tbsp finely chopped chives,  1 head Little Gem lettuce, leaves separated and washed,  50g\/1¾oz bull's blood salad leaves,  1 free-range egg yolk,  1 tsp white wine vinegar,  ½ tsp Dijon mustard,  100ml\/3½fl oz vegetable oil,  1 shallot, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crab_rarebit_on_grilled_01579"}