{"recipe_name":"Crab rarebit, spiced crab butter, hazelnut and beurre noisette salad","author":"Simon Hulstone","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2–4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a saucepan, warm the milk and 30g\/1oz butter together until the butter has melted. Add the cheese and mix until melted; do not boil. Add the egg yolks and mix well. Add the white crab meat and parsley and season. Keep warm. Meanwhile, heat the oil in a griddle pan. Cook the sourdough until golden and crispy. Drain on kitchen paper. Heat the grill to medium. Preheat the grill to hot. Mix the brown crab meat with the remaining 25g\/1oz butter, the paprika and lemon juice, then season. Spread the mixture onto the toast, then pour over the cheese mixture. Grill until everything has melted and coloured, but be careful not to burn. To make the salad, in a heavy-bottomed saucepan, melt the butter. Once it starts to foam, watch until it cooks to a nice golden colour. Add the hazelnuts, then remove from the heat. Add the lemon juice and season. Allow to cool to body temperature, but not cold. Mix the mustard and vinegar together in a bowl, then slowly add the melted butter and hazelnuts to make a vinaigrette. Dress the rocket in the vinaigrette and serve immediately along side the rarebit. . ","ingredients":" 2 tbsp whole milk,  55g\/2oz unsalted butter, softened,  175g\/6oz Lancashire cheese, grated,  2 free-range egg yolks,  100g\/3½oz fresh white crab meat,  2 tbsp chopped flat leaf parsley,  1 tsp vegetable oil,  4 slices sourdough bread,  75g\/2½oz fresh brown crab meat ,  pinch paprika,  squeeze lemon juice,  salt and freshly ground black pepper,  150g\/5½oz unsalted butter,  25g\/1oz blanched hazelnuts, roughly chopped,  squeeze lemon juice,  1 tsp Dijon mustard,  2 tsp Chardonnay vinegar,  50g\/1¾oz wild rocket","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crab_rarebit_spiced_crab_67113"}