{"recipe_name":"Crab tortellini with spring vegetables, crab sauce and chive oil","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pasta, put the egg, egg yolk, flour and salt into a food processor. Switch on the processor and slowly add two tablespoons of water until well combined. Remove the dough from the food processor, knead briefly until smooth, then wrap in cling film and chill in the fridge for 30 minutes. For the crab sauce, heat a heavy-based saucepan until medium hot. Add the butter, shallots and ginger and fry for five minutes. Add the brown crabmeat and crab carcasses and fry for five minutes. Pour in the fish stock and bring to the boil, then simmer for 20 minutes. Pass the mixture through a fine sieve into a clean saucepan. To finish the sauce, add the butter, salt, freshly ground black pepper and lemon juice. Whisk until well combined. For the chive oil, heat the oil to 80C\/180F and add the chives. Infuse for a few minutes and then blend in a food processor until smooth. Pass the mixture through a fine sieve and set aside For the crab tortellini filling, place the scallops, egg yolk, cream and brown crabmeat into a food processor and mix until smooth and mousse-like. Stir in the white crabmeat. Season with salt, pepper and a pinch of cayenne pepper. Add a few drops of lemon juice. Split the crab mousse into four equal portions. To make the tortellini, roll the pasta out thinly using a pasta machine or rolling pin. Using a pastry cutter, cut the dough into 10cm\/4in circles. Place a spoonful of crab mixture onto a pasta circle, fold the top over to form a semi-circle, press down lightly to seal and then wrap the edges of the semi-circle around your index finger and join together. Bring a saucepan of salted water to the boil, add the pasta and simmer for 4-5 minutes. Drain. For the spring vegetables, heat a large frying pan and once hot add the butter and oil. Add the vegetables and cook for a couple of minutes, or until the vegetables are slightly wilted. To serve, place the vegetables in the centre of each of four plates and serve the tortellini alongside with the crab sauce and a drizzle of chive oil for each plate. ","ingredients":" 3 free-range egg yolks,  1 free-range egg,  250g\/9oz plain flour,  1 tsp salt,  75g\/2½oz unsalted butter,  75g\/2½oz shallots,  25g\/1oz fresh root ginger, grated,  75g\/2½oz brown crabmeat,  250g\/9oz crab carcasses (available from fishmongers),  250ml\/9fl oz fish stock,  300g\/11oz unsalted butter,  ½ tsp salt,  pinch ground white pepper,  1 tsp lemon juice,  10g fresh chives,  100ml\/3½fl oz olive oil,  40g\/1½oz scallops,  1 free-range egg yolk,  25ml\/1fl oz double cream,  40g\/1½oz brown crabmeat,  125g\/4½oz white crabmeat,  cayenne pepper,  lemon juice, to taste,  25g\/1oz butter,  25ml\/1fl oz olive oil,  1 leek, cut into julienne strips,  2 carrot, cut into julienne strips,  1 courgette, cut into julienne strips","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crab_tortellini_with_53501"}