{"recipe_name":"Crab and chilli tagliatelle","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pasta, place the '00' flour, eggs and egg yolks into a food processor and process for one minute, or until everything is bound together and smooth. Cover and place in the fridge to rest for 30 minutes. Flour the pasta machine with semolina flour and divide the pasta into two equal pieces. Starting at the lowest (thickest) setting, feed one piece of the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. Repeat this process 3-4 more times, flouring the machine and changing the setting down each time. The pasta should be quite thin, but still easy to handle without tearing. Don't be tempted to skip settings or the dough may tear. Repeat with the other piece of dough. Once the pasta sheets have reached the ideal thickness, trim the edges slightly. Attach the tagliatelle cutter attachment to the pasta machine, flouring it well with more semolina flour. Run the sheets of dough through the machine once again, cutting them into tagliatelle of 5mm\/0.2in. Dust with the remaining semolina flour and place in the fridge overnight. For the crab sauce, heat a frying pan until hot and add the olive oil, shallots, chilli, lemongrass, ginger and curry powder. Fry for 2-3 minutes. Add the white wine and bring to a simmer. Cook until the wine has reduced by half.  Add the cream and cook for a further minute before adding the crabmeat. Stir to combine and simmer for one minute.  Season with salt and freshly ground black pepper, to taste, and add a little of the lime juice and coriander, saving a squeeze of lime to serve. Set aside, keeping the sauce warm, while you cook the pasta. To serve, bring a large pan of salted water to the boil, add the tagliatelle and cook for 2-3 minutes until tender.  Drain the pasta and place into the pan with the sauce and stir to combine. Serve in bowls with a squeeze of lime. ","ingredients":" 200g\/7oz '00' flour (available in most supermarkets' baking sections),  1 free-range whole egg,  6 free-range egg yolks,  50g\/2oz fine semolina flour,  1 tbsp olive oil,  2 shallots, finely chopped,  1 red chilli, finely sliced ,  ½ stalk lemongrass, finely chopped,  3cm\/1¼in fresh ginger, finely chopped,  1 tsp hot curry powder,  200ml\/7fl oz white wine,  250ml\/9fl oz double cream,  350g\/12oz picked brown and white crabmeat,  1 lime, juice only,  3 tbsp fresh coriander, finely chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crabandchillitagliat_87860"}