{"recipe_name":"Crabcakes with a rice noodle salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Boil the potatoes in a saucepan of lightly salted water for about 15 minutes, or until tender. Drain well, and then return to the pan. Mash with a fork or potato masher until smooth. Heat the oil in a deep fat fryer or a deep-sided, heavy bottomed pan to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended). Add the butter, coriander, chilli and season with salt and pepper. Stir together to mix thoroughly, then leave to cool completely. Meanwhile, check the crabmeats carefully for any flecks of shell and discard. Add the crabmeats to the mashed potato mixture. Add the lime juice then shape into 4 round patties. If the mixture sticks to your hands, dip your hands in cold water. Carefully add the crabcakes to the oil and cook for 3-4 minutes, until golden-brown on the underside, then carefully turn them and cook for another 3-4 minutes on the other side. When fully cooked, remove from the fryer and drain on kitchen paper.  Cook the noodles according to the packet instructions and place in a large bowl. Place all the other ingredients in a food processor and blend to a rough paste. Add the dressing to the noodles and mix well. Place the noodles in the centre of serving bowls and top with the crabcakes. Garnish with the coriander cress, chilli and spring onions. ","ingredients":" 250g\/9oz floury potatoes, such as King Edward, cut into large chunks,  vegetable oil, for deep frying,  10g\/¼oz butter,  1 tbsp finely chopped fresh coriander,  ½ large fresh green chilli, seeds removed and finely chopped,  150g\/5½oz white crabmeat, flaked,  100g\/3½fl oz brown crabmeat,  2 limes, juice only,  salt and freshly ground black pepper,  250g\/9oz rice noodles,  3 limes, juice only,  4 garlic cloves, crushed,  2 tbsp finely grated fresh root ginger,  4 tbsp palm sugar,  1 tbsp sesame oil,  3 tbsp nuoc nam (Vietnamese fish sauce),  3 tbsp soy sauce,  2 red chillies, 1 finely chopped and 1 sliced,  1 large bunch fresh mint, leaves only, chopped,  1 large bunch coriander, leaves only, chopped,  coriander cress,  1 red chilli, sliced,  4 spring onions, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crabcakes_with_a_rice_91861"}