{"recipe_name":"Cranachan with oatmeal praline","author":"Nick Nairn","programme":"Great British Menu","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the praline, line a baking sheet with non-stick baking parchment. Place a frying pan over a medium heat and sprinkle in the sugar. Allow the sugar to melt without stirring; then turn up the heat. As the sugar begins to caramelise, mix in the oats and stir. Carefully tip the contents onto the lined baking sheet and leave to cool completely. Once cool, break into pieces with a rolling pin, and grind in a pestle and mortar to a coarse powder. (This can be done ahead. If you don't use it all, it can be stored in an airtight container for future use.)  To make the jelly, set a medium-sized heavy pan over a gentle heat and add the raspberries, sugar, lemon juice and six tablespoons of water. Bring to the boil and simmer for three minutes or until the raspberries have softened. Meanwhile, soften the gelatine in cold water.  Remove the pan from the heat and rub the mixture through a fine sieve into a clean pan, to remove the seeds. You should get about 200ml\/7fl oz of purée. Gently reheat the purée, then remove from the heat. Drain and squeeze the gelatine. Add the gelatine to the hot raspberry purée and stir until the gelatine has melted. Leave to set to a very soft jelly in the fridge. For the cranachan mousse, put the egg yolks and sugar in a large heatproof bowl and whisk to combine. Mix in the honey and three tablespoons of the whisky. Set the bowl over a pan of simmering water and beat with an electric mixer for 5-6 minutes or until the mixture starts to thicken - when you lift the beaters out of the mix in a circular motion, you should be left with a distinct trail on the surface. (If you have a thermometer, the mix should be at 80C\/176F.) When ready, take the bowl off the pan and allow to cool.  In another bowl mix the crème fraîche and mascarpone together. Soak the gelatine as before. Gently warm the remaining whisky in a small pan (don't allow it to get too hot). Lift the gelatine from the water, squeeze and add to the whisky. The gelatine should melt almost at once. Fold the whisky into the mascarpone mix; then add the cooled egg mix and the lemon juice. Carefully fold the whole lot together with a metal spoon. Keep the mousse in the fridge. To serve, add a handful of raspberries to the softly set jelly. Put a couple of spoonfuls of jelly in the bottom of eight dessert glasses. Put a couple of spoonfuls of mousse on top; then sprinkle with some oatmeal praline. Add more jelly, then more mousse and top with another sprinkling of praline. Finish with a few raspberries. ","ingredients":" 100g\/4oz caster sugar,  50g\/2oz pinhead oatmeal,  250g\/9oz raspberries,  3 tbsp caster sugar,  4 tsp lemon juice,  two-thirds of a gelatine leaf,  3 large free-range egg yolks,  25g\/1oz caster sugar,  35g\/1½oz clear honey (2½ tbsp) ,  5 tbsp whisky,  150g\/5½oz crème fraîche,  100g\/4oz mascarpone cheese,  two-thirds of a gelatine leaf,  2 tsp lemon juice,  raspberries","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cranachanwithoatmeal_86093"}