{"recipe_name":"Cream of celeriac soup ","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/cream_of_celeriac_soup_59784_16x9.jpg","method":"For the soup, heat a large frying pan or saucepan until medium hot, add 25g\/1oz of the butter, the onion and bacon and fry for a couple of minutes to just soften. Add the garlic, leek, celery and thyme sprigs and fry for another minute; then add the chopped celeriac. Pour in the stock and bring to the boil, then reduce the heat to a simmer and cook for 10-15 minutes, or until the celeriac is just tender. Blend the soup to a fine purée using a stick blender or a blender. Return to the heat in a pan. Add the cream and whisk in the remaining 50g\/2oz of butter.  Season with salt and white pepper. Serve the hot soup in bowls, or keep it warm in the pan if making the garnish. For the optional garnish, fry the pancetta until crisp then set aside. Return the frying pan to the heat, add half the butter and the olive oil and heat until foaming. Add the celeriac and stir fry for 1-2 minutes, or until just softened, then remove from the pan and drain on kitchen paper. Add the rest of the butter and the bread to the pan and cook until golden-brown and crisp, tossing to cook on each side. Drain on a plate lined with kitchen paper and season with salt and freshly ground black pepper. To serve, pile the julienned celeriac into the centre of each of four soup plates. Ladle the soup around. Crumble the crispy bacon over the top and then scatter over the croutons. Finish with swirls of extra virgin olive oil and cream.  ","ingredients":" 75g\/3oz butter,  1 onion, finely chopped,  50g\/2oz streaky bacon, cut into small pieces,  2 garlic cloves, finely chopped,  1 leek, white only, finely chopped,  1 stick celery, finely chopped,  2 thyme sprigs, leaves picked,  700g\/1lb 8oz celeriac, peeled and cut into small cubes,  1 litre\/1¾ pint chicken stock,  200ml\/7floz double cream,  salt and white pepper,  4 rashers pancetta ,  25g\/1oz butter,  1 tbsp olive oil,  50g\/2oz celeriac, peeled and finely julienned,  1 slice white bread, cut into 1cm\/¼ dice,  salt and freshly ground black pepper,  2 tbsp extra virgin olive oil,  2 tbsp double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cream_of_celeriac_soup_59784"}