{"recipe_name":"Creamy chicken, ham and leek pie","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/creamy_chicken_ham_and_03877_16x9.jpg","method":"Heat the chicken stock in a lidded saucepan. Add the chicken breast and bring to a low simmer. Cover with a lid and cook for 10 minutes. Remove the chicken breasts from the water with tongs and place on a plate. Pour the cooking liquor into a large jug.  Melt 25g\/1oz of the butter in a large heavy-based saucepan over a low heat. Stir in the leeks and fry gently for two minutes, stirring occasionally until just softened. Add the garlic and cook for a further minute. Add the remaining butter and stir in the flour as soon as the butter has melted. Cook for 30 seconds, stirring constantly.  Slowly pour the milk into the pan, just a little at a time, stirring well between each adding. Gradually add 250ml\/10fl oz of the reserved stock and the wine, if using, stirring until the sauce is smooth and thickened slightly. Bring to a gentle simmer and cook for 3 minutes.  Season the mixture, to taste, with salt and freshly ground black pepper. Remove from the heat and stir in the cream. Pour into a large bowl and cover the surface of the sauce with cling ilm to prevent a skin forming.  Set aside to cool. Preheat the oven to 200C\/400F\/Gas 6. Put a baking tray in the oven to heat.  For the pastry, put the flour and butter in a food processor and blend on the pulse setting until the mixture resembles fine breadcrumbs.  With the motor running, add the beaten egg and water and blend until the mixture forms a ball. Portion off 250g\/10oz  of pastry for the lid.  Roll the remaining pastry out on a lightly floured surface, turning the pastry frequently until around 5mm\/¼in thick and 4cm\/1½in larger than the pie dish.  Lift the pastry over the rolling pin and place it gently into the pie dish. Press the pastry firmly up the sides, making sure there are no air bubbles. Leave the excess pastry overhanging the sides. Cut the chicken breasts into 3cm\/1¼in pieces. Stir the chicken, ham and leeks into the cooled sauce. Pour the chicken filling into the pie dish. Brush the rim of the dish with beaten egg. Roll out the reserved pastry for the lid. Cover the pie with the pastry lid and press the edges together firmly to seal. Trim any excess pastry.   Make a small hole in the centre of the pie with the tip of a knife.  Glaze the top of the pie with beaten egg. Bake on the preheated tray in the centre of the oven for 35-40 minutes or until the pie is golden-brown all over and the filling is piping hot.   ","ingredients":" 450ml\/16fl oz chicken stock,  3 chicken breasts, skinned,  75g\/3oz butter,  2 leeks, trimmed and cut into 1cm\/½in slices,  2 garlic cloves, crushed,  50g\/2oz plain flour,  200ml\/7fl oz milk,  2-3 tbsp white wine (optional),  150ml\/3fl oz double cream,  150g\/5oz piece thickly carved ham, cut into 2cm chunks,  sea salt flakes,   freshly ground black pepper,  350g\/12oz plain flour,  200g\/7oz butter,  1 free-range egg beaten with 1 tbsp cold water, plus 1 free-range egg, beaten, to glaze","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/creamy_chicken_ham_and_03877"}