{"recipe_name":"Creamy coconut and fruit mince buns ","author":"Monica Galetti","programme":"Christmas Kitchen with James Martin","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 10-12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the flour and salt in a large bowl. In a saucepan heat the sugar and milk together to warm. Stir the yeast into the warm milk. Pour the milk into the flour and mix to form a dough. Knead until smooth, then return to the bowl and leave somewhere warm to prove for an hour, or until doubled in size. Knock back the dough and then roll out to a large square - about 1cm\/½in thick. Cut the dough in half and spread the mincemeat over both halves and sprinkle the toasted coconut over. Roll up the dough like a Swiss roll and cut into slices about 4cm\/1½in wide. Using a baking tray, approximately 25x30cm\/10x12in, press the butter along the base. Sprinkle over the demerara sugar, then pour over 400ml\/14fl oz of the coconut milk (reserve the rest). Place the cut buns on the coconut milk leaving 1cm\/½in gaps between each. Leave to prove somewhere warm until well risen and the gaps have been filled by proved dough - about 40 minutes. Preheat the oven to 180C\/350F\/Gas 4. Place a small knob of the extra butter on top of each bun and sprinkle with extra demerara sugar. Bake for 25-30 minutes, or until golden-brown. Remove from oven and gently separate the buns using a spoon, then pour over the reserved coconut milk. ","ingredients":" 500g\/1lb 2oz strong flour,  pinch salt,  45g\/1½oz caster sugar,  300ml\/10½fl oz warm milk,  10g\/⅓oz fresh yeast,  300g\/10½oz mincemeat,  50g\/1¾oz desiccated coconut, toasted,  50g\/1¾oz unsalted butter, plus extra for the topping,  50g\/1¾oz demerara sugar, plus extra for the topping,  600ml\/1lb 5oz coconut milk","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/creamy_coconut_and_fruit_77195"}