{"recipe_name":"Creamy haddock gratins","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place 4–6 small, shallow flameproof dishes on a baking tray.  For the gratin topping, mix the breadcrumbs, gruyere and parsley and set aside while you make the filling.  For the filling, pour the milk into a large, deep frying pan and add the onion, bay leaf and lemon peel. Place the fish skin-side down in the pan and bring to a gentle simmer over a medium heat. Baste the fish occasionally with the milk, and cook for 5–6 minutes. When cooked, the fish will be opaque and be starting to flake into pieces. Leave to stand for 5 minutes.  Drain the fish in a colander over a large jug, reserve the milk.  Melt the butter in a large non-stick saucepan and stir in the flour with a wooden spoon until thoroughly combined. Remove from the heat and slowly add the reserved warm milk, stirring constantly. Return to the heat, bring the sauce to a simmer and continue to stir until it is smooth and thick. Stir in the wine or vermout, Gruyère, mustard and cream. Cook over a low heat for a further 2–3 minutes, while stirring. Season with salt and freshly ground black pepper to taste. Flake the fish into chunky pieces and discard the skin, onion, bay leaf and lemon peel. Add the fish to the pan with the sauce and heat very gently for a 2 minutes to warm it through.  While the fish is warming, preheat the grill to hot and place the baking tray with the shallow dishes under the heat to warm for a few seconds. Carefully remove them from the heat and divide the hot fish mixture between the warm dishes. Sprinkle with the gratin topping and return to the grill for 3–5 minutes or until nicely browned and filling bubbling undeneath. ","ingredients":" 25g\/1oz fresh white breadcrumbs,  15g\/½ oz Gruyère, finely grated,  ½ tsp dried parsley,  300ml\/10fl oz whole milk,  1 small onion, peeled, cut into 6 wedges lengthways,  1 bay leaf,  2 strips lemon peel ,  450g\/1lb fresh haddock fillet (or any other decent white fish with skin),  40g\/1½oz butter,  25g\/1oz plain flour,  2 tbsp white wine or vermouth (optional),  50g\/1¾oz Gruyère, finely grated,  ½ tsp prepared English mustard,  3 tbsp double cream,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/creamy_haddock_gratins_86114"}