{"recipe_name":"Albondigas (spicy Mexican meatballs with red rice)","author":"Gino D'Acampo","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the meatballs, place half of the onions, the pork and beef mince, oregano, breadcrumbs, cumin and egg into a large bowl. Mix together well, then season with salt and freshly ground black pepper. Using your hands, roll the mince mixture into 4cm\/1½in meatballs. Heat the vegetable oil in a large frying pan over a medium heat. Add the meatballs and fry for 5-6 minutes, turning occasionally, until browned all over. Drain from the oil with a slotted spoon and set aside on a plate. Heat the olive oil in a clean pan over a medium heat. Add the remaining onions, the garlic and chillies and fry until soft and golden. Add in the chopped tomatoes, season with salt and freshly ground black pepper and cook for 5-6 minutes. Add the beef stock to the sauce and stir well, then the meatballs and simmer for 20 minutes, or until the sauce has thickened and the meatballs are cooked through. For the red rice, place the plum tomatoes on a baking tray with the garlic, drizzle over two tablespoons of the olive oil and place into the oven to roast for 20 minutes. Remove from the oven and allow to cool. Once cool enough to handle safely, remove the skin from the tomatoes and peel the garlic. Place the garlic, tomatoes, paprika, sugar, lime juice, spring onions and oregano in a food processor and blend until smooth. Soak the rice in a fine sieve for ten minutes. Drain thoroughly. Heat the remaining eight tablespoons of olive oil a large saucepan over a medium heat. Add the rice and fry, stirring to coat the rice in the oil, for 5-6 minutes, add the blended tomato mixture and the tomato purée and stir well, allowing the rice to absorb the liquid. Slowly add ladlefuls of vegetable stock, stirring constantly, as you would with a risotto, allowing each ladleful to be absorbed by the rice before adding the next.  Cook until the rice is al dente, or to your liking and season with salt. Serve hot in bowls. ","ingredients":" 2 onions, finely chopped,  250g\/9oz pork mince,  250g\/9oz beef mince,  1 tsp dried oregano,  60g\/2oz fresh breadcrumbs,  1 tsp ground cumin,  1 free-range egg, beaten,  salt and freshly ground black pepper ,  8 tbsp vegetable oil,  3 tbsp olive oil,  800g\/1lb 12oz canned chopped tomatoes,  4 medium-hot red chillies, seeds removed and finely chopped,  2 garlic cloves, finely chopped,  100ml\/3½fl oz beef stock,  salt and freshly ground black pepper ,  3 large plum tomatoes, cut into quarters,  500g\/1lb 2½oz long grain rice,  2 cloves garlic ,  10 tbsp olive oil,  2 tsp paprika,  1 tbsp brown sugar,  2 limes, juice only,  2 spring onions, finely chopped,  1 tsp dried oregano,  3 tbsp tomato purée,  500ml\/18fl oz vegetable stock (if you need more liquid use hot water),  salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/albondigasspicymexic_83672"}