{"recipe_name":"Creamy garlic rabbit casserole","author":"Paul Merrett","programme":"Economy Gastronomy","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sprinkle the flour onto a plate and dredge the rabbit pieces in the flour until evenly coated. Heat the vegetable oil in a heavy-based casserole over a medium heat. Add the floured rabbit pieces to the casserole in batches and cook slowly for 6-8 minutes, turning regularly, until browned all over. Remove from the casserole and set aside. Keep warm. Repeat the process with the remaining batches of rabbit, then set all of the browned rabbit pieces aside.  Add the leek, onion, celery, white peppercorns, the two halves of the garlic heads and all of the sage and thyme to the casserole the rabbit was cooked in. Fry for 4-5 minutes, or until softened.  Add the wine and bring to the boil. Continue to boil for 4-5 minutes, or until the volume of liquid has reduced by half.  Add the stock and browned rabbit pieces and bring the mixture to a gentle simmer. (If the stock does not cover the rabbit pieces, add a little more hot water.) Simmer for one hour, uncovered, until the rabbit meat is tender and the sauce has thickened.  Transfer the cooked rabbit pieces to a warm plate, cover and set aside. Keep warm. Increase the heat of the casserole until the mixture is boiling. Continue to boil the cooking liquid for 4-5 minutes, or until it the volume of liquid has reduced in volume and the sauce has thickened.  Reduce the heat until the mixture is simmering, then add the double cream and stir well. Continue to simmer for 10-12 minutes, or until the cream sauce has thickened slightly.  Strain the cream sauce through a fine sieve into a clean pan. Add the rabbit pieces and simmer for 8-10 minutes, or until the rabbit has warmed through. Meanwhile, peel and crush the garlic cloves from the remaining head of garlic to a paste with the edge of a sharp knife. Add teaspoonfuls of the crushed garlic paste to the cream sauce, to taste, stirring well after each addition. Meanwhile, heat the butter in a pan over a medium heat. Add the chopped mushrooms and fry for 4-5 minutes, or until golden-brown. When the mushrooms are cooked, add them to the rabbit and cream sauce.  To serve, spoon some of the creamy garlic rabbit casserole into the centre of each of four serving plates. Sprinkle over the chopped chives. ","ingredients":" 2 tsp flour,  1 large farmed rabbit, jointed,  1 tbsp vegetable oil,  ½ leek, cleaned, trimmed, chopped into 2cm\/¾in slices,  1 onion, peeled, roughly chopped,  1 celery stalk, chopped into 2cm\/¾in slices ,  ½-1 tsp whole white peppercorns,  2 garlic heads, one cut in half horizontally, the other separated into cloves,  6 fresh sage leaves,  large sprig fresh thyme,  300ml\/10½fl oz white wine,  1 litre\/1¾ pints hot chicken stock,  600ml\/1 pint 2fl oz double cream,  30g\/1oz butter,  200g\/7½oz mushrooms, chopped,  1 tbsp chopped fresh chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/creamygarlicrabbitca_92045"}