{"recipe_name":"Creamy mushroom pancakes with thyme-roasted tomatoes","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the mushroom sauce, place the butter with the olive oil in a medium frying pan over a medium heat. When the butter has melted add the garlic, shallot, sage and thyme and fry for one minute. Add the mushrooms and fry for a further minute. Add the cream and bring to simmering point. Season, to taste, with salt and freshly ground black pepper and remove from the heat. To make the thyme roasted tomatoes, place a small frying pan over a high heat. Place the tomatoes, thyme, olive oil and brown sugar in a large bowl and mix together well.   Place the mixture into the frying pan and cook for five minutes continually agitating the pan. To make the pancakes, place the flour and salt into a large bowl, making a well in the centre. Place the egg and egg yolk into the well in the flour with a little milk. Stir together, gradually adding the remaining milk and oil as you continue to stir, until a loose batter mix is formed. Place a lightly oiled small frying pan over a high heat. Add a ladle of the batter to the pan and cook for a minute. Turn over the pancake to cook for one more minute, or until golden. Repeat the process to cook one more pancake. To serve, place a base pancake onto a warmed plate. Spoon the mushroom sauce over and place another pancake on top. Finish with a further layer of mushroom sauce. Place the thyme roasted tomatoes around the edge of the plate and serve. ","ingredients":" 25g\/1oz butter,  1 tbsp olive oil,  1 garlic clove, finely chopped,  ½ banana shallot, finely chopped,  ½ tsp fresh sage, chopped ,  ½ tsp fresh thyme leaves, chopped ,  75g\/2¾oz wild mushrooms, carefully cleaned and chopped,  50ml\/2fl oz double cream,  salt and freshly ground black pepper,  3 vine tomatoes, cut in half,  1 tbsp fresh thyme leaves, finely chopped,  1 tbsp brown sugar,  1 tbsp olive oil,  110g\/4oz plain flour, sifted ,  1 pinch salt,  1 free-range egg, beaten,  1 free-range egg yolk,  300ml\/9½fl oz milk,  1 tbsp olive oil","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/creamymushroompancak_79850"}