{"recipe_name":"Crisp breadcrumbed squid with creamy ponzu dressing and Chinese leaf salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the squid, heat a deep fat fryer to 190C\/375F. Alternatively heat vegetable oil in a deep-sided, heavy based pan, until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Season the flour with salt and black pepper. Dredge the squid rings with the seasoned flour, coating thoroughly. Dip the floured squid rings into the beaten eggs then straight into the breadcrumbs to coat. Lower a few squid rings at a time into the fat fryer, or hot oil, and cook for two minutes until golden-brown and crisp. Remove the squid rings from the hot oil with a slotted spoon and drain onto kitchen paper. For the creamy ponzu dressing, place all the ingredients, except the vegetable oil, into a small food processor and blend to a purée. Gradually add in the vegetable oil until a thin mayonnaise forms. Check the seasoning and add more yuzu juice if desired. For the Chinese leaf salad, mix together the Chinese leaf, red onion and mint in a bowl. Whisk the rice wine vinegar, sesame and vegetable oils together with the lime juice then season to taste. Pour the dressing over the leaves and mix well. To serve, pile the squid onto a plate and drizzle over the creamy ponzu dressing then pile the salad alongside. ","ingredients":" 4 medium squid, cleaned and sliced into 5mm\/¼ in thick rings,  75g\/3oz plain flour,  salt and freshly ground black pepper,  2 eggs, beaten,  75g\/3oz panko or Japanese breadcrumbs,  1 lime, segmented,  3 tbsp coriander cress,  2 tbsp red amaranth cress,  2 eggs, yolks only,  ½ tsp sea salt,  1 pinch white pepper,  2 tsp rice wine vinegar,  4 tsp chilli garlic sauce,  2 tsp yuzu juice,  200ml\/7fl oz vegetable oil,  200g\/7oz Chinese leaf, finely shredded,  ½ red onion, very finely sliced,  2 tbsp very finely shredded mint ,  2 tbsp rice wine vinegar,  1 tbsp toasted sesame oil,  2 tbsp vegetable oil,  1 lime, juice only,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crisp_breadcrumbed_squid_24534"}