{"recipe_name":"Crisp camembert wedges with raspberry sauce","author":"Gregg Wallace","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Slice the chilled camembert into six equally sized wedges. Sprinkle the flour onto a plate and season to taste with salt and freshly ground black pepper. Beat the eggs in a bowl. Sprinkle the breadcrumbs onto another plate. Dredge each wedge of camembert in the flour until coated all over. Dip in the egg, then roll in the breadcrumbs until completely coated. Repeat the process with the remaining wedges of cheese. Place the breadcrumbed camembert onto a plate, cover with cling film and chill until needed.  Meanwhile, heat the raspberries, sugar and lemon juice in a saucepan over a low heat. As the sugar dissolves, mash the raspberries gently with a fork, stirring the mixture to prevent if from sticking to the bottom of the pan. Gently bring the mixture to the boil then remove the pan from the heat.  Transfer the raspberry mixture to a sieve and press through, collecting the strained sauce. Set the raspberry sauce aside until needed (keep warm if desired or cool then chill in the fridge). Heat the rapeseed oil in a deep-sided, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. The oil should come 5cm\/2in up the sides of the pan. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat the oil in a deep-fat fryer to 190C\/375F. Gently lower the breadcrumbed camembert slices into the hot oil and fry until crisp and golden-brown. Carefully remove from the pan using a slotted spoon and set aside to drain on kitchen paper. To serve, divide the cheese wedges equally between two serving plates. Spoon a little of the raspberry sauce alongside. ","ingredients":" 200g\/7oz camembert, chilled,  50g\/2oz flour,  salt and freshly ground black pepper,  2 free-range eggs,  100g\/3½oz dried white breadcrumbs,  500g\/17oz fresh raspberries,  50g\/2 oz sugar,  2 tsp freshly squeezed lemon juice,  500ml\/1¾ pints rapeseed oil, for deep frying","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crisp_camembert_wedges_98274"}