{"recipe_name":"Crispy chilli beef with noodles and steamed broccoli","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the beef, heat a deep-fat fryer to 190C, or heat the oil for deep-frying in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Toss the beef strips in the vegetable oil. In a pestle and mortar, crush the Sichuan peppercorns to a fine powder. Place them in large bowl with the lime and orange zest and cornflour then toss well to combine. Add the beef and toss to coat each piece thoroughly. In batches, drop the beef into the deep-fat fryer and cook for 2 minutes. Drain on a plate lined with kitchen paper. For the sauce, heat a frying pan or wok until hot, add the sugar, rice wine and rice wine vinegar and bring to the boil. Add the chillies, chilli flakes, ginger, lemongrass and lime leaves then cook for 5-8 minutes until thickened, sticky and glossy looking. Add the fried beef to the sauce, remove from the heat and toss well so that all the beef is coated in the sticky sauce. For the noodles, heat the vegetable oil in a wok over a high heat. When the oil is smoking, add the ginger, garlic and spring onions and stir fry for 2-3 minutes, or until softened. Add the cooked noodles and stir fry for a further minute, or until warmed through. Add the sesame oil, soy sauce, rice wine vinegar and lemon juice and mix well to combine. Add the sesame seeds and stir fry for a further 1-2 minutes. Sprinkle over the coriander and stir well to combine. To serve, divide the noodles between serving bowls and top with the chilli beef. Place the broccoli in a separate serving bowl. ","ingredients":" sunflower oil, for deep frying,  400g\/14oz rib-eye steak, cut into thin strips,  2 tbsp vegetable oil,  1 tbsp Sichuan peppercorns,  2 limes, zest only,  1 orange, zest only,  3 heaped tbsp cornflour, rice flour or potato starch,  150g\/5½oz caster sugar,  150ml\/5fl oz Shaoxing rice wine,  25ml\/¾fl oz rice wine vinegar,  1½ red chillies, finely chopped,  2 tsp dried chilli flakes,  10cm\/4in piece fresh root ginger, finely chopped,  2 lemongrass stems, outer leaves removed, then finely chopped,  4 lime leaves, finely chopped,  1 tbsp vegetable oil,  10cm\/4in piece fresh ginger, julienned,  4 garlic cloves, finely chopped,  6 spring onions, trimmed, finely sliced,  250g\/9oz fine rice noodles, cooked according to packet instructions, drained and refreshed in cold water and drained again,  3 tbsp sesame oil,  2 tbsp soy sauce,  2 tbsp rice wine vinegar,  ½ lemon, juice only,  2 tbsp sesame seeds,  4 tbsp chopped fresh coriander,  steamed broccoli","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crispy_chilli_beef_with_40462"}