{"recipe_name":"Crispy filo mince pies with pear and apple mincemeat","author":"Lorraine Pascale","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 12 mince pies","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/crispy_filo_mince_pies_63765_16x9.jpg","method":"Preheat oven to 180C\/160C(fan)\/350F\/Gas 4. Place a baking tray into oven to heat up. (This will give extra bottom heat to the pies so that the bases cook through and are not soggy.) Grease a 12-hole muffin tin with a little spray oil and set aside.  Put all the mincemeat ingredients into a saucepan over a medium heat. Allow to cook gently, stirring occasionally, for about 10 minutes or until the apples begin to soften. Then remove from the heat and leave the mixture to infuse while you make the pies.  Lay the sheets of filo pastry out on top of each other and cut them in half across the width. Then cut each half in half again to give four stacks of about 12cm\/4½in squares of filo. I find scissors really handy to cut these out, but a sharp knife will do. Keep any filo not being worked on under a damp tea towel so that it doesn’t dry out. Line each hole of the muffin tin with three squares of filo. I like to take a square at a time and press it into the hole, each one slightly staggered from the previous so the resulting pastry case edge looks like a star. Make sure to push the pastry down so it is in the ‘corners’ of each muffin hole.  After lining the tin, you should be left with 12 squares of filo. Which you can reserve under a damp tea towel for now.  Spray each stack in the tin with a little oil and bake in the oven for five minutes until crisp and pale golden. Then, divide the filling evenly among the cases.  Next take the remaining squares of filo, scrunch each one up lightly and place one on top of each pie so that it looks like a scrunched-up tissue. Brush them lightly with beaten egg or melted butter.  Pop in the oven on the heated baking sheet for 8-10 minutes or until the pies are crisp and golden.  Meanwhile, prepare the yogurt for serving. Gently mix together the yogurt, icing sugar and vanilla seeds or extract in a bowl. Cover and set aside in the fridge until ready to use.  Once ready, remove the pies from the oven, dust with a little icing sugar and serve with a dollop of the yogurt, if you like. ","ingredients":" 3 tart eating apples (such as Granny Smith), peeled, cored and cut into 1cm\/½in chunks,  1 perfectly ripe pear, peeled, cored and cut into 1cm\/½in chunks,  100g\/3½oz raisins,  100ml\/3½fl oz apple juice,  75g\/2¾oz dried cranberries,  50g\/1¾oz pecan nuts, finely chopped,  2 tsp ground ginger,  2 tsp ground cinnamon,  pinch ground cloves,  big pinch freshly grated nutmeg,  1 vanilla pod, seeds scraped out,  1 orange, zest only, finely grated,  1cm\/½in piece fresh ginger, very finely chopped,  a few twists cracked black pepper,  3 tbsp cider, calvados, rum or brandy (optional),  vegetable oil, in a spray bottle,  12 sheets filo pastry,  1 egg, lightly beaten (alternatively use a little melted butter or vegetable oil),  icing sugar for dusting (optional),  200g\/7oz low-fat Greek yogurt (optional),  50g\/1¾oz icing sugar, sifted,  1 vanilla pod, seeds scraped out or 1 tsp vanilla extract ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crispy_filo_mince_pies_63765"}