{"recipe_name":"Crispy haggis and potato pancake with a spinach salad and warm whisky and bacon dressing","author":"Nick Nairn","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Grate the peeled potatoes into a clean tea towel using the large holes on the grater. Wrap the tea towel around the grated potato and squeeze to remove the moisture.  Heat a blini pan (or a frying pan) over a medium heat and add about a tablespoon of the olive oil. When hot, place a heaped tablespoon of the dry grated potato in a mound in the pan and gently press down to form a neat circle. Leave to cook for a couple of minutes. Place a slice of haggis on top of each potato cake, then cover with another heaped tablespoon of grated potato and gently press down.  Cook until crispy and golden (4-5 minutes), then very carefully turn and cook on the other side for 3-4 minutes. Blini pans make this job easier, but an alternative method is to cook them in a frying pan and cut out the neat finished rounds after cooking. Place in the oven for 5-6 minutes. Fry the eggs as you like them. I like mine cooked in a fair bit of olive oil over a high heat, so they go a bit crispy while keeping the yolk runny. To make the salad, in a pan set over a medium heat fry the pancetta until crisp in a little olive oil. Keep warm. Place the spinach, mushrooms, herbs and tomato in a bowl. When ready to serve, stir the warm pancetta through the salad.  Combine the olive oil, vinegar, mustard and whisky into a dressing and vigorously shake. Drizzle over the salad, keeping a little back for serving. To serve, place the warm dressed salad on serving plates, topped with the haggis and potato pancakes and a fried egg. Grind over a little pepper and drizzle the remaining dressing around. Serve immediately. ","ingredients":" 3 tbsp olive oil,  200g\/7oz potatoes, peeled (roughly one potato per person),  80g\/3oz haggis, cut into two slices, at room temperature,  2 free-range eggs,  50g\/1¾oz pancetta, finely chopped,  75g\/2½oz baby spinach,  3 raw button mushrooms, very thinly sliced,  2 tbsp chopped chives,  2 tbsp chopped parsley,  2 ripe tomatoes, deseeded and finely chopped,  3 tbsp olive oil,  1 tbsp red wine vinegar,  1 tsp grainy mustard,  1 tbsp whisky,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crispy_haggis_and_potato_74567"}