{"recipe_name":"Crispy hen’s egg, griddled asparagus, asparagus purée, burnt onion","author":"Daniel Clifford","programme":"2007-16","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the burnt onion powder, preheat the oven to 65C\/150F\/Gas: lowest possible setting. Heat a dry frying pan until hot. Cut the onions in half and place cut side down onto the frying pan and leave until very charred. Turn the onions over and repeat on the other side. Transfer the onions onto a baking tray and bake in the oven on a very low heat for 12 hours. When completely dry, blend the onions in a food processor to a fine powder. Sieve the onion powder and set aside until needed.  For the asparagus velouté, heat a frying pan until medium hot. Add the butter, onions and garlic and fry gently for 4-5 minutes until just soft. Add the chopped asparagus, stir well, then pour the hot chicken stock over. Bring the mixture up to the boil and simmer for six minutes. Add the beurre noisette and cream to the asparagus pan and mix well. Pour the asparagus mixture into a blender, add the baby spinach and blend to a fine purée. Strain the asparagus purée through a fine sieve into a bowl over iced water, to chill and keep the colour. Set aside until needed. For the asparagus purée, bring a pan of salted water to the boil, add the asparagus and cook for a few minutes until soft. Drain the asparagus, then plunge immediately into cold water to refresh. Drain again, and pat the asparagus dry.  Blend the cooked asparagus with the remaining ingredients to a fine purée.  Strain the purée through a fine sieve into a bowl over iced water, to chill and keep the colour. Set aside until needed. For the crispy hen’s eggs, heat a deep fat fryer to 190C\/375F. Alternatively heat vegetable oil in a deep sided, heavy-based pan, until a breadcrumb sizzles and turns golden brown when dropped in. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Bring a deep pan of water to the boil, add the vinegar then the eggs and cook for 2½ minutes. Drain the eggs and place immediately into cold water to refresh and stop the cooking process. Peel the shells from the eggs and trim them so they are nice and round. Pat the peeled eggs dry then wrap them in potato spaghetti. Gently lower the potato wrapped eggs into the hot oil and cook until crisp. Remove the eggs from the oil with a slotted spoon and drain on kitchen paper. Season with salt and freshly ground black pepper. For the griddled asparagus, bring a large pan of salted water to the boil, add the asparagus and boil for two minutes 20 seconds, then drain and plunge immediately into cold water to refresh. Drain the asparagus again and pat dry.  Heat a griddle pan until medium hot. Drizzle the asparagus with olive oil, sprinkle with salt and griddle them on a medium heat until charred on each side. To serve, sprinkle the onion powder onto the griddled asparagus. Spoon three stripes of asparagus purée across each serving plate, and place two griddled asparagus covered in the onion powder across the purée. Place the deep-fried egg on top of the asparagus. Pour the velouté into small jugs and serve alongside.  ","ingredients":" 750g\/1lb 10oz onions, peeled,  50g\/2oz butter,  2 small onions, roughly chopped,  3 garlic cloves, roughly chopped,  750g\/1lb 10oz asparagus, chopped,  1 litre\/1¾ pints white chicken stock, hot,  200ml\/7fl oz beurre noisette ,  200ml\/7fl oz boiled double cream,  150g\/5½oz baby spinach, washed,  750g\/1lb 10oz asparagus, chopped ,  150ml\/5fl oz beurre noisette,  125ml\/4fl oz boiled double cream,  115g\/4oz washed baby spinach,  2 tbsp white wine vinegar,  4 free-range eggs,  4 large potatoes, made into spaghetti using a spiralizer,  8 large asparagus spears, trimmed,  2 tbsp olive oil,  salt, to season","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crispy_hens_egg_griddled_95185"}