{"recipe_name":"Crispy noodles with prawn and crab (Mee krob)","author":"The Hairy Bikers","programme":"The Hairy Bikers' Asian Adventure","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dressing, add the palm sugar and fish sauce to a small bowl and mix well to dissolve the sugar. Add the lime juice and set aside. For the crispy noodles, heat the oil for deep-fat frying in a deep fryer, wok or large saucepan to 180-190C\/250F-375F. When it is ready, a small cube of bread should become crisp and golden-brown and float to the top in a few seconds. Cook the vermicelli - do this in batches. Fry until puffed up and turning a pale golden-brown colour.  Carefully remove using a slotted spoon and drain on a plate lined with kitchen paper. Add three tablespoons of vegetable oil to a wok or saucepan. Fry the Thai shallots (or banana shallot) until crisp. Remove from the pan and set aside to drain on kitchen paper. Add another tablespoon of vegetable oil to the wok. When hot, add the prawns and stir or toss until slightly opaque.   Add the ginger, garlic, and galangal and fry for a couple of minutes. Stir until the prawns are cooked – no longer than a minute. Transfer into a large bowl with the crisp shallots. Add the spring onions, bean sprouts, lime leaves, and crabmeat. Pour in the dressing and the herbs. Mix well, but gently as you do not want to bruise the herbs - use your hands for this. Layer the salad up in a large serving bowl, by putting a layer of crisp noodles on the  bottom and a layer of prawn and crab mixture on top, then repeat until you have used up all the ingredients. Garnish with slithers of chilli and lime wedges and serve straight away. ","ingredients":" 2 heaped tbsp grated palm sugar,  5 tbsp Thai fish sauce ,  3 tbsp fresh lime juice,  vegetable oil, for deep fat frying,  125g\/4½oz vermicelli or thin rice noodles,  5 Thai shallots or 1 banana shallot, thinly sliced,  400g\/14oz raw tiger prawns, peeled and deveined (feel free to leave the shell on some of the prawns if preferred) ,  1 small thumb-sized piece fresh root ginger ,  3 garlic cloves, grated or crushed ,  thumb-sized piece galangal, finely grated ,  at least 3 spring onions, cut lengthways and thinly sliced ,  150g\/5½oz beansprouts,  3 kaffir lime leaves, finely sliced ,  200g\/7oz freshly picked white crab meat,  handful coriander leaves, roughly chopped,  handful picked mint leaves (do not chop or the leaves will go brown),  handful picked holy basil (normal basil will do if not available),  1 long red chilli, sliced on the diagonal for garnish,  2 limes, cut into wedges ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crispy_noodles_with_80051"}