{"recipe_name":"Crispy duck pancakes with chilli-plum sauce","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 210C\/410F\/Gas 7. For the crispy duck, place the duck, skin side up, onto a rack over a roasting tray and pierce the skin all over with a knife. Boil a kettle and pour the boiling water over the duck skin, discarding the water. Pat the duck dry, using kitchen paper, then rub salt and freshly ground black pepper, to taste, over the skin.  Transfer to the oven to roast for 1-1¼ hours, or until crisp and golden-brown. Remove from the oven and set aside to rest for 10 minutes. Shred the duck into fine pieces using two forks. For the chilli plum sauce, heat the olive oil in lidded pan and fry the spring onions and chillies for 1-2 minutes, or until softened. Add the spices and continue to cook for another 1-2 minutes.  Add the plums, vinegar and sugar and bring the mixture to the boil. Reduce the heat until the mixture is simmering, cover with a lid and simmer for 5-6 minutes, or until the plums are tender. Set the plums aside to cool Remove the cinnamon stick and blend the mixture to a purée in a food processor. Strain the purée through a sieve into a bowl. Season, to taste, with salt and freshly ground black pepper. Meanwhile, for the pancakes, place the flour into a bowl and make a well in the centre. Pour in the boiling water and stir to form a dough. Tip the dough out onto a floured work surface and knead for 2-3 minutes, or until the dough is smooth. Cut the dough into 16 pieces and roll each piece into a thin pancake. Heat a frying pan until hot and fry each pancake for 1-2 minutes on each side, or until pale golden-brown. Keep the pancakes warm until ready to serve. To serve, place the shredded duck onto a large serving plate and place spring onion and chillies alongside. Place the pancakes onto a separate serving plate and serve the plum sauce alongside. ","ingredients":" 1 x 2kg\/2lb 4oz duck, back bone removed, flattened,  1 tbsp olive oil,  3 spring onions, sliced,  2 red chillies, finely chopped,  1 cinnamon stick,  ½ tsp Sichuan peppercorns,  500g\/1lb 2oz plums, stones removed, roughly chopped,  125ml\/5fl oz rice wine vinegar,  75g\/3oz caster sugar,  salt and freshly ground black pepper,  225g\/8oz strong white flour,  175ml\/6fl oz boiling water,  4 spring onions, finely shredded,  2 red chillies, seeded, finely shredded","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crispyduckpancakeswi_93114"}