{"recipe_name":"Aubergine parmigiana","author":"Donal Skehan","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Brush the aubergine slices with olive oil on both sides to coat. Heat a griddle pan and cook the aubergines for a couple of minutes on both sides until lightly browned. Set aside while you get on with the tomato sauce. Heat a large frying pan. Fry the garlic and onion with a little oil until soft. Add the chopped tomatoes, oregano and wine. Simmer for about 15 minutes, or until the sauce thickens. Preheat the oven to 220C\/200C Fan\/Gas 7. In a medium-sized roasting tin, spread a little tomato sauce over the bottom of the tin. Add a layer of aubergine slices and spread another layer of tomato sauce on top. Spread half the ricotta on the top and sprinkle with Parmesan, salt and pepper. Continue to repeat the layers until all the aubergine is used. Finish with a layer of mozzarella slices topped with a final sprinkle of Parmesan. Bake for 25 minutes. For the salad, place the leaves in a large bowl and mix. Combine the oil, vinegar and mustard in a small bowl. Season with salt and pepper. Dress the leaves with the dressing just before serving. Serve the parmigiana hot with the salad alongside. This dish reheats well if you have any leftovers. ","ingredients":" 2 large aubergines, sliced into thin slices about a 5mm\/¼in thick,  2 tbsp olive oil,  100g\/3½oz ricotta,  100g\/3½oz Parmesan, grated,  100g\/3½oz mozzarella, sliced ,  sea salt and freshly ground black pepper,  2 garlic cloves, finely chopped,  1 red onion, finely chopped,  a good splash olive oil,  2 x 400g tins chopped tomatoes ,  2 tsp dried oregano ,  125ml\/4fl oz red wine,  A selection of Italian leaves,  3 tbsp olive oil,  1 tbsp sherry vinegar,  1 tsp Dijon mustard","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/aubergine_parmigiana_57566"}