{"recipe_name":"Crispy tomato and mozzarella cakes","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Melt the butter in a large, heavy-bottomed pan. Add the rice and cook on a low heat for a couple of minutes. When the rice starts to become translucent around the edges, add the wine and cook for one minute. Add a ladleful of warm stock (it must be warm to enable the rice to cook properly) and stir well. When the stock has been absorbed by the rice, add another ladleful of stock and stir again until absorbed. Continue adding stock in this way until all the stock has been added and\/or the rice is tender. Add the sun-dried tomatoes and the cream and stir. Season, to taste, with salt and freshly ground black pepper, then remove from the heat and allow the risotto to go cold. Heat the vegetable oil in a deep heavy-bottomed saucepan until a breadcrumb sizzles and turns brown in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Divide the cold risotto into six and roll into balls. The rice should be quite sticky. Make a hole in the centre of each ball with your finger and press some of the mozzarella into it. Reform the rice ball to cover over the cheese, then flatten slightly into a patty shape. Dredge the patties in the flour, then dip into the beaten egg, then finally into the breadcrumbs. Repeat the dipping into the egg and the breadcrumbs to ensure the rice patties are thoroughly coated. Carefully place the patties into the hot oil and deep fry for 4-5 minutes or until crisp and golden. Remove with a slotted spoon and drain on kitchen paper. To serve, place a tomato and mozzarella cake into the centre of six plates with a small handful of rocket leaves drizzled with olive oil placed alongside. ","ingredients":" 50g\/2oz butter,  450g\/1lb Arborio rice, rinsed and drained,  splash white wine,  850ml\/1½ pints vegetable stock, warm ,  100g\/3½oz sun-dried tomatoes, chopped,  2 tbsp double cream,  salt and freshly ground black pepper,  vegetable oil, for deep-frying ,  150g\/5½oz mozzarella, cut into cubes,  plain flour, for dredging,  1 free-range egg, beaten,  150g\/5oz fresh breadcrumbs,  rocket leaves, drizzled with olive oil, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crispytomatoandmozza_85087"}