{"recipe_name":"Crocodile or chicken skewers with cashew nut satay","author":"The Hairy Bikers","programme":"The Hairy Bikers","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2 as main, 4-6 as nibbles","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Soak the bamboo skewers or cocktail sticks in cold water for 10 minutes to prevent them from burning.  Season the crocodile or chicken generously with salt and freshly ground black pepper. Cut into strips about 1cm x 2cm (0.5in x 1in). Mix together the marinade ingredients and marinate the crocodile or chicken strips for half an hour or longer if possible. To make the satay sauce, combine all the satay sauce ingredients together in a small pan, adding just enough soy sauce to season. Add a little palm sugar or light brown muscovado sugar to sweeten, if necessary. Simmer very gently for five minutes.  Preheat a barbecue, grill or griddle pan until very hot (the Hairy Bikers cook theirs on an outdoor fire). Thread two or three strips of marinated crocodile or chicken meat onto each skewer and place on the barbecue or griddle pan or under the grill.  Cook for a few minutes on each side until cooked through and golden, being careful not to overcook. Serve the skewers with the hot satay sauce for dipping. ","ingredients":" 1 piece crocodile fillet or 2 large chicken breasts,  salt and freshly ground black pepper,  ½ lemon, juice only,  2 tbsp olive oil,  1 clove garlic, crushed,  1-2 tbsp soy sauce,  2 tbsp crunchy peanut butter,  110g\/4oz unsalted cashew nuts, crushed,  1 lime or lemon, juice only,  half tin coconut milk,  fresh chillies, chopped, to taste,  splash soy sauce, to season,  palm sugar or light brown muscovado sugar, to taste (optional),  approx 8-12 bamboo skewers or cocktail sticks, for assembling","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crocodileorchickensk_79545"}