{"recipe_name":"Crubeens (pig's trotters) and beetroot with salad leaves and salad cream","author":"Richard Corrigan","programme":"Great British Menu","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put all the ingredients for the brine in a large saucepan with 3 litres\/5¼ pints cold water. Bring to the boil, stirring until the sugar has dissolved and skimming off the foam that rises to the surface. Simmer for 10 minutes, then remove from the heat and leave to cool. Put the trotters in a large bowl and pour over the cold brine. Cover the trotters with a plate to keep them submerged, then cover the bowl and leave in the fridge for 24 hours. Drain the trotters and put them in a large saucepan or stockpot. Cover with cold water, add the bouquet garni and bring to the boil. Reduce the heat, cover and simmer for three hours.  Preheat the oven to 160C\/320F\/Gas 3. Make a bed of the cubed vegetables on the base of a heavy casserole. Set the ham hock on top and pour over the white wine. Cover the pan with cling film, then tie a sheet of foil tightly over the top with string and cover with a tight-fitting lid. Braise in the oven for 3½ hours. Leave both trotters and ham hock to cool in their pans, then remove. Using a very sharp knife, score through the skin and split the trotters in half lengthways. Carefully take out the meat, discarding the bones and gristle but keeping the fat with the meat. Reserve the skins. Shred the trotter meat, and the meat from the ham hock. Heat a splash of olive oil in a heavy frying pan and sweat the shallots, stirring frequently, over a low to medium heat for 8-9 minutes or until softened but not coloured. Remove from the heat and stir in the parsley, then mix with the shredded meats and fat, and the mustard. Season lightly with salt and freshly ground black pepper. Divide the mixture into three portions. Lay two large (catering-size) sheets of cling film on top of each other on a board and smooth out any wrinkles. Place the trotter skins on the cling film, opening them out and laying them flat. Arrange them close to each other in pairs so you have three rows that make a 'blanket' of skins. Put the meat mixture in the middle of the skins and form into a long sausage, then roll up the sausage so that it is completely encased in the skins. Now roll the sausage in the cling film and twist the ends to seal. Chill overnight.  The next day, make the salad cream. For the salad cream, whisk the mustard, sugar and vinegar with the white pepper and salt. Add the evaporated milk and continue to whisk. Gradually whisk in the rapeseed oil to make a cream consistency. Check the seasoning and add salt and freshly ground black pepper to taste. Keep cool. For the beetroot relish, peel and grate the raw beetroot, sprinkle with salt and leave to stand for 30 minutes. Rinse off the salt. Sweat the onion in a splash of hot olive oil with some salt and freshly ground black pepper until softened but not coloured. Add the wine vinegar, wine and grated beetroot, and stir. Cover and cook until reduced. Uncover and fold in the horseradish with sugar, salt and freshly ground black pepper to taste. Set aside. Preheat the oven to 180C\/350F\/Gas 4. For the roasted beetroot, place the whole raw beetroot on a large sheet of oiled foil, add the thyme and garlic, and sprinkle with olive oil, salt and freshly ground black pepper. Close the foil to make a parcel and place on a baking tray. Roast for 30-35 minutes, or until the beetroot is tender. Cool, then peel and halve (you may wish to wear gloves while you peel the beetroot to protect your hands from staining). For the crubeens, remove the cling film from the sausages and cut it in half lengthways. Place each half cut-side down on a board and cut in half lengthways again. Now cut each quarter crossways into five 3-4cm\/1¼-1½in nuggets or crubeens. Mix the breadcrumbs and mustard powder together on a plate. Coat the crubeens in the flour, then in the beaten eggs and finally in the crumbs. Shallow-fry in hot corn oil for 2-3 minutes or until crisp and golden brown. Drain well.  To serve, put five crubeens and two beetroot halves on each plate with a spoonful of beetroot relish. Lightly dress the salad leaves with olive oil and salt and freshly ground black pepper, then put a pile of leaves on each plate. Serve the salad cream in a bowl. ","ingredients":" 900g\/2lb sea salt,  450g\/1lb light soft brown sugar,  1 tbsp saltpetre (optional; it isn't essential, but it improves the colour of the meat),  1 clove,  10 black peppercorns,  6 juniper berries,  4 garlic cloves, split in half,  1 bay leaf,  3 sprigs thyme,  6 pig's trotters, well cleaned and hairs removed,  bouquet garni,  selection of vegetables, cut into cubes (1 carrot, 2 celery sticks, 1 leek and 1 onion),  1 small ham hock,  1 bottle (75cl) dry white wine,  olive oil,  2 shallots, finely chopped,  handful chopped parsley,  2 tbsp English mustard,  100g\/4oz fine fresh white breadcrumbs,  2 tsp English mustard powder,  75g\/2¾oz plain flour,  2 large free-range eggs, beaten,  corn oil, for shallow-frying,  1 tsp English mustard,  1 tsp caster sugar,  2-3 tbsp white wine vinegar,  ¼ tsp white pepper,  ½ tsp salt,  150ml\/¼ pint evaporated milk,  150ml\/¼ pint organic rapeseed oil,  4 small raw beetroots,  1 onion, finely sliced,  olive oil,  salt and freshly ground black pepper,  2 tbsp red wine vinegar,  50ml\/2fl oz red wine,  1 tbsp freshly grated horseradish,  sugar, to taste,  4 small raw beetroot,  2 sprigs thyme,  1 garlic clove, unpeeled, crushed with the flat edge of a knife,  organic salad leaves and herbs in season, such as frisée, flat-leaf parsley, wood sorrel, pea shoots and dandelion,  olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crubeenspigstrotters_86182"}