{"recipe_name":"Crunchy chicken cutlets","author":"Nigella Lawson","programme":"Simply Nigella","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/crunchy_chicken_cutlets_21611_16x9.jpg","method":"Take the chicken out of the fridge so that it isn’t too cold by the time you get frying. If you are using filleted chicken breasts, rather than escalopes, then proceed as described in the tips section. Get out a shallow dish that, preferably, you can get both escalopes in, and spoon in the mustard and garlic. Add the cinnamon and egg and whisk to combine. Put the escalopes in, turn them, and leave to sit in the mixture while you prepare the \"crumbs\". Put the cornflakes in a bowl and crush them by hand. This, sadly, is not as brutal as it sounds: merely break them up with your fingers to get coarsely crushed flakes, but not dust. Add the pimentón or paprika and use a fork to mix in. Dredge the egg-and-mustard-soaked escalopes, one by one, in the cornflake crumbs, so that they are well covered, and then transfer to a wire rack for 5–10 minutes so they can dry out. Heat the oil in a cast-iron pan or heavy-based frying pan in which the chicken pieces will fit neatly. Once hot, fry the chicken for 3 minutes on the first side, then turn them over carefully and give them another 3 minutes, by which time the chicken should be cooked through in the middle, though do check. Remove to waiting plates, already strewn with tomatoes and rocket or salad leaves of your choice. ","ingredients":" 2 chicken escalopes or breast fillets (200–300g\/7-10½oz total), preferably organic,  70g\/2½oz Dijon mustard,  1 garlic clove, finely grated or minced,  ½ tsp ground cinnamon,  1 free-range egg,  75g\/2¾oz cornflakes,  1½ tsp pimentón picante or paprika,  2 tbsp sunflower oil,  cherry tomatoes,  rocket or salad leaves of your choice,  1 lemon, cut into wedges,  cherry tomatoes,  rocket or salad leaves of your choice,  1 lemon, cut into wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crunchy_chicken_cutlets_21611"}