{"recipe_name":"Crushed potatoes with hot smoked salmon, poached egg and hollandaise","author":"James Martin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a clean bowl, crush the potatoes with the back of a wooden spoon until mashed.   Add the mustard and chervil and season to taste with salt and freshly ground black pepper.   Placea 10cm\/4in chefs' rings onto a plate and top the potato with the smoked salmon. For the spinach, gently melt the butter in a frying pan over a medium heat, add the spinach and cook for 1-2 minutes or until the spinach has wilted. For the poached egg, bring a large pan of water to the boil and add the white wine vinegar. Whisk the centre of  the water to create a whirlpool. Crack the egg into the whirlpool and leave to poach gently for four minutes, or  until set. Carefully remove with a slotted spoon. For the hollandaise sauce, place the egg yolks into a food processor. Place the vinegar into a saucepan over a  high heat and reduce down to one tablespoonful. Add the vinegar to the egg yolks in the food processor and blend, while gradually pouring in the melted butter  with the motor running, to form a thick sauce. Season with salt and freshly ground black pepper. Add the lumpfish roe and stir.  Place the spinach into the centre of a serving plate.  Place the chefs' ring with potato and spinach on top, then  carefully remove the ring.  Place the poached egg on top and spoon over the lumpfish hollandaise. Serve immediately. ","ingredients":" 100g\/3½oz new potatoes, cooked hot,  1 tsp wholegrain mustard,  small bunch of fresh chervil, chopped,  55g\/2 oz smoked salmon,  15g\/¼oz butter,  100g\/3½oz baby spinach leaves,  1 free-range egg, for poaching,  1 tbsp white wine vinegar,  2 free-range egg yolks,  3 tbsp white wine vinegar,  110g\/4oz butter, melted,  salt and freshly ground black pepper,  2 tsp lumpfish roe","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/crushedpotatoeswithh_84388"}