{"recipe_name":"Cumberland rum Nicky","author":"Paul Hollywood","programme":"Paul Hollywood's Pies & Puds","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/cumberland_rum_nicky_17799_16x9.jpg","method":"Start by mixing all the filling ingredients, except the butter, together in a bowl. Set aside to soak while you make the pastry. For the sweet shortcrust pastry, mix the flour and icing sugar together in a bowl. Add the cubed butter and rub it in lightly with your fingertips until the mixture resembles fine breadcrumbs. Alternatively, do this in a food processor or a mixer and then transfer to a bowl. Mix the egg with the lemon juice and two tablespoons of cold water. Make a well in the centre of the flour mixture and pour in the egg mixture. Using a table knife, work the liquid into the flour to bring the pastry together. If it seems too dry, add a splash more water. When the dough begins to stick together, use your hands to gently knead it into a ball. Wrap in cling film and rest in the fridge for at least 15 minutes. Preheat the oven to 180C\/350F\/Gas 4. Once the dough has rested, cut it into two pieces, roughly one-third and two-thirds. Roll out the larger piece on a lightly floured work surface. Line a 20cm\/8in pie dish with the pastry, leaving any excess pastry hanging over the edge. Spread the filling in the pastry case and dot with the butter. Roll out the remaining pastry and cut it into eight long strips, roughly 1cm\/½in wide. On a sheet of baking parchment, use the pastry strips to create a lattice with four strips going each way, passing them under and over each other.  Dampen the edge of the pastry in the tin with water, then invert the lattice from the paper onto the tart. Press the ends of the strips to the pastry base to secure. Bake for 15 minutes, then turn the oven down to 160C\/325F\/Gas 3 and cook for a further 20 minutes. Meanwhile, for the rum butter, beat together the butter and sugar, then gradually beat in the rum. Refrigerate until needed. Serve the tart warm or cold, with a spoonful of rum butter. ","ingredients":" 225g\/8oz dates, coarsely chopped ,  100g\/3½oz dried apricots, coarsely chopped,  50g\/2oz stem ginger in syrup, drained and finely chopped,  50ml\/2fl oz dark rum,  50g\/1¾oz soft dark brown sugar,  50g\/1¾oz unsalted butter, cut into 1–2cm\/½-¾in cubes,  200g\/7oz plain flour,  2 tbsp icing sugar,  100g\/3½oz unsalted butter, chilled and cut into 1cm\/½in cubes,  1 free-range egg, lightly beaten,  1 tsp lemon juice,  100g\/3½oz unsalted butter, softened,  225g\/8oz soft light brown sugar,  75ml\/2½fl oz dark rum","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cumberland_rum_nicky_17799"}