{"recipe_name":"Aubergine moussaka with sautéed potatoes","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. Cut the aubergines in half, and carefully scoop out the flesh, leaving the skins to one side. Cut the aubergine flesh into small cubes. Heat a frying pan over a medium heat until hot, then add the olive oil and aubergines and fry for 2-3 minutes. Add the onion and garlic and fry for a further 2-3 minutes, until the onions have softened and the aubergines are starting to turn golden-brown. Add the lamb mince and cook for 4-5 minutes, until browned. Add the tomatoes, cumin, cinnamon, dried oregano and red wine and cook for 2-3 minutes, breaking up the tomatoes with a spoon as you cook. Add the mint and the stock. Bring to the boil, then reduce the heat and simmer for 15 minutes. Season, to taste, with salt and freshly ground black pepper. Spoon the aubergine mixture into the reserved aubergine skins and place onto a roasting tray. Place the butter into a pan over a medium heat. When the butter has melted, add the flour and cook, stirring well, for one minute. Add the hot milk and cook, stirring constantly, for 2-3 minutes, until the mixture has thickened. Add the eggs, season with salt and freshly ground black pepper, and add the nutmeg. Add half of the grated cheddar and mozzarella and continue to cook, stirring, until combined as a smooth sauce. Spoon equal amounts of the cheese sauce over the top of each of the stuffed aubergines, then sprinkle with the remaining grated cheddar and mozzarella. Transfer the stuffed aubergines to the oven to bake for 20-25 minutes, until the cheese topping is golden-brown and bubbling. Meanwhile, for the sautéed potatoes, heat a frying pan over a medium heat until hot. Add the olive oil and potatoes and fry, turning occasionally, for 7-8 minutes, or until golden-brown all over and tender. Season the potatoes with salt and freshly ground black pepper, then add the flatleaf parsley and stir well. To serve, place a stuffed aubergine onto each plate and place a spoonful of sautéed potatoes alongside. ","ingredients":" 2 aubergines,  2 tbsp olive oil,  1 large onion, chopped,  2 garlic cloves, crushed,  600g\/1lb 5oz lamb mince,  4 plum tomatoes, finely chopped,  1 tsp ground cumin,  1 tsp ground cinnamon,  ½ tsp dried oregano,  150ml\/5fl oz red wine,  2 tbsp chopped fresh mint ,  120ml\/4fl oz chicken stock,  salt and freshly ground black pepper ,  25g\/1oz butter,  25g\/1oz plain flour,  200ml\/7fl oz milk, heated to near-boiling,  2 free-range eggs, beaten,  pinch freshly grated nutmeg,  75g\/3oz cheddar cheese, grated,  75g\/3oz mozzarella cheese, grated,  2 tbsp olive oil,  3 white potatoes, peeled and cut into cubes,  salt and freshly ground black pepper ,  2 tbsp flatleaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/auberginemoussakawit_88436"}