{"recipe_name":"Cured river trout, Jersey Royal crisps, ricotta and preserved lemon","author":"Jon Rotheram","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 2 as a main, or 4 as a starter","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To cure the trout fillets, mix all the cure ingredients in an airtight container and cover the fillets completely with the mix. Seal with the lid, place in the fridge and leave for 24 hours.  When the fish is cured, cut into pieces and use a chef’s blowtorch to char the skin.  For the preserved lemons, place 100ml\/3½oz water, the sugar and vinegar in a pan. Heat until the sugar is dissolved and you have a syrup, remove from the heat. While still warm, add the lemon slices then transfer to a sterilised jar with a lid. Leave for at least 24 hours before using. Preheat a deep fat fryer to 150C\/300F (CAUTION: hot oil can be dangerous. Do not leave unattended).  For the crisps, run the potato slices under cold water for 10 minutes to remove the starch. Drain on kitchen paper. Meanwhile, mix the lemon juice with the olive oil in a small bowl or jug. When the potato slices are dry, deep fry them until crisp. Set aside on kitchen paper until ready to serve. Sprinkle with a little salt, if using. To make a salad, put the mustard cress, peas and wild fennel in a salad bowl. Add the lemon oil and season with salt and pepper, to taste.  To serve, spread the ricotta on the bottom of serving plates. Place the cured trout on top and then the salad. Finish with the crisps scattered around the plate and a few slices of preserved lemon. ","ingredients":" 1 rainbow trout, filleted, skin-on, pin boned,  200g\/7oz salt,  200g\/7oz sugar,  10 fennel seeds,  10 coriander seeds,  1 star anise, crushed,  70g\/2½oz sugar,  50ml\/2fl oz white wine vinegar,  1 lemon, finely sliced on a mandoline,  vegetable oil, for deep frying,  4 Jersey Royal potatoes, finely sliced on a mandolin,  1 lemon, juice only,  100ml\/3½fl oz extra virgin olive oil,  salt and pepper,  2 tbsp mustard cress,  100g\/3½oz fresh peas, podded ,  10g wild fennel,  70g\/2½oz ricotta","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/cured_river_trout_jersey_87210"}