{"recipe_name":"Curried cod pasties","author":"Paul Hollywood","programme":"Paul Hollywood's Pies & Puds","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 6 pasties","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. Start by making the chapati dough. Mix the flour and salt together in a bowl. Add the oil then gradually add 160ml\/5½fl oz water to form a dough. Knead the dough on a lightly floured work surface for 5-10 minutes, until elastic and smooth. Place in an oiled bowl and leave to rest for 30 minutes. To make the filling, squeeze the roasted garlic cloves from their skins into a bowl. Add the ginger, salt and garam masala. Mix to combine. Add the tomatoes and stir. Gently stir the cod portions into the mixture to coat. Heat the oil in a large frying pan. When the oil is hot, add the carom seeds and cook until they darken in colour.  Place the coated cod pieces into the pan and pour over the tomato mixture. Once the sauce begins to boil, reduce the heat and simmer for three minutes. Turn the cod and cook for a further 3-4 minutes, or until the cod is just cooked.  Remove the cod from the pan and set aside. Cook the sauce until the volume of liquid has reduced to a thick sauce. Tip the chickpeas into the sauce and stir.  Remove from the heat and set aside to cool. Divide the chapati dough into six equal pieces. Roll each piece into a ball, then use a rolling pin to roll each ball into a thin disc, about 18cm\/7in in diameter. Take the cooled sauce and flake the cod into it. Place spoonfuls of the filling into the centre of the chapati discs. Brush the edges with water. Bring the edges of the dough together around the filling and crimp the top to seal. Place on a baking tray and bake for 30-35 minutes, or until the dough is crisp and golden-brown. ","ingredients":" 250g\/9oz strong wholemeal flour,  5g salt,  4 tsp olive oil,  6 garlic cloves, roasted in their skins until soft,  15g\/½oz fresh ginger, finely chopped,  2 tsp salt,  2 tsp garam masala,  3-4 small green chillies, finely chopped with seeds kept in,  1 x 400g\/14oz tin plum tomatoes,  350g\/12oz cod fillets, skinned,  1 tbsp vegetable oil,  2 tsp carom seeds (also known as ajwain seeds),  1 x 215g\/8oz tin chickpeas, rinsed and drained","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/curried_cod_pasties_28943"}