{"recipe_name":"Curried lamb cutlets with tomatoes and green sauce","author":"Valentine Warner","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb cutlets, put all the ingredients except the lamb into a pestle and mortar. Grind to a paste. Rub the paste all over the lamb cutlets and place in the fridge to marinate for at least an hour.   For the tomatoes, heat the oven to 100C\/80C Fan\/Gas ¼ and line a baking tray with baking paper. Place the tomatoes on the lined baking tray and put a small knob of butter on each half. Spot with red wine vinegar and scatter over the brown sugar, salt and pepper. Roast until nearly dried (semi juicy and totally lacking in wateriness), this will take 1-2 hours. For the lamb cutlets, heat a large frying pan and add the butter and oil, once hot add the lamb cutlets and sear on each side. Set aside to rest.  For the green sauce, mix all the ingredients together in a bowl.  To serve, place the slow roasted tomatoes onto serving plates and top with the green sauce. Place the lamb next to the tomatoes and scatter with toasted almonds. Serve a wedge of lemon on the side. ","ingredients":" 1½ tsp garam masala,  1 tsp ground turmeric,  ½ tsp chilli powder ,  1 tsp fennel seeds ,  ½ tsp cumin seeds ,  ½ tsp coriander seeds ,  10 cardamom pods, seeds removed ,  1 garlic clove, grated ,  1 tsp salt,  4 tbsp olive oil ,  2 lemons, juice only,  8 lamb cutlets,  6 plum tomatoes,  50g\/1¾oz unsalted butter,  ½ tsp salt,  1 tbsp red wine vinegar,  30g\/1oz brown sugar,  2 tbsp chopped fresh tarragon,  2 tbsp chopped fresh coriander,  2 tbsp chopped curly parsley,  2 tsp Dijon mustard,  1 tsp red wine vinegar,  4-6 tbsp olive oil ,  50g\/1¾oz toasted slivered almonds,  1 lemon, cut in quarters","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/curried_lamb_cutlets_41998"}