{"recipe_name":"Custard tart with sugared walnuts, ice cream and caramel","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, put the flour, sugar, butter and vanilla seeds in a bowl and rub together using your fingertips until the mixture resembles breadcrumbs. (Alternatively, pulse in a food processor).  Lightly beat the whole egg and pour it into the flour mixture. Stir the mixture together until it forms clumps, then bring together with your hands to form a dough. Wrap in cling film and rest in the fridge for 30 minutes. Preheat the oven to 200C\/180C Fan\/Gas 6.  Roll out the pastry and line a 30cm\/12in loose-bottomed flan tin, leaving any excess pastry hanging over the edge - do not trim until after the pastry has been cooked. Line with baking paper and fill with baking beans or uncooked rice. Bake for 8-10 minutes. Remove the baking paper and baking beans. Reduce the oven temperature to 150C\/130C Fan\/Gas 2.  For the custard filling, heat the cream in a saucepan without letting it boil.  In a bowl, beat the egg yolks and caster sugar for 3-4 minutes until pale and thick. Gradually whisk the hot cream into the mixture, being careful not to let the egg yolks curdle. Pour the mixture into the cooked pastry case. Sprinkle with the allspice.  Bake for 50 minutes or until the custard is set. Remove from the oven, trim the pastry edges carefully and leave to cool.  For the ice cream, whip the cream until soft peaks form when the whisk is removed. Place the cream in a large bowl and fold in the honey and walnuts. Pour the mixture into a container and place into the freezer to set for about 15 minutes. For the walnuts, make a syrup by heating the sugar with 100ml\/3½fl oz water until the sugar is dissolved. Bring to the boil and add the walnut halves. Remove from the heat and set aside to cool. Drain the walnuts and discard the syrup. In a deep frying pan or sauté pan, heat a little rapeseed oil until hot. Shallow fry the walnuts until crisp (approximately 30 seconds), then drain on kitchen paper.  Paint a stripe of caramel on the serving plates and top with a slice of the custard tart. Add a spoonful of walnut ice cream. Garnish with candied sugared walnuts and lemon balm. ","ingredients":" 225g\/8oz plain flour,  50g\/1¾oz caster sugar,  125g\/4½oz butter, slightly softened,  1 vanilla pod, seeds scraped out,  1 free-range egg,  750ml\/1¼ pint whipping cream,  12 egg yolks,  115g\/4oz caster sugar,  ½ tsp ground allspice,  200ml\/7fl oz double cream,  1 tbsp clear honey,  100g\/3½oz walnuts, shells removed, chopped,  100g\/3½oz caster sugar,  100g\/3½oz walnut halves,  rapeseed oil,  caramel,  lemon balm leaves","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/custard_tart_with_53199"}