{"recipe_name":"Custard tart with Earl Grey poached prunes","author":"Jun Tanaka","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4 and grease a 22cm\/9in flan tin. For the pastry, mix the flour, egg and yolks, butter and sugar in a food processor to form a soft dough. Form the pastry into a thick disc, wrap in cling film and place in fridge until firm. (About 20minutes.) Roll out the pastry into a shape large enough to cover the tin. Press the pastry into the tin and cover with a piece of baking parchment. Fill with baking beans  and blind bake for 15 minutes, or until the pastry is just beginning to colour. Set aside to cool. Pour the full-fat milk into a heavy-based saucepan. Add the vanilla pod and seeds. Bring just to the boil, then remove from the heat.  Put egg yolks into a large bowl with the caster sugar and whisk until thick and pale. Slowly pour the vanilla-infused milk through a sieve onto the egg mixture, stirring constantly. Discard the pod and set the custard aside to cool slightly.  Reduce the oven temperature to 100C\/225F\/Gas ¼. Pour the custard into the pastry tin and bake for a further 45 minutes. Meanwhile, for the prunes, combine 150ml\/5fl oz water and the sugar in a pan. Heat gently, stirring, until the sugar has dissolved. Add the tea bags and bring to the boil.  Add the prunes and set aside to allow the prunes to soak up the tea. When cool, remove the tea bags. Once the tart has cooked (there should just be a bit of a wobble in the centre of the tart when it is shaken slightly), remove from the oven and set aside to cool. To serve, reheat the prunes and serve alongside slices of the custard tart. ","ingredients":" 750g\/1lb 10oz plain flour,  1 free-range egg, plus 2 free-range egg yolks ,  225g\/8oz unsalted butter,  150g\/5½oz caster sugar,  500ml\/18fl oz full-fat milk,  1 fresh vanilla pod, split and seeds scraped out,  5 free-range egg yolks,  80g\/3oz golden caster sugar,  50g\/1¾oz caster sugar,  2 Earl Grey tea bags,  150g\/5½oz prunes","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/custard_tart_with_earl_25616"}