{"recipe_name":"Da Dong-inspired Peking duck salad","author":"Ching-He Huang","programme":"Exploring China: A Culinary Adventure","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2-4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the apple and pear slices down the centre of a large, long, rectangular serving plate, to make heart shapes. Place some red radish strips down the middle of the hearts, then top with spring onion strips. Decorate the rest of the plate with sprinkles of Sichuan pickle.  Pour the oil into a wok and heat to 180C\/350F, or until a cube of bread turns golden-brown in 15 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Dust the duck pieces with Chinese five-spice and then with the cornflour. Lower the pieces into the hot oil and deep-fry until crispy and the edges of the cornflour have turned golden-brown. Lift out and drain on kitchen paper. Place the duck down the middle of the apple, pear, radish and spring onion strips on the serving plate.  Mix together all the dressing ingredients in a small bowl. Spoon some of this dressing over the duck pieces. Garnish the duck with micro herbs and decorate the plate with some edible yellow flowers. ","ingredients":" 1 Granny Smith apple, unpeeled, halved, cored and sliced into thin half-moon shapes,  1 Chinese pear, halved and sliced into thin half-moon shapes ,  1 large red radish, sliced lengthways into julienne strips ,  1 spring onion, sliced lengthways into julienne strips,  1 tbsp Sichuan pickle or grated red radish mixed with a splash of rice vinegar,  500ml\/17fl oz vegetable oil ,  250g\/9oz Peking roast duck, boned and cut into small pieces,  ¼ tsp Chinese five-spice powder,  2 tbsp cornflour ,  3 tbsp wheat flour bean paste (tian mian jiang), or alternatively 1 part yellow bean paste mixed with 4 parts Hoisin sauce),  1 tbsp sugar ,  2 tbsp Chinese black rice vinegar (or balsamic vinegar) ,  1 tbsp XO sauce (available online) or, alternatively, ½ tbsp each chilli sauce and chilli oil,  small handful of micro herbs ,  small handful of edible yellow flowers (such as evening primrose or nasturtiums)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/da_dong-inspired_peking_72250"}