{"recipe_name":"Dal chicken with chilli paneer and naan","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03dy2kx.jpg","method":"For the naan, place the flour, yeast and baking powder into a free-standing food mixer fitted with a dough hook, or use a large bowl and a hand-held electric whisk fitted with a dough hook. Add the egg, sugar and salt and mix well to combine. Add the yoghurt and milk and continue to mix until the mixture comes together as a soft dough.  Set the dough aside, in the bowl, for 1 hour, or until risen, then turn out onto a lightly floured work surface and knead briefly until smooth and elastic. Set aside until needed. Divide the dough into 6 equal-sized balls, then place them onto a floured tray, cover them with a clean tea towel and set aside once more at room temperature for another 1 hour. Meanwhile, for the dal chicken, heat half of the vegetable oil in a large, heavy-based, lidded frying pan over a high heat. Add the dried chillies and fry for 1 minute, then add the green chillies and onion and fry for 3-4 minutes, or until lightly coloured. Stir in the curry leaves, ginger and garlic and continue to fry. In a bowl, mix the chilli powder, ground cumin, coriander and turmeric with 150ml\/5fl oz of the chicken stock to form a paste. Add the paste to the pan and cook until you see the oil separate from the mixture – about 2-3 minutes. Add the lentils and their soaking water to the pan and bring the mixture to the boil, stirring well. Season, to taste, with the salt, then reduce the heat until the mixture is simmering, cover the pan with the lid and simmer for 4-5 minutes.  Add the butter to the pan, cover once more and continue to simmer while you cook the chicken. Heat the remaining oil in a separate saucepan over a medium heat. Fry the chicken for 3-4 minutes, or until golden-brown on both sides and almost cooked through. Transfer the lentil mixture to the pan containing the chicken, then stir in the tinned tomatoes and remaining chicken stock. Return the mixture to a simmer and simmer for another 5-10 minutes, or until the chicken is cooked through with no trace of pink remaining and the lentils are tender.  Stir in the tamarind paste, brown sugar, coriander and mint and season again, to taste. Loosen the mixture with a little more stock if it is too thick. For the chilli paneer, heat a wok over a high heat, then add enough oil to reach 2.5cm\/1in up the sides. When the oil is just shimmering, carefully lower the paneer into the pan in batches and fry until golden-brown all over. Transfer each batch to a sieve suspended over a bowl. Discard the majority of the oil, leaving enough to just coat the bottom of the wok.  Add the pine nuts, chilli, ginger and garlic to the wok and stir-fry for 1-2 minutes. Add the red onion and peppers and stir-fry for another 1-2 minutes, then add the vinegar, soy sauce and chicken stock and bring to the mixture to a simmer.  Add the spring onions and continue to simmer for 1-2 minutes, then whisk in the cornflour paste and continue to cook until the sauce has just thickened. Stir in the drained paneer. Garnish with coriander. Preheat the oven to its highest setting. Place a heavy-based baking tray or pizza stone into the oven as it heats up. Stretch each dough ball into a flat oval shape using your hands. Bake the naans in the oven for 4-5 minutes, or until slightly risen and golden brown, then keep warm. Just before serving, brush their surfaces with melted butter. To serve, transfer the chicken dal to a large serving bowl. Stack the naans on a serving plate alongside. Spoon the chilli paneer onto a separate serving plate. Let everybody help themselves. ","ingredients":" 450g\/1lb plain flour, plus extra for dusting,  2 tsp fast-action dried yeast,  1 tsp baking powder,  1 free-range egg,  1 tsp caster sugar,  pinch sea salt,  150g\/5oz plain yoghurt,  150ml\/5fl oz milk,  50g\/2oz butter, melted,  4 tbsp vegetable oil,  2 whole dried red chillies, torn or chopped, seeds removed,  2 long green chillies, finely chopped,  2 onions, finely chopped,  1 tbsp finely chopped fresh curry leaves,  5cm\/2in piece fresh root ginger, peeled, finely chopped,  6 garlic cloves, finely chopped,  1 tsp hot red chilli powder,  1 tsp ground cumin,  2 tsp ground coriander,  1 tsp turmeric,  300ml\/10½fl oz chicken stock,  250g\/9oz red lentils, rinsed, then soaked in 250ml\/9fl oz water for 15 minutes,  1 tsp salt,  40g\/2½oz butter,  6 boneless, skinless chicken thighs, cut into chunks ,  1 x 200g tin tomatoes,  1 tbsp tamarind paste,  1 tbsp soft dark brown sugar,  1 small bunch fresh coriander, roughly chopped, plus extra to serve,  2 tbsp roughly chopped fresh mint leaves,  vegetable oil, for shallow frying,  450g\/1lb paneer, cut into thin strips about 1cm\/½in wide 3cm\/1¼in long,  50g\/2oz pine nuts,  4 long green chillies, finely sliced,  8 garlic cloves, finely diced,  5cm\/2in piece fresh root ginger, peeled and finely diced,  1 red onion, finely sliced,  1 green pepper, finely sliced,  1 long red pepper, finely sliced,  50ml\/2fl oz white wine vinegar,  75ml\/2¾fl oz light soy sauce,  250ml\/9fl oz chicken stock,  3 spring onions, trimmed, finely sliced,  1 tbsp cornflour, mixed to a paste with 3 tbsp cold water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dahl_chicken_with_chilli_24406"}