{"recipe_name":"Dark chocolate fondant with hot chocolate sauce, banana fritters and ice cream","author":"James Martin","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ice cream, spread the banana chunks out on a tray and freeze until frozen all the way through (about one hour). Place the frozen banana chunks into a food processor. Add the vanilla, sugar (or honey\/sweetener) and half of the buttermilk (or yoghurt). Turn on the processor and blend for a few moments. Then, while the processor is still running, pour in the remaining buttermilk in a thin, steady stream (if you are using yoghurt, just tip it all in and blend). Blend until the mixture is smooth and creamy. Set aside in the freezer and take out a little before you are ready to serve. For the dark chocolate fondants, finely grate 40g\/1½oz of the chocolate and set aside.   Melt half the butter and brush liberally all over the inside of eight ramekins.  Dust well with the grated chocolate, shaking out any excess. Set aside on a baking sheet. Melt the remaining chocolate (including any shaken out excess) and butter in a small heatproof bowl over a pan of barely simmering water (do not let the bowl touch the water), or melt it in a microwave-proof bowl in a microwave on full power for 2-3 minutes, stirring once.  Do not overheat or the chocolate will ‘seize’, or turn solid.  Scrape this mixture into a bigger bowl, then beat in the ground almonds, egg yolks and cornflour. Whisk the egg whites in a separate bowl until they form stiff but not dry peaks. Gradually beat in the caster sugar.  A hand-held electric whisk is best for this. Fold the egg-white mixture into the melted chocolate mixture.   Spoon the combined mixture into the ramekins. Smooth the tops of the fondants and chill in the refrigerator while you heat the oven to 180C\/350F\/Gas 4. Bake the fondants in the oven for 6-8 minutes, or until risen and set. For the banana fritters and ice cream, sift the flour, cornflour and baking powder together into a bowl then stir in the water and sesame oil.  Add the bananas and gently mix until coated.  Fill a wide pan half full with vegetable oil and heat until hot, or alternatively heat a deep fat fryer to 180C\/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Carefully lower the battered bananas into the oil and deep-fry until golden-brown, then drain on paper towels.  To make the caramel, place the sugar in a frying pan and heat until all the sugar has melted. Increase the heat and continue cooking without stirring, until the syrup becomes a light caramel colour. Add the sesame seeds and stir well. Remove from the heat and carefully add one banana fritter at a time to the hot caramel (CAUTION: The caramel will be very hot). Turn the fritter over with a fork to completely coat it in caramel, then remove immediately and plunge into a bowl of iced water. Remove and drain on a wire rack while cooking the remaining fritters. For the hot chocolate sauce, melt the chocolate in a bowl set over a pan of simmering water (make sure the bottom of the bowl does not touch the water).  Heat the sugar in a pan with 100ml\/3½oz water, stirring until the sugar dissolves. Bring to the boil.  Stir the sugar syrup into the melted chocolate until smooth and shiny.  To serve, place the chocolate fondants on serving plates along with the banana fritters. Add a scoop of ice cream and pour the chocolate sauce over it. ","ingredients":" 4 very ripe bananas, peeled, cut into chunks ,  ¼ tsp vanilla essence,  3-4 tbsp sugar, honey or sweetener, to taste,  150ml\/5fl oz buttermilk or 150g\/5½oz Greek-style yoghurt,  200g\/7oz dark chocolate (minimum 60% cocoa solids),  100g\/3½oz butter,  35g\/1¼oz ground almonds,  2 large free-range eggs, separated,  35g\/1¼oz cornflour,  85g\/3oz caster sugar,  175g\/6oz plain flour,  125g\/4½oz cornflour,  1 tsp baking powder,  250ml\/9fl oz sparkling water,  4 tsp sesame oil,  4 bananas, cut into chunks,  vegetable oil, for deep frying,  250g\/9oz caster sugar ,  3 tbsp sesame seeds ,  iced water,  175g\/6oz plain chocolate, broken into pieces,  50g\/1¾oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dark_chocolate_fondant_07896"}