{"recipe_name":"Dartmoor raspberry mousse with vanilla rice pudding ice cream","author":"Michael Caines","programme":"Great British Menu","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the meringue, dissolve the sugar in 75ml\/3fl oz of water, then boil to the soft ball stage (120C on a sugar thermometer).  Whisk the egg whites until they form soft peaks. Slowly pour the sugar syrup onto the whites while whisking. Continue whisking until cold.  For the mousse, purée the raspberries in a food processor, then pass through a sieve to remove the seeds. Warm some of the purée in a saucepan.  Gently squeeze dry the gelatine, add to the warm purée and stir until completely melted. Add to the rest of the purée and stir through. Leave in a cool place or fridge until starting to set, then fold in 190g\/7oz of Italian meringue followed by the whipped cream.  Place four 6 x 6cm\/2½ x 2½in chefs' rings on a flat baking tray lined with parchment paper. Pipe the mousse into the rings and leave to set in the fridge.  To make the jelly, place the raspberries, sugar and lemon juice in a saucepan with 100ml\/3½fl oz of water. Cover with clingfilm and bring to the boil, then immediately remove from the heat. Drain in a sieve set over a bowl lined with a muslin cloth. Gather up the cloth and leave to hang over a bowl so the clear juice filters through. Reserve the cooked raspberries.  Place the gelatine leaves into cold water, leave to soften for 10 minutes, then gently squeeze dry the gelatine.  Warm a little of the raspberry juice, add the gelatine and stir to melt completely. Put the cooked raspberries in the bottom of four shot glasses. Fill up the glasses with the juice mixture and leave to set in the fridge.  Next make the rice pudding for the ice cream. Blanch the rice in boiling water for 2-3 minutes, then drain and refresh in running cold water.  Return to the saucepan and add the sugar, vanilla pod and seeds, coconut and milk. Bring to the boil, then cook for 30 minutes, stirring from time to time. The mixture should be boiling to reduce the cooking liquid. Tip the rice into a colander and leave to drain.   For the clotted cream curd, cream together the eggs, egg yolks and sugar. Bring the milk to the boil, then stir into the creamed mixture. Pour back into the saucepan and cook for a few minutes until a thickened custard is formed.  Put the clotted cream in a blender and add the custard. Blend well until smooth, then place in a bowl and allow to cool. Combine with the rice pudding (discard the vanilla pod) and churn in an ice cream maker - do this just before serving, so as not to freeze the rice. To serve, turn out each mousse at the end of an oval plate and dress the top with fresh raspberries. Place a shot glass at the other end of each plate and top the jelly with a ball of ice cream. Decorate the plate with a few raspberries and the remaining raspberry sauce. ","ingredients":" 200g\/7oz caster sugar,  4 free-range egg whites,  200g\/7oz raspberries ,  3 gelatine leaves, soaked in water for at least 10 minutes,  200ml\/7fl oz whipping cream, whipped until thick  ,  200g\/7oz raspberries ,  40g\/1½oz sugar,  ½ lemon, juice only,  2 gelatine leaves, soaked in water for at least 10 minutes,  200g\/7oz pudding rice,  200g\/7oz caster sugar,  1 vanilla pod, split and seeds scraped out  ,  50g\/2oz desiccated coconut ,  1 litre\/1¾ pints milk,  3 free-range eggs,  6 free-range egg yolks,  100g\/3½oz caster sugar,  190ml½fl oz milk,  200g\/7oz clotted cream,  120g\/4½oz raspberries","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dartmoorraspberrymou_81706"}