{"recipe_name":"Deep-fried crab spring rolls with spiced fresh mango salad","author":"Richard Phillips","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crab mayo, put the crab shell and vegetable oil in a pan and heat to warm. Remove from the heat and set aside to infuse the oil with the crab flavour. Strain the crab-flavoured oil into a jug. Put the egg yolks in a bowl and whisk.  Gradually whisk in the drained oil, adding a little at a time. Stir in the Dijon mustard, add the brown crabmeat and combine. Set aside. For the spring rolls, mix all the ingredients in a bowl except the pastry and oil, adding the lemon juice, soy sauce and oyster sauce to taste. Lay one sheet of pastry on a clean work surface, spread a twelve of the mixture in a line along one end of the pastry. Gently roll tucking in the edges. Repeat with the remaining pastry.   Preheat the oil in a deep fat fryer to 180C\/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep fry each spring roll for a few minutes until crisp and golden-brown. Carefully remove with a slotted spoon and transfer to a plate lined with kitchen paper. For the spiced fresh mango salad, in a pan heat 250ml\/9fl oz water, the sugar and vinegar. Add the star anise, cardamom, cinnamon stick and chilli. Bring to the boil and set aside to cool down. Gently toss the baby spinach leaves in the sesame oil in a bowl and sprinkle over the sesame seeds.  To serve, put a few of the leaves on each plate, coat the mango cubes in the dressing and drizzle it on top of the leaves. Place the spring rolls on top with a generous spoonful of the mayo. ","ingredients":" 1 crab shell,  100ml\/3½fl oz vegetable oil,  2 free-range egg yolks,  1 tbsp Dijon mustard,  picked brown crabmeat from 1 crab,  200g\/7oz picked white crabmeat,  3 tbsp chopped spring onion,  3 tbsp chopped mooli,  1 tbsp chopped fresh coriander,  squeeze of lemon juice, soy sauce and oyster sauce, to taste,  12 sheets filo pastry,  vegetable oil, for deep-fat frying,  50g\/1¾oz sugar,  50ml\/2fl oz white wine vinegar,  5 star anise ,  3 cardamom pods,  1 cinnamon stick,  1 red chilli,  200g\/7oz baby spinach,  1 tbsp sesame oil,  2 tsp sesame seeds ,  2 mangoes, cubed (or 350g\/12oz prepared mango)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/deep-fried_crab_spring_20161"}