{"recipe_name":"Deep-fried doughnuts (struffoli)","author":"Antonio Carluccio and Gennaro Contaldo","programme":"Christmas Kitchen","prep_time":"over 2 hours","cooking_time":"less than 10 mins","serves":"Makes 10-12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the doughnuts, put the flour into a large bowl and make a well in the centre. Add the remaining doughnut ingredients, except for the fat, to the well. Gradually stir the ingredients using a wooden spoon or your hands, until the mixture comes together as a soft dough. Cover the bowl with a clean tea towel and set aside to rest in a cool room for 2-3 hours. Once the dough has rested, tear small pieces from it and roll them into equal-sized sausage shapes about 1cm\/½in thick. Cut each sausage into little pellets about 1cm\/½in long. Heat the oil or lard in a deep, heavy-based saucepan over a medium heat, until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.) Carefully lower the dough pellets into the hot fat, in batches if necessary. Fry for 2-3 minutes, or until crisp and golden-brown. Remove from the fat using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining dough pellets. Set all of the struffoli aside to cool. Meanwhile, for the sauce, heat the sauce ingredients in a saucepan over a low heat, stirring well until the sugar has melted. Bring the mixture to a simmer and simmer for 3-4 minutes, or until the sauce has the consistency of syrup. Set aside to cool. To serve, pile the struffoli onto a serving platter and drizzle over the sauce. Decorate with candied citrus peel, if desired. ","ingredients":" 500g\/1lb 2oz type '00' pasta flour,  5 free-range eggs,  4 tbsp caster sugar,  1 lemon, finely grated zest only,  1 orange, finely grated zest only,  2 tbsp vodka or whisky,  pinch salt,  olive oil or lard, for deep-frying,  250g\/9oz runny honey,  100g\/3½oz caster sugar,  2 tbsp water,  1 tangerine, peel only, julienned,  candied citrus peel, to serve (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/deep-fried_doughnuts_39832"}