{"recipe_name":"Deep-fried Goosnargh egg with wild mushroom, toasted brioche and truffle mayonnaise","author":"James Martin","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the deep-fried egg, bring a large saucepan of water to the boil, add the vinegar and a pinch of salt. Boil four of the eggs for 5½ minutes. Remove the eggs from the saucepan using a slotted spoon, and leave to chill in a bowl of iced water. Whisk the remaining egg in a bowl with a pinch of salt and freshly ground black pepper. Peel the boiled eggs. Prepare a shallow plate of flour and a separate plate of breadcrumbs. Dredge the boiled eggs in the flour, then dip into the beaten egg  and roll in the breadcrumbs. Set aside on a tray in the fridge until needed. Meanwhile for the truffle mayonnaise, place the egg yolks, white wine vinegar and mustard into a food processor and blend until pale and creamy. With the motor running, pour in the oil, in a slow steady stream, until the mayonnaise is thick (you may not need all the oil). Mix in the lemon juice and truffle. Set aside in the fridge until needed. For the wild mushrooms, heat a large frying pan over a medium heat, add half of the butter and fry the brioche croûtons until golden-brown on each side. Drain onto kitchen paper then carefully stamp out a small hole with a 2.5cm\/1in round cutter at one end of the croûton. Place onto the serving plates. Return the frying pan to the heat, add the remaining butter and the mushrooms and gently fry over a high heat for 2-3 minutes, or until just tender. Season with salt and freshly ground black pepper, then stir in the chives. To cook the eggs, heat the oil in a deep-fat fryer to 180C\/350F. Alternatively, pour the oil into a deep, heavy-based pan to a depth of 2cm\/¾in and bring to the same temperature on the hob, checking with a sugar thermometer. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Fry the eggs until golden-brown all over. Remove with a slotted spoon, drain on kitchen paper and season with salt. To serve, carefully place each egg into the hole on each brioche croûton and take a slice off of the top to just show the yolk. Pile the mushrooms onto the other end of the croûton, then spoon a little truffle mayonnaise directly in the middle in front of the croûton. Scatter some pea shoots around and then finish with a drizzle of the chicken demi-glace around the edge.  ","ingredients":" 2 tbsp white wine vinegar,  5 free-range eggs,  salt and freshly ground black pepper,  110g\/4oz plain flour,  200g\/7oz fresh breadcrumbs,  vegetable oil, for deep frying,  2 free-range eggs, yolks only,  2 tsp white wine vinegar,  1 tsp Dijon mustard,  300ml\/10fl oz rapeseed oil,  1 tsp lemon juice ,  1 English truffle, finely grated,  sea salt, to taste,  75g\/3oz butter,  4 slices of brioche, 12.5cm\/5in long, 5cm\/2in wide and 5mm\/¼in thick,  200g\/7oz mixed wild mushrooms, cleaned ,  1½ tbsp finely chopped chives,  1 small punnet pea shoots,  4 tbsp chicken demi-glace, warmed (200ml\/7floz chicken stock simmered over a low heat until reduced to 4 tbsp)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/deep-fried_goosnargh_87087"}