{"recipe_name":"Deep-fried soft-boiled egg with mushrooms, toasted brioche and herb mayonnaise","author":"James Martin","programme":"Christmas Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the deep-fried egg, bring a large saucepan of water to the boil, add the vinegar and a pinch of salt. Boil 4 of the eggs for 5 minutes. Remove the eggs from the saucepan using a slotted spoon, and leave to chill in a bowl of ice-cold water. Crack the remaining egg into a bowl. Whisk with a pinch of salt and pepper. Peel the boiled eggs. Prepare a shallow plate of flour and a separate plate of breadcrumbs. Dredge the boiled eggs in the flour, then dip into the beaten egg and roll in the breadcrumbs. Set aside on a tray in the fridge until needed. Heat the oil in a deep-fat fryer to 180C\/350F. Alternatively, pour the oil into a deep, heavy-based pan to a depth of 2cm\/¾in and bring to the same temperature on the hob. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Fry the eggs until golden-brown. Remove with a slotted spoon, drain on kitchen paper and season with salt. Heat a frying pan, add the butter and olive oil. Add the shallot and gently fry for 3 minutes, until just softened. Add the garlic and mushrooms and cook until the mushrooms have released their liquid and are tender. Season with salt and pepper. Heat a clean frying pan. Lay the brioche in the hot pan and toast each side until golden-brown. For the mayonnaise, put the egg yolks, vinegar and mustard in a food processor and blend until pale and creamy.  With the motor running, pour in a steady stream of oil until the mayonnaise is thick (you may not need all the oil). Just before serving add the herbs and blend. To serve, cut a hole in the slices of brioche and sit the eggs in the holes. Dress the plate with mushrooms and mayonnaise. ","ingredients":" 2 tbsp white wine vinegar ,  5 free-range eggs ,  110g\/4oz plain flour ,  200g\/7oz fresh breadcrumbs ,  vegetable oil, for deep-frying ,  50g\/1¾oz butter,  1 tbsp olive oil,  1 banana shallot, finely chopped,  1 garlic clove, finely chopped,  300g\/10½oz mixed wild mushrooms, torn into pieces if large,  ½ loaf brioche, cut into thick slices,  2 egg yolks,  2 tsp white wine vinegar,  1 tsp Dijon mustard,  300ml\/10fl oz vegetable oil,  4 tbsp chopped fresh parsley,  2 tbsp chopped fresh tarragon,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/deep-fried_soft-boiled_22870"}