{"recipe_name":"Deep-fried chicken wings with barbecue sauce and griddled fillet steak with chilli sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the BBQ sauce with deep fried chicken wings, heat the oil for deep-frying to 180C\/350F (use a cooking thermometer) in a deep-sided pan not more than half full, or alternatively use a deep fat fryer. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Season the chicken with salt and pepper and place in the deep fat fryer. Cook for 6-8 minutes or until golden-brown and crisp. When cooked, remove with a slotted spoon and leave to drain on kitchen paper. Season to taste with more salt. Fry the onion and garlic in olive oil with the chilli, fennel seeds and sugar for 2-3 minutes. Add the soy sauce and ketchup and season with salt and pepper. Bring to the boil and simmer for a few minutes to combine the flavours. For the chilli sauce with griddled fillet steak, heat a large frying pan and, when hot, add the vinegar, sugar and soy sauce and bring to the boil. Add two of the red chillies, the chipotle chilli and ginger. Cook for 2-3 minutes, or until the mixture is thickened and sticky. Heat the oil in a griddle pan. Rub the steaks with oil and salt and pepper. Place on the hot griddle pan and cook each side for a couple of minutes (depending on how rare you like your steaks). Serve the chicken wings in a bowl with the sauce over the top and sprinkle with half the flatleaf parsley. To serve the steak, slice the steak, spoon the sauce over and garnish with chopped parsley and the remaining red chilli. ","ingredients":" olive or sunflower oil, for deep-frying ,  12 free-range chicken wings, tips removed,  salt and freshly ground black pepper,  1 small onion, finely chopped,  3 garlic cloves, finely chopped,  1 tbsp olive oil, for frying,  1 red chilli, finely chopped,  1 tsp fennel seeds, crushed,  55g\/2oz dark brown sugar,  50ml\/1¾fl oz dark soy sauce,  300ml\/10½fl oz tomato ketchup,  150ml\/5fl oz rice wine vinegar,  150g\/5½oz caster sugar,  4 tbsp soy sauce,  3 red chillies, finely chopped,  1 chipotle chilli, soaked in water and finely chopped,  4 x 150-200g\/5½-7oz fillet steaks,  2-3 tbsp olive oil,  10cm\/4in piece fresh ginger, finely grated,  2 tbsp flatleaf parsley, finely chopped, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/deep_fried_chicken_wings_53985"}