{"recipe_name":"Deep-fried Caerphilly with pineapple chutney","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a deep heavy-based pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Place the breadcrumbs, polenta, lime zest, celery salt and freshly ground black pepper into a bowl and mix well. Dip the cheese wedges into the beaten eggs to coat, then roll in the breadcrumb mixture to coat completely.  Chill the coated wedges in the fridge for five minutes, then repeat the process of dipping in beaten egg and breadcrumbs, making absolutely sure that the cheese is completely covered. Place the cheese wedges into the hot oil and deep fry for three minutes, turning regularly, until crisp and golden-brown. For the chutney, heat the oil in a non-reactive frying pan. Fry the onion and chillies for 2-3 minutes, until softened.  Add the pineapple, lime juice, cider vinegar and sugar and bring to the boil. Reduce the heat and simmer for 15 minutes, then remove from the heat and leave to cool. To serve, place a wedge of cheese onto each plate with a spoonful of pineapple chutney and some mixed salad leaves alongside. ","ingredients":" 200ml\/7fl oz vegetable oil, to deep fry,  100g\/3½oz fresh breadcrumbs,  100g\/3½oz polenta,  1 lime, zest only,  1 tsp celery salt,  pinch freshly ground black pepper,  4 x 125g\/4oz wedges Caerphilly,  2 free-range eggs, beaten,  2 tsp vegetable oil,  1 red onion, sliced ,  2 red chillies, finely chopped ,  1 small pineapple, peeled, core removed, finely chopped,  1 lime, juice only,  100ml\/3½fl oz cider vinegar,  100g\/3½oz caster sugar,  mixed salad leaves","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/deepfriedcaerphillyw_89889"}