{"recipe_name":"All-day breakfast frittata","author":"Emily Angle","programme":"Food: Truth or Scare","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/all-day_breakfast_12416_16x9.jpg","method":"Preheat the grill to medium-high. Grill the bacon until it is browned on both sides. Remove from the grill and set aside.  Spray a small non-stick frying pan with spray oil and place on a medium-high heat. When the pan is hot, fry the mushrooms for 5 minutes, stirring frequently, until they are browned and softened. Set aside. Rinse the spinach under cold water and drain it in a sieve. Add it to the frying pan and cook for 1-2 minutes, stirring all the time, so that the leaves steam in the residual water. When the spinach is cooked, but still bright green, transfer back to the sieve and press with the back of a spoon to squeeze any remaining water from the leaves. Set aside. Wipe the frying pan clean, spray with oil and return to a medium heat. Fry the potatoes and tomatoes without stirring too much, so that the vegetables take on some colour but don’t fall apart – about 5 minutes. Meanwhile, beat the eggs in a fairly large bowl. Chop the cooked bacon and the spinach. Add to the eggs along with the cooked mushrooms. Season the eggs with salt and freshly ground black pepper.  When the tomatoes and potatoes are golden-brown in places, spoon them into the eggs with the other vegetables. Give the egg mixture a brief stir, then pour it back into the frying pan and place it back over the heat. Cook gently over a medium heat for 10 minutes, until the egg looks set around the edges (it may be a little runny on the top).  Place the pan under the grill for 2 minutes to finish cooking the frittata on top. Turn out the frittata onto a plate and let it cool slightly before cutting into wedges. Serve with a crunchy salad for maximum veggies. ","ingredients":" 2 rashers back bacon, all visible fat removed,  spray oil, for frying,  125g\/4½oz mushrooms, thinly sliced,  75g\/2½oz spinach,  100g\/3½oz boiled potatoes (or leftover baked potatoes) cut into rough chunks,  100g\/3½oz cherry tomatoes, halved,  4 medium free-range eggs, beaten,  salt and freshly ground black pepper","vegetarian":false,"calories":290.0,"protein":24.0,"carbs":11.0,"sugars":3.0,"total_fat":16.0,"saturated_fat":5.0,"fiber":3.0,"salt":1.4,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/all-day_breakfast_12416"}