{"recipe_name":"Deep-fried prawns with soy and sesame noodle salad","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the deep-fried prawns, place the flour, chilli flakes, chives, salt and freshly ground black pepper into a large bowl and then gradually whisk in the cold sparkling water until the mixture is smooth and reaches the consistency of double cream. (You may not need all of the water.) Pour the vegetable oil into a saucepan and heat until a small cube of bread dropped in sizzles and turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Dip the prawns into the batter and then carefully lower into the hot oil. Fry for 2-3 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. For the noodle salad, cook the rice noodles in boiling water according to packet instructions, then drain and refresh under cold running water. Transfer to a bowl, then stir in the soy sauce, sesame oil, sesame seeds and coriander. Season, to taste, with salt and freshly ground black pepper.  To serve, pile the noodle salad onto a serving plate and top with the deep-fried prawns. Garnish with lime wedges and serve. ","ingredients":" 200g\/7oz self-raising flour,  1 tsp dried chilli flakes,  2 tbsp fresh chopped chives,  salt and freshly ground black pepper,  150ml\/5½fl oz cold sparkling water,  300ml\/10½fl oz vegetable oil, for deep-frying,  5 raw tiger prawns, peeled, de-veined,  150g\/5½oz rice noodles,  1 tbsp soy sauce,  dash sesame oil,  1 tbsp sesame seeds, toasted,  small handful chopped fresh coriander leaves,  salt and freshly ground black pepper,  lime wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/deepfriedprawnswiths_89052"}