{"recipe_name":"Avocado and smoked salmon mousse","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the avocado mousse, place the chopped avocado, double cream, lime juice and lemon juice into a food processor and blend to a smooth purée.  Bring the chicken stock to a simmer in a saucepan. Drain the soaked gelatine and gently squeeze out any excess liquid, then add to the chicken stock and stir until dissolved.  Whisk the chicken stock into the avocado purée until well combined. Season, to taste, with salt and freshly ground black pepper and set aside. For the smoked salmon mousse, place the smoked salmon, double cream, horseradish sauce and lemon juice into a food processor and blend to a smooth purée.  Place the chicken stock into a saucepan and bring to a simmer. Drain the soaked gelatine and gently squeeze out any excess liquid, then add to the chicken stock and stir until dissolved.  Whisk the chicken stock into the smoked salmon purée until well combined. Season, to taste, with salt and freshly ground black pepper.  Place four 5cm\/2in chefs' rings that are 6.25cm\/2in deep onto a plate or tray lined with cling film. Divide the smoked salmon mousse mixture among the four rings, so that each ring is roughly half-filled. Top up each ring with the avocado mousse, filling up to just below the tops of the rings. Place into the fridge and chill for two hours, or until set.  Whisk the four tablespoons of double cream until thickened, then spoon over the top of the mousse, levelling off with a palette knife.  For the salad, whisk the mustard, lemon juice and olive oil together in a medium bowl until well combined. Season, to taste, with salt and freshly ground black pepper, then add the chopped avocado and gently mix to coat.  To serve, carefully place each of the rings into the centre of four serving plates. Using a blow torch or hot cloth, run around the edge of the ring to loosen the mousse and remove the ring. Arrange the salad leaves around the mousse and spoon the dressed avocado around and on top of the salad and the mousse. ","ingredients":" 3 avocados, stones removed, flesh scooped out and roughly chopped ,  110ml\/4fl oz double cream, plus 4 tbsp to serve,  1 lime, juice only ,  1 tsp lemon juice,  75ml\/3fl oz chicken stock,  2 gelatine leaves, soaked in cold water until softened,  salt and freshly ground black pepper,  90g\/3½oz smoked salmon, roughly chopped,  110ml\/4fl oz double cream,  1 tsp ready-made horseradish sauce,  1 tsp lemon juice,  75ml\/3fl oz chicken stock,  2 gelatine leaves, soaked in cold water until softened,  ½ tsp English mustard,  1 tbsp lemon juice,  3 tbsp extra virgin olive oil,  1 avocado, stone removed, flesh scooped out and chopped,  75g\/3oz mixed salad leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/avocadoandsmokedsalm_91648"}