{"recipe_name":"Delicious fried rice","author":"Kylie Kwong","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2-4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the peanut oil in a hot wok until the surface seems to shimmer slightly.  Pour the beaten eggs into the wok and cook for about one minute, lightly scrambling them and rotating the wok to ensure even cooking.  When almost cooked through, carefully remove omelette from the wok with a fish slice and drain on kitchen paper. Set aside. Wipe out the wok with kitchen paper, add the extra peanut oil and stir fry the ginger and garlic for one minute, or until very aromatic.  Add the onion and stir fry for two minutes, or until lightly browned and tender.  Add the bacon and stir fry for a further minute, or until lightly browned.  Stir in the sugar and wine, then stir fry for 30 seconds.  Add the rice, reserved omelette, oyster sauce, spring onion, soy sauce and sesame oil.  Stir fry for three minutes, or until the rice is heated through. Roughly chop the omelette into smaller pieces as you stir. Divide the rice between individual bowls and garnish with extra spring onions.  Combine the light soy sauce and chilli in a small bowl and serve on the side. ","ingredients":" 75ml\/2½fl oz peanut oil, plus 1 tbsp extra,  4 large free-range eggs, beaten,  1½ tbsp finely chopped ginger,  4 garlic cloves, diced,  1 medium brown onion, finely diced,  125g\/4½oz rindless bacon rashers or Chinese sausage, roughly chopped,  1 tsp white sugar,  2 tbsp shao hsing wine (Chinese rice wine),  825g\/1lb 13 oz medium-grain white rice, cooked,  1 tbsp oyster sauce,  115g\/4¼oz finely sliced spring onions (scallions),  3 tsp soy sauce,  ¼ tsp sesame oil,  2 spring onions (scallions), finely sliced on the diagonal ,  60ml\/2 ¼fl oz light soy sauce ,  ½ large red chilli, finely sliced on the diagonal","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/deliciousfriedrice_72056"}