{"recipe_name":"Devilled chicken livers, lambs kidneys and mushrooms on toast with salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken livers, heat a sauté pan or a large frying pan until medium hot. Add the butter, shallot and garlic and cook for 1-2 minutes until just softened. Turn the heat up to high and add the chicken livers and kidneys. Fry for 2-3 minutes until browned and nearly cooked through. Add the mushrooms and cook for another minute. Add the beef stock and cook until reduced by half. Add the cream, mustard and Worcestershire sauce and cook until just thickened. Season, to taste, with salt and freshly ground black pepper and cook for a further two minutes For the salad, toss together the Little Gem, cucumber and rocket in a bowl. Place the remaining ingredients with a tablespoon of water into a small bowl and whisk together until emulsified. Pour over the salad and toss to coat. To serve, place the toast on serving plates, top with the devilled livers and kidneys and garnish with flat leaf parsley. Serve the salad alongside. ","ingredients":" 50g\/1¾oz butter,  2 shallots, finely chopped,  1 garlic clove, finely chopped,  300g\/10½oz chicken livers, trimmed,  4 lambs kidneys, trimmed and cut into chunks,  150g\/5½oz pied bleu mushrooms, trimmed and halved if large,  200ml\/7fl oz beef stock,  110ml\/4fl oz double cream,  2 tsp English mustard,  1 tsp Worcestershire sauce ,  salt and freshly ground black pepper,  4 slices white bread, toasted,  2 tbsp flat leaf parsley, chopped,  2 heads Little Gem lettuce, leaves separated,  ½ cucumber, finely sliced,  1 handful rocket ,  1 tsp French mustard,  1 tbsp sherry vinegar,  1 tbsp walnut vinegar,  2 tbsp walnut oil,  4 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/devilled_chicken_livers_06432"}