{"recipe_name":"Devilled kidneys","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/devilled_kidneys_58867_16x9.jpg","method":"Rinse the kidneys under cold running water and pat them dry with kitchen paper. Using scissors, carefully cut the white cores out of the kidneys and discard them, then cut the kidneys into chunky pieces.  Tip the flour into a freezer bag and season well with salt and pepper. Add the kidneys and toss them until well coated with the flour. Melt the butter in a large non-stick frying pan. Add the onion and fry gently for 3–4 minutes, or until soft and slightly golden-brown, stirring regularly.  Shake off any excess flour from the kidneys and add them to the pan. Cook them with the onion over a medium-high heat for 2–3 minutes, turning every now and then. Add the tomato purée and mustard to the pan, then gradually add 300ml\/10fl oz of water, stirring constantly. Bring to the boil, add a tablespoon of the Worcestershire sauce to the pan and season with salt and freshly ground black pepper.  Reduce the heat and simmer gently for 15 minutes, or until the kidneys are tender and the sauce is thickened, stirring occasionally. Add a little more Worcestershire sauce to taste if you like. While the kidneys are cooking, toast the bread on both sides, then spread with butter and put on four small plates. Spoon the kidneys and sauce over the buttered toast and scatter with freshly chopped parsley (if using). Serve immediately while piping hot. ","ingredients":" 6 lambs’ kidneys, about 375g\/13oz, skinned,  2 tbsp plain flour,  25g\/1oz butter,  1 medium onion, finely sliced,  1 tbsp tomato purée,  1 tbsp English mustard,  1–2 tbsp Worcestershire sauce,  4 thick slices of crusty bread,  butter, for spreading,  small bunch of fresh parsley, chopped (optional),  sea salt and freshly ground pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/devilled_kidneys_58867"}