{"recipe_name":"Pepper and coriander tuna with noodles and tomato and soy vinaigrette","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Firstly, rub the tuna loin in a little olive oil, then roll in the crushed peppercorns and coriander seeds.  Drizzle the tuna with a little more olive oil, heat a griddle pan until smoking hot and add the tuna. Cook for two minutes on each side and remove from the heat. Set aside and keep warm. For the noodles, place the rice noodles into a bowl of cold water and leave to soak for five minutes, or until softened. Drain well.  Rub the spring onions in olive oil, heat a griddle pan until smoking hot, and add the spring onions. Griddle for 3-4 minutes and set aside.  Meanwhile, carefully drop the broccoli florets into a pan of gently boiling water and boil for three minutes. Drain well.  Heat a dash of olive oil in a wok, add the blanched broccoli florets and stir-fry for one minute. Add the griddled spring onions, sesame oil, ground coriander and soy sauce and cook for a further one minute.  Add the soaked and drained noodles to the wok and toss together. For the tomato and soy sauce vinaigrette, whisk together all the vinaigrette ingredients in a small bowl. To serve, pile the noodles and griddled vegetables onto a serving plate, top with the tuna and drizzle with vinaigrette. ","ingredients":" 150g\/5½oz tuna loin,  dash olive oil,  1 tsp peppercorns, crushed,  ½ tsp coriander seeds, crushed,  150g\/5½oz brown rice vermicelli noodles,  4 spring onions, halved lengthways,  dash olive oil,  150g\/5½oz broccoli, cut into florets,  dash sesame oil,  pinch ground coriander,  1-2 tbsp soy sauce,  2 tbsp tomato ketchup,  2 tbsp soy sauce,  ½ lemon, juice only,  dash olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dgheth_86895"}