{"recipe_name":"Doorstep vanilla cheesecake with rum punch roasted pears, figs and toasted hazelnuts","author":"Lorraine Pascale","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 8-12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cheesecake, put the butter in a large saucepan over a low heat and leave to melt. Meanwhile, put the biscuits in a plastic food bag, seal it and crush the biscuits using a rolling pin, until you have fine crumbs. (Alternatively pulse them in a food processor.) Tip the crushed biscuits and sugar into the melted butter. Mix together. Push the mixture into the base of a deep 23cm\/9in springform cake tin. Really pack in tight by pressing it down with your hands or the back of a spoon. Place in the fridge to firm up while you make the topping. In a large bowl, mix the cream cheese, lemon zest and vanilla seeds until smooth. Pour the double cream into a separate bowl and sift in the icing sugar. Whisk until it is almost the same consistency as the cream cheese, just a little looser. Tip the cream into the cream cheese mixture and mix everything gently. Remove the base from the fridge and tip the mixture onto the base. Smooth the top with the back of a spoon. Cover with cling film and put into the freezer for about 30 minutes, until just set. Or place in the fridge for 4 hours. For the pears, figs and hazelnuts, preheat the oven to 160C\/140C Fan\/Gas 3 and line a baking tray with baking paper.  Put the chopped fruit on the tray and drizzle with maple syrup, to taste. Drizzle with rum or apple juice and top with the vanilla pod, cinnamon stick, rosemary and orange zest. Mix together until combined and cover in aluminium foil. Roast for 30 minutes, then remove the foil and cook for a further 20 minutes, basting the fruit with the juices. Remove the rosemary before serving. To serve, remove the cheesecake from the freezer 10 minutes before serving. Cut into wedges and serve the roasted fruit and hazelnuts alongside. ","ingredients":" 75g\/2½oz unsalted butter,  250g\/9oz digestive biscuits,  2 tbsp soft light brown sugar,  800g\/1lb 12oz full-fat cream cheese,  1 lemon, zest only,  1 vanilla pod, split in half lengthways and seeds removed,  800ml\/1⅓ pint fridge-cold double cream,  75g\/2½oz icing sugar,  6 fresh figs, halved,  4 ripe pears, cored and cut into quarters lengthways,  2-4 tbsp maple syrup,  250ml\/9fl oz dark rum or apple juice,  1 vanilla pod, split in half lengthways ,  1 cinnamon stick, broken in half,  1 sprig fresh rosemary, left whole,  1 orange, zest only,  25g\/1oz toasted hazelnuts","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/doorstep_vanilla_66658"}