{"recipe_name":"Double baked cheese soufflés","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/double_baked_cheese_94727_16x9.jpg","method":"For the soufflés, preheat the oven to 200C\/400F\/Gas 6. Generously butter 6x150ml\/5fl oz ovenproof ramekins and line the bases with a disc of baking parchment. Place on a baking tray.  Put the onion into a saucepan with the milk and bay leaf. Bring to a gentle simmer over a low heat and cook for 5 minutes to infuse the flavours. Watch carefully to ensure the pan doesn’t boil over. Remove from the heat and set aside for a couple of minutes. Melt the butter in a medium non-stick saucepan over a low heat. Remove from the heat and stir in the flour with a wooden spoon. Once combined, return to the heat and cook for a minute, stirring as it cooks and begins to bubble. Remove from the heat.  Strain the milk through a sieve into a jug and discard the onion and bay leaf. You’ll need around 250ml\/9fl oz of infused milk, so discard any excess or top up as needed with fresh milk.  Gradually stir the milk into the flour and butter paste, then return to the heat and cook for 2 minutes, bringing to the boil, stirring constantly. The sauce will become smooth and thick. Add the Cheddar, mustard and a grating of nutmeg and continue to cook for a further 1–2 minutes more until the cheese melts. Stir in the chives and season to taste. The seasoning can be quite strong at this point, as the mixture will be bulked out with egg whites later. Transfer the cheese sauce to a heatproof bowl and leave to stand for 5 minutes. Once the mixture has cooled, beat in the egg yolks one at a time until thoroughly mixed.  Whisk the egg whites in a bowl until stiff peaks are formed when the whisk is removed. Fold about one-fifth of the egg whites into the cheese mixture with a large metal spoon (this slackens the mixture and makes folding the remaining egg whites in easier). Then gently fold in the remaining egg whites  to preserve the volume you have created.  Spoon the soufflé mixture into the ramekins until it almost reaches the top. Bake in the centre of the oven for 15-20 minutes until very well risen and golden-brown on top. (Do not open the oven door for the first 10 minutes of cooking). Once cooked, remove the tray from the oven and leave the soufflés to cool in their ramekins. When the soufflés are cold, line a baking tray with baking parchment and slide a knife around the edge of each ramekin. Carefully turn the soufflés out onto your hand. remove the baking paper disc from the base. Place on the tray upside down. The soufflés can now be covered with cling film and chilled for up to 24 hours before being baked again. For the second baking, preheat the oven to 200C\/400F\/Gas 6. Fifteen minutes before serving, remove the cling film from the soufflés, and sprinkle with the grated gruyere or cheddar. Spoon a tablespoon of double cream over each soufflé, allowing it to run down the sides. Bake for 10 minutes until the soufflés are hot and the cheese topping has melted. Serve immediately, sprinked with extra chives if using.  ","ingredients":" 1 small onion, peeled, cut into wedges,  275ml\/10fl oz whole milk, plus extra for topping up if needed,  1 bay leaf,  40g\/1½oz butter, plus extra for greasing,  40g\/1½oz plain flour,  100g\/3½oz mature cheddar, coarsely grated,  1 tsp English mustard (or 2 tsp Dijon mustard),  freshly grated nutmeg, to taste,  salt and freshly ground black pepper,  3 free-range eggs, separated,  1 heaped tbsp chopped chives, plus extra for garnish,  50g gruyere or mature cheddar, finely grated,  6 tbsp double cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/double_baked_cheese_94727"}