{"recipe_name":"Double layered cookie","author":"Joanna Lumley","programme":"Series 2","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 1 x 30cm\/12in cookie","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chocolate crispy base, line a 30cm\/12in circular baking tray (such as a pizza pan) with cling film. Gently heat the butter, sugar and syrup in a saucepan until well combined. Remove the pan from the heat and stir in the cocoa powder. Quickly add the puffed rice cereal while the mixture is still hot and mix thoroughly until the cereal is evenly coated. While the mixture is still warm, press it into the prepared tin and chill in the fridge until set. Preheat the oven to 180C\/170C Fan\/Gas 4.  For the cookie, in a large bowl, beat the sugars and butter together for a minute until light and fluffy, either by hand with a wooden spoon or using an electric mixer. Stir in the egg and vanilla extract until combined. Sift in the flour, salt, baking powder and ground ginger. Mix thoroughly to form a dough. Mix in the chocolate pieces until well combined. Line a 30cm\/12in circular baking tray (such as a pizza pan) with silicon paper. Press the cookie dough into the tray in an even layer, about 1cm\/½in deep. Alternatively, chill the dough and then shape it into a freeform circle on a lined baking sheet. Bake for 25-30 minutes, or until golden-brown all over, but still soft in the middle. The cooking time will vary by a few minutes, depending on whether the cookie is in a tray or freeform, so keep checking it towards the end of the cooking time. Remove your giant cookie from the oven and leave to cool for a few minutes before removing from the tray and silicon paper.  Leave to cool fully on a wire rack.  Be careful when handling it as it will break easily. For the ginger cream filling, whisk the double cream and icing sugar together until lightly whipped. Carefully stir in the ginger syrup and the chopped ginger.   To assemble, spread the ginger cream over the chocolate crispy base and scatter over the grapefruit zest. Top with the cookie. ","ingredients":" 120g\/4¼oz unsalted butter,  60g\/2¼oz caster sugar,  120g\/4¼oz golden syrup,  60g\/2¼oz cocoa powder,  125g\/4½oz puffed rice cereal ,  200g\/7oz soft brown sugar ,  100g\/3½oz caster sugar ,  170g\/6oz softened unsalted butter ,  1 large free-range egg,  1 capful vanilla extract,  250g\/9oz plain flour ,  pinch table salt,  ¼ tsp baking powder,  ½ tsp ground ginger,  100g\/3½oz dark chocolate (minimum 70% cocoa solids), chopped  ,  300ml\/10fl oz double cream,  1 tbsp icing sugar,  50g\/1¾oz stem ginger, finely chopped, plus 2 tbsp of syrup from the jar,  1 unwaxed grapefruit, zest only ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/double_layered_cookie_39378"}