{"recipe_name":"Douglas fir pine custard with blood orange curd and coconut tuille","author":"Tom Kerridge","programme":"Spring Kitchen with Tom Kerridge","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the custard, in a saucepan, bring the double cream and milk to the boil. In a bowl, whisk the egg yolks and caster sugar together. Pour the hot cream and milk onto the eggs, whisking as you go. Return to the pan and place on a low heat. Gently cook the custard, stirring all the time, until it’s thick enough to coat the back of a spoon, or reaches 82C\/180F on a cooking thermometer. Add the fir sprig and bring back to the boil. Take the custard off the heat and allow the fir to infuse for up to an hour while the custard cools.  Pass through a fine sieve into a bowl. Cover the surface with cling film to prevent a skin forming and leave to chill in the fridge. For the blood orange curd, place the orange zest, juice, butter and sugar into a bowl set over a pan of simmering water. (Don’t let the bowl touch the water). Whisk occasionally until the sugar is completely dissolved then beat in the eggs and whisk until thickened and cooked through. Remove from the heat and allow to cool completely. For the coconut tuilles, preheat the oven to 180C\/350F\/Gas 4 and line a baking tray with a silicone mat or baking parchment.  Melt the butter, then leave until cool, but still runny.  Blend the coconut in a food processor until finely ground, but not powdery. Add in the icing sugar and flour, and blend again, then add the egg whites followed by the cooled butter and blend until you have a smooth, slightly runny paste.  Put a teaspoon of the mixture on the silicone and spread with the back of a dessertspoon into a neat thin 7cm\/3in circle. Repeat to fill the tray with circles. Bake for seven minutes, or until pale golden-brown around the edges. Remove and scrape off on to a wire rack to cool. To shape, press each one over a rolling pin as it cools, to make a curved tuille. To serve, put some of the orange curd onto serving plates. Whip the custard to foam it and layer it on top of the curd. Top with coconut tuilles. ","ingredients":" 300ml\/10½fl oz double cream,  1 sprig Douglas fir pine,  6 egg yolks,  50g\/1¾oz sugar,  300ml\/10½fl oz whole milk,  4 blood oranges, zest and juice,  110g\/4oz butter,  175g\/6oz caster sugar,  4 free-range eggs, beaten,  50g\/1¾oz unsalted butter,  85g\/3oz fresh or desiccated coconut,  85g\/3oz icing sugar, sifted,  25g\/1oz plain flour,  2 egg whites","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/douglas_fir_pine_custard_60315"}