{"recipe_name":"Dover sole and langoustine tail with asparagus tops and samphire drizzled with a white wine sauce","author":"Michel Roux","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Steam the langoustines for 5-6 minutes in a steamer. Remove the langoustines from the steamer and carefully remove the shell from the body as soon as it is cooked, taking care as it will be hot.   Separate the heads from the body. Crush them with the back of a wooden spoon or a rolling pin and reserve.  Remove the tails from their shells. Reserve the tails to serve, and discard the remaining shell. Fillet and skin the Dover sole and then lightly season the fillets with salt.  Place the fillets flat in a lightly buttered shallow baking tray with the fish stock and white wine, then poach for 3-4 minutes by bringing to simmering point.  Quickly turn each fillet over in the liquor.  Immediately remove from heat.   Carefully remove the fillets from the cooking liquor and set aside in a warm place.  Pour the cooking liquor into a pan. Add the crushed head of langoustine to the pan of sole cooking liquor with the bouquet garni and chopped shallot. Simmer on medium heat until the volume of this liquid has been reduced by two-thirds. Meanwhile, prepare the asparagus: asparagus with thicker stalks will naturally snap at the woodiest part of the spear. Young asparagus spears are more tender and don’t need to be snapped before cooking. Steam the asparagus for about five minutes, add the samphire (or seaweed) to the asparagus and cook for one minute.  Set aside. Pass the reduced liquid through a fine metal sieve, pressing firmly with the back of a ladle.  Reduce a little further if needed. Add the butter to the reduced liquid to make a sauce, either by gently whisking or gentle rotation of the pan.  Season to taste with salt and pepper. To serve, arrange the asparagus and samphire on two plates. Place the sole on the vegetables.  Arrange the langoustine tail to curl around the sole. Generously drizzle the sauce over the sole and langoustine. Pour over the lemon juice and sprinkle with the snipped chives. ","ingredients":" 8 medium-sized langoustines ,  1 whole Dover sole, about 600g\/1lb 5oz,  salt and freshly ground black pepper,  200ml\/7fl oz fish stock,  100ml\/3½l oz white wine,  1 small bouquet garni,  1 shallot, finely chopped,  8 small to medium-sized asparagus,  50g\/1¾oz samphire or seaweed \"sea lettuce\",  50g\/1¾oz unsalted butter,  ½ lemon, juice only,  2 tbsp snipped chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dover_sole_and_08196"}