{"recipe_name":"Dover sole with watercress and crab butter","author":"James Martin","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Rinse the Dover sole fillets and pat dry with kitchen paper. Sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Dredge both sides of the Dover sole fillets in the seasoned flour.  Heat the oil over a high heat in a non-stick, ovenproof frying pan. Add the coated Dover sole fillets, white skin-side down, and fry for 2-3 minutes, or until pale golden-brown. Carefully turn the Dover sole fillets over using a palette knife or fish slice. Add a knob of butter to the pan, then transfer the pan to the oven and roast the fillets for 6-7 minutes, or until just cooked through. Meanwhile, for the watercress and crab butter, heat the butter in a separate frying pan over a medium heat. When the butter is foaming, add the shallot and fry for 2-3 minutes, or until softened.  Stir in the ground mace, cayenne pepper and Gentleman’s relish until well combined.  Stir in the crabmeat and chopped watercress, then remove the pan from the heat. Season to taste with salt and freshly ground black pepper, then squeeze over a little lemon juice and stir again. Set aside and keep warm. To serve, stack two Dover sole fillets in the centre of each serving plate. Spoon half of the watercress and crab butter over each portion of fish. Top with half of the lemon slices. Garnish the plate with the watercress sprigs. ","ingredients":" 2 x 600-700g\/1lb 5oz-1lb 8oz Dover soles, filleted (ask your fishmonger to do this for you),  75g\/3oz plain flour,  salt and freshly ground black pepper,  50ml\/2fl oz vegetable oil,  knob of butter,  125g\/4½oz butter,  1 shallot, peeled, finely chopped,  1 tsp ground mace,  ½ tsp cayenne pepper,  2 tsp Gentleman’s relish (or another anchovy paste),  100g\/3½oz white crabmeat, picked,  50g\/2oz fresh watercress leaves, chopped,  salt and freshly ground black pepper,  squeeze of lemon juice,  2 whole lemons, peeled, pith scraped off, sliced into rounds,  4 sprigs fresh watercress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dover_sole_with_33308"}