{"recipe_name":"Dover sole with crab-crushed Jersey Royals and sauce grenoble","author":"Mark Jordan","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Place the fillets of sole on top of each other, with the first fillet facing one way then the other facing the other way (like building a sole wall!) so that you have an eight-fillet high wall. Skewer the sole fillets together with six cocktail sticks and trim off the ends, then slice the stacked fillets neatly in half.  Heat a non-stick frying pan until hot, add the vegetable oil and then the sole fillets; cook until coloured on one side.  Once one side is golden-brown, flip the sole fillets over and then place on a tray in the oven for 15 minutes. Meanwhile, place the potatoes in a saucepan of salted, boiling water and boil for about 5-10 minutes, or until cooked (the cooking time depends on the size of the potatoes).  Drain and return the potatoes to the pan and crush lightly using a fork, then add the crabmeat and a squeeze of the lemon juice and mix well. Add salt and freshly ground black pepper to taste. Keep the mixture warm. Return the frying pan used for the fish to the heat, then add the butter and cook until it is brown in colour; add the caperberries and gherkins and heat through. Add the chopped chives and the juice from two of the lemons (reserve another squeeze of lemon juice for the fish).  Remove the sole from the oven and gently twist out the cocktail sticks. Squeeze over the remaining lemon juice. Bring a pan of salted water to the boil, add the asparagus and boil for 10 seconds. Drain and keep warm. To serve, place a spoonful of the potato into a metal ring in the centre of each of two plates and top with a stack of Dover sole. Spoon the caperberry and gherkin butter over and around the fish, then scatter the cress and crôutons around the plate. Top the sole with some asparagus and serve straightaway. ","ingredients":" 2 x 500g\/1lb Dover soles (8 fillets), skinned and filleted,  1 tbsp vegetable oil,  250g\/9oz Jersey Royal potatoes,  250g\/9oz fresh white crabmeat, picked,  3 lemons, juice only,  salt and freshly ground black pepper,  200g\/7oz butter,  110g\/4oz caperberries,  110g\/4oz gherkins, finely diced,  2 tbsp chopped fresh chives,  1 bunch Jersey asparagus,  1 punnet baby pea shoots,  1 punnet baby basil,  1 handful crôutons","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dover_sole_with_53504"}