{"recipe_name":"Dover sole with clams","author":"José Pizarro","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the potatoes, bring a large pan of salted water to the boil. Add the sliced potatoes, bring back to the boil and cook for two minutes. Drain well. In a large roasting tin, mix the potatoes, onions, garlic, bay leaves and olive oil together. Season with salt and pepper. Roast for 15 minutes then turn all the vegetables over and return them to the oven for another 15 minutes, or until the vegetables are cooked and caramelised. Meanwhile, for the sauce, heat the olive oil in a frying pan. When hot, add the garlic, bread cubes and almonds and fry until the bread cubes are golden-brown and crisp. Add the parsley then immediately drain the mixture and reserve any excess oil. Place the mixture in a food processor and pulse. Gradually add the reserved oil and the hot fish stock, blending all the time, until you have a smooth sauce. Season with salt and pepper, to taste. Transfer the sauce to a clean saucepan. Just before serving, reheat the sauce. For the Dover sole, season the fillets with salt and pepper and roll individually. Place them in an oven tray and bake in the oven for 6-8 minutes (at 220C\/425F\/Gas 7).  Clean the clams in cold running water. Discard any with cracked shells. Discard any open clams that do not close when given a sharp tap. Heat a saucepan with a lid and place the clams in the pan with a little water. Cook for 2-3 minutes until they open.  Discard any clams that stay closed. For the cherry tomatoes, heat the oil in a deep-fat fryer, or fill a large, deep, heavy-based pan two-thirds full with vegetable oil. Heat the oil to 180C\/350F (use a probe thermometer to check the temperature if you're not using a deep-fat fryer). (CAUTION: Hot oil can be dangerous. Don't leave unattended). Fry the tomatoes for 1-2 minutes. To serve, divide the potatoes between four warmed plates, place the fish on top and finish with the sauce and clams. Finish with some chopped parsley, tomatoes and some fresh olive oil. ","ingredients":" 4 Dover sole, filleted,  160g\/5⅔oz clams,  800g\/1lb 12oz waxy potatoes as Desirée, sliced into 7mm-thick rounds,  1 large red onion, sliced,  1 large white Spanish onion, sliced,  3 garlic cloves, sliced,  2 bay leaves,  5 tbsp olive oil,  sea salt and pepper,  3 tbsp olive oil,  2 garlic cloves,  1 slice of bread, crusts removed, cut into 1cm\/½in cubes ,  20 blanched almonds,  1 handful flatleaf parsley leaves,  200ml\/7fl oz fish stock, hot,  salt and pepper,  vegetable oil, for deep frying,  1 bunch cherry tomatoes on the vine,  2 tbsp chopped fresh parsley,  drizzle olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dover_sole_with_clams_50002"}