{"recipe_name":"'Dragon prawn' noodles","author":"Ching-He Huang","programme":"Chinese Food Made Easy","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/dragonprawnnoodles_89298_16x9.jpg","method":"Freeze the lobster for 30 minutes. Heat a large pan of boiling water, then very quickly plunge the lobster in the water and cook for 7-8 minutes, or until pink and cooked through. Lift the lobster out with tongs and reserve the cooking liquid. Using a large cleaver or knife, chop off the tail and cut into three sections. Chop off the claws. Divide the body in half lengthways. Chop each half into two pieces. Using the back of the cleaver, crack the shell of the claws and all the other pieces - this helps to let the sauce seep through and flavour the meat as the lobster cooks.  Discard the rest of the lobster. Heat a wok until smoking and add the groundnut oil, then add the garlic and ginger and fry for a few seconds. Stir in the yellow bean sauce, soy sauce and rice wine or sherry and cook for 30 seconds. Add the lobster pieces and stir well to coat the lobster in the sauce. Add the cooked noodles and toss through well. Add 3-4 tablespoons of the reserved cooking liquid (keep the rest to make a good seafood stock). Finally, add the spring onions, toss through well and serve immediately on a large serving plate. ","ingredients":" 650g\/1lb 6oz live lobster,  2 tbsp groundnut oil,  5 cloves garlic, crushed,  2.5cm\/1in piece fresh root ginger, peeled, finely chopped,  4 tbsp yellow bean sauce (available from Asian grocers),  4 tbsp light soy sauce,  2 tbsp Shaoxing rice wine or dry sherry,  350g\/12oz yellow shi whole wheat noodles or medium egg noodles, cooked according to packet instructions,  4 spring onions, sliced lengthways,  dash toasted sesame oil (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dragonprawnnoodles_89298"}