{"recipe_name":"Dried fruit and almond buns ","author":null,"programme":null,"prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes 12 rolls","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the flour into a mixing bowl and, using your fingertips, rub in the butter until the mixture resembles fine breadcrumbs. Add the, salt, sugar, ground almonds, and yeast and stir until well combined. Add the milk and mix together with a fork until the mixture comes together as a sticky dough. Tip the dough onto a lightly floured work surface and knead for five minutes, or until the dough is smooth and elastic. Lightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size.  Lightly grease two baking trays. Knock the dough back to its original size and turn out onto a lightly floured work surface. Knead in half of the flaked almonds and all of the dried fruit.  Sprinkle the remaining flaked almonds onto a plate. Divide the dough into 12 portions and shape them into rounds. Roll each round in the flaked almonds and place onto the baking trays, cut-side facing upwards, ensuring that the rolls are well spaced. Cover with a tea towel and set aside to prove for one hour. Preheat the oven to 220C\/425F\/Gas 7.  Bake the almond buns for 15-20 minutes, or until risen and golden-brown. Remove the buns from the oven and set aside to cool on a wire rack. ","ingredients":" 500g\/1lb plain flour,  50g\/2oz butter,  2 tsp salt,  65g\/2½oz caster sugar,  75g\/3oz ground almonds,  1 x 7g\/¼oz sachet fact-action dried yeast,  300ml\/10fl oz milk, warmed,  vegetable oil, for greasing ,  125g\/4oz flaked almonds,  150g\/5oz mixed dried berries,  75g\/3oz dried apricots, roughly chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dried_fruit_and_almond_47710"}