{"recipe_name":"A warm salad of asparagus, field mushrooms and fresh peas","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Cook the asparagus in boiling salted water for 1 minute, remove and set aside. Add the peas to the asparagus cooking water and cook for 2-5 minutes, drain and set aside. Prepare your barbie, griddle or grill pan. Combine the olive oil and garlic and brush over the asparagus and both sides of the mushrooms with salt and black pepper. Grill or barbecue the mushrooms for 4 minutes on each side, and the asparagus for 2 minutes each side.  Keep both warm.  Brush the ciabatta slices on both sides with the garlic oil and grill until both sides are toasted. In a saucepan heat the remaining oil infusion, add the shallot and over a medium heat allow to cook without colour.  Add the vermouth, increase the heat and cook for a further minute.  Remove the pan from the heat and whisk in the butter a little at a time. Fold in the peas, parsley, chives, tarragon and lemon juice. Season to taste.   Return to a gentle heat to warm through. Combine the rocket and watercress and divide between four plates. Top the leaves with a slice of the grilled bread.   Divide the asparagus and mushrooms between the bread slices, arranging them attractively on top of each slice. Spoon the peas and buttery juices over the salad leaves. ","ingredients":" 20 medium asparagus spears, trimmed and peeled,  175g\/6oz shelled young peas,  4 tbsp extra virgin olive oil,  1 clove garlic, mashed to a paste with a little salt,  8 small field mushrooms, stalks removed and peeled,  salt and ground black pepper,  1 ciabatta loaf, cut into two horizontally then in two from top to bottom,  1 shallot, finely chopped,  3 tbsp dry vermouth,  55g\/2oz unsalted butter, cubed,  1 tbsp chopped flat-leaf parsley,  1 tbsp snipped chives,  1 tsp chopped tarragon,  1 tbsp freshly squeezed lemon juice,  30g\/1oz each rocket and watercress leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/awarmsaladofasparagu_67967"}