{"recipe_name":"Dry lamb encrusted with spices","author":null,"programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the spice powder heat the 1 tbsp oil in a large frying-pan or wok. When hot, put in all the spices. Stir until the chillies darken. Put the spices into a clean coffee grinder and grind to a fine powder. Set aside. Heat 1 tbsp of the remaining oil in a large frying-pan or wok over a meduim heat. When hot, add the coconut chips, turmeric and ½ tsp of the salt. Stir fry for 3-4 minutes or until the coconut is toasted. Set aside. In a clean, large frying-pan heat 3 tbsp of the oil over a meduim heat. When hot, add 1 tsp of the mustard seeds. Stir until the seeds pop, a matter of a few seconds. Now add about 20 of the curry leaves, 6-8 of the shallots, the ginger and the garlic. Stir-fry for 3-4 minutes until the shallots become lightly browned. Add the meat and the spice powder. Stir to coat the meat well, then add the vinegar, toasted coconut chips, ½ tsp of the salt and 750ml\/1½pt\/3 cups of water. Bring to the boil, then turn the heat down and cover. Simmer for about 50 minutes to 1 hour or until the meat is almost tender. Remove the lid and continue to cook for another 10-15 minutes until the sauce becomes very thick and clings to the meat, increasing the heat if neccessary. Meanwhile, heat the remaining 1 tbsp oil in a small pan over a meduim heat. When hot, add the remaining mustard seeds. When the mustard seeds pop, add the remaining shallots and about 20 curry leaves. Stir and fry until the shallots become golden-brown. Add the contents of the pan to the meat. Mix well and remove from the heat. ","ingredients":" 1 tbsp vegetable oil,  2.5cm\/1in cinnamon stick,  10-15 cloves,  3 tbsp coriander seeds,  4-6 dried hot red chillies,  1 tbsp black peppercorns,  ½ tsp fennel seeds,  6 cardamom pods,  5tbsp vegetable oil,  120g\/4½\/1 cup plus,  1½tbsp fresh coconut, first cut into thin slices and then into 1cm\/½in chips,  ¼tsp ground turmeric,  1¼-1½ tsp salt,  2tsp brown mustard seeds,  40 fresh curry leaves, if avaliable,  10-12 shallots (150g\/5oz), finely sliced,  2.5cm\/1in piece of fresh ginger, peeled and finely chopped,  1kg\/2¼lb boneless lamb from the shoulder, cut into 2.5cm\/1in dice,  2 tbsp white wine vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/drylambencrustedwith_5071"}