{"recipe_name":"Venison curry with sweet potato and chilli and honey-drizzled parsnip crisps","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the curry, heat one tablespoon of oil in a frying pan over a high heat, add the venison and fry for two minutes.  Add the curry powder, turmeric, cumin seeds, bay leaves and chilli flakes and cook for a further three minutes. Remove from the heat and keep warm. In another frying pan, heat a tablespoon of oil over a medium heat and add the sweet potato and leeks. Cover with a lid and cook for five minutes.  Add the venison to the sweet potato and leeks and cook for three minutes.  Add the red wine and lime juice and cook for two minutes. Remove from the heat, and keep warm. For the parsnip crisps, heat the oil in a deep heavy-bottomed saucepan, until very hot or until a breadcrumb sizzles in it (CAUTION: Hot oil is very dangerous. Do not leave unattended). Carefully lower the parsnips into the hot oil, and deep fry for six minutes or until golden. Remove with a slotted spoon and drain on kitchen paper. Transfer the crisps to a serving plate, and drizzle with honey. To serve, stir the herbs into the venison curry, reserving some coriander for garnishing. Arrange the curry on top of the crisps with a spoonful of Greek yoghurt on top and garnish with the coriander. ","ingredients":" 2 tbsp vegetable oil,  150g\/ 5½oz venison leg, boned and cubed,  1 tbsp medium curry powder,  1 tsp turmeric,  ½ tsp cumin seeds,  2 bay leaves,  pinch chilli flakes,  50g\/ 1¾oz sweet potato, peeled and cubed,  2 baby leeks, chopped,  4 tbsp red wine,  1 lime, juice only,  vegetable oil, for deep frying,  3 parsnips, peeled and cut into long thin ribbons,  1 tbsp clear honey,  small handful of each fresh flatleaf parsley, mint and coriander, plus extra to garnish,  75g\/2½oz Greek yoghurt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/dryvenisoncurrywiths_84447"}