{"recipe_name":"Duck à la rhubarb","author":"Michel Roux Jr.","programme":"Food & Drink","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/duck__la_rhubarb_67136_16x9.jpg","method":"For the sauce, put the sugar and vinegar in a saucepan and bring to a boil, then reduce the heat and cook until it begins to thicken and caramelize. Add the chicken stock. Cook until the sauce has reduced in volume by half. Add the butter to finish the sauce. Meanwhile, for the rhubarb, place the chopped pieces into a pan with the sugar, two tablespoons water and grenadine, if using. Cook until the rhubarb has softened. Allow to cool slightly then tip into a blender and pulse to form a purée.  For the duck, place the Chinese five spice on a plate along with a good pinch of salt. Mix together and then rub the duck breasts with the mixture. Lay the duck breasts, skin-side down in a cold frying pan. Turn on the heat and cook until the skin is golden-brown and the duck is almost cooked through. Turn the breasts over and remove the pan from the heat. The duck will continue to cook with the residual heat from the pan, but this method ensures it won’t overcook. It also allows the duck to rest before serving. Meanwhile, for the pak choi, add a little groundnut oil to a wok and stir fry the chilli for 1-2 minutes. Throw in the pak choi and stir fry for another two minutes before adding the soy sauce and fish sauce. Cook for 1-2 minutes, or until the pak choi is tender. For the garnish, simply melt the sugar in a pan, add the rhubarb batons and the butter, toss to coat the rhubarb in the caramel. To serve, slice the duck breasts in half lengthways and share them out between four serving plates. Garnish the duck with the rhubarb batons, put some pak choi alongside and pour a little of the sauce over the duck. ","ingredients":" 1 tbsp brown sugar,  100ml\/3½fl oz red wine vinegar,  500ml\/18fl oz chicken stock,  20g\/¾oz butter ,  3-4 sticks rhubarb, roughly chopped,  2 tbsp brown sugar,  splash of grenadine, optional,  2 tsp Chinese five spice,  2 tsp salt,  2 large duck breasts, trimmed and fat scored,  groundnut oil, for frying,  1 red chilli, chopped,  4 pak choi, quartered,  soy sauce, to taste,  fish sauce, to taste,  50g\/1¾oz brown sugar,  ½ stick rhubarb, cut into 1¾cm\/2in batons,  20g\/¾oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck__la_rhubarb_67136"}