{"recipe_name":"Duck a l’orange with smoked garlic mash, cardamom-glazed carrots and creamed chard","author":"Ed Baines","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Place the potatoes in a saucepan and cover in cold water. Heat to a simmer and cook for 15-20 minutes, or until the potatoes are soft. Drain and then put through a potator ricer or mash in the pan. Meanwhile put the smoked garlic in a medium saucepan with the milk and cook for 10-15 minutes, strain and retain the milk. Add the milk and butter to the potatoes and mix until you have a very runny mash potato. Set aside until ready to serve. To make the glazed carrots, place a roasting tin on the hob. Once hot, add the cardamom, sugar and butter and melt. Add the carrots and place in the oven for 30 minutes. For the creamed chard, place a pan of water on the hob, fill with water and bring to the boil.  Blanch the leaves and the stalks separately, drain each and refresh in cold water to keep the colour. Heat a deep frying pan that fits in the oven, add the butter and fry the garlic. Add the cream and chard. Cook for 4-6 minutes, or until the volume of cream has reduced.  In a medium bowl, mix the breadcrumbs and parmesan cheese. Sprinkle this mixture over the top of the chard and place in the oven for 20 minutes, or until the top is brown. To make the sauce, place the sugar in a medium frying pan and heat it. Once it turns to a caramel, add the orange zest and juice, white wine vinegar and stock and cook until the volume of liquid has reduced by half. Heat a large ovenproof frying pan and add the oil. Once hot, add the duck skin-side down and cook for four minutes. Turn the duck over and place in the oven for eight minutes. To serve, place a spoon of the potatoes on each plate. Slice the duck on an angle and lay half of it on the mash. Sit a pile of the chard next to it and the carrots on the other side in a cross shape. Spoon the orange sauce over the duck. ","ingredients":" 1 kg\/2lb 4oz white potatoes, peeled and quartered,  4 smoked garlic cloves, peeled and left whole,  150ml\/5fl oz whole milk,  110ml\/3½fl oz butter, softened,  2 green cardamom pods, smashed,  2 tbsp caster sugar,  2 tbsp unsalted butter,  4 sweet young carrots with leaves cut in half, leave a small amount of green stalk on the end,  1 bunch Swiss chard leaves, separated and stalks finely chopped,  25g\/1oz unsalted butter,  1 garlic clove,  250ml\/9fl oz double cream,  100g\/3½oz breadcrumbs,  100g\/3½oz parmesan cheese, grated,  50g\/1¾oz caster sugar,  2 oranges, zest and juice only,  2 tbsp white wine vinegar ,  350ml\/12fl oz chicken stock,  2 tbsp olive oil,  4 duck breasts, trimmed and scored","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck_a_lorange_with_56899"}