{"recipe_name":"Duck and lemongrass kebabs","author":"Tom Kerridge","programme":"Tom Kerridge's Best Ever Dishes","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Makes 8 skewers","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Score the duck breast skin using a sharp knife (do not cut into the meat). Cut lines about 5mm apart on a slight angle, then cut the other way to form diamond shapes in the skin.  Place the breasts skin-side down in a dry, non-stick frying pan over a medium heat. Slowly cook for about 5-10 minutes, or until the fat has rendered from the breast and seeped into the pan. When the skin is golden-brown and crisp, remove the duck breasts and drain on kitchen paper. Allow to cool, then place in the fridge until needed.    To make a marinade, mix the oil, soy sauce and honey together in a bowl. Add the lime juice, garlic, chilli and grated ginger and mix again.  Cut the duck into 12-16 evenly-sized cubes, then pierce each piece of duck and the vegetables using a skewer. Thread them onto the lemongrass stalks, trying not to put the same ingredients next to each other. When all eight lemongrass stalks are full, place them in a plastic container and pour over the marinade. Place the kebabs into the fridge to marinate for at least two hours, but overnight will be fine. Remove the kebabs from the fridge 30 minutes before you want to cook them. Heat a griddle pan or barbecue until hot.  Place the kebabs on the hot griddle pan or barbecue. Baste them with the marinade every 3-4 minutes, turning frequently so they cook evenly. Cook for about 8-10 minutes, then remove from the heat and leave to rest for 4-5 minutes before serving. ","ingredients":" 2 duck breasts, skin on,  75ml\/2½fl oz vegetable oil,  75ml\/2½fl oz dark soy sauce,  2 tbsp clear honey,  2 limes, juice only,  3 garlic cloves, grated,  1 red chilli, finely chopped,  3cm\/1in fresh ginger, grated,  2 large field mushrooms, each cut into 6 pieces,  1 large head of broccoli, broken into large florets,  1 green pepper, deseeded and cut into squares,  2 red onions, each cut into 8 chunks,  8 lemongrass stalks","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck_and_lemongrass_18615"}