{"recipe_name":"Ayam golek (spiced chicken with coconut cream and rojak salad)","author":"Tom Kime","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6 and preheat a large griddle pan until hot. For the poussins, place the softened chillies, shallots, garlic, ginger, galangal and salt into a food processor and blend. Add a little water if necessary to form a smooth paste. (Blend the hardest ingredients first, then add the softer ones to the processor to ensure the paste is very smooth.) Bruise the lemongrass with a rolling pin, then place a stalk inside the body cavity of each poussin. Rub half of the spice paste over both the insides and outsides of the poussins. Place the remaining spice paste into a pan. Add the coconut cream and sugar and place over a medium heat. Bring to a boil, then reduce the heat to simmer, until the liquid has reduced by half. Place the poussins onto the hot griddle pan and griddle for 3-4 minutes on all sides to achieve golden-brown griddle marks all over. Transfer the poussins to a roasting tray and place into the oven to roast for 15-20 minutes, or until completely cooked through. During cooking, baste the poussins with the reduced coconut cream and spice mixture every five minutes. Remove the poussins and leave to rest for 4-5 minutes in a warm place. Before serving, pour all of the juices from the roasting tray over the poussins and drizzle with the lime juice. For the dressing, reduce the oven temperature to 180C\/365F\/Gas 4. Place the shrimp paste into kitchen foil and wrap up to seal. Bake in the oven for ten minutes, or until it becomes nutty and drier (it should smell aromatic rather than pungent). Grind the chillies and ginger together in a pestle and mortar.  Add the roasted shrimp paste and grind again with the pestle and mortar to combine well. Add the tamarind pulp, lime juice, water, fish sauce and sugar and mix well. For the rojak salad, place the cucumber, pineapple, mango, papaya and apple into a bowl and mix together well. Add the spring onion and mint and mix through gently. Add half of the peanuts and stir through gently. Pour over the dressing and stir again to coat well. To serve, place a poussin onto each plate. Add a couple of spoonfuls of salad and garnish with the remaining peanuts and a few mint leaves. ","ingredients":" 2cm\/1in piece fresh root ginger,  2cm\/1in piece galangal (if galangal is not available, use double the quantity of fresh root ginger),  1 tsp salt,  4 dried chillies, soaked in hot water to soften,  5 shallots, roughly chopped,  2 garlic cloves,  4 lemongrass stalks, tough outer leaves removed,  4 poussin or baby chickens ,  300ml\/10½fl oz coconut cream,  2 tsp sugar,  2 limes, juice only,  2 tbsp shrimp paste,  3 fresh red chillies, seeds removed, finely chopped,  4cm\/1½in piece of fresh root ginger, grated,  1 tbsp tamarind pulp, mashed (available in Asian and Indian supermarkets),  1 lime, juice only,  5 tbsp boiling water,  2 tbsp fish sauce (nam pla),  3 tbsp caster sugar,  ½ small cucumber, cut into triangular chunks,  ¼ fresh pineapple, peeled, core removed, cut into cubes,  1 firm unripe mango, peeled, stone removed, cut into thin wedges,  1 firm unripe papaya, peeled, seeds removed, cut into strips,  1 Granny Smith apple, core removed, cut into thin wedges,  2 spring onions, finely sliced,  ½ bunch fresh mint, leaves only, torn (plus extra to garnish),  100g\/3½oz roasted blanched peanuts, coarsely crushed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ayamgolekspicedchick_86656"}