{"recipe_name":"Duck breast with umeboshi sauce and steamed bok choi","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03fkz17.jpg","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. In a bowl, mix together the curry powder, ground ginger, Chinese five-spice and sansho pepper. Set aside a teaspoon of the spice mixture for the plums. Sprinkle the rest of the spice mixture over the skin and flesh of the duck breasts. Place the duck breasts, skin-side down, into a large, cold, non-stick, ovenproof frying pan.Turn on the heat to high and leave for 3-4 minutes, until the pan is hot and the fat has rendered.  Turn over the duck breasts and drizzle half of the honey over the skins. Transfer the pan to the oven and roast the duck breasts for 8-10 minutes (for medium), or longer until cooked to your liking, basting the duck breasts with the pan juices halfway through cooking. When the duck is cooked to your liking, remove from the pan and set aside to rest on a warm plate for 8-10 minutes. Meanwhile, steam the bok choi leaves with the ginger, garlic, chilli and red onion in a steamer suspended over a pan of barely simmering water for 5-6 minutes, or until wilted and tender. Blend the plums to a fine purée with 1 teaspoon of the remaining spice mixture and all of the remaining honey, using a food processor or hand-held blender. Warm the mixture in a small saucepan, then add it to the juices released from the duck. Season with more honey if needed. To serve, divide the steamed vegetables equally among four serving plates. Carve the duck breasts into thick slices and arrange them alongside. Finish with a dollop of the umeboshi sauce. ","ingredients":" 1 tsp mild curry powder,  1 tsp ground ginger,  1 tsp Chinese five-spice powder,  2 tsp sansho pepper,  4 x 175g\/6oz duck breasts,  4 tbsp honey,  1 head of bok choi, root removed, leaves separated,  3cm\/1¼in root ginger, peeled, finely diced,  1 garlic clove, crushed,  1 red chilli, finely sliced,  ½ red onion, finely sliced,  200g\/7oz umeboshi plums, stones removed (available from health food shops and online specialists)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck_breast_with_30241"}