{"recipe_name":"Duck breast with confit duck cassoulet","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Cut the duck legs in half. Shred the meat off from the top half and reserve. Heat a casserole dish and add the duck fat, once hot add the garlic, shallot and rosemary and cook for 2-3 minutes.  Add the pancetta and cook for a minute until crispy. Add the bay leaf, beans, cabbage and chicken stock, once hot add the butter and mix until you form an emulsion. Finish with the parsley and shredded duck leg meat. For the roasted duck breast, heat an ovenproof frying pan and place the duck skin side down and cook for 4-5 minutes until golden-brown and crisp, and turn over.  Transfer to the oven for 4-6 minutes. Allow to rest for at least 8 minutes before slicing and serving. Heat a small frying pan and add a little oil, once hot add the trimmed duck leg and the honey and cook for 1-2 minutes or until golden-brown.  To serve, place the confit duck cassoulet in the centre of a plate and top with the sliced duck breast and the honey-glazed duck leg. Dress the plate with the duck jus. ","ingredients":" 2 confit duck legs,  2 tbsp fat from the confit duck,  2 garlic cloves, finely chopped,  1 large shallot, finely chopped,  2 tbsp roughly chopped fresh rosemary leaves,  50g\/1¾oz pancetta lardons,  1 bay leaf,  400g tin cannellini beans, drained,  ¼ hispi cabbage, thinly shredded,  275ml\/\/9fl oz chicken stock,  100g\/3½oz unsalted butter,  1 tbsp chopped fresh flat leaf parsley,  2 tbsp runny honey,  4 x small duck breasts, skin on, scored,  200ml\/7fl oz duck jus, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck_breast_with_confit_69482"}