{"recipe_name":"Duck burger and chips","author":"Michel Roux Jr.","programme":"Food & Drink","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/duck_burger_and_chips_40267_16x9.jpg","method":"For the duck burger, roughly remove about two-thirds of the fat from each duck breast and then chop them into chunks and pass through a mincer. Season the meat well and form into two balls using your hands. Take one ball of meat and push a scoop of Vacherin into the centre. Form the meat around the Vacherin and pat down a little to make a classic burger shape. Repeat with the remaining ball and scoop of cheese. Preheat the oil in a deep fat fryer to 160C\/325F (CAUTION: hot oil can be dangerous: Do not leave unattended.) Rinse the chipped potatoes under cold running water to remove any excess starch. Dry thoroughly on a clean tea towel and then place into the hot oil to cook for about 8-10 minutes. The chips should begin to lightly colour on the outside and be soft enough to crush between your fingers. Carefully remove the chips from the oil with a slotted spoon and drain on a plate lined with kitchen paper. Increase the oil temperature to 180C\/350F In the meantime, heat a griddle pan over a high heat. Once hot, add the burgers and fry for 3-4 minutes on each side until nicely cooked on each side and just cooked through in the middle. If you like your burger fully cooked through, place in a hot oven for a few minutes to finish. Otherwise, place the burgers on to a plate to rest. Place the sliced shallots onto the hot griddle to caramelise. Cook for about two minutes. Heat the butter in a separate pan over a high heat. Add the mushrooms and fry for 3-4 minutes, or until just softened. When you are ready to eat, add the chips to the hot oil and cook for 2-3 minutes, or until golden-brown and crisp. Remove and drain on a plate lined with kitchen paper.  Serve the duck burgers with the shallots and mushrooms in a brioche bun. ","ingredients":" 2 large duck breasts,  2 tbsp Vacherin cheese, scooped from the middle,  2 banana shallots, peeled and sliced into thin strips,  1 tbsp butter,  250g\/9oz girolle mushrooms, cleaned,  2 brioche buns,  vegetable oil, for deep frying,  2 King Edward potatoes, cleaned and chipped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck_burger_and_chips_40267"}