{"recipe_name":"Duck confit with smoked-duck salad, caramelised pecans and blue-cheese dressing","author":"James Martin","programme":"Christmas Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the duck, preheat the oven to 200C\/180C Fan\/Gas 6. Place the confit duck legs on a baking tray in the oven for 10 minutes to heat through. Meanwhile, for the caramelised pecans, heat a frying pan over a high heat until hot. Add the sugar and cayenne pepper and cook without stirring until the sugar has melted (swirl the pan carefully from time to time if you think the sugar will start to burn).  When the sugar starts to melt, add 50ml\/2fl oz of water and swirl the pan to combine (CAUTION: boiling sugar is extremely hot. Handle very carefully.).   Continue to cook over a high heat until the sugar melts to a deep-coloured caramel, then add the pecans and salt and stir to coat them in the caramel.  Transfer the caramelised pecans to a roasting tray, then bake in the oven for 4-5 minutes. Meanwhile, for the blue-cheese salad, in a large mixing bowl, beat the gorgonzola and St Agur until slightly broken down, then whisk in the garlic, honey, buttermilk and crème fraîche until well combined. Whisk in the lemon juice, Tabasco, Worcestershire sauce, vinegar and mayonnaise until well combined, then season, to taste, with salt and freshly ground black pepper. When the confit duck legs have heated through, remove them and the caramelised pecans from the oven and set aside until cool enough to handle. Shred the duck meat from the bone. To serve, pile the sliced lettuce leaves onto a serving platter and drizzle over the blue-cheese dressing. Top with the shredded confit-duck leg, slices of smoked duck and the caramelised pecans. ","ingredients":" 2 ready-made confit duck legs ,  1 head Romaine lettuce (or similar firm, crisp lettuce), root trimmed, leaves cut into 2.5cm\/1in thick slices,  1 smoked duck breast, sliced,  75g\/2¾oz soft light brown sugar,  pinch cayenne pepper,  100g\/3½ oz pecans,  pinch salt,  75g\/2¾oz gorgonzola, roughly chopped,  50g\/1¾ozmild, creamy blue cheese such as St Agur, roughly chopped,  1 garlic clove, finely chopped,  2 tbsp honey,  50ml\/2fl oz buttermilk,  60g\/2¼oz crème fraîche,  1 lemon, juice only,  dash Tabasco,  2 dashes Worcestershire sauce,  1 tbsp red wine vinegar,  75g\/2¾oz ready-made mayonnaise,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck_confit_with_85583"}