{"recipe_name":"Duck salad with blue cheese dressing","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01s2l8l.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Put the duck legs onto a tray in the oven for 10 minutes to heat through. Meanwhile, heat a frying pan until hot, add the sugar and cayenne pepper. When the sugar stars to melt, add 50ml\/2floz of water and swirl to combine. Cook over a high heat until the sugar turns into a deep-coloured caramel, then add the pecan nuts and salt and stir to coat. Tip out onto a roasting tray and place in the oven for five minutes while you make the dressing. Put the gorgonzola and St Agur into a bowl and whisk to break down the cheese slightly, then add the garlic, honey, buttermilk and crème fraîche and whisk well. Add the lemon juice, Tabasco, Worcestershire sauce, vinegar and mayonnaise and whisk well until combined, then season with salt and black pepper. Remove the duck and pecans from the oven and allow to cool enough to handle, then shred the duck from the bone. Toss the lettuce with some of the dressing, just enough to coat the leaves, then add the shredded duck and pecans and toss together. Pile into a large bowl and serve straight away. ","ingredients":" 2 confit duck legs,  75g\/3oz soft light brown sugar,  1 pinch cayenne pepper,  100g\/3½ oz pecan nuts,  pinch salt,  75g\/2½oz gorgonzola, roughly chopped,  50g\/1¾oz St Agur blue cheese, roughly chopped,  1 garlic clove, finely chopped,  2 tbsp honey,  50ml\/2fl oz buttermilk,  60g\/2¼oz crème fraîche,  1 lemon, juice only,  dash Tabasco,  2 dashes worcestershire sauce,  1 tbsp red wine vinegar,  75g\/2½oz mayonnaise,  1 head Romaine lettuce, cut into 2.5cm\/1in thick slices","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck_salad_with_blue_19571"}