{"recipe_name":"Duck spring rolls with dipping sauces","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the filling for the spring rolls, heat a wok and add the oil. Once hot add the ginger, mushrooms, bamboo shoots and water chestnuts. Cook for a couple of minutes. Add the soy sauce, Chinese five-spice powder, beansprouts, spring onions and carrot. And cook for 1 minute. Add the duck meat, oyster sauce and finish with the toasted sesame oil. Transfer to a dish and let this mixture cool before using it. To assemble the spring rolls, arrange one spring roll wrapper so that the corners are pointing upwards, downwards and to the sides. Spoon 2 teaspoons of filling near the bottom corner about 2cm\/¾in from the edge. (Make sure the filling is cool but not too wet – otherwise the spring roll will be soggy and you will break the spring roll wrapper.) Roll the wrapper over the filling, squeezing any air out as you roll away from you. As you reach the middle bring the 2 side corners to the middle, making sure they overlap. Continue to roll and tuck the top edge in and seal it with a little of the beaten egg.  Repeat with the remaining spring roll wrappers and filling. Fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with vegetable oil. Heat the oil to 180C. (CAUTION: Hot oil can be dangerous. Don't leave unattended) Deep-fry the spring rolls in batches for 5-6 minutes swishing them in the fryer until golden-brown. Remove and drain on kitchen paper.  For the barbecue dipping sauce, fry the onion and garlic in the oil with the chilli, fennel seeds and sugar. Add the soy sauce and ketchup and season with salt and pepper.  Bring to the boil and simmer for a few minutes to combine the flavours.  For the sweet and sour dipping sauce, put all the ingredients in a pan and bring to a boil and cook until it thickens, 5-8 minutes. To serve, place the spring rolls on a serving board or slate and pour the 2 dipping sauces in separate bowls and serve alongside. Garnish with fresh coriander, spring onions and fresh red chilli. ","ingredients":" 1 tbsp groundnut oil,  1 tsp grated fresh root ginger,  50g\/1¾oz fresh shiitake mushrooms or soaked porcini mushrooms, sliced, stalks removed,  50g\/1¾oz tinned bamboo shoots, drained and cut into matchsticks,  25g\/1oz tinned water chestnuts, drained, sliced into small strips,  1 tbsp light soy sauce,  ½ tbsp Chinese five-spice powder,  30g\/1oz beansprouts, must be very fresh,  1 large spring onion, sliced lengthways,  ½ small carrot, cut into matchsticks,  2 confit duck legs, meat shredded,  1 tbsp of oyster sauce,  1 tsp toasted sesame oil,  25-30 large spring roll wrappers, 15x15cm\/6x6in square shape,  1 medium free-range egg, lightly beaten ,  vegetable oil, for deep-frying ,  1 tbsp vegetable oil,  1 small onion, chopped,  2 garlic cloves, crushed,  1 red chilli, finely chopped,  1 tsp fennel seeds, crushed,  50g\/1¾oz dark brown sugar,  50ml\/2fl oz dark soy sauce,  300ml\/10fl oz tomato ketchup,  salt and freshly ground black pepper,  150g\/5½oz caster sugar,  150ml\/5fl oz rice wine,  75ml\/2½fl oz grapefruit juice,  4 tbsp soy sauce,  1 tsp chilli flakes,  10cm\/4in piece fresh root ginger, finely grated,  2 tbsp chopped coriander,  4 spring onions, chopped,  1 red chilli, chopped into rings","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duck_spring_rolls_with_84656"}