{"recipe_name":"Duck breasts with pepper cream sauce, wild mushrooms, spinach, chard and potatoes en cocotte","author":"Paul Rankin","programme":"Put Your Money Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the potatoes, preheat the oven to 190C\/375F\/Gas 5. Pour the oil into a heavy-based roasting tray and heat in the oven for 8-10 minutes, or until smoking.  Add the garlic cloves and new potatoes to the hot oil and return to the oven. Roast for 18-20 minutes, or until the potatoes are tender. Dot the butter over the potatoes, then continue to roast for a further 4-5 minutes, or until the skins are golden-brown. Meanwhile, for the pepper cream sauce, heat the butter in a pan over a medium heat. When the butter is foaming, add the shallots and fry for 3-4 minutes, or until softened but not coloured. Increase the heat and add the wild mushrooms. Continue to fry for 2-3 minutes, or until the mushrooms have softened and are golden-brown. Add the cognac and continue to cook until it has almost all evaporated. Add the stock and bring to a simmer. Continue to simmer for 4-6 minutes, or until the volume of liquid has reduced by half.  Add the cream and simmer until the volume of liquid has reduced by half again. Strain the pepper sauce through a fine sieve. Add the crushed green and black peppercorns and stir to combine. Keep warm.  For the duck, increase the oven temperature to 200C\/400F\/Gas 6.  Place the duck breast, fat-side down, into a cold ovenproof frying pan. Turn the heat to maximum (the duck fat will slowly render, resulting in crisp, golden-brown skin).  When the pan is hot and the fat is sizzling, fry the duck breast for 6-8 minutes, or until the fat is crisp and golden-brown. Drain off any excess fat, then turn the breast over and continue to fry for 6-8 minutes, or until browned.  Transfer the pan to the oven and roast for a further 6-8 minutes (for medium) or longer if you prefer your meat well done. When the duck is cooked to your liking, set aside on a warm plate to rest for 4-5 minutes. Meanwhile, for the wild mushrooms, heat the butter and oil in a frying pan over a medium heat. When the butter is foaming, add the mushrooms (do this in batches if necessary). Fry for 4-5 minutes, or until softened and golden-brown, then remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Meanwhile, for the chard and spinach, heat the butter and olive oil in a frying pan. When the butter is foaming, add the blanched chard and spinach and stir to coat in the butter and oil. Heat until wilted, then remove from the heat and keep warm. To serve, divide the wilted spinach and chard mixture equally among four serving plates. Drizzle over a little of the pepper sauce. Place a duck breast on top of each portion. Sprinkle the fried mushrooms around the edge of the plates. Drizzle over the remaining pepper sauce. ","ingredients":" 5 tbsp olive oil,  8 garlic cloves, skin on, left whole, crushed,  1kg\/2lb 3¼oz Jersey Royal potatoes, or similar new potatoes,  75g\/2½oz butter,  1 tbsp butter,  2 shallots, finely chopped,  100g\/3½oz wild mushrooms, cleaned and roughly chopped,  25ml\/1fl oz cognac,  250ml\/8¾fl oz chicken stock,  200ml\/7fl oz double cream,  2 tbsp crushed green peppercorns,  2 tbsp crushed black peppercorns,  4 duck breasts, fat scored in a criss-cross pattern with a sharp knife,  1 tbsp butter,  2 tbsp olive oil,  400g\/14¼oz wild mushrooms,  1 bunch chard, tough stems removed, leaves blanched and refreshed in cold water,  250g\/8¾oz baby spinach leaves, blanched and refreshed in cold water,  1 tbsp butter,  1 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duckbreastswithpeppe_91398"}