{"recipe_name":"Baba ganoush, grilled aubergine with lentils and aubergine fritters","author":"Matt Tebbutt","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the baba ganoush, hold the aubergines over a gas flame until blackened all over (alternatively char them under a hot grill). Put them in a large bowl and cover with cling film. Set aside for a few minutes, then wash off the blackened skin and scoop out the flesh.  Place in a food processor with the other ingredients apart from the herbs. Blend until smooth but with a little texture. Remove from the processor and season to taste with salt and pepper. Sprinkle over the fresh herbs and serve.  For the lentils and grilled aubergine, heat a large ridged griddle pan. Place the aubergine in a bowl and add the oil, garlic and parsley. Mix to coat the aubergine. Place the slices of aubergine onto the hot griddle pan and cook for 1–2 minutes on each side. Mix the lentils with the remaining ingredients and season with salt and pepper.  Put the griddled aubergines onto a serving plate and pile the lentil mixture on top. For the aubergine fritters, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. Mix the flour with a little water to make a smooth batter. Dip the aubergine pieces into the batter to coat. Deep-fry in batches for 3–4 minutes, or until golden. Leave to drain on kitchen paper. Mix the lemon zest, parsley and chilli together. Sprinkle over the deep-fried aubergines and grate over the salted ricotta. ","ingredients":" 2 aubergines,  2 garlic cloves, chopped,  1 lemon,  1 tbsp tahini ,  2 tbsp olive oil,  1 tbsp chopped fresh parsley,  1 tbsp chopped fresh mint,  1 aubergine, sliced ,  2 tbsp olive oil,  1 garlic clove, chopped,  150g\/5½oz cooked Puy lentils,  1 tbsp chopped fresh coriander,  1 tbsp chopped fresh parsley,  2 tbsp olive oil,  1 tbsp white wine vinegar,  2 shallots, chopped,  vegetable oil, for deep-frying,  300g\/10½oz chickpea flour,  2 aubergines, cut into finger lengths,  1 lemon, grated zest only,  2 tbsp chopped fresh parsley,  1 red chilli, finely chopped,  100g\/3½oz salted ricotta","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/baba_ganoush_grilled_50988"}