{"recipe_name":"Duck with cherries and potato scones","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Score the skin of the duck a few times with a sharp knife and place skin-side down into a cold frying pan. Place the frying pan over a medium heat and cook the duck breasts for 8-10 minutes, pouring off any excess fat (you can reserve and refrigerate the duck fat for use in cooking roast potatoes). Turn the duck breasts over and cook for 1-2 minutes, then transfer onto a baking tray and place into the oven to roast for 8-10 minutes, or until cooked to your liking. Meanwhile, pour the sherry into the frying pan used to cook the duck breasts and bring to a boil while scraping up the juices from the base of the pan. Cook until the sherry has almost reduced completely. Add a little oil, then add the onion and garlic and cook over a medium heat for 5-6 minutes, until softened. Add the cherries, chilli flakes, brandy and the stock. Bring to the boil, then cook to reduce the liquid by half. Add the cold butter and whisk well to create a glossy sauce. For the potato scones, sift the flour and baking powder into a bowl.  Melt the butter in a clean pan over a medium heat. Add the onion and thyme and fry until the onion has softened. Add the onion and thyme mixture to the flour mixture and mix well. Add the beaten eggs, the milk and the mashed potatoes and season with salt and freshly ground black pepper. Mix together well to form a dough. Divide the dough into four equal potions and mould each portion into scone-shapes.  Place onto a tray and transfer to the fridge to rest for 20 minutes. Melt the extra butter in a clean frying pan over a medium heat. Add the potato scones and fry for 2-3 minutes on each side, or until golden-brown on each side. (If the scones are still very moist you can transfer them to the warm oven for 2-3 minutes to dry out.) To serve, place a scone onto each of four plates. Slice each duck breast and place a few slices onto each scone. Pour over sauce and garnish with a sprinkling of flaked almonds. ","ingredients":" 4 x 175g\/6oz duck breasts,  salt and freshly ground black pepper,  50ml\/2fl oz dry sherry,  1 tbsp vegetable oil ,  1 onion, finely chopped ,  1 garlic clove, chopped ,  400g\/14oz cherries, stones and stalks removed ,  pinch dried chilli flakes,  100ml\/3½fl oz cherry brandy,  100ml\/3½fl oz chicken stock,  25g\/1oz cold butter,  200g\/7oz plain flour,  1 tsp baking powder,  50g\/2oz butter, plus extra for frying,  1 onion, finely chopped ,  1 tsp fresh thyme leaves,  2 free-range eggs, beaten,  3 tbsp milk,  250g\/10½oz cooked potato, mashed,  salt and freshly ground black pepper,  125g\/4½oz flaked almonds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/duckwithcherriesandp_86810"}