{"recipe_name":"Spiced pork loin with black pudding sauce, asparagus, and spiced January King cabbage","author":"Nigel Haworth","programme":"2007-16","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pork loin, mix together the salt, orange zest, juniper, cinnamon, Jamaican allspice and a pinch of sugar. Rub this all over the pork loin. Wrap tightly in clingfilm and leave to marinate in the fridge for three days. For the spicy cabbage, when you are ready to cook, mix the 30g\/1oz of salt with the sliced cabbage and set aside for 30 minutes. Meanwhile, put the pork in a pressure cooker with the diced parsnip and stock and cook for 25 minutes. Remove the pork from the cooker. Allow it to rest for five minutes then sprinkle with icing sugar and glaze with a blow torch.  To make the sauce, pour off the excess cooking juices from the pork into a small pan, add a little more stock and bring to the boil, thicken lightly with fecule (potato starch) and pass through a fine sieve. Add the diced black pudding. Reserve. Remove the parsnips and crush with a fork, add a knob of butter and a few drops of cream. Mix in the parsley and reserve. Cook the asparagus spears in boiling water with a pinch of salt and sugar added. To cook the spicy cabbage, wash the cabbage thoroughly and dry well. In a heavy-bottomed pan, gently fry the bacon, add the roast garlic then the cabbage, rice vinegar and cumin. Mix well and season to taste with salt. Stir well and cook for two minutes, or until the cabbage is tender. Check the seasoning again and reserve. To serve, place the spicy cabbage in the center of the plate. Carve the pork into two slices per portion and place on top. Place the crushed parsnip to the right and garnish with asparagus. Spoon on the gravy and black pudding. Garnish with the pork rind and serve.  ","ingredients":" 2 tsp salt,  ½-1 orange, zest only,  6 juniper berries, crushed,  1 stick cinnamon, crushed,  2 tsp Jamaican allspice,  pinch sugar,  700g\/1lb 9oz pork loin,  1 large parsnip, peeled and cut into large dice,  600ml\/21fl oz chicken stock, plus extra for the gravy,  1 tbsp icing sugar,  pinch fecule (potato flour),  1 black pudding (2cm\/¾in thick, 12cm\/4½in long), diced,  knob of butter,  dash of cream,  2 tbsp chopped parsley ,  8 spears new season asparagus ,  4 pieces deep-fried pork rind, to garnish,  300g\/11oz January King cabbage, thinly sliced,  30g\/1oz salt,  50g\/1¾oz smoked bacon lardons,  5g roasted garlic,  25ml\/1fl oz rice vinegar,  2 pinches of cumin,  pinch salt, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/easter_spiced_pork_loin_42095"}