{"recipe_name":"Eastern-spiced shepherd’s pie with Bombay potato topping","author":"The Hairy Bikers","programme":"Hairy Bikers Everyday Gourmets","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/eastern-spiced_shepherds_80973_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Heat the oil in a large frying pan with a tight-fitting lid over a medium heat. Add the onions, celery, carrots, garlic, ginger and spices, stir well and fry for 8-10 minutes, or until the vegetables have softened slightly. Increase the heat and stir in the leftover lamb and orange zest. Continue to cook for a further five minutes. Sprinkle over the flour and stir to incorporate, then pour over the stock. Bring the mixture to the boil, then reduce the heat until the mixture is simmering and stir in the honey, Worcestershire sauce, and figs. Season, to taste, with salt and freshly ground black pepper. Cover the pan with the lid and simmer for 12-15 minutes. Remove from the heat and set aside to cool slightly. Preheat the oven to 180C\/350F\/Gas 4. For the Bombay mashed potato, cook the potatoes in a large pan of boiling salted water for 12-15 minutes, or until tender. Drain well and mash until completely smooth. While the potatoes are boiling, heat the oil in a small frying pan. Add the mustard seeds, curry powder and cumin seeds and fry gently until the seeds start to pop. (Caution: keep your eyes and face away from the pan.) Remove the pan from the heat and set aside. Stir the spice mixture into the mashed potato and season well with salt and freshly ground black pepper. Spoon the filling into a suitably sized ovenproof dish (or two smaller ones if necessary). Top with the Bombay mashed potato, smoothing into an even layer using a spatula. Drag a fork through the topping to decorate. Bake the shepherd’s pie in the oven for 15-20 minutes, or until the filling is bubbling and the mashed potato is crisp and golden-brown. ","ingredients":" 2-3 tbsp sunflower oil,  2 onions, peeled, diced,  2 celery stalks, trimmed, diced,  2 carrots, peeled, trimmed, diced,  3 garlic cloves, peeled, chopped,  knob fresh ginger, peeled, grated,  1 tsp ground cinnamon,  1 tsp ground coriander,  1 tsp ground cumin,  ½ tsp ground turmeric,  1 tsp mustard seeds,  500g\/1lb 2oz leftover roast lamb, finely diced,  ½ orange, zest only,  1 tbsp plain flour,  250ml\/9fl oz warm lamb stock,  1 tsp clear honey,  1 tbsp Worcestershire sauce,  4 dried figs, chopped,  salt and freshly ground black pepper,  400g\/14oz floury potatoes, such as Maris Piper, peeled, diced,  2 tbsp sunflower oil,  1 tsp mustard seeds,  3 large pinches mild curry powder,  ½ tsp cumin seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/eastern-spiced_shepherds_80973"}