{"recipe_name":"Easy roast chicken with gravy","author":"Tom Kerridge","programme":null,"prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/easy_roast_chicken_with_29774_16x9.jpg","method":"Preheat the oven to 140C\/120C Fan\/Gas 1.  Put the carrots, celery and onion in a roasting tray and place the chicken on top. Stuff the cavity of the chicken with the lemon and herbs, then drizzle with the oil, rubbing it into the skin. Season, to taste, with salt and pepper.  Roast the chicken for 3 hours, basting the skin with the juices halfway through. Increase the oven temperature to its highest setting and continue to roast the chicken for 5-10 minutes to crisp up the skin. Remove it from the roasting tray and check it is cooked through (see tips), then set aside on a platter to rest for 10-15 minutes. Reserve the vegetables and cooking juices in the roasting tray.  Meanwhile, for the gravy, strain the reserved vegetables and cooking juices through a fine sieve into a saucepan, squeezing the vegetables with the back of a wooden spoon to extract maximum flavour. Add the stock to the pan and bring to the boil. Put the roasting tray over a low heat and add the butter. As the butter melts, scrape up any burned bits from the bottom of the tray using a wooden spoon. Whisk in the flour until it forms a paste.  Gradually pour the hot roasting juices and stock back into the roasting tray, whisking after each addition, until all the liquid is incorporated and the gravy has thickened. Season with a little salt. Heat until just bubbling, then continue to cook the gravy, stirring well, for 5 minutes. Season with a pinch of salt.  Strain the gravy through a sieve into a serving jug. Keep warm. Just before serving, stir any juices released by the rested chicken in to the gravy.  To serve, carve the roast chicken at the table and serve with roasted vegetables and potatoes. Drizzle with the gravy. ","ingredients":" 2 carrots, cut into chunks,  2 celery stalks, trimmed, cut into chunks,  1 onion, cut into six ,  1 x 2kg\/4½lb whole chicken,  ½ lemon, cut into quarters,  small bunch fresh mixed herbs (sage, thyme and rosemary),  dash vegetable oil ,  salt and freshly ground black pepper,  potatoes and roasted vegetables, to serve,  275ml\/½ pint chicken stock ,  30g\/1¼oz butter ,  1 tbsp plain flour ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/easy_roast_chicken_with_29774"}