{"recipe_name":"Eccles cakes","author":"Jackie Kearney","programme":"MasterChef","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/eccles_cakes_72475_16x9.jpg","method":"For the filling, melt the butter over a low heat in a small saucepan. Once melted, remove from the heat and stir in all of the remaining filling ingredients until well combined. Set aside to cool.  Preheat the oven to 220C\/425F\/Gas 7. Grease a baking tray with the margarine. For the pastry, roll out the pastry on a lightly floured work surface to a thickness of about 3mm\/⅛in. Using a 6cm\/2½in cutter, cut the pastry into rounds. Place a teaspoon of the filling in the middle of each round, then brush the edges of half the pastry with milk. Bring the other half of the pastry over and seal. Bring the corners of the pastry up into the middle and pinch to seal.  Turn thr sealed pastry parcel over, so that the seam is underneath, then gently roll out until it is about ½cm\/¼in thick. Gently pat back into a round shape and place onto the greased baking tray. Slash each cake across three times using the tip of a sharp knife. Brush the cakes with milk and sprinkle with caster sugar.  Bake for 15 minutes, or until the pastry is golden-brown and puffed up. Transfer the cakes to a wire rack to cool.  Dust the eccles cakes with icing sugar before serving.  ","ingredients":" 75g\/3oz unsalted butter,  150g\/5oz soft brown sugar,  150g\/5oz currants,  1 tsp ground cinnamon,  ½ tsp freshly ground nutmeg ,  1 orange, juice and finely grated zest ,  50g\/2oz mixed citrus peel,  25-50g\/1-2oz margarine, for greasing,  1 block ready-made puff pastry,  flour, for dusting,  2-3 tbsp milk, for glazing ,  caster sugar, for dusting,  icing sugar, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/eccles_cakes_72475"}