{"recipe_name":"Egg fu yung with roasted red pepper and sweet chilli sauce","author":"Ching-He Huang","programme":"Chinese Food Made Easy","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01941m8.jpg","method":"Preheat the oven to 200C\/390F\/Gas 6. For the red pepper and sweet chilli sauce, place the sliced pepper onto a baking tray, drizzle with olive oil and season with salt and freshly ground black pepper. Roast in the oven for ten minutes, or until softened, then transfer to a food processor. Add the sweet chilli sauce and lime juice and blend to a smooth paste.  For the egg fu yung, heat a wok until smoking and add the groundnut oil. Add the mushrooms, red pepper and bacon and stir-fry for one minute, or until crisp and golden-brown. Add the stir-fry mixture to the beaten eggs and stir to combine. Carefully wipe out any excess oil from the wok with kitchen paper. Place the wok over a high heat and add the remaining oil, swirling to coat the wok. Add half the beaten egg mixture and cook for 1-2 minutes, or until golden-brown on the underside. Flip the omelette over and cook for another minute on the other side, or until golden-brown and cooked through. Season with soy sauce and freshly ground white pepper. Slide onto on a warmed plate and cover with foil. Repeat with the remaining egg mixture.  To serve, arrange the mixed salad leaves on a plate and place the omelette to the side. Spoon over the red pepper and sweet chilli sauce and serve immediately. ","ingredients":" ½ red pepper, seeds removed, flesh sliced into strips,  olive oil, for drizzling,  salt and freshly ground black pepper,  5 tbsp sweet chilli sauce,  1 tsp lime juice,  3 tbsp groundnut oil,  1 small handful shiitake mushrooms or chestnut mushrooms, sliced,  1 red pepper, de-seeded and diced,  75g\/3oz smoked bacon, diced,  5 free-range eggs, lightly beaten,  dash light soy sauce,  pinch freshly ground white pepper,  mixed salad leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/eggfuyoungwithroaste_89264"}