{"recipe_name":"Eggs Benedict","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Fill a small pan just over one third full with cold water and bring it to the boil. Add the vinegar and reduce to a simmer. Crack the eggs one at a time into a small bowl and gently tip into the simmering water. Poach for 2-3 minutes. Remove with a slotted spoon and plunge into iced water, then remove the eggs and place them on a kitchen towel.   For the hollandaise sauce, melt the butter slowly in a medium pan over a low heat, stirring occasionally.  Remove from the heat and pour the butter into a jug.  Add enough water into a medium saucepan to come a third of the way up the sides.  Bring to the boil, then reduce the heat to a simmer. Put the vinegar, shallot, peppercorns and bay leaf in a small saucepan over a high heat and bring to the boil.  Cook for 1-2 minutes, or until reduced to two tablespoons of liquid.  Remove from the heat.   Put the egg yolks in a heatproof bowl and place over the pan of simmering water.  Whisk the egg yolks with the salt and sugar until pale.  Pour the vinegar mixture through a fine sieve onto the yolks and continue whisking until well combined.  Slowly add the butter in a steady stream whisking constantly until the sauce is smooth, thick and shiny. Toast the muffin halves and bring the pan of water back to a simmer, ready to reheat the eggs. Spread the muffins with butter.  Put a muffin half on each plate and top with ham or salmon.  Using a slotted spoon, drop the cooked eggs in to the simmering water and reheat for one minute.  Remove and drain on kitchen paper.   Place an egg on each muffin and spoon over some hollandaise.  Sprinkle with chives and serve with the other muffin halves on the side. ","ingredients":" 6 free-range eggs, at room temperature,  2 tbsp white wine vinegar,  6 English muffins, halved,  butter, for spreading,  6 slices ham or smoked salmon,  1-2 tbsp finely snipped fresh chives,  225g\/8oz butter, cut into pieces,  4 tbsp white wine vinegar,  1 small shallot or ½ banana shallot, peeled and very finely chopped,  10 black peppercorns,  1 bay leaf,  3 free-range egg yolks,  pinch sea salt flakes,  pinch caster sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/eggs_benedict_10471"}