{"recipe_name":"Elderflower and honeycomb tartlets","author":"Urvashi Roe","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, place the flour, butter, salt and icing sugar into a food processor and pulse until the mixture resembles fine breadcrumbs. Beat the egg and elderflower cordial together in a small jug and with the motor running, slowly pour the egg mixture into the flour mixture until it comes together to form a dough. Remove the dough from the processor and knead lightly on a floured surface. Wrap in cling film and chill in the fridge for about 30 minutes. Preheat the oven to 150C\/300F\/Gas 2. Grease a 12-hole tart tin with butter.  Roll the pastry out on a lightly floured work surface and using a fluted edge 7.5cm\/3in biscuit cutter, cut out 12 circles . Gently place the pastry circles into the holes in the tart tin, prick with a fork and bake in the oven for 10-12 minutes, or until golden-brown.   For the honeycomb, grease and line a baking tray with greaseproof paper. Place the sugar, honey, water and glucose into a pan and boil until temperature reaches 160C\/320F (use a sugar thermometer to check this) – it should be a light caramel colour. Take it off the heat and quickly whisk in the bicarbonate of soda then pour onto the baking tray. Set the honeycomb aside to cool then break into pieces.  For the filling, mix the sugar, egg, egg yolk and cornflour into a large bowl. Put the milk and cream into a saucepan and heat over a low flame until it starts to simmer.  Whisk the hot milk and cream into the egg and sugar mixture until smooth then return to a low heat and continue whisking until it starts to thicken. Continue cooking for one minute, whisking continuously, then take it off the heat and leave to cool at room temperature, with cling film over to the surface to prevent a skin forming. When cooled, add elderflower cordial to taste.  To assemble the tartlets, pipe the elderflower cream into the cooled pastry cases. Place a broken piece of honeycomb on top and garnish with a flower. ","ingredients":" 200g\/7oz plain flour, sifted,  100g\/3½oz cold unsalted butter, diced,  ½ tsp salt,  2 tbsp icing sugar,  1 free-range egg,  1½ tbsp elderflower cordial,  butter, for greasing,  200g\/7oz caster sugar,  50ml\/2fl oz runny honey,  50ml\/2fl oz water,  1 tbsp glucose syrup,  1 tsp bicarbonate of soda,  55g\/2oz caster sugar,  1 free-range egg, plus 1 free-range egg yolk,  1 tbsp cornflour,  125ml\/4fl oz whole milk,  4 tbsp double cream,  1-2 tbsp elderflower cordial,  fresh flowers, eg violets ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/elderflower_and_13963"}