{"recipe_name":"Elderflower jelly with easy strawberry ice cream","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"over 2 hours","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03fkthl.jpg","method":"For the strawberry ice cream, freeze the strawberry quarters in the freezer in a sealable food bag for at least 4 hours, but preferably overnight. Meanwhile, for the elderflower jelly, heat 100ml\/3½fl oz of the elderflower pressé and all of the caster sugar in a saucepan over a medium heat until just simmering. Drain the soaked gelatine and add it to the elderflower mixture, stirring until dissolved. When the gelatine has dissolved, pour in the rest of the elderflower pressé and stir to combine. Pour the elderflower jelly mixture into a wide, shallow bowl or a lipped plate. Chill in the fridge until set, about 30 minutes. When the strawberries have frozen and the jelly is ready to serve, blend the strawberries in a food processor with the vanilla seeds and half of the cream for 3-4 minutes, or until the ice cream mixture is smooth and thick and the strawberries have started to freeze the cream. To serve, decorate the top of the jelly with the chopped peaches, chopped fresh strawberries and basil, then top with scoops of the strawberry ice cream. Serve immediately, with the remaining ice cream in bowls alongside. ","ingredients":" 500g\/1lb 2oz strawberries, hulls removed,  300ml\/10½fl oz extra-thick double cream,  ½ vanilla pod, seeds scraped out with a sharp knife,  450ml\/¾ pint sparkling elderflower pressé,  50g\/2oz caster sugar,  5 gelatine sheets, soaked in cold water for 5 minutes,  1 peach, stone removed, flesh finely diced,  50g\/2oz small fresh strawberries, cut into quarters,  small handful fresh basil leaves, preferably Greek basil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/elderflower_jelly_with_16318"}