{"recipe_name":"Elizabethan rabbit pie","author":"Clarissa Dickson Wright","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the filling, sprinkle the flour onto a plate and coat the rabbit pieces in the floor, dusting off any excess. Heat the lard in a large, ovenproof dish over a medium heat. Add the rabbit pieces and fry for 4-5 minutes or until golden-brown all over. Add the onions, carrots and artichokes and continue to fry for a few minutes.  Pour in the wine and stock and bring to the boil. Stir in the remaining filling ingredients then transfer to the oven and cook for 1½ hours, or until the rabbit is tender.  Baste the rabbit a few times whilst it’s cooking in the oven, spooning the cooking liquid over the meat, to make sure it doesn’t dry out.  Spoon the filling into a pie dish and top with the hard-boiled eggs and artichoke hearts. Roll out the pastry on a floured work surface until it is slightly larger than the pie dish. Gently drape the pastry over the dish, pressing firmly onto the edges. Trim, then shape the edges into a fluted shape and cut a cross into the middle of the pie. Glaze the pastry with the beaten egg. Cook the pie in the oven for 25 minutes, or until the pastry is cooked through and golden-brown. ","ingredients":" plain flour, for dusting,  1 rabbit, jointed,  55g\/2oz lard, dripping or butter,  2 onions, finely chopped,  2 carrots, diced,  3 Jerusalem artichokes, peeled and sliced,  300ml\/½ pint red wine,  150ml\/¼ pint stock,  1 bouquet garni,  2 apples, peeled, cored and chopped,  115g\/4oz grapes, halved and deseeded,  55g\/2oz raisins,  1 orange, zest and juice,  salt and freshly ground black pepper,  2 hard-boiled free-range eggs, halved,  3 cooked artichoke hearts, sliced,  200g\/7oz shortcrust pastry,  1 free-range egg, beaten","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/elizabethan_rabbit_pie_38750"}