{"recipe_name":"English apricot and almond bake","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 10-15 pieces","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03fgjtb.jpg","method":"Preheat the oven to 170C\/150C Fan\/Gas 3. Grease a 30x23cm\/12x9in cake tin with butter and line with baking paper.  Roll out the pastry onto a lightly floured work surface until it is slightly larger than the cake tin and 0.5cm\/¼in thick.  Roll the pastry onto a rolling pin, then line the cake tin with the pastry, pressing it gently into the corners and trimming away any excess. Chill in the fridge while you make the filling. Beat the butter and sugar in a large bowl for 5 minutes, until pale, fluffy and well combined. Alternatively, use a free-standing food mixer to do this.  Beat in the eggs one at a time, waiting until each has been incorporated into the mixture before adding the next. Fold in the flour, ground almonds and baking powder. Brush the pastry with the warmed apricot jam, then spoon in the filling mixture and smooth the top with a palette knife. Decorate the top of the filling with the apricot halves. Bake the tart in the oven for 30-35 minutes, until the filling has risen and is golden-brown, and a skewer inserted into the centre comes out clean (if it doesn’t, return the bake to the oven for a further 5 minutes). Set aside to cool, in the tin, on a wire rack, then remove from the tin and cut into rectangles to serve. ","ingredients":" 375g\/13oz ready-made sweet shortcrust pastry,  200g\/7oz butter, softened, plus extra for greasing,  200g\/7oz caster sugar,  3 large free-range eggs,  200g\/7oz plain flour, plus extra for dusting,  125g\/4½oz ground almonds,  ½ tsp baking powder,  150g\/5oz apricot jam, warmed until melted,  8 fresh apricots, stones removed, cut into quarters","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/english_apricot_and_84974"}