{"recipe_name":"Baby squid stuffed with chorizo and feta","author":"Richard Corrigan","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/360F\/Gas 4. Place the chorizo into a pan with the white wine (the wine should cover the chorizo). Bring to boil, then turn down the heat and simmer for 15 minutes. Remove from the heat and allow the chorizo to cool down in the pan. When cool, remove the chorizo, peel off their skins and chop into small cubes. Place into a bowl. Chop the feta into similar-sized cubes as the chorizo and mix in the bowl with the chorizo. Carefully spoon the chorizo and feta mixture into the squid tubes to three-quarters fill the tubes. Fasten the opening closed with a cocktail stick Prepare a baking dish. Heat the oil in a frying pan over a high heat. When very hot, add the squid and cook in batches, searing them for one minute on each side. As each batch of squid is cooked, transfer to the dish. When the last squid is cooked, place the dish into the oven to cook for two minutes. Meanwhile, add the squid tentacles to the frying pan and fry for 1-2 minutes, or until just cooked through. Bring a pan of salted water to the boil. Add the fennel and boil for one minute. Drain the fennel and place into a bowl. Drizzle with the olive oil and season, to taste, with salt and freshly ground black pepper. To serve, place equal portions of the fennel into the centre of each plate. Top each with five stuffed squid tubes and a few tentacles. Drizzle with a little olive oil and serve. ","ingredients":" 200g\/7oz uncooked chorizo sausages,  150ml\/5fl oz white wine,  200g\/7oz feta or feta-style cheese,  20 baby squid, cleaned, tubes and tentacles only,  vegetable oil, for frying,  2 fennel bulbs, thinly sliced,  1 tbsp good quality extra virgin olive oil, plus extra to serve,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/babysquidstuffedwith_89940"}