{"recipe_name":"Eton mess torte","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the meringue, preheat the oven to 100C\/200F\/Gas ¾. Line three baking trays with greaseproof paper. Whisk the egg whites in a bowl until soft peaks are formed when the whisk is removed. Gradually whisk in the sugar until stiff and glossy. Spoon into a piping bag fitted with a small plain nozzle. Draw three 23cm\/9in circles on the greaseproof paper, then divide the remaining meringue between the circles and spread the mixture out until the circles are filled. Bake in the oven for 20 minutes, then turn the oven off and leave the meringues in the oven for at least 2 hours, or until crisp. Remove from the oven and set aside to cool. For the filling, blend 150g\/5½oz of the chopped strawberries with the icing sugar in a food processor and pass through a sieve into a bowl. Whip the double cream to soft peaks then fold in the vanilla seeds and strawberry purée. Fold in the remaining chopped strawberries. Heat a frying pan until hot, add the caster sugar and water and heat until the sugar turns a deep caramel colour. Place the base of the pan into a pan of cold water to stop the caramel from cooking on any more. Carefully dip the whole strawberries into the caramel and place onto a plate. (Caution: the caramel will be very hot.) To assemble the torte, place a meringue circle onto a serving plate. Spoon on some of the cream mixture and spread it out to cover the meringue. Repeat with another meringue dish and layer of cream, finishing with the remaining meringue circle. Drizzle the remaining liquid caramel over the top of the meringue and decorate with the caramel-dipped strawberries. ","ingredients":" 8 free-range egg whites,  400g\/14oz white caster sugar,  400g\/14oz strawberries, 300g\/11oz roughly chopped, the rest whole,  2 tbsp icing sugar,  600ml\/1pint 1fl oz double cream,  1 vanilla pod, split and seeds scraped out,  150g\/5oz caster sugar,  2 tbsp water","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/eton_mess_torte_15363"}