{"recipe_name":"Falafel","author":"Roberta Sawalha \/ Julia Sawalha","programme":"A Taste of My Life","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Drain, rinse and dry soaked the chickpeas. Place the chickpeas in a food processor with the garlic and the parsley and process until the mixture is roughly chopped. Add the onion and potatoes and the salt and freshly ground black pepper to taste and blend again. The mixture should retain some texture. Sprinkle the bicarbonate and water mixture over the top of the chickpea mixture and let it sit for about 30 minutes. Sprinkle the chilli flakes and cumin over the mixture and mix in lightly. Form the mixture into balls, place on a baking tray, cover and refrigerate for about half an hour. Heat enough oil to shallow fry in a deep, heavy-bottomed pan. The oil is ready when a breadcrumb dropped into it will sizzle gently. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) Carefully place a few balls of falafel into the hot oil and fry for a minute or two, until the outside is brown and crisp. Cook the falafel balls in batches, removing with a slotted spoon when cooked and draining on kitchen towels. For the sauce, put three tablespoons of tahini into a deep dish. Add water a teaspoon at a time, until you have a mixture the consistency of thick cream (you may need a little more or a little less water). Add the juice of 1-2 lemons, to taste, and mix again. If the mixture becomes too thick, add a little water. Add the chopped garlic and mix again. Serve the falafels with the tahini sauce. ","ingredients":" 450g\/16oz dried chickpeas, soaked overnight,  3 large cloves garlic, finely chopped,  ¼ large bunch fresh parsley, leaves only,  1 small onion, finely chopped (about twice as much as the amount of garlic),  2 medium potatoes, boiled until tender, then peeled,  salt and freshly ground black pepper ,  ¼ tsp bicarbonate of soda, dissolved in a little cold water,  dried chilli flakes, to taste,  1-2 tsp ground cumin,  sunflower oil, for frying,  3 tbsp tahini (sesame paste),  1 tbsp water, or as needed,  1-2 lemons, juice only,  1 clove garlic, finely chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/falafel_80242"}