{"recipe_name":"Family fish pie","author":"Yasmin Limbert","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4 - 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the pastry, mix the flour with the salt and rub in the lard or vegetable shortening until the mixture resembles breadcrumbs.  Add the lemon juice and water to form a dough and knead until smooth. Roll out the pastry on a floured work surface to form a rectangle and dot two thirds of the rectangle with one third of the butter.  Fold the unbuttered end of the rectangle over the middle third, fold again and seal the open ends by gently pressing them together. Cover with cling film and chill for 15 minutes. Roll out the pastry again and repeat the process with another third of the butter, then repeat again with the remaining butter. Roll out the pastry to a rectangle once more, fold it in thirds then wrap in cling film and return it to the fridge.  To make the filling, cook the quails' eggs in a pan of boiling water for two minutes then plunge into cold water and set aside to cool. Warm the milk in a wide saucepan with the saffron, bay leaves, peppercorns and salt. Bring to a gentle simmer then poach the salmon, haddock and cod in the milk until just cooked through. Remove the fish, break it into flakes then set it aside and strain the milk through a sieve into a clean bowl. Melt the margarine in a clean saucepan then add the flour, stir to form a roux and cook gently for two minutes.  Add the strained milk and bring the sauce to a simmer, stirring all the time, then season with salt and freshly ground white pepper. Add the chopped chives and parsley to the sauce, gently fold in the fish and transfer the mixture to an ovenproof dish.  Preheat the oven to 180C350F\/Gas 4. Peel the quails' eggs and add them to the pie filling with the prawns. Roll out the pastry and cover the filling, sealing the edges of the pastry to the dish with a little water.  Roll out the off-cuts of pastry and use to decorate the top of the pie. Brush the pie with the beaten egg, scatter over the sesame seeds and bake for 25 minutes. ","ingredients":" 250g\/9oz strong white bread flour,  pinch salt,  50g\/1¾oz lard or vegetable shortening,  1 tbsp lemon juice,  100ml\/3½fl oz chilled water,  150g\/5½ oz butter,  8 quails' eggs,  600ml\/20fl oz milk,  pinch saffron,  2 bay leaves,  6 black peppercorns,  pinch salt,  200g\/7oz salmon ,  200g\/7oz smoked haddock,  200g\/7oz cod,  70g\/2½oz sunflower margarine,  70g\/2½oz flour,  salt and freshly ground white pepper,  small bunch chives, chopped,  small bunch flat leaf parsley, chopped,  125g\/4½oz jumbo king prawns, cooked and peeled,  1 free-range egg, beaten,  1 tbsp sesame seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/family_fish_pie_69153"}