{"recipe_name":"Father's Day delight (Sirloin steak with peppercorn sauce and chips)","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Brush the sirloin steaks all over with the vegetable oil. Season, to taste, with salt and freshly ground black pepper.  Heat a large frying pan over a high heat until smoking. Add the steaks (two at a time if necessary) and fry for two minutes on each side (for medium rare), or until cooked to your liking, placing a knob of butter on top of each steak once it has been turned over. Remove from the pan and set aside to rest on a warm plate. Repeat the process with any remaining steaks. For the peppercorn sauce, add the brandy to the pan the steaks were cooked in to deglaze the pan, scraping up any browned bits from the bottom of the pan using a wooden spoon.  Add the beef stock, drained green peppercorns and anchovies, stir well and bring the mixture to a simmer. Simmer until the volume of liquid has reduced by half. Add the cream, stir well and continue to simmer until the mixture has thickened to a sauce consistency. To serve, place one steak onto each of four serving plates. Drizzle over the peppercorn sauce. Spoon a portion of chips alongside and garnish with a little of the dressed green salad. ","ingredients":" 4 x 200g\/7oz thick-cut sirloin steaks, preferably aged for 28 days,  2 tbsp vegetable oil,  salt and freshly ground black pepper,  2 tbsp butter,  100ml\/3½fl oz brandy,  100ml\/3½fl oz hot beef stock,  1 tbsp green peppercorns (from a jar, in brine), drained,  300ml\/10½fl oz double cream,  2 salted anchovy fillets, very finely chopped,  chips and lightly dressed green salad, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fathersdaydelightsir_91595"}