{"recipe_name":"Fennel and chocolate mousse cake with passion fruit cream and candied fennel","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 100C\/80C Fan\/Gas ¼. Line a large baking tray with non-stick baking paper.  For the candied fennel, put the fennel in a pan with the sugar and 100ml\/3½fl oz water and bring to the boil. Reduce the heat and simmer for 20-30 minutes, until the fennel is softened and the liquid has reduced to a syrup. Remove from the heat and leave to cool. Place half the fennel on the prepared baking tray and bake for 1-2 hours.  For the cake, preheat the oven to 180C\/160C Fan\/Gas 4. Line the base and sides of a 20cm\/8in springform cake tin with baking paper. Lay the remaining fennel over the base of the prepared tin. Put the chocolate and butter in a heatproof bowl set over a pan of gently simmering water. Heat, stirring occasionally, until melted and well combined. Remove from the heat and leave to cool slightly.  Put the egg yolks in a bowl with 2 tablespoons of the sugar and whisk together. Stir in the melted chocolate and mix well. Put the egg whites in a separate clean bowl with the remaining sugar and whisk until stiff peaks form when the whisk is removed. Fold one-third of the egg white mixture into the chocolate mixture, to loosen it, then gently fold in the remainder and pour the mixture into the cake tin. Place on the middle shelf of the oven and bake for 20 minutes, or until risen and set. Remove from the oven and leave to cool before serving. For the passion fruit cream, put the double cream in a large bowl and whisk until stiff peaks form when the whisk is removed. Add the cream cheese and passion fruit and mix. To serve, cut the cake into wedges and dust with the cocoa powder. Serve with the candied fennel and a spoonful of passion fruit cream. ","ingredients":" 2 fennel bulbs, thinly sliced,  100g\/3½oz caster sugar,  300g\/10½oz dark bitter chocolate (minimum 60% cocoa content),  150g\/5½oz unsalted butter,  6 free-range eggs, separated,  50g\/1¾oz caster sugar,  200ml\/7fl oz double cream,  100g\/3½oz cream cheese,  6-8 fresh passion fruit, seeds and pulp only,  cocoa powder, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fennel_and_chocolate_16758"}