{"recipe_name":"Bacon or crackling scones (pogácsa)","author":"The Hairy Bikers","programme":"Hairy Bikers' Bakeation","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Gently heat the milk in a pan until it is lukewarm, then pour it into a jug and stir in the yeast. Leave it for 15 minutes or so to get working and froth up.  Meanwhile, heat a heavy-based pan and fry the bacon bits until crisp and golden. Remove them from the pan and leave to cool. Sift the flour into a bowl and mix with the baking powder and salt. Stir in the parmesan and caraway seeds.  Put the butter in a small pan over a gentle heat and allow it to melt until it is just liquid. Take the pan off the heat, stir in the soured cream and add the beaten eggs – make sure the butter isn’t too hot or the eggs will scramble. Add the cooled crispy bacon and stir in the yeasty milk. Pour the buttery egg and bacon mixture into a large bowl, then add the flour and other dry ingredients, a little at a time, until everything is combined.  Turn the dough out onto a floured work surface and knead for 5 minutes or so until elastic. You can do this with a mixer and a dough hook if you like. Put the dough in a lightly oiled bowl, cover with oiled cling film and leave it in a draught-free place for about an 1½ hours until it has doubled in size. Turn the dough out again and knock it back with your knuckles. Dust the dough with flour and roll it out to about 4 cm\/1½ in thick. Cut out rounds with a pastry cutter and place them on a sheet of silicone baking parchment on a baking tray. Using a sharp knife, cut a criss-cross pattern on the top of each one, then leave to rest for another 30 minutes.  Preheat the oven to 200C\/400F\/Gas 6. Brush the scones with the beaten egg and water to glaze and bake them for 25–30 minutes until golden.  Eat them warm, split in half and spread with butter. Perfect with beef goulash soup. ","ingredients":" 60ml \/4 tbsp milk,  1 tsp dried yeast,  250g\/9oz streaky bacon, chopped,  500g\/1lb 2oz plain flour, plus extra for dusting,  1 tsp baking powder,  ½ tsp salt,  2 tbsp parmesan, grated,  1 tbsp caraway seeds,  120g\/4½ oz unsalted butter,  120ml\/4fl oz soured cream,  2 eggs, beaten,  beaten egg and a drop of water, to glaze","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bacon_or_crackling_75198"}