{"recipe_name":"Fig, prosciutto and gorgonzola pizza","author":"Paul Hollywood","programme":"Paul Hollywood's Bread","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pizza dough, mix the flour, salt, olive oil, yeast and water together in a bowl.  Turn the dough out onto an oiled work surface and knead for 5-10 minutes, or until the dough is smooth and elastic. Cut off a small piece of the dough and stretch part of it as thinly as you can. If you can see the shadow of your fingers through the dough - the light should shine through the dough like a window pane - without the dough tearing, it is ready to prove.  Shape the dough into a ball and tip into a bowl.  Cover with a damp tea towel and leave to rise for an hour. Divide the mix into three balls. Roll out on a floured surface into circles. Place each circle on a flat baking tray or a plastic chopping board dusted with semolina (so the pizza can be easily transferred to the oven later). Place a pizza stone or an upturned baking tray into the oven and heat the oven to 220C\/425F\/Gas 7 (in a non-fan oven). For the topping, cover the bases with the onion slices and sprinkle on the crumbled gorgonzola.  Lay the ham and fig quarters on top and dust with the pecorino.  Drizzle over a little olive oil and a sprinkle of balsamic vinegar. Season with salt and freshly ground black pepper.  When ready to bake, slide the pizza directly onto the hot pizza stone or baking tray and bake in the oven for 8-10 minutes, or until the base is golden-brown and the topping is bubbling. Serve with rocket leaves on top.  ","ingredients":" 250g\/9oz strong white flour, plus extra for flouring,  5g\/¼oz salt,  30ml\/1fl oz olive oil,  5g\/¼oz fast-action yeast,  180ml\/6fl oz water,  semolina, for dusting (optional),  1 small onion, sliced thinly and lightly fried in oil until caramelised,  75-100g\/2½oz-3½oz gorgonzola (or a similar vegetarian blue cheese),  4 slices prosciutto,  2 ripe figs, cut into quarters,  small handful grated pecorino,  drizzle olive oil,  dash of good-quality balsamic vinegar,  salt and freshly ground black pepper,  handful of rocket","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fig_prosciutto_and_90004"}