{"recipe_name":"Fillet of lemon sole with kale and crab butter sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crab butter sauce, in a saucepan, bring the finely sliced shallots, white wine vinegar and white wine to the boil (don’t use an aluminium saucepan as it could react with the acid). Reduce the heat until the mixture is simmering, then continue to simmer until only two tablespoons of liquid are left in the pan. Add a tablespoon of cold water and continue to simmer until the volume of liquid remaining in the pan is about one tablespoon. Reduce the heat to low, then gradually whisk in the butter, 25g\/1oz at a time, waiting until all of the butter has melted and incorporated into the mixture before adding more. Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it into a clean saucepan. Season, to taste, with salt and freshly ground black pepper, then stir in the crab, tomatoes, chives and finish with the lemon juice. Set aside at room temperature until needed. For the kale, heat a large saucepan of boiling water and plunge in the kale. Cook for a couple of minutes, then drain. Plunge the kale into ice cold water, then drain again and dry on kitchen roll. Melt the butter in a large frying pan, then add the kale, stirring for a few minutes until wilted. Finish the kale with the lemon juice and season with salt and pepper. For the fillet of lemon sole, season the sole with salt and freshly ground black pepper. Heat a frying pan until hot and add the butter to the pan. Once melted, cook the fish for two minutes on each side.. To serve, place the kale in the centre of the plate and put two fillets on top, pour the crab butter sauce over and around the plate. ","ingredients":" 2 shallots, finely sliced,  1 tbsp white wine vinegar,  4 tbsp white wine ,  225g\/8oz butter, cut into cubes,  salt and freshly ground black pepper,  100g\/3½oz white crab meat,  2 tomatoes, peeled, seeds removed and cut into small dice,  4 tbsp chopped chives,  1 lemon, juice only,  300g\/10oz curly kale,  50g\/1¾oz unsalted butter,  1 lemon, juice only,  2 lemon sole, filleted and skin removed,  50g\/1¾oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fillet_of_lemon_sole_29298"}