{"recipe_name":"Fillet of sea trout with baby leeks, broad beans and asparagus","author":"John Williams","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sauce, fry the vegetables gently in a little of the butter until soft but not coloured. Add the champagne, and heat until reduced in volume to a syrup. Then add the chicken stock and cook until reduced to half the volume. Add the cream and herbs, bring to the boil and simmer for 5-10 minutes. Pass through a fine sieve and season with salt and pepper and finish with lemon juice. To make the cauliflower purée, cut the cauliflower florets into thin slices, place in a pan with the milk and 250ml\/9fl oz water. Bring to the boil, and simmer until the cauliflower is tender.  Drain and place in a blender with a couple of tablespoons of the cooking liquid, the butter and cream, and blend to a purée. Season with salt and pass through a sieve. Keep warm. For the trout, cut the fish into squares and season with the salts. Heat the olive oil and a little butter in a frying pan and cook the fish skin-side down until golden-brown and just under-cooked. Add 20g\/¾oz butter and half of the vegetable stock. Braise the fish in the stock until cooked through. For the broadbeans, leeks and asparagus, cook the leeks and asparagus in the remaining 30ml\/1fl oz of vegetable stock with the butter, onions, sugar, salt and pepper until almost cooked. Add the broad beans and cook in the glaze for a few minutes more. To serve, spoon the cauliflower purée onto the centre of the plates. Dress the trout on top. Place the vegetables on top. Mix the sauce with a hand blender to aerate it and spoon the resulting foam over the fish. Garnish with the fresh herbs and season to taste with salt, pepper and lemon juice. ","ingredients":" 100g\/3½oz butter,  40g\/1½oz shallots, finely chopped,  20g\/¾oz mushrooms, finely chopped,  10g celery, finely chopped,  10g celeriac, peeled and finely chopped,  ½ bottle champagne,  200ml\/7fl oz chicken stock ,  200ml\/7fl oz cream,  1 sprig parsley,  1 sprig thyme,  salt and pepper,  1 lemon, juice only,  ½ small cauliflower,  250ml\/9fl oz milk,  75g\/2½oz butter,  75ml\/2½fl oz cream,  4 x 150g\/5½oz sea trout fillets, pin-boned,  1 tbsp olive oil,  20g\/¾oz butter, plus extra for frying,  60ml\/2¼fl oz vegetable stock,  12 asparagus spears, peeled and cut into three pieces on an angle,  12 baby leeks, cut into 5cm\/2in lengths,  50g\/1¾oz butter,  8 grelot onions or spring onions,  2 tsp sugar,  salt and freshly ground black pepper,  40g\/1½oz broad beans, blanched and shelled,  1 tbsp finely chopped chives,  1 tbsp finely chopped chervil ,  salt and freshly ground black pepper ,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fillet_of_sea_trout_with_74118"}