{"recipe_name":"Fillet of sole Saint-Germain with sauce remoulade","author":"Lawrence Keogh","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fish, preheat the grill to high and lightly oil a baking tray. Place a pan of water on the hob and add the new potatoes, bring to the boil and cook for 10-12 minutes until soft. Place the fish down and score the back of the fish gently where the skin was, this will help stop it curling up as it cooks. Place the seasoned flour and clarified butter on separate plates. Now lay the fish in the seasoned flour, shake off any excess and then dip in the clarified butter. Ensure both sides of the fillet are coated. Now dredge the fish through the breadcrumbs. Place the fish on the prepared baking tray, sprinkle with a little more clarified butter and put under the grill to cook. It will not take long, maybe five minutes at the most. Drain the potatoes and toss through the diced butter, salt and pepper and chopped parsley. For the sauce base, place the egg yolks in a large bowl, add a pinch of salt and the vinegar and whisk with the mustard until light in colour, fluffy and thickened a little. Slowly drizzle in the sunflower oil very steadily, whisking all the time. When all mixed, check the seasoning and divide between two bowls. For the remoulade sauce, add the remoulade ingredients to one of the bowls of egg and oil mixture, mix well and season to taste with salt and freshly ground black pepper. For the tartare sauce, add the tartare ingredients to the other bowl, mix well, and season to taste with salt and freshly ground black pepper. To serve, lay your fish on serving plates with a spoonful of the new potatoes and a lemon wedge. Add the sauces on the side. Great served with a simple green salad.  ","ingredients":" 4 x 250g\/9oz lemon sole fillets, skin removed,  400g\/14oz new potatoes, scrubbed,  200g\/7oz flour, seasoned with salt,  200ml\/7fl oz clarified butter,  200g\/7oz panko breadcrumbs,  110g\/4oz butter, diced,  2 tsp finely chopped flat leaf parsley,  2 lemons, cut into wedges, to garnish,  2 free-range eggs, yolks only,  pinch salt,  20mls\/1fl oz white wine vinegar,  2 tsp English mustard powder,  100g\/3½oz sunflower oil,  100g\/3½oz onion, finely chopped, ,  100g\/3½oz cornichons or gherkins, finely chopped,  30g\/1oz  anchovy, finely chopped,  2 tsp parsley, finely chopped,  10g\/½oz  chives, finely chopped,  30g\/1oz fine capers, finely chopped,  pinch cayenne pepper,  salt and freshly ground white pepper,  2 lemons, juice only,  110g\/4oz capers, finely chopped,  150g\/5oz gherkins, finely chopped,  ½ shallot, finely chopped,  1 small bunch fresh dill, finely chopped,  2 tbsp fresh flat leaf parsley, finely chopped,  ½ lemon, juice only,  1 bag fresh salad leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fillet_of_sole_98546"}