{"recipe_name":"Fillet steak with a spiced herb butter and fondant potatoes","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spiced herb butter, place all the ingredients in a large food processor and blend until smooth. Lay a piece of aluminium foil on the work surface and lay the blended butter in a line along the foil. Roll the butter in the foil into a cylinder, tighten at both ends and place in the fridge to set. For the fondant potatoes, trim both ends of the potatoes and use a peeler to shape them into a barrel shape. Heat a large frying pan and add the butter. Once melted, add the potatoes and fry until golden-brown. Add the chicken stock and cook for 20-30 minutes until soft, but not falling apart - they need to hold together. To make the glazed vegetables, place the carrots, sugar, chicken stock and butter in a saucepan over a medium heat and cook for 10 minutes. Remove from the heat and set aside. Meanwhile, place a small saucepan on the heat and add water. Once boiling, add the sugar snaps. Cook for 4-5 minutes, drain and refresh in cold water before setting aside. For the steak, place a large frying pan over a high heat. Once hot, add the oil and then cook the steak for two minutes on each side, or until cooked to your liking. Place a slice of the spiced herb butter on top of the steaks and place under the grill for 1-2 minutes, or until the butter has melted. To serve, place a frying pan over a medium heat and add a little of the carrot cooking liquor. Add the carrots and sugar snap peas and cook for a couple of minutes, or until hot. Place the vegetables at one side of each plate and a fondant potato at the opposite side. Place the steak in the middle and serve immediately. ","ingredients":" 200g\/7oz unsalted butter, softened,  1 small shallot, finely chopped,  1 garlic clove, finely chopped,  2 tsp capers, finely chopped,  2 tsp finely chopped gherkins,  1 tsp finely chopped anchovies ,  1 tsp finely chopped chives,  1 tsp finely chopped chervil,  1 tsp finely chopped tarragon,  1 tsp finely chopped flatleaf parsley,  1 tsp thyme leaves,  1 bay leaf,  2 tsp curry powder,  4 medium Maris Piper potatoes, peeled,  50g\/1¾oz unsalted butter,  300ml\/10fl oz fresh chicken stock,  150g\/5½oz baby carrots,  50g\/1¾oz caster sugar,  50ml\/1¾fl oz chicken stock,  75g\/2½oz unsalted butter,  150g\/5½oz sugar snap peas,  2 tbsp olive oil,  4 x 140g-175g\/5-6oz fillet steaks","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fillet_steak_with_a_94163"}