{"recipe_name":"Fillet steaks stuffed with goats cheese","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/fillet_steaks_stuffed_22262_16x9.jpg","method":"For the candied shallots, bring a pan of water to the boil. Simmer the shallots in the water for 5 minutes, then drain. Heat the butter in a frying pan, add the shallots and cook over a medium low heat until lightly browned. Add the sugar, heat gently and stir until the sugar starts to caramelise.  Mix the wine, port, cassis and stock in a jug. Add about a quarter of this to the pan of shallots, bring to the boil, then add the bay leaf, thyme and lemon zest. Keep adding the remaining liquid gradually, reducing each time, until the shallots are just covered with a lovely sticky glaze, then set aside until needed. For the steaks, take the steaks out of the fridge an hour or so before cooking so that they are at room temperature. Crumble the cheese into a bowl, then add the rosemary, lemon zest and garlic. Using a sharp knife, cut a pocket horizontally in each steak, taking care not to cut all the way through the steak. Place one-quarter of the cheese stuffing into each pocket. Close the flap, and wrap a rasher of bacon around each steak, helping to seal the pocket. Secure with a cocktail stick. Rub olive oil over the steaks, then sprinkle with salt and pepper to season. Heat frying pan until hot and fry the steaks for 3-4 minutes on each side (for medium) or until cooked to your liking. For a 2.5cm\/1in thick steak, 2-3 minutes per side will give you a rare steak, 3-4 minutes per side will give you a medium-rare steak; and 4-5 minutes per side will give you a medium to well-done steak. Allow the steaks to rest for 5 minutes. Meanwhile, gently reheat the shallots. Serve the steaks with the candied shallots. ","ingredients":" 12 shallots, peeled, roots trimmed,  60g\/2¼oz butter,  1 tbsp caster sugar,  75ml\/2 ½fl oz red wine,  50ml\/2fl oz port,  50ml\/2fl oz crème de cassis,  250ml beef stock,  1 bay leaf,  ½ tsp dried thyme,  ½ lemon, zest only,  4 thick fillet steaks (ask your butcher for steaks cut from the centre of the fillet),  150g\/5½oz soft goats’ cheese,  1 tsp finely chopped rosemary,  1 lemon, zest only ,  1 garlic clove, crushed,  4 streaky bacon rashers, rind removed,  2 tbsp olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fillet_steaks_stuffed_22262"}