{"recipe_name":"Bacon waffles with poached eggs and hollandaise sauce","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat a waffle maker to the medium setting. Preheat the oven to 135C\/275F\/Gas 1. In a large mixing bowl mix the flour, baking powder, salt and sugar. Whisk in the eggs, milk and melted butter until well combined. Stir in the cooked bacon. Pour a ladleful of the batter into each well of the waffle maker, close the lid and cook for five minutes, or until golden-brown and crisp. Repeat the process until the batter is used up, keeping the cooked waffles warm on a wire rack in the oven. For the hollandaise, place the shallot, peppercorns, bay leaf, white wine vinegar and two tablespoons of water in pan and cook until the volume of liquid has reduced by half. Strain into a large bowl and cool slightly. Add the egg yolks into the vinegar mixture with a pinch of salt. In a steady stream, gradually add the melted butter until it is all incorporated. Season the sauce with sea salt and freshly ground black pepper. For the eggs and bacon, bring a pan of salted water to the boil and add the vinegar. Reduce the heat to a simmer and whisk the water to create a whirlpool. Once settled, carefully crack an egg into the water. Simmer gently for 2-3 minutes, remove the poached egg with a slotted spoon and place on a plate to drain. Repeat the process with the remaining eggs. Heat a frying pan until hot, add the bacon and cook until crisp on both sides. Drain the bacon on kitchen paper. To serve, place the waffles onto serving plates, top with the poached eggs and bacon. Finish with a drizzle of hollandaise sauce and the chopped chives. ","ingredients":" 250g\/9oz plain flour,  1 tsp baking powder,  1 tsp salt,  1 tbsp caster sugar,  3 free-range eggs,  425ml\/15fl oz whole milk,  115g\/4oz unsalted butter, melted,  8 slices cooked American-style bacon (or rindless smoked streaky bacon), chopped,  1 shallot, finely diced,  3 peppercorns,  1 bay leaf,  2 tbsp white wine vinegar,  2 large free-range egg yolks,  125g\/4½oz butter, melted,  sea salt and freshly ground black pepper,  2 tbsp white wine vinegar,  4 free-range eggs,  12 slices streaky bacon,  2-3 tbsp finely chopped chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bacon_waffles_with_50318"}