{"recipe_name":"Fillets of cod with a smoky garlic and parsley butter with diced carrot, leeks and potatoes","author":"Paul Rankin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the parsley butter, melt the butter in a small saucepan, with the smoked salmon trimmings and the crushed garlic. Heat gently for about ten minutes or until the butter has clarified. Strain the butter through a sieve and return to the pan.  Allow the butter to rest off the heat for about 30 minutes, to let the flavours infuse. Meanwhile, pick the parsley leaves off their stalks and blanch them in boiling water for one minute.  Refresh under very cold water, drain, pat dry with kitchen paper and chop roughly. Set aside. Strain the clarified butter through a fine sieve and add the lemon juice and the salt and pepper. Blanch or steam the vegetables until they are tender, then refresh them under cold water and reserve. To cook the cod fillets, season them with some salt and pepper and dredge them in flour. In a large frying pan, heat the vegetable oil until almost smoking, then add the knob of butter and the cod fillets. Cook the fillets over a medium heat for about four minutes on each side. Be careful not to treat them roughly or they may break up. To serve, warm the vegetables and parsley leaves in the clarified butter. Divide this mixture between warm plates and add a cod fillet to each serving. ","ingredients":" 140g\/5oz unsalted butter,  50g\/2oz smoked salmon trimmings ,  3 garlic cloves, crushed,  1 small bunch of fresh parsley,  3 tbsp of lemon juice,  salt and freshly ground black pepper,  140g\/5oz carrots, diced,  140g\/5oz leeks, washed and trimmed and diced,  140g\/5oz potatoes, peeled and diced,  4 portions of thick, boneless, skinless cod fillets, weighing about 200g\/8oz each   ,  salt and freshly ground black pepper ,  100g\/4oz plain white flour, for dredging,  2 tbsp of vegetable oil,  knob of butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/filletsofcodwithasmo_74450"}