{"recipe_name":"Fillet steak, pickled walnuts and horseradish","author":"Jeremy Lee","programme":"Great British Menu","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the horseradish cream, peel the horseradish swiftly and then grate finely. Grate quickly as the horseradish will make your eyes water. The heat of fresh horseradish is vital for this dish. Stir the sugar into the vinegar to dissolve, then pour in the horseradish. Let this sit for half an hour or so. Very lightly whip the cream; then stir into the horseradish. Cover well - then dry your eyes. (The sauce can be made a few hours ahead and chilled, but not too far ahead or the flavour will fade dramatically.)  Season the steaks liberally and evenly with sea salt and freshly ground pepper. Warm a heavy-bottomed frying pan; then add the oil. Heat until gently smoking, then carefully sit the steaks in the pan and do not touch at all. Let the meat cook gently until the edges turn a good rich, dark brown, moving the pan if the steaks are cooking unevenly. After 7-8 minutes, turn the steaks onto the other side and you should reveal a splendid crust. Continue to cook for a few minutes further, then remove the steaks to warm plates and set aside.  Stir the Madeira into the pan and boil until only a teaspoonful remains. Add the stock and the spoonful of pickling liquid, then simmer gently until slightly thickened. Add the butter all at once and stir until thoroughly combined. Return to the boil; then pour the sauce through a fine sieve into a small pan and keep warm.  To serve, slice the pickled walnuts in half and heap over the steaks. Pour the sauce over and add a dollop of horseradish cream alongside. ","ingredients":" good-sized stick fresh horseradish, about 1.5cm\/½in wide x 5cm\/2in long (longer if you like it hot) ,  2-3 tsp caster sugar,  2 tbsp white wine vinegar,  200ml\/7fl oz double cream,  4 fillet steaks, each 250g\/9oz, trimmed of any sinew ,  salt and freshly ground black pepper,  4 tbsp groundnut oil,  80ml\/2½fl oz Madeira,  225ml\/8fl oz good-quality beef stock,  9-12 pickled walnuts, plus 1 tbsp of the pickling liquid,  50g\/2oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/filletsteakpickledwa_86083"}