{"recipe_name":"Filo baked salmon with peas, cream and mustard","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Brush the filo sheets with a little of the olive oil and layer them on top of each other on a baking sheet.  Mix together the salmon, capers, lemon zest and half of the parsley in a small bowl. Season with salt and freshly ground black pepper, to taste, and spoon the mixture down the middle of the filo sheets. Roll the pastry around the filling to form a sausage shape and trim the ends of the pastry. Brush with a little more olive oil and scatter with sesame seeds. Place in the oven for ten minutes or until the pastry is golden-brown and the salmon is cooked through. For the peas, melt the butter in a small saucepan. Add the onion and fry gently for 3-4 minutes or until softened but not browned.  Add the mustard, peas, lemon juice and cream, and saeson, to taste, with salt and freshly ground black pepper. Bring to the boil and simmer for five minutes or until the peas are cooked and the liquid has reduced by half. To serve, spoon the peas onto a serving plate and top with the salmon parcel.  Garnish with chopped fresh parsley and serve. ","ingredients":" 3 sheets filo pastry,  2 tbsp olive oil,  100g\/3½oz salmon fillet, skinned, chopped,  1 tsp capers, drained,  ½ lemon, zest only,  2 tbsp chopped fresh parsley,  salt and freshly ground black pepper ,  1 tbsp sesame seeds,  25g\/1oz butter,  ½ onion, finely chopped,  2 tsp Dijon mustard,  55g\/2oz fresh or frozen (defrosted) peas,  ½ lemon, juice only,  100ml\/3½fl oz double cream,  salt and freshly ground black pepper,  fresh parsley, chopped, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/filobakedsalmonwithp_88146"}