{"recipe_name":"Fish, chips, mushy peas and tartare sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mushy peas, soak the peas for at least four hours in a large bowl with three times their volume of water and the bicarbonate of soda, or, if you have the time, overnight.  Drain the peas, rinse under cold running water and place in a large, lidded pan. Cover with water (about 2.5cm\/1in above the peas), cover with a lid and bring to the boil. Reduce the heat and simmer the peas for 1½-2 hours, stirring from time to time. The peas should be soft and mushy in texture but not too dry. If they are wet, continue cooking over the heat with the lid off until they dry out a little. Beat in the butter and season with salt and freshly ground black pepper. For the tartare sauce, whisk the egg yolks, mustard and vinegar together in a bowl. Continue to whisk the mixture and slowly pour in the rapeseed oil until all of the oil is incorporated and mixture is thick and light. Stir in the capers, gherkins, shallot and herbs. Season, to taste, with salt and freshly ground black pepper and a squeeze of lemon juice. Keep in the fridge until ready to serve. For the fish and chips, preheat a deep-fat fryer to 190C\/375F. Meanwhile, sprinkle the yeast and sugar into a mixing bowl. Pour over the beer and vinegar and whisk in the flour and salt. Leave to ferment – it is ready to use when the mixture starts to bubble. Place a steamer on the hob and place the chopped potatoes in the steamer and cook for 4-5 minutes. Remove and allow to dry out. Dip the cod fillets into the batter and deep fry until golden-brown and cooked through – about 3-4 minutes. Remove with a slotted spoon and drain on kitchen paper. Add the potatoes to the deep-fat fryer and fry for 3-4 minutes, or until golden-brown and crisp. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Season with a little salt. Serve the fish and chips with the tartare sauce and mushy peas. ","ingredients":" 225g\/8oz dried marrowfat peas ,  1 tsp bicarbonate of soda ,  35g\/1¼oz butter,  salt and freshly ground black pepper,  3 free-range egg yolks,  1 tbsp Dijon mustard,  2 tbsp cider vinegar,  300ml\/10½fl oz rapeseed oil,  50g\/1¾oz capers,  100g\/3½oz gherkins, chopped,  ½ shallot, finely chopped,  1 small bunch fresh dill, chopped,  2 tbsp chopped fresh flatleaf parsley,  ½ lemon, juice only,  vegetable oil, for deep frying,  15g\/½oz fresh yeast,  pinch sugar,  300ml\/10½fl oz beer ,  1 tsp cider vinegar,  200g\/7oz plain flour,  pinch salt,  1 whole fillet of cod, cut in two,  300g\/10½oz chipping potatoes, peeled and cut unto 2cm\/½in sticks,  ½ lemon, cut into wedges, for serving","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fish_chips_mushy_peas_33132"}