{"recipe_name":"Fish soup with rouille-topped crostini","author":"The Hairy Bikers","programme":"Hairy Bikers Everyday Gourmets","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/fish_soup_with_27076_16x9.jpg","method":"For the fish soup, heat the oil in a frying pan over a medium heat. Fry the onion, shallots and fennel for 8-10 minutes, or until softened, then add the garlic and continue to fry for a further 1-2 minutes, stirring well. Add the fish bones and fry for a further 4-5 minutes, stirring well. Add the prawn shells and heads, tomato purée, chopped tomatoes, passata, mixed herbs, stock and caster sugar and stir until well combined. Bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 30 minutes. Once cooked, set aside to cool slightly. Meanwhile, for the rouille-topped crostini, place the slices of ciabatta onto a baking tray. Brush each slice with a little olive oil and season, to taste, with salt and freshly ground black pepper. Bake in the oven for 5-6 minutes, or until crisp and golden-brown. Set aside. To make the rouille, blend the garlic and egg yolks in a food processor with a pinch of salt. Mix together the vegetable and extra virgin olive oil. With the motor still running, gradually add the oils to the egg mixure in a thin stream until the mixture becomes thick and smooth. Add the cayenne pepper, tomato purée and lemon juice and blend again until smooth. Set aside. Once the fish soup has cooled, blend the mixture to a smooth purée using a hand-held blender, then strain through a fine sieve into a clean bowl, helping the mixture through the sieve using the back of a wooden spoon. Season, to taste, with salt and freshly ground black pepper. Just before serving, reheat the fish soup gently, stirring in the crabmeat (if using) and cream. Meanwhile, poach the bantam eggs. Bring a saucepan of water to the boil, add the eggs (still in their shells) and boil for 20 seconds. Remove the eggs from the water. Add a splash of white wine vinegar to the boiling water and stir to form a vortex. Crack one of the eggs into the centre of the vortex and poach for 2-3 minutes, or until the egg is cooked to your liking. Remove the poached egg from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining eggs. Top each crostini with a teaspoonful of rouille and a little grated gruyère. Top each with a poached bantam egg and garnish with a sprig of parsley or chervil. When the soup is warmed through, ladle into bowls. Serve the rouille-topped crostini alongside, or float them on top of the soup. ","ingredients":" 4 tbsp olive oil,  1 onion, peeled, roughly chopped,  2 banana shallots, peeled, roughly chopped,  1 fennel bulb, trimmed, roughly chopped,  4 garlic cloves,  2kg\/4lb 4oz fish bones (if using fish heads, ask your fishmonger to remove the gills),  300g\/10½oz prawn shells and heads,  2 tbsp sun-dried tomato purée,  400g\/14oz canned chopped tomatoes,  500g\/1lb 2oz passata,  2 tbsp dried mixed herbs,  1.5 litres\/2½pints chicken or vegetable stock,  1 tbsp caster sugar,  salt and freshly ground black pepper,  1 small dressed crab (optional),  250ml\/9fl oz double cream,  1 small unbaked ciabatta, cut into 6-8 thin slices,  splash olive oil,  salt and freshly ground black pepper,  2 garlic cloves,  2 free-range egg yolks,  75ml\/3fl oz extra virgin olive oil,  75ml\/3fl oz vegetable oil,  large pinch cayenne pepper,  3 tbsp tomato purée,  freshly squeezed lemon juice, to taste,  6-8 bantam eggs (available from farm shops),  splash of white wine vinegar,  75g\/3oz gruyère, grated,  parsley or chervil sprigs, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fish_soup_with_27076"}