{"recipe_name":"Fishcakes with cheddar sauce","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 4 large fishcakes","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the hake into a large pan and season with sea salt and freshly ground black pepper. Pour over the milk and add the bay leaf, then cover the pan with aluminium foil and gently poach the fish over a medium low heat for 25 minutes, or until the fish is cooked through (the flesh should be opaque and flake easily).  Set the fish aside to cool, then flake the flesh into a bowl and discard the bones. Strain the poaching liquid into a measuring jug, discarding any solids. Add enough milk to the liquid to bring it up to 500ml\/17½fl oz, then set aside for making the cheese sauce later. In a large bowl, carefully fold together the fish, mashed potatoes, one beaten egg and the parsley until well combined. Season, to taste, with salt and freshly ground white pepper.  With damp hands, divide the mixture into four equal portions and form into patties. Dust the fishcakes in the flour, dip into the remaining beaten egg and roll in the breadcrumbs.  Heat a few tablespoons of vegetable oil in a frying pan and fry the fish cakes for 2-3 minutes on both sides, or until golden-brown and crisp all over. For the cheddar cheese sauce, melt butter in a pan set over a medium heat, then beat in the flour. Cook the mixture for 2-3 minutes, then gradually whisk in the reserved milk mixture until smooth. Cook for 10-12 minutes, or until the sauce is thickened slightly, then stir in the grated cheddar cheese until melted. Season, to taste, with salt and freshly ground black pepper.  To serve, spoon the cheddar cheese sauce over the fishcakes. ","ingredients":" 500g\/17½oz hake steaks,  sea salt and freshly ground black pepper,  250ml\/9fl oz milk, plus extra for the cheddar sauce,  1 bay leaf,  500g\/17½oz cold mashed potatoes,  3 free-range eggs,  1 heaped tbsp chopped fresh curly parsley,  freshly ground white pepper,  4 tbsp plain flour,  1 x 200g\/7oz packet golden breadcrumbs,  vegetable oil, for shallow frying,  50g\/2oz unsalted butter,  2 tbsp plain flour,  175g\/6oz cheddar cheese,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fishcakeswithcheddar_93165"}