{"recipe_name":"Fish chowder with 'piri-piri' sauce and fennel salad","author":"Gordon Jones","programme":"Virgin Cooks","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02bymgw.jpg","method":"For the fish chowder, heat the olive oil in a large, lidded saucepan over a medium heat. Add the onions, salt and garlic and fry for 2-3 minutes, or until softened.  Add the chorizo and chilli and continue to fry for 3-4 minutes, or until the chorizo is crisp and has darkened in colour. Add the chopped fennel stem and red pepper and season, to taste, with sea salt and freshly ground black pepper. Continue to fry for 2-3 minutes. Add the chopped potatoes and fry for 3-4 minutes, or until coloured.  Add the wine and saffron mixture to the pan, scraping any browned bits up from the bottom of the pan to deglaze.  Add the stock and all of the canned tomatoes and bring the mixture to a simmer. Continue to simmer for 15-20 minutes, or until the potatoes are tender and the volume of liquid has reduced by half. Add the prawns, cod and mussels, cover the pan with a lid and bring the mixture back to a simmer. Steam for 4-5 minutes, or until the mussels have opened (discard any mussels that do not open during cooking). Meanwhile, for the fennel salad, in a glass or ceramic bowl, mix together the sliced fennel, chopped red chilli and parsley leaves until well combined. Squeeze over the lemon juice and mix well to coat the vegetables. Set aside. Meanwhile, for the 'piri-piri' sauce, in a bowl, mix together the fennel fronds, chillies, tomatoes and garlic. Season, to taste, with salt. Drizzle over the olive oil and red wine vinegar and stir to combine. For the bread, rub the bread slices all over with the halves of garlic. Drizzle both sides of each slice with a dash of olive oil.  Heat a griddle pan over a medium heat. When the pan is hot, add the bread slices, in batches, and grill for 1-2 minutes on each side, or until golden-brown griddle marks appear on both sides. Repeat the process with the remaining batches of bread slices. Keep warm. For the sea bass, drizzle the sea bass fillets with olive oil and sprinkle the salt over the skin.  Heat a griddle pan over a high heat. When the pan is hot, add the sea bass fillets, skin-side down and griddle for 2-3 minutes, or until the skin is crisp. Turn the fish fillets over and fry for a further minute, or until the sea bass is cooked through. Drizzle over the lemon juice. To serve, spoon the fish chowder equally among four to six serving bowls. Place one of the sea bass fillets on top of each serving. Sprinkle over the chopped parsley. Serve the bread alongside, with the 'piri-piri' sauce spooned over it. ","ingredients":" 2-3 tbsp olive oil ,  2 onions, peeled, finely chopped ,  pinch sea salt,  3 garlic cloves, peeled, finely chopped,  100g\/3½oz cooking chorizo, skin removed, roughly chopped,  1 medium red chilli, finely sliced ,  reserved fennel stem, finely chopped (see below),  1 red pepper, seeds removed, sliced,  salt and freshly ground black pepper,  2 large floury potatoes, such as Maris Piper or King Edward, peeled, chopped ,  pinch saffron threads, infused in 1 glass dry white wine,  500ml\/17fl oz fish stock or vegetable stock,  1 x 400g\/14oz can chopped tomatoes,  8-12 fresh prawns, heads and shells removed, de-veined ,  450g\/1 lb cod fillet, skin removed, chopped,  8-12 mussels, rinsed, cleaned, de-bearded (discard any mussels that do not close tightly when tapped),  1 fennel bulb, finely sliced, stem reserved for chowder, green fronds reserved for the piri-piri sauce ,  1 red chilli, finely chopped,  bunch fresh flatleaf parsley, leaves only ,  ½ lemon, juice only ,  reserved green fennel fronds, finely chopped (see above),  6 small fresh red chillies, finely chopped,  3 ripe tomatoes, skins removed, chopped,  1 tsp salt flakes,  1 tbsp finely chopped garlic, plus 1 garlic clove, peeled and cut in half,  4-6 tbsp olive oil,  2 tbsp red wine vinegar,  4-6 thick slices crusty white bread,  4-6 tbsp olive oil,  large pinch salt,  4-6 wild sea bass fillets (about 500g\/1 lb in total), skin scored several times using a sharp knife,  3-4 tbsp olive oil,  salt, to taste,  ½ lemon","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fishchowderwithpirip_92209"}