{"recipe_name":"Fisherman's soup","author":"Mitch Tonks","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the aioli, peel the garlic cloves and crush them to a paste on a chopping board with the tip of a knife. Sprinkle a pinch of sea salt over the garlic cloves to help in the crushing. Place the crushed garlic in a clean bowl with the mustard. Separate the eggs and add the yolks to the bowl with the garlic and mustard (you can use the whites for another purpose). Whisk thoroughly. While still whisking, add some of the vegetable oil in a steady stream. Continue adding oil, alternating between vegetable oil and olive oil, until a thick emulsion is formed. Season to taste with sea salt. Squeeze in the lemon juice and stir well. The aioli should have a spooning consistency. Cover the bowl with cling film and let the aioli stand for an hour in the fridge before serving, to let the flavours develop. The aioli can be kept for up to three days, covered, in the fridge. For the soup, peel and chop the shallots and garlic finely. Chop the tomatoes roughly. Heat the olive oil in a large pan. Add the chopped shallots and garlic and sweat gently over a low heat until translucent, about five minutes. Add the thyme, followed by the tomatoes and the saffron and stir together. Add the Pastis and cook for a minute or two to burn off the alcohol. Add the wine and simmer gently for a few minutes. Meanwhile, prepare the fish and seafood: cut the monkfish into chunks and add to the pan. Cut the langoustines in half lengthwise and remove the black stomach sac that runs down the back. Add to the pan, along with the cleaned red mullet. Add the whole prawns to the pan. Cut the squid body into rings and add to the pan. Cover the fish with enough water just to cover it. Put the lid on the pan and simmer gently for 7-8 minutes. Remove the beards from the mussels and add the mussels to the pan. Add the palourde clams to the pan. Put the lid back on and cook for a few minutes, until the shellfish are open. Remove and discard any that don't open. At the end of cooking, season to taste with sea salt and freshly ground black pepper. Take the pan off the heat and sprinkle with chopped fresh parsley or basil. To serve, spread the aioli onto the grilled bread slices and place a slice into each of four shallow bowls. Ladle over some of the broth into each bowl. Place the pan of fish and shellfish, along with the remaining aioli and extra bread slices, onto the table for diners to help themselves. ","ingredients":" 4-6 garlic cloves,  sea salt,  1 tsp Dijon mustard,  2 free-range eggs, at room temperature,  75ml\/2½ fl oz vegetable oil,  75ml\/2½ fl oz good-quality extra virgin olive oil,  1 lemon, juice only,  3 shallots,  2 garlic cloves,  2 ripe tomatoes,  2-3 tbsp olive oil,  3 or 4 sprigs fresh thyme,  pinch saffron,  2-3 tbsp Pastis,  3-4 tbsp dry white wine,  500g\/1lb 2oz cleaned fish and shellfish, such as 2 red mullet, gutted and cleaned; 2 prawns; 2 langoustines; 6 mussels, rinsed; 6 palourde clams, rinsed; 1 squid body; piece of monkfish fillet. (You don't have to stick to this selection; use whatever comb,  sea salt and freshly ground black pepper,  chopped parsley or basil, for sprinkling,  slices of grilled bread","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fishermanssoup_90211"}