{"recipe_name":"Fish goujons with pineapple salsa and hush puppies (cornbread)","author":"Momma Cherri","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Combine the flour and cornmeal in a bowl and mix in Cajun seasoning according to taste. Gently dip each fish steak into the mixture. (You don't need to roll it in egg first, so don't worry that it won't stick, it will.) Heat the oil for deep-frying (CAUTION: Hot oil can be dangerous. Do not leave unattended). Place the seasoned fish steaks into the hot oil and cook until the fish begins to float and is golden. Depending on the size of your fish steaks, they should take no more than five minutes to cook. Remove and drain on kitchen towel. Reserve some of the oil for the hush puppies. For the pineapple salsa, place the pineapple chunks in a blender with the coriander, dried or fresh chilli and lemon juice. Blend briefly so the salsa has a chunky texture. For the hush puppies, combine all the dry ingredients in a bowl. Make a well in the centre and stir in the egg and milk, then stir in the melted butter last.  Add the onions, peppers, sweetcorn and coriander and mix well. Heat a small amount of the oil used for the frying the fish goujons in a frying pan. Using a spoon, drop a few small spoonfuls of the cornbread mixture into the pan. Gently fry on both sides until golden. Remove and drain on kitchen towel. Repeat until all mixture has been used and serve hot with the fish goujons and salsa. ","ingredients":" 1 medium-sized tuna steak ,  1 medium-sized cod steak ,  1 medium-sized salmon steak,  Cajun seasoning ,  110g\/4oz plain flour,  230g\/8oz cornmeal (polenta),  enough oil to deep-fry the fish,  ½ small pineapple, peeled and diced, or 1 small tin of pineapple chunks, drained,  pinch dry chilli flakes or finely chopped fresh chilli, to taste,  ½ handful fresh coriander, finely chopped,  1 tsp lemon juice,  230g\/8oz plain flour,  230g\/8oz cornmeal (medium or course),  110g\/4oz sugar,  ½ tbsp baking powder,  1 egg ,  125ml\/5oz milk,  110g\/4oz melted butter,  60g\/2oz finely diced onions, mixed peppers,  small tin sweetcorn, drained,  handful fresh coriander, chopped,  vegetable oil, for frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fishgoujonswithpinea_76389"}