{"recipe_name":"Fish kebabs with cucumber raita","author":"Reza Mahammad","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a food processor, blend the cod until finely minced. In a large mixing bowl mix together the minced cod, chopped salmon and lime zest. Add the chopped fennel, chopped coriander, green chillies, spring onions, fennel seeds, coriander seeds, salt, two tablespoons of oil, garlic paste, ginger paste, two teaspoons of crushed black pepper and lime juice and mix well. Mould the fish mixture onto 12 skewers, forming 12 fish kebabs. To make the cucumber raita, squeeze out any excess water from the grated cucumber. Mix together the cucumber and yoghurt, and stir in the dill, the remaining black pepper and the garlic. Heat one tablespoons of oil in a small frying pan and fry the mustard seeds, cumin seeds, asafoetida and curry leaves for 2-3 minutes, stirring, until fragrant. Mix the fried mustard seed mixture into the raita. Either grill the kebabs on a barbecue until golden brown on both sides or heat one tablespoon of oil in a large frying pan and fry the kebabs until golden brown on both sides. Serve the freshly cooked kebabs with cucumber raita and basmati rice. ","ingredients":" 300g\/10½oz cod fillet, skinned and diced,  300g\/10½oz salmon fillet, skinned and finely chopped,  1 lime, juice and grated zest only,  1 small fennel bulb, finely chopped,  1 small bunch of fresh coriander, finely chopped,  4-8 green chillies, finely chopped,  4 spring onions, finely chopped,  2 tbsp fennel seeds, finely ground,  2 tbsp coriander seeds, finely ground,  ½ tsp salt,  2 tbsp vegetable oil,  1 tbsp garlic paste,  1 tbsp ginger paste,  4 tsp crushed black pepper,  1 cucumber, grated,  450ml\/16fl oz yoghurt,  4 tbsp finely chopped dill,  ½ tsp crushed garlic,  1 tbsp vegetable oil,  ½ tsp mustard seeds,  ½ tsp cumin seeds,  pinch of asafoetida,  4-5 curry leaves,  basmati rice, boiled, enough for 4","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fishkebabswithcucumb_74039"}