{"recipe_name":"Bacon butty and brown sauce","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Lightly oil and flour two 450g\/1lb loaf tins. For the bread, sift the flour, yeast and sugar into a large bowl. Gradually add the water, mixing gently as you go, until the mixture comes together to form a dough (you may not need all of the water).  Knead the dough on a lightly floured work surface for 3-5 minutes, or until the dough feels smooth and elastic. Place the dough back into the bowl and cover with a damp tea towel. Leave in a warm, dry place for two hours.  Add the salt to the dough, then knead for 2-3 more minutes, or until smooth and elastic. Cut into two oblong loaves, then place each piece into a prepared loaf tin. Cover with a damp tea towel again and leave to rest in a warm, dry place for one hour. Meanwhile, preheat the oven to 220C\/430F\/Gas 7.  Bake the two loaves for 30-40 minutes, or until golden-brown and cooked through. (The bread will sound hollow when it is tapped on the bottom.) Remove from the oven and set aside to cool.  For the brown sauce, heat the oil in a non-reactive pan and gently fry the shallots for 4-5 minutes, or until softened but not coloured. Add the tomatoes, dates, tamarind sauce, ginger, cloves, peppercorns, turmeric, cayenne pepper, ground coriander and water. Bring to boil, then reduce the heat and simmer for ten minutes. Transfer the mixture to a food processor and blend until smooth. Pass the mixture through a very fine sieve into a clean, non-reactive pan and bring to the boil. Stir in the malt vinegar, mustard powder, molasses, salt and muscovado sugar. Whisk well and boil for 4-5 minutes.  Reduce the heat, then stir in the cornflour paste and cook for a further minute, or until the sauce is thickened. Set aside to cool slightly. (The sauce can be cooled and stored in an airtight bottle for up to three weeks in the fridge.) To serve, thickly slice the bread and butter each slice. Place three slices of cooked bacon in between two slices of bread, with dollops of brown sauce on top of the bacon. Serve immediately. ","ingredients":" 700g\/1½lb strong bread flour, plus extra for dusting,  1 tsp dried yeast,  1 tsp sugar,  400ml\/14fl oz warm water,  1 tsp salt,  1 tbsp vegetable oil,  4 shallots, peeled, finely chopped,  4 fresh tomatoes, chopped,  75g\/2½oz dates, chopped,  50ml\/2fl oz ready-made tamarind sauce,  1 tsp ground ginger,  4 cloves,  4 black peppercorns,  pinch ground turmeric,  pinch cayenne pepper,  pinch ground coriander,  200ml\/7fl oz water,  700ml\/1 pint 5fl oz malt vinegar,  1 tbsp mustard powder,  2 tbsp molasses,  pinch salt,  2 tbsp muscovado sugar,  2 tbsp cornflour, mixed with enough water to form a loose paste,  30 slices thick-cut smoked back bacon, grilled,  butter, for spreading","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/baconbuttyandbrownsa_91737"}