{"recipe_name":"Fish tagine","author":"Antony Worrall Thompson","programme":"Saturday Brunch","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Coat the fish in half the ground spices and leave to marinate in the fridge overnight.  Preheat the oven to 170C\/340F\/Gas 3. Heat one tablespoon of the olive oil in a casserole and add the remaining spices, the crushed garlic and grated onion.  Allow the onion to soften without browning. Add the apricots and their soaking water, the almonds, sultanas or raisins, honey, saffron, tomatoes, tomato juice and fish stock.  Bring to the boil, place in the oven and cook for one hour. After 40 minutes, add the fish and return the casserole to the oven to finish cooking.  If you want a thicker sauce, remove the fish pieces, put on a warm plate and reduce the sauce over a high heat until thickened. Fry the preserved lemon rind in the remaining olive oil for a few minutes, then fold in the chopped coriander. Pour the sauce over the fish and garnish with the lemon and coriander mixture. ","ingredients":" 1kg\/2lb 3oz monkfish,  1½ tbsp ground ginger,  2 tsp freshly ground black pepper,  2 tsp powdered cinnamon,  3 tsp ground turmeric,  1½ tbsp paprika,  1 tsp cayenne pepper,  1 head garlic, all but 3 cloves crushed with a little salt,  450g\/1lb onions, grated,  2 tbsp olive oil,  175g\/6¼oz dried apricots, soaked in a little water (reserve the water), cut in half,  85g\/3oz flaked almonds,  55g\/2oz sultanas or raisins,  2 tbsp clear honey,  1 tsp saffron stamens, soaked in cold water,  400g\/14oz tinned tomatoes, roughly chopped,  600ml\/1 pint tomato juice,  600ml\/1 pint fish stock,  1 pickled lemon, rind only, chopped,  25g\/1oz coriander leaves, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fishtagine_72361"}