{"recipe_name":"Flamed mackerel with rhubarb chutney, roasted beetroot and pickled shallots","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chutney, in a heavy-based pan melt the sugar until a golden-brown caramel forms (CAUTION: boiling sugar is extremely hot. Handle very carefully.). Remove from the heat and stir in the ginger, shallot and rhubarb. Stir in the cider vinegar and orange juice. Return to the boil then cook gently for 8-10 minutes. Season with salt and pepper, set aside to cool. Put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave to cool slightly. Carefully peel the beetroots and cut in half. Melt the butter in a medium frying pan and add the beetroots. Cook for 2-3 minutes, or until slightly golden-brown. For the pickled shallots, heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar has dissolved. Put the shallots in a bowl and pour over the hot vinegar mixture. Mix together, coating the shallots. Set aside to pickle for at least an hour, but preferably 24 hours. Put the mackerel skin-side up on a heavy baking tray and use a chef's blow torch to char the skin. Season with salt and pepper. Place a spoonful of chutney on each serving plate with the baby beetroot dotted around the plates. Place the mackerel in the centre and dot the plates with crème fraîche and pickled shallots. Garnish with the leaves. ","ingredients":" 75g\/2¾oz caster sugar,  2cm\/¾in piece root ginger, peeled and finely chopped,  1 shallot, finely chopped,  3 sticks rhubarb, finely chopped,  5 tbsp cider vinegar,  1 orange, juice only,  2 mackerel fillets, filleted, pin boned, skin on,  salt and freshly ground black pepper,  ½ bunch baby heritage beetroots, cleaned, leave a little stalk on,  75g\/2¾oz unsalted butter,  200ml\/7fl oz white wine vinegar,  75g\/2¾oz caster sugar,  1 tsp salt,  ½ tsp black peppercorns,  2 banana shallots, thinly sliced,  100g\/3½oz crème fraîche,  1 tbsp bull's blood leaves,  1 tbsp baby red sorrel leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/flamed_mackerel_with_79694"}