{"recipe_name":"Flexible fish stew","author":"Guyrope Gourmet","programme":"Food & Drink","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the base for the stew, heat a little olive oil and a knob of butter in a large saucepan. When the butter is melted, add the chopped vegetables and a pinch of salt.  Cover with a lid and simmer gently for 4-5 minutes, then add a teaspoon of paprika, a generous twist of freshly ground black pepper and the whole peppercorns. Pour in the tinned tomatoes, then fill the empty tin with water and add that to the pot as well. Simmer with a lid on for 5 minutes or so, stirring occasionally. Add the new potatoes, replace the lid and continue to simmer for another 5 minutes, or until the potatoes are nearly cooked through.   If any mussels are open, tap them lightly on a hard surface. If they don't close, discard them. Add the fish and mussels to the pan. If you are using Queen scallops or fresh prawns, they should go in a minute or two later, as they will cook quickly.  Add a large sprig of tarragon and simmer for a few more minutes. The mussels are cooked when they've opened up. Discard any that don't open.  Serve the stew in bowls garnished with the cherry tomatoes and fennel fronds. ","ingredients":" olive oil, for frying,  knob of butter,  1 bulb fennel, finely chopped, fronds reserved for garnish,  1 bunch spring onions, chopped,  1 tsp paprika,  6 whole peppercorns,  1 x 400g tin chopped tomatoes,  6-8 baby new potatoes (preferably Jersey Royals), washed and halved ,  4-8 mussels, cleaned and beards removed,  small fillet haddock (about 150-170g), skinned, pin boned and cut into chunks ,  small fillet monkfish (about 150-170g), skinned, pin boned and cut into chunks ,  12 Queen Scallops or fresh prawns (optional),  large sprig fresh tarragon,  handful cherry tomatoes, halved,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/flexible_fish_stew_82833"}