{"recipe_name":"Focaccia","author":"The Hairy Bikers","programme":"Hairy Bikers' Bakeation","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Makes 1 loaf","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/focaccia_97984_16x9.jpg","method":"To make the dough, put the flour, yeast, sugar and salt in a large bowl. Mix the olive oil with the warm water and pour it on to the flour mixture. Stir with a wooden spoon and then bring the mixture together with your hands to form a rough ball. Turn the dough out on to a lightly floured surface and knead for 5 minutes to make a smooth, pliable and fairly soft dough. Transfer the dough to a lightly oiled bowl, cover loosely with oiled cling film and leave to rise for about an hour in a warm place until it has doubled in size. Lightly oil a large baking tray measuring about 36cm x 25cm\/14in x 10in.  Turn the dough out on to a floured surface and knock it back with your knuckles. Press the dough into a rough rectangle, about the size of the baking tray, then carefully place it on the baking tray and ease it out towards the edges. Don’t worry too much about how it looks – it’s meant to be rustic. Cover loosely with oiled cling film and leave in a warm place for a further 30 minutes to prove. Preheat the oven to 220C\/425F\/Gas 7. After 30 minutes, the focaccia should look puffed up and spongy. Use your index finger to poke dimples all over the dough right through to the bottom of the tray. To make the topping, drizzle the focaccia with the three tablespoons of olive oil, allowing it to seep into the dimply holes. Sprinkle with the sea salt, black pepper and chopped rosemary. Finish by poking the twiggy sprigs of rosemary randomly into the dough.  Bake in the centre of the oven for about 15–20 minutes or until risen and deep golden brown. Serve warm. ","ingredients":" 500g\/1lb 2oz strong white flour, plus extra for dusting,  1 x 7g\/¼oz sachet of fast-action dried yeast,  1 tsp caster sugar,  1 tsp fine sea salt,  2 tbsp olive oil, plus extra for greasing,  300ml\/10fl oz\/½ pint warm water,  3 tbsp olive oil,  flaked sea salt, to taste,  1 tsp coarsely ground black pepper,  1 tbsp fresh rosemary leaves, roughly chopped ,  10 tiny sprigs of rosemary","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/focaccia_97984"}