{"recipe_name":"Fougasse with chickpea and olive oil purée, pesto and tapenade","author":"Richard Bertinet","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fougasse, preheat the oven to 240C\/475F\/Gas 9 and preheat a baking stone or upturned baking tray. Rub the yeast into the flour using your fingertips.  Add the salt and water and, holding the bowl with one hand, mix the ingredients with your other hand for 2-3 minutes, or until the mixture comes together as a dough.  Scoop the dough out onto the work surface and continue to knead the dough, stretching and folding it over on itself until it becomes smooth and elastic. Place the dough into a bowl, cover with cling film and set aside for at least one hour, or until the dough has doubled in size. Use a plastic spatula to release the dough from the bowl - you should be able to scoop it out easily in one piece and transfer it to the work surface without stretching it. Be careful not to deflate the dough when handling it, but let it spread out to cover a square of your work surface. Generously flour the top of the dough. Cut the dough into two rectangles, then cut each piece again into three roughly rectangular pieces.  Handle the dough as gently as you can so that it stays as light and full of air as possible and keep the pieces well-floured. Cut a large diagonal cut across the centre of each piece of dough, making sure that you don’t go right to the edges of the dough, but cut all the way through the dough to the work surface. Make three smaller diagonal cuts fanning out on each side of the central one. Put your fingers into the slits and gently open them out to form holes. (Be bold - it is better to make a fewer cuts and really open out the holes.) Lift the pieces of dough onto a lightly floured wooden peel or flat-edged baking tray, then slide them onto the preheated baking stone. Spray water into the inside of the oven and close the door. Reduce the heat to 230C\/450F\/Gas 8 and bake for 10-12 minutes, or until golden brown. Meanwhile, for the chickpea and olive oil purée, pulse the chickpeas and garlic in a blender or food processor until smooth. Add the lemon juice, and pulse until smooth, then add the olive, a little at a time and pulse until the mixture is a quite loose, but not too runny, paste. (You may not need all of the olive oil.)  For the pesto, pulse the pine nuts, garlic and parmesan in a blender to a coarse paste. Add the basil and pulse again, then add the lemon juice and the olive oil, a little at a time, until you have the texture you want. Season, to taste, with salt. (The key to a good pesto is not to overwork the ingredients, otherwise the basil bruises and will start to turn black and lose its fresh flavour.) For the tapenade, blend the olives in a food processor until roughly chopped. Add the remaining ingredients and keep pulsing in short bursts to a coarse paste. Serve the fougasse with the dips. ","ingredients":" 10g\/¼oz fresh yeast (or 1 x 7g sachet fast action yeast),  500g\/1lb 2oz strong bread flour,  2 tsp salt,  350g\/12oz water (weighing the water is more accurate),  1 x 400g\/14oz tinned chickpeas, drained and rinsed well,  2 garlic cloves, roughly chopped,  1 lemon, juice only,  250ml\/9floz extra virgin olive oil,  110g\/4oz pine nuts,  3 garlic cloves, roughly chopped,  110g\/4oz parmesan, grated,  1 lemon, juice only,  3-4 bunches fresh basil ,  4 tbsp extra virgin olive oil,  sea salt,  300g\/11oz black olives, stones removed,  75g\/3oz tinned tuna in olive oil,  150g\/5oz capers, drained,  ½ lemon, juice only,  5 tbsp extra virgin olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fougasse_with_chickpea_84307"}