{"recipe_name":"Fragrant chicken noodle soup","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the soup base, pour the stock into a large saucepan and bring to a simmer. Finely chop one of the lemongrass stalks and add to the pan. Split two of the chillies lengthways almost all the way through and add to the pan.  Add the lime leaves, if using, one of the sliced shallots and all the ginger and garlic. Bring to a low simmer and cook gently for 15 minutes. Remove from the heat and leave to stand.. For the chicken balls, put all the ingredients in a large bowl and mix until well combined. Tip some cornflour onto a plate and use dust your hands. Roll the chicken mixture into 16 small balls and put on a large dinner plate.  Strain the infused stock through a sieve into a clean pan. Stir in the remaining shallots, lime juice and fish sauce.  Slice the remaining two bird’s eye chilles very finely and add to the pan. Bash the lemon grass with a rolling pin to bruise, and stir into the stock. Bring to a gentle simmer and add the chicken balls. Cook for five minutes, allowing the liquid to bubble. Add the noodles and return to a simmer for two minutes.  Stir in the mange tout and red pepper and simmer for two minutes more until the chicken balls are cooked through and the vegetables and noodles are just tender. Add salt and freshly ground black pepper, to taste, adding a little extra lime juice or fish sauce if needed. Ladle into deep bowls, scatter the coriander over and serve. ","ingredients":" 1 litre\/1¾ pints chicken stock (home-made or bought),  2 lemongrass stalks,  4 bird’s eye chillies,  4-5 kaffir lime leaves (optional),  3 long shallots, peeled and finely sliced,  50g\/2oz piece fresh root ginger, peeled and sliced thinly,  3 garlic cloves, peeled and halved lengthways,  4 tbsp lime juice,  2 tbsp nam pla (Thai fish sauce),  100g\/3½oz medium rice or egg noodles,  100g\/3½oz mange tout, trimmed and sliced diagonally ,  1 red pepper, deseeded and very thinly sliced,  small bunch fresh coriander, roughly torn,  250g\/9oz minced chicken,  2 spring onions, trimmed and finely sliced,  1 garlic clove, peeled and crushed,  1 birds eye chilli, finely chopped ,  1 tbsp cornflour, plus extra for dusting,  ¼ tsp fine sea salt,  2 tbsp chopped fresh coriander leaves,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fragrant_chicken_noodle_59139"}