{"recipe_name":"French-trimmed chicken breast with wild mushrooms","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. To French-trim your own chicken, cut the legs from the bird and set them aside to use in another dish. Place a sharp knife onto the front end of the chicken and cut down either side of the wishbone. Discard the wishbone. Slice down either side of the breast bone and remove the chicken breasts, with the wings still attached. Trim the ends off the wings and discard. Run the knife around the end of each wing, push the flesh down to reveal some of the bone and scrape the flesh from the revealed bone. You now have a French-trimmed chicken breast. Season the chicken breasts with salt and freshly ground black pepper. Heat an ovenproof frying pan until hot, add half the butter then cook the chicken, skin side down, for 1-2 minutes or until the skin is golden-brown. Flip the chicken breasts over and cook for another minute then transfer to the oven and roast for 12-15 minutes or until the chicken is cooked through. Meanwhile, heat another frying pan, add the remaining butter, the shallots and garlic and cook gently for 1-2 minutes until just softened. Add the mushrooms, cook for one minute then add the Madeira, let it flambé then cook until reduced by half. Add the chicken stock and cook for another minute then add the cream. Season with salt and freshly ground black pepper then add the chives and chervil and stir them through the sauce. To serve, spoon the mushrooms onto a serving plate, carve the chicken into thick slices and place on the top. ","ingredients":" 2 corn-fed free-range chicken breasts, French-trimmed (see below for method),  salt and freshly ground black pepper,  50g\/1¾oz butter,  1 tbsp olive oil,  2 shallots, finely chopped,  1 garlic clove, finely chopped,  50g\/1¾oz trompettes de mort mushrooms, cleaned and trimmed,  50g\/1¾oz chanterelle mushrooms, cleaned and trimmed,  50g\/1¾oz girolles mushrooms, cleaned and trimmed,  75ml\/3fl oz Madeira,  150ml\/5fl oz reduced chicken stock,  75ml\/3fl oz double cream,  2 tbsp finely chopped chives,  2 tbsp finely chopped chervil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/french-trimmed_chicken_70337"}