{"recipe_name":"French onion soup with cheese croute, red onion compôte and shallot rings","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the soup, heat the butter and olive oil in a large deep pan and add the onions, garlic and thyme. Fry for 20-25 minutes over a medium-low heat, or until softened and golden-brown. Add the sherry, two thirds of the brandy and the wine and carefully flambé. When the flames have died out, add the sugar and beef stock to the pan. Bring to the boil, then reduce the heat and simmer for ten minutes. Season, to taste, with salt and freshly ground black pepper and stir in the balsamic vinegar and the remaining brandy. Preheat the grill to high. For the cheese croûtes, grill the baguette slices on one side, then turn, sprinkle with gruyère and grill until golden-brown and bubbling. For the compote, heat the oil in a pan and add the red onion. Fry for 5-8 minutes, or until just softened but not too browned. Stir in the sugar, vinegar and lemon juice and season, to taste, with salt and freshly ground black pepper. For the shallot rings, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place the shallot rings into a bowl with the seasoned flour and mix well to coat the rings. Carefully place the shallot rings into the hot oil and deep fry for 1-2 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. To serve, ladle the soup into serving bowls and top with the cheese croûtes. Top the croûtes with a spoonful of onion compote and a few shallot rings. ","ingredients":" 25g\/1oz butter,  2 tbsp olive oil,  1kg\/2lb 2oz white onions, finely sliced,  3 garlic cloves, finely chopped ,  2 sprigs fresh thyme, leaves only,  50ml\/2fl oz dry sherry,  75ml\/3fl oz brandy,  250ml\/9fl oz white wine ,  1 tsp soft brown sugar,  1 litre\/1¾ pints fresh beef stock,  salt and freshly ground black pepper ,  1 tbsp balsamic vinegar,  1 small baguette, cut into slices on the diagonal,  110g\/4oz gruyère cheese, grated,  1 tbsp olive oil,  1 red onion, finely sliced,  ½ tsp soft brown sugar,  1 tbsp balsamic vinegar,  ½ lemon, juice only,  salt and freshly ground black pepper ,  vegetable oil, for deep-frying,  2 shallots, sliced into rings,  2 tbsp plain flour, seasoned with salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/frenchonionsoupwithc_87385"}