{"recipe_name":"Fresh fruit salad","author":"Ramona Andrews","programme":null,"prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4--6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/fresh_fruit_salad_61942_16x9.jpg","method":"For the fruit salad, segment the grapefruit and orange, catching the juices in a bowl. Squeeze more juice out of the remaining citrus fruit into the bowl. Set aside the orange and grapefruit segments. For the syrup, measure the juice and add water to make 100ml\/3½fl oz.  Peel a large strip of lime zest from the lime, avoiding any of the white pith. Reserve the remaining lime. Combine the citrus juice\/water mixture and the sugar in a small saucepan. Heat until the sugar has dissolved, stirring once or twice. Add the lemongrass, lime zest and ginger and then bring to a boil. Immediately reduce the heat to a simmer. Simmer over a low heat for 10 minutes. Turn off the heat and leave the syrup to cool. For the fruit salad, remove the seeds from the pomegranate and slice the banana.  Peel another slice of zest from the lime using a vegetable peeler, avoiding any of the white pith. Slice it very finely and reserve this for decoration. Set aside the remaining lime as you will need the juice. Cut the grapes in half and slice the kiwi.  Finally chop the pear and apple, pouring a little lime juice over the apple to retain its colour. Combine all the fruit in a large bowl or in individual serving dishes or Martini glasses. Pour over the syrup, to taste. You may not need to use all the syrup – any remaining syrup can be used in cocktails or added as a sweetener to herbal tea. Decorate with strips of lime and a sprig of mint. ","ingredients":" 1 pink grapefruit,  1 orange,  1 pomegranate,  1 banana,  small bunch white grapes,  small bunch black grapes,  1 kiwi,  1 pear,  1 apple,  sprig mint, to decorate (optional),  citrus juice (from above),  1 lime,  100g\/3½oz sugar ,  1 lemongrass stalk, sliced in half,  1 thumb-sized piece ginger, roughly sliced","vegetarian":true,"calories":159.0,"protein":1.5,"carbs":36.0,"sugars":35.0,"total_fat":0.0,"saturated_fat":0.0,"fiber":4.0,"salt":0.0,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fresh_fruit_salad_61942"}