{"recipe_name":"Fresh herb fougasse ","author":"Paul Hollywood","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Makes 2 large loaves","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/fresh_herb_fougasse_70351_16x9.jpg","method":"Grease a large plastic container with a little olive oil. Line two large baking sheets with baking parchment or silicone paper.  Put the flour, salt and yeast into the bowl of a freestanding electric mixer fitted with a dough hook. (Don’t put the salt directly on top of the yeast). Add the olive oil and three-quarters of the water. Begin mixing on a low speed. As the dough starts to come together, add the remaining water very slowly, then mix for another 8 minutes on a medium speed. Add the rosemary, sage and thyme and mix for a minute until the herbs are evenly distributed in the dough. When ready, the dough will be very elastic and you should be able to stretch it away from the bowl.  Tip the dough into the oiled container. Cover and leave to rise until at least doubled in size – about an hour. The dough should be bouncy and shiny.  Mix equal quantities of white flour and semolina together and use to heavily dust the work surface. Carefully tip out the dough. It will be quite loose and flowing, but don’t worry. Divide the dough in half.  Lift each piece of dough onto the prepared baking sheets and spread out into flat ovals. Using a pizza cutter make two cuts in a line down the middle of the ovals with a gap between them, stopping 2cm\/1in from each end. Then make 12 diagonal cuts in the dough, 6 either side of the central cuts, forming a leaf design, then stretch the dough out slightly to emphasise the holes.  Place the baking sheets inside large plastic bags and leave to prove in a warm place for 20 minutes. Preheat the oven to 220C\/200C Fan\/Gas 7.  Spray a little olive oil over the top of the loaves using a water spray bottle, or just drizzle over the oil. Sprinkle over the oregano and bake for 15–20 minutes, or until the fougasse sounds hollow when tapped on the base. Remove from the oven and while still hot, brush with more olive oil and sprinkle with the sea salt. ","ingredients":" 500g\/1lb 2oz strong white bread flour, plus extra for dusting ,  10g\/¼ fine salt ,  7g sachet instant yeast ,  2 tbsp olive oil, plus extra for greasing and drizzling ,  350ml\/12fl oz warm water ,  2 tsp chopped fresh rosemary, plus extra to finish ,  2 tsp chopped fresh thyme ,  2 tsp chopped fresh sage ,  fine semolina, for dusting ,  ½ tsp dried oregano ,  sea salt flakes, crushed, to finish ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fresh_herb_fougasse_70351"}