{"recipe_name":"Fresh kaffir lime and coconut posset and cardamom butter biscuits","author":"Paul Rankin","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the posset, bring the cream to the boil with the lime zest, sugar and lime leaves.  Add lemon and lime juice, bring back to boil and stir in the ground desiccated coconut. Strain through a fine sieve and pour into glasses to serve.  Chill in the fridge for 2-3 hours before serving. For the biscuits, rub the flour and butter together in a large bowl until the mixture resembles breadcrumbs. Stir in the caster sugar, ground cardamom, ginger, lemon or orange zest, salt and egg yolk and work together using your hands until it becomes a soft, smooth dough. (Add a splash of water if necessary to combine.)  Wrap the biscuit dough in cling film and transfer to the fridge to chill for an hour.  Preheat the oven to 180C\/350F\/Gas 4. Roll the dough out on a floured surface until it is approximately 5mm\/¼in thick.  Using a 6cm\/2½in round cutter, cut into rounds and place on baking trays lined with greaseproof paper.  Bake in the preheated oven for 10-12 minutes, or until lightly golden-brown.  Transfer to a wire rack to cool. Sprinkle with caster sugar or dust with icing sugar to serve.  For the mango salsa, carefully mix together all the salsa ingredients and refrigerate until ready to serve.  To serve, set each posset glass on a side plate with a couple of biscuits and carefully spoon some mango salsa on top of the posset. ","ingredients":" 600ml\/20fl oz double cream,  2 limes (preferably kaffir), zest and juice ,  140g\/5oz caster sugar,  4 kaffir lime leaves, shredded,  2 lemons, juice only,  2 tbsp ground desiccated coconut,  200g\/7oz self-raising flour, plus extra for dusting,  100g\/3½oz unsalted butter, cut into cubes,  75g\/2½oz caster sugar,  1½ tsp freshly ground cardamom,  ¼ tsp ground ginger,  1 tsp lemon or orange zest (optional),  pinch of salt,  1 free-range egg yolk,  caster sugar or icing sugar, to dust,  ½ small honey mango, peeled and finely diced ,  sugar syrup (4 tbsp water and 2 tbsp sugar boiled together),  2 tbsp lemon juice,  1 kaffir lime leaf, finely shredded","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fresh_kaffir_lime_and_02405"}