{"recipe_name":"Fresh linguine with crab and mussels","author":"Galton Blackiston","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the pasta, place the flour and salt in a large food processor and mix. Add the egg yolks and mix again until you have a mixture that resembles breadcrumbs. Remove the mixture from the processor and gently knead until it comes together as a smooth dough. Wrap in cling film and rest in the fridge for at least an hour. For the Piedmont peppers, put half a tomato inside each halved pepper and sprinkle over the garlic, oil and basil and place in the oven for 20-30 minutes. For the fontina mash, place the potatoes in a large saucepan of boiling water and cook for 15-20 minutes. Once soft, drain and place back in the pan. Add the butter, milk and cheese and mash until smooth. Set aside. For the mussels, place the artichokes in a saucepan and add cold water just to cover the artichokes. Bring to a simmer and cook for 15-20 minutes. Drain and roughly chop the artichokes then set aside. To prepare the mussels, wash the shells in cold water and pull off any stringy beards. Discard any mussels with broken shells, or any open ones that do not close when given a sharp tap. For the pasta, roll the pasta though a pasta machine, put through the linguine setting and sprinkle with the semolina flour. For the mussels, place a large frying pan on the heat and add the oil. Once hot, add the red onion and cook for three minutes. Add two-thirds of the garlic, all the chilli and the artichokes and cook for five minutes. Add the wine and cook until the volume of liquid has reduced by half. Add the tomatoes and reduce the heat to a gentle simmer. Heat a large saucepan and add the onion, remaining garlic and the white wine. Cook for 3-4 minutes and then add the mussels. Place a lid on and cook until the mussels have opened. Discard any mussels that have not opened. Remove all but eight mussels from their shells. Heat a large saucepan of boiling salted water and add the pasta and cook for 2-3 minutes and drain. Toss the onion mix through the pasta and add parsley. To serve, pile the pasta at one end of the plate and dress the mussels and crab around the edge with the mash and peppers at the other end of the plate. Serve with a twist of black pepper. ","ingredients":" 400g\/14oz 00 Italian pasta flour,  1 tsp sea salt,  4 medium free-range yolks,  25g\/1oz semolina flour,  2 vine-ripened tomatoes, peeled, halved, seeds removed,  2 red peppers, cut in half lengthways, seeds removed,  1 garlic clove, finely chopped,  2 tbsp olive oil,  ½ bunch fresh basil,  500g\/1lb 2oz white potatoes, peeled and cut into four,  100g\/3½oz unsalted butter,  50ml\/2fl oz whole milk,  100g\/3½oz fontina cheese, grated,  2 globe artichokes, peeled and trimmed ,  200g\/7oz mussels,  2 tbsp olive oil,  1 red onion, finely diced,  3 garlic cloves, finely chopped ,  1 red chilli, seeds removed ,  75ml\/2½fl oz white wine,  4 vine-ripened tomatoes, peeled, seeds removed, finely chopped,  ½ onion, finely chopped,  75ml\/2½fl oz white wine,  200g\/7oz cooked white crabmeat,  2 tbsp fresh flat-leaf parsley, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fresh_linguine_with_crab_93316"}