{"recipe_name":"Fresh pea, courgette and parmesan rosti with tangy tomato dressing","author":"Ainsley Harriott","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rosti, blanch the peas in a pan of boiling salted water for two minutes or until just tender then drain well. Refresh in a bowl of iced water and drain again.  Squeeze the courgettes in a clean tea towel and place in a large bowl. Mix in the blanched peas, ground rice, basil, parmesan and pine nuts then add the beaten eggs and season with sea salt and freshly ground black pepper. Divide the mixture into 16 evenly sized balls and slightly flatten each one. Heat one tablespoon of the olive oil in a large non-stick frying pan over a medium heat and fry half the rosti for 2-3 minutes on each side or until crisp and golden-brown. Drain on kitchen paper and keep warm. Repeat with the remaining oil and rostis. To make the dressing, place the ingredients in a bowl, mix until well combined and season with sea salt and freshly ground black pepper. Place a stack of rosti on each plate, drizzle a little dressing over and around the rosti and garnish with a sprinkling of shredded basil leaves. ","ingredients":" 200g\/7oz shelled fresh peas ,  350g\/12oz courgettes, grated,  150g\/5½oz ground rice,  3 tbsp shredded basil leaves, plus extra to serve,  70g\/2½oz parmesan (or a vegetarian alternative), grated,  50g\/1¾oz pine nuts, lightly toasted,  2 free-range eggs, lightly beaten,  sea salt and freshly ground black pepper,  2 tbsp olive oil,  6 tbsp olive oil,  1 ripe plum tomato, seeds removed and finely diced,  4 sun-dried tomatoes in oil, drained and finely chopped,  1 small shallot, finely chopped,  1 tbsp red wine vinegar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fresh_pea_courgette_and_97855"}