{"recipe_name":"Fresh pasta with chilli, smoked garlic and wild mushrooms","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pasta, place the flour into a food processor and crack in the eggs one at a time with the motor running until the mixture resembles fine breadcrumbs.  Add the olive oil and blend for a couple of seconds. Turn out onto a floured surface and knead for five minutes. Ideally wrap in cling film and allow to rest at room temperature for 30 minutes. If you dont have time, it is possible to use it straightaway. Work the pasta through a pasta machine according to the machine instructions until it is as thin as possible. Cut into strips either by hand or using the pasta machine and hang up to dry for two minutes.  Bring a large pan of salted water to the boil, drop in the pasta and cook for two minutes. Drain well and mix with extra virgin olive oil. For the sauce, heat the olive oil in a pan, add the garlic and chilli and sauté for 1-2 minutes.  Transfer the mixture to a blender. Add the parsley and chives and blend until smooth. For the mushrooms, heat the butter in a frying pan, add the mushrooms and garlic and cook gently for 2-3 minutes until soft. To serve, mix the pasta with the chilli sauce, spoon into a serving bowl and scatter with the mushrooms. Garnish with parsley. ","ingredients":" 200g\/7oz plain flour, plus extra for dusting,  2 free-range eggs,  2 tsp extra virgin olive oil, plus extra for drizzling ,  3 tbsp olive oil,  1 smoked garlic clove, chopped,  1 green chilli, finely chopped,  handful each fresh parsley and chives,  30g\/1oz butter,  150g\/5½oz wild mushrooms, cleaned and sliced,  1 smoked garlic clove, finely chopped ,  1 tbsp chopped parsley, to garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/freshpastawithchilli_87147"}