{"recipe_name":"Fricassée of wild mushrooms","author":"Raymond Blanc","programme":"Raymond Blanc's Kitchen Secrets","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/320F\/Gas 2. For the croutons, cut the baguette into 3mm-thick slices and arrange in an even layer on a baking sheet. Toast in the oven for 2-3 minutes on both sides, or until golden-brown and crisp. Rub each slice of toast with the cut sides of the garlic clove. Set aside.  For the mushrooms, lightly brush the mushrooms to get rid of any remaining dirt or mud. Briefly wash the mushrooms in a large bowl of fresh water (for no more than 10-15 seconds) then lift them out and place onto a clean tea towel. Gently pat dry, then cut off the base of the stalks and discard.  Heat the butter in a pan over a medium heat until foaming, then add the shallots and garlic and fry for 30 seconds. Increase the heat to high, then add the pied de mouton mushrooms and cook for one minute. Add the white wine and cook for one minute, or until the liquid has reduced slightly, then add the girolles. Cook for a further minute before adding the trompette de la mort, herbs, lemon juice and tomatoes. Stir well. Add a splash of water if the mixture is becoming too dry, then season, to taste, with salt and freshly ground black pepper.  To serve, spoon the mushrooms into serving bowls and crumble over the croutons. ","ingredients":" ½ small French baguette,  1 garlic clove, halved ,  400g\/14oz mixed wild mushrooms (pied de mouton, girolle, chanterelle  and trompette de la mort),  30g\/1½oz unsalted butter,  ½ banana shallot or ¼ onion, peeled, chopped ,  1 garlic clove, peeled, puréed,  100ml\/3½fl oz dry white wine,  4 pinches sea salt,  4 pinches freshly ground black pepper,  10g\/½oz fresh flatleaf parsley leaves, roughly chopped,  1 sprig fresh tarragon, leaves only, finely chopped,  2 sprigs fresh chervil, finely chopped,  1 tbsp lemon juice,  200g\/7oz tomatoes, quartered, seeds scooped out, finely chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fricasseeofwildmushr_93489"}