{"recipe_name":"Fried aubergine with fennel yoghurt","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/fried_aubergine_with_69889_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. For the fennel yoghurt, heat the oil in an ovenproof casserole over a medium heat. Add the garlic and fennel and fry for 4-5 minutes, or until golden-brown and slightly softened.   Add the lemon juice to the mixture, stir well, then cover and transfer to the oven. Roast for 15-20 minutes, or until the fennel is tender. Set aside to cool. For the aubergine chips, mix together the breadcrumbs, percorino, chilli flakes, salt and pepper in a shallow bowl.  Place the plain flour onto a shallow plate and beat the eggs in a shallow bowl.  Roll the aubergine sticks in the flour, then dip into the egg and finally coat in the breadcrumb mixture.    Heat the oil in a deep-fat fryer to 150C\/300F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Transfer the coated aubergine sticks to the hot oil to deep-fry for about six minutes, or until golden-brown.  Remove from the oil with a slotted spoon and drain on kitchen paper.  Combine the roasted fennel, roasted garlic and any roasting juices with the fennel seeds in a blender.  You may need to add some more olive oil or  lemon juice, to taste. Blend until the mixture is a smooth purée.  Pass the puréed fennel through a sieve and stir into the Greek yoghurt.  Serve the fennel yoghurt in a bowl and with the fried aubergine sticks and watercress on the side.  ","ingredients":" 2 heads fennel, quartered ,  1 tbsp olive oil, plus extra for blending,  2 cloves garlic, peeled,  1 lemon, juice only,  1 tbsp fennel seeds, toasted,  300g\/10½oz thick Greek yoghurt,  250g\/9oz breadcrumbs,  50g\/2oz pecorino, grated ,  1 tsp chilli flakes,  salt and freshly ground black pepper ,  4 aubergines, cut into 2cm\/1in rounds,  3 free-range eggs, beaten,  100g\/3½oz plain flour,  vegetable oil, for deep frying ,  watercress, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fried_aubergine_with_69889"}