{"recipe_name":"Fried calves' liver with straw fries, onion rings and cavolo nero","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fried calves' livers, season the livers, to taste, with salt and freshly ground black pepper. Heat a large frying pan over a high heat and add the butter.  When the butter is foaming, add the livers and fry on both sides for 1-2 minutes, or until golden-brown all over but still slightly pink in the middle. Remove from the pan and set aside to rest. For the straw fries, heat the vegetable oil in a deep-fat fryer to 190C\/375F. Alternatively, half-fill a deep, heavy-based pan with the vegetable oil and heat to the same temperature, checking using a digital thermometer. (Caution: hot oil can be dangerous. Do not leave unattended.) Fry the chips in the oil for 4-5 minutes, or until golden-brown and crisp.  Using a slotted spoon, remove the chips and set aside to drain on kitchen paper. While the chips are still warm, season with salt, to taste.  Mix the cornflour and a pinch of salt in a bowl. Whisk in enough sparkling water to form a smooth batter (you may not need all of the water). Dip the onion rings into the batter and carefully lower into the hot oil. Fry for 1-2 minutes on each side, or until crisp and golden-brown on both sides. Remove from the pan using a slotted spoon and set aside to drain on a plate lined with kitchen paper. Add the butter to a hot frying pan and, once foaming, add the cavolo nero and cook for a minute and then season with salt and pepper, then cook until wilted. For the Diane sauce, add the brandy to the still-hot pan that you cooked the liver in and return it to the heat. Very carefully tip the pan slightly to catch the flame and ignite the brandy. Flambé until the flame subsides. (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.) Reduce the heat and quickly add the butter, Worcestershire sauce, mustard, sea salt and pepper, stirring vigorously with a wooden spoon for one minute, allowing the mixture to bubble and thicken.  Add the parsley and lemon juice to finish. To serve, place the cabbage in the centre of the plates and the liver on top. Pour the sauce over and serve alongside the fries and onion rings. ","ingredients":" 4 x 150g\/5½oz slices calves' livers, trimmed,  salt and freshly ground black pepper,  50g\/1¾oz butter,  600g\/1lb 5oz potatoes, peeled and cut into ½cm\/¼in chips,  vegetable oil, for deep-frying,  salt, to taste,  100g\/3½oz cornflour,  150ml\/5½fl oz sparkling water,  2 small onions, finely sliced into rings,  50g\/1¾oz unsalted butter,  1 head cavolo nero,  2 tbsp brandy,  2 tbsp butter,  2 tbsp Worcestershire sauce,  2 tsp Dijon mustard,  ½ tsp sea salt,  freshly ground black pepper,  1 tbsp finely chopped parsley,  1 tsp lemon juice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fried_calfs_liver_with_41221"}