{"recipe_name":"Fried egg ‘bourguignon’ with duck confit and cracklings and grilled Portobello mushrooms","author":"Daniel Boulud","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the grilled Portobello mushrooms, place the mushrooms into a bowl, drizzle over the oil and sprinkle with the garlic and thyme leaves. Season, to taste, with salt and freshly ground black pepper. Mix until the mushrooms are coated in the marinade mixture. Set aside to marinate for at least one hour.  For the crispy egg, bring a large pot of water to the boil. Add the vinegar and a pinch of salt. Set a bowl of ice water alongside.  Boil 4 of the eggs in the water for exactly 5 minutes, then remove from the pan using a slotted spoon and chill in the ice water.  Crack the remaining egg into a bowl. Whisk and add a pinch of salt and freshly ground black pepper.  Sprinkle the flour and breadcrumbs into two separate shallow dishes and season with salt and freshly ground black pepper.  Peel the cooled boiled eggs. Dredge each one first in the flour, then dip it in the whisked egg, then roll it in the breadcrumbs until completely coated. Chill in the fridge. Meanwhile, for the shallot purée, bring the shallots, garlic and wine to a gentle simmer in a small saucepan. Simmer until the shallots are tender and the wine has almost completely evaporated.  Transfer the mixture to a food processor, add the olive oil, and blend to a smooth purée. Season, to taste, with salt and freshly ground black pepper, then set aside until needed. Keep warm. When the mushrooms have marinated, preheat the grill to medium and grill the mushrooms for 7-8 minutes on each side, or until cooked through.  Cut each grilled mushroom into a perfect circle using a 7.5cm\/3in cookie cutter. Then cut a smaller circle inside each mushroom using a 4cm\/1½in cookie cutter to make a donut shape. Keep warm.  Chop and reserve the cooked trimmings. For the duck confit fricassée, mix together the red onions, butter and chicken broth in a small frying pan. Season, to taste, with salt and freshly ground black pepper. Bring the mixture to a simmer and cook until the shallots are tender, about 3-4 minutes.  Heat the olive oil in a separate pan over a medium to high heat. Add the mixed wild mushrooms, garlic and thyme and fry for 2-3 minutes, or until softened. Season, to taste, with salt and freshly ground black pepper.  Add the reserved trimmings from the grilled Portobello mushrooms, the confit duck leg meat and the onion mixture and mix well.  Pour in the sherry vinegar and fry for a further 2-3 minutes.  Just before serving, heat the oil in a deep fat fryer to 180C\/350F. Roll the chilled, coated eggs in more breadcrumbs, then deep-fry until golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Sprinkle with salt.  To serve, place a spoonful of shallot purée into the centre of each of four serving plates. Spoon a large spoonful of duck confit fricassée on top, then plate one grilled mushroom ring on top. Slice off the wider end of each deep-fried egg to expose the yolk, then set one inside each Portobello mushroom. Sprinkle over a pinch of cracked peppercorns and some of the chives. Whisk the lemon juice with the olive oil and season, to taste, with salt and freshly ground black pepper. Add the salad leaves and mix to coat the leaves in the dressing. Arrange the salad around the edge of the plate with a few duck cracklings. Serve warm. ","ingredients":" 4 Portobello mushrooms (about 8cm\/3¼in in diameter), stems trimmed and reserved, skin peeled and reserved,  110ml\/4fl oz olive oil,  3 garlic cloves, crushed,  4 sprigs fresh thyme, leaves only,  salt and freshly ground black pepper,  5 free-range eggs,  2 tbsp white wine vinegar,  salt and freshly ground black pepper,  110g\/4oz plain flour,  200g\/7oz fresh breadcrumbs,  vegetable oil, for deep frying,  150g\/5oz shallots (about 4 large shallots), finely chopped,  2 garlic cloves, finely chopped,  300ml\/11fl oz red wine,  40ml\/1½fl oz olive oil,  salt and freshly ground black pepper,  110g\/4oz small red onions, such as red pearl onions, peeled and halved,  30g\/1¼oz butter,  60ml\/2½fl oz chicken stock (or water),  salt and freshly ground black pepper,  4 tsp olive oil,  150g\/5oz mixed wild mushrooms (such as chestnut, shiitake and girolles), trimmed and rinsed,  trimmings and skin from Portobello mushrooms (see above),  1 ready-made confit duck leg, meat picked from bone and roughly chopped,  2 tbsp sherry vinegar,  mixed cracked peppercorns, to taste,  10g\/¼oz fresh chives, sliced,  110g\/4oz mixed green salad leaves,  1 tbsp lemon juice,  3 tbsp olive oil,  salt and freshly ground black pepper,  50g\/2oz duck ‘cracklings’ (fried duck skin)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fried_egg_bourguignon_90211"}