{"recipe_name":"Fried melon and red mullet with a ginger pickle, nasturtium leaves, wild rice and a kaffir lime foam","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the melon in a vacuum pack plastic bag and seal. Leave in the fridge for 48 hours. Remove the melon from the bag and fry in a little oil until golden-brown. For the ginger pickle, heat two tablespoons of the oil in a frying pan, fry the cumin seeds for 1-2 minutes, and then add the sesame seeds, ginger, green chilli and chilli powder. Season with a little salt.  Stir for 2-3 minutes and then cover with a circle of greaseproof paper and let the mixture cook slowly for 40-45 minutes, or until the ginger is almost cooked.  Let the mixture cool, then transfer to a food processor. Add the tamarind paste, palm sugar, asafoetida, dried chilli, mustard seeds and curry leaves. Blend to a fine paste.  For the rice, heat a deep fat fryer to 210C\/410F, or heat the oil in a deep pan. (Caution: hot oil can be dangerous. Do not leave unattended.) Carefully add the rice to the oil. It will burst and float to the top. When they have stopped popping, remove them from the oil and drain on a plate lined with kitchen paper. Season with sea salt. Pour the milk into a saucepan with the lime leaves and lecithin and bring just to a simmer. Blend with a hand-held blender to create a foam. Heat a little olive oil and butter in a frying pan and once hot add the red mullet skin-side down. Cook for 1-2 minutes and turn the fish over and cook for a further 1-2 minutes. Remove the pan from the heat and allow to rest. To serve, place the ginger pickle on the plate, and top with the red mullet, with the fried melon. Garnish with the nasturtium leaves, popped wild rice and the lime foam. ","ingredients":" 1 piel de sapo melon, peeled, seeds removed and cut into slices,  2 tbsp olive oil,  2 tbsp unsalted butter,  2 fillets red mullet,  3 tbsp rapeseed oil,  1 tsp cumin seeds,  2 tsp sesame seeds,  200g\/7oz root ginger, thinly sliced,  1 green chilli, slit open,  1 tsp red chilli powder,  salt,  100g\/3½oz tamarind paste ,  100g\/3½oz palm sugar,  pinch asafoetida ,  1 dried red chilli,  ½ tsp mustard seeds,  5-6 curry leaves ,  vegetable oil, for deep fat frying,  50g\/1¾oz wild rice,  salt, to taste,  200ml\/7fl oz full-fat milk,  4 lime leaves, finely chopped,  1 tsp lecithin,  handful of nasturtium leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fried_melon_and_red_90384"}