{"recipe_name":"Fried red mullet with teriyaki risotto, enoki mushrooms, dried seaweed and a kaffir lime foam","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the lime foam, place the lime leaves and 180ml\/6fl oz water in a blender and pulse, leave to stand for 30 minutes to infuse and then strain the liquid. Chill the liquid in the fridge overnight.  Add the lecithin to the chilled liquid and, using a stick blender, mix the liquid until a light foam forms. To make the risotto, heat a large saucepan and add the butter. Once melted, add the shallots and cook for a minute. Add the garlic and continue to cook for a further minute, then add the mushrooms. Add the rice and stir to coat the rice in the butter. Pour in the wine and cook until the volume of liquid has reduced by half.  Gradually add the stock, allowing it to be absorbed between additions, until the rice is cooked. For the teriyaki sauce, heat a frying pan and add the rice wine, sake, mirin, soy sauce and sugar and bring to the boil. Simmer for 2-3 minutes, or until it has thickened. Once the rice is cooked stir through the teriyaki sauce and keep warm until ready to serve. To cook the red mullet, heat a medium frying pan and add the oil and butter. Once hot add the fish skin-side down and cook for a couple of minutes, then turn over and cook for another minute. To serve, spoon the risotto into a serving bowl and place the fillet on top and garnish with the mushrooms, seaweed, micro coriander and cress. Spoon over the lime foam. ","ingredients":" 30g\/1oz kaffir lime leaves,  1 tbsp lecithin,  75g\/2½oz unsalted butter,  2 shallots, finely chopped,  2 garlic cloves, finely chopped,  200g\/7oz enoki mushrooms,  350g\/12½oz arborio rice,  150ml\/5fl oz white wine,  600ml\/21fl oz vegetable stock, warm,  125ml\/4fl oz shaoxing rice wine,  125ml\/4fl oz sake,  125ml\/4fl oz mirin,  125ml\/4fl oz soy sauce,  3 tbsp caster sugar,  1 tbsp olive oil,  50g\/1¾oz unsalted butter,  4 x 150g-200g\/5½-7oz fillets of red mullet, skin on, pin boned,  50g\/1¾oz dried seaweed,  2 tbsp micro coriander,  2 tbsp shiso cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fried_red_mullet_with_20199"}