{"recipe_name":"Fried fish in oatmeal with tartare sauce","author":"The Hairy Bikers","programme":"The Hairy Bikers' Food Tour of Britain","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Season the fish strips with salt and freshly ground black pepper, and sprinkle over the lemon juice. Pour the beaten eggs into a bowl. Sprinkle the pinhead oatmeal onto a plate.  Brush each piece of fish all over with a little of the beaten egg using a pastry brush, then dredge in the oatmeal until completely covered.  Pour enough oil into a large frying pan to just cover the base of the pan. Heat the oil over a medium to high heat (CAUTION: hot oil can be dangerous. Do not leave unattended). When the oil is hot, add the prepared fish strips, in batches, and fry for 6-8 minutes, turning once, or until crisp and golden-brown and completely cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper, keeping warm. Repeat the process with the remaining fish. Meanwhile, for the tartare sauce, in a bowl, mix together all of the tartare sauce ingredients until well combined. Set aside until ready to serve. (NB: this recipe will make more tartare sauce than is needed. Store the remaining sauce in an airtight jar in the fridge for up to a week.) To serve, divide spoonfuls of the tartare sauce equally among four small dipping bowls. Place one dipping bowl into the centre of each of four serving plates. Arrange the fish goujons around the dipping bowls. Sprinkle over salt, to taste, and garnish with lemon wedges. ","ingredients":" 600g\/1lb 5oz mixed fish fillets (such as herring, smoked haddock, plaice, etc), any pin bones removed, cut into strips,  salt and freshly ground black pepper,  ½ lemon, juice only,  2 free-range eggs, beaten,  200g\/7oz pinhead oatmeal ,  sunflower oil, for frying ,  1 x 500g\/1lb 2oz jar ready-made good quality mayonnaise,  2 tbsp chopped capers ,  2 tbsp chopped pickled cornichons or gherkins ,  2 tbsp chopped fresh parsley leaves,  2 tbsp chopped fresh dill,  ½ lemon, juice only,  splash Tabasco sauce,  salt, to taste,  1 lemon, cut into wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/friedfishinoatmealwi_91975"}