{"recipe_name":"Fritto misto di verdure","author":"Theo Randall","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Fill a large bowl with water and add the lemon juice. Prepare the artichokes one at a time. Remove the tough outer leaves to reveal the pale inner heart. Open the heart and, using a teaspoon, scoop out the hairy choke. Peel the stem to remove the tough outside, leaving just the tender core. Chop the artichoke heart vertically in half, then cut the heart and stem into slices. Immediately immerse the artichoke in the lemon water to prevent it from turning brown. For the batter, put the flour in a large mixing bowl and make a well in the middle. Pour the oil into the well, then mix it with the flour while slowly adding the warm water. Mix until the batter is smooth with the consistency of double cream. Put a deep, heavy-based pan containing the sunflower oil on the heat until the oil is 180C, or alternatively use a deep-fat fryer. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Preheat the oven to its lowest setting. Drain the artichokes and pat dry using kitchen paper.  In a separate, clean glass bowl, whisk the egg white to soft peaks. Carefully fold it into the batter. Fry the vegetables in batches, each type separately (cook the chard and sage leaves together). To do this, dip the vegetables into the batter and shake off any excess, then deep-fry them in the hot oil for 3–4 minutes, or until crisp and golden-brown all over. Drain on kitchen paper and keep warm in the oven while you cook the next batch.  Mix all the dressing ingredients together in a small bowl. To serve, season the deep-fried vegetables with salt and pepper, drizzle the dressing over the top and serve with lemon wedges. ","ingredients":" 1 lemon, juice only,  3 violet artichokes with long stems,  1 large aubergine, thinly sliced,  1 bunch of asparagus, woody ends removed,  2 sweet onions (such as scallions), thinly sliced,  2 portobello mushrooms, cut into 1cm\/½in slices,  6 small courgettes with their flowers attached, sliced,  sunflower oil, for deep-frying,  4 small Swiss chard leaves,  6 large sage leaves,  sea salt and freshly ground black pepper,   300g\/10½oz tipo ‘00’ flour,  4 tbsp extra virgin olive oil,  250ml\/9fl oz warm water,  1 free-range egg white,  1 red chilli, seeds removed and chopped,  2 tbsp chopped fresh mint,  2-4 tbsp sherry vinegar,  1 lemon, zest and juice only,  lemon wedges","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fritto_misto_di_verdure_14523"}