{"recipe_name":"Fruity Swedish tea ring","author":"Richard Burr","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 1 large loaf","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the flour, salt, yeast, butter, sugar, eggs, milk and 50ml\/1¾fl oz water in a bowl. Mix with a spoon until combined. Add another 50ml\/1¾fl oz water and knead in a freestanding mixer with a dough hook attachment for five minutes, or until you have a smooth soft dough. Cover with a tea towel and leave to prove for 45 minutes in a warm place.  For the filling, combine the fruit and nuts in one bowl, and the sugar and cinnamon in another.  When the dough is proved, turn it out onto a lightly floured work surface. Knock back the dough and lightly knead.  Roll the dough out into a 40x60cm\/16x23½in rectangle, taking care not to knock all the air out.  Sprinkle the sugar and cinnamon mixture evenly over the dough and then cover with the fruit and nuts.  Starting at a long side, carefully roll the dough up into a cylinder (like a Swiss roll). Shape into a ring then use water to stick the two ends together. Grease a large baking tray with butter. Lift the dough onto the tray and, using scissors, make vertical cuts around the outer edge of the ring, leaving a 4cm\/1½in gap between each cut.  Put the formed ring into a proving bag and leave to rise for 40 minutes. Preheat the oven to 190C\/375F\/Gas 5. Bake the proved loaf for 15 minutes, then check if the loaf is browning too quickly. Cover it with aluminium foil (to prevent it burning) if necessary and return to the oven for another 5-10 minutes, or until cooked through and golden-brown.  For the decoration, gently heat the apricot jam to make a glaze. Once baked, remove the tea ring from the oven and brush it with the apricot glaze. Set aside to cool completely on a wire rack. Make an icing by combining the lemon juice and the icing sugar until smooth. When fully cooled, drizzle the lemon icing over the loaf and serve. ","ingredients":" 420g\/15oz strong white flour, plus extra for dusting,  7g salt (approximately a teaspoon),  10g\/⅓oz fast-action yeast,  25g\/1oz unsalted butter, softened and cut into cubes, plus extra for greasing,  35g\/1¼oz caster sugar,  2 medium free-range eggs,  100ml\/3½fl oz full-fat milk, warmed,  75g\/2½oz dried cherries,  75g\/2½oz mixed peel,  75g\/2½oz sultanas,  75g\/2½oz dried apricots, chopped,  100g\/3½oz pecans, chopped,  60g\/2¼oz caster sugar,  3 tsp ground cinnamon,  2 tbsp apricot jam ,  1 lemon, juice only,  100g\/3½oz icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fruity_swedish_tea_ring_19325"}