{"recipe_name":"Fruity beef casserole with parsley dumplings","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 140C\/275F\/Gas 1.  Meanwhile, toss the beef in the seasoned flour. Heat the oil or dripping in an ovenproof casserole dish and brown the beef all over.  Add the bacon, celery, onion, garlic and thyme and cook for 6-8 minutes without browning. Add the redcurrant jelly, wine, stock, port and Worcestershire sauce along with the dried fruit, chestnuts, mushrooms, bay leaves, orange zest and tomato purée. Bring slowly to simmering point then cover and cook in the oven for two to two and a half hours or until the beef is tender.  Turn the oven up to 180C\/350F\/Gas Mark 4 after about an hour-and-a-half to two hours.  To make the dumplings - sift the flour, salt and baking powder into a large bowl. Make a well in the centre and add the olive oil and herbs, then pour in the milk and, using a fork, mix to form a soft dough.  Place the dough on a lightly floured surface and knead briefly. Divide and shape into 16 teaspoon-sized dumplings.  Place the dumplings on the surface of the casserole, cover and place in the oven (now at the higher temperature) for the last 35-40 minutes, or until the dumplings have risen and are golden brown. Remove the casserole from the oven and allow to rest for five minutes. Skim off any fat that has risen to the surface.  Season to taste and fold in the parsley. Serve with new potatoes and red braised cabbage. ","ingredients":" 1 kg\/2lb beef cut into 5cm\/2inch pieces,  seasoned flour for dusting,  2 tbsp vegetable oil or beef dripping,  175g\/6oz smoked bacon, diced,  2 stalks celery, finely chopped,  1 large onion, finely diced,  2 cloves garlic, finely chopped,  2 sprigs thyme,  2 tbsp redcurrant jelly,  275ml\/10fl oz of red wine,  500ml\/1 pint game or beef stock,  150ml\/5fl oz port,  1 tbsp Worcestershire sauce,  12 stoned prunes,  55g\/2oz dried cherries,  55g\/2oz dried cranberries,  225g\/8oz chestnuts, cooked and peeled,  115g\/4oz button mushrooms,  2 bay leaves,  organic orange, zest only,  1 tbsp tomato purée,  2 tbsp rough chopped parsley,  salt,  freshly black ground pepper,  250g\/9oz plain flour, plus extra for dusting,  1 tsp salt,  2 tsp baking powder,  2 tbsp olive oil,  4 tbsp fresh flatleaf parsley, chopped, plus extra for garnish,  4 tbsp fresh chives, snipped,  150ml\/¼ pint milk,  new potatoes and braised red cabbage","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/fruitybeefcasserolew_72908"}