{"recipe_name":"Raised game pie with apple chutney ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Grease a 25cm\/10in spring-form pie tin, about 8cm\/3in deep, with lard.  For the filling, in a large bowl, mix together the game meat, minced pork belly, dried apricots, hazelnuts and pistachios. Season with salt, freshly ground black pepper and the nutmeg and mix again. For the hot water crust pastry, mix together the flours in a bowl, then rub in the butter lightly using your fingertips. Heat 200ml\/7fl oz water, the salt and lard in a saucepan until just boiling. Pour the liquid on to the flour and mix well using a spoon. As soon as it is cool enough to handle, tip it on to a lightly floured surface and knead until you have a smooth dough. Cut off two-thirds of the pastry and roll it out on the floured surface using a rolling pin, then use it to line the prepared tin, leaving any excess hanging over the edge. Make sure there are no cracks in the pastry. Roll out the remaining pastry and set side. Spoon a quarter of the filling into the pastry case, then lay a line of fresh sage leaves on top. Repeat three times, until all the filling is used up. Press down to level the surface. Brush the pastry edge with beaten egg yolk, then place the reserved pastry on top. Crimp the edges to seal them, and trim off the excess pastry. Brush the top with more egg yolk and make a hole in the centre of the lid for steam to escape and for the gelatine mix to be poured in. Place the tin on a baking tray and bake the pie for 30 minutes. Turn the oven down to 160C\/140C Fan\/Gas 3 and bake for a further 1¾ hours. Transfer the pie to a wire rack and leave to cool for 10 minutes. Soak the gelatine in a shallow bowl of cold water for 5 minutes. Squeeze out the excess water and whisk the gelatine into the hot stock in a jug. Carefully pour the stock into the hole in the pie lid, filling any spaces. (This must be done when the pie is hot, if done when cold the jelly will sit on the top and not soak in.) Leave to set overnight before serving. For the chutney, heat a large frying pan until hot. Add the sugar, sultanas and currants and heat until the sugar just melting. Add the vinegar and cook until it has dissolved and is starting to caramelise. Stir in the apples, tomatoes and shallot and cook for 10 minutes, or until the apples are tender and the mixture has thickened. Remove from the heat and transfer to a sterilised jar.  To serve, cut the pork pie into thin slices and place it on a serving plate. Spoon the chutney alongside. ","ingredients":" 1.5kg\/3lb 5oz mixed, boned, diced game meat, such as rabbit, pheasant, partridge,  300g\/10½oz pork belly, minced ,  150g\/5½oz dried apricots,  75g\/2½oz hazelnuts, roughly chopped,  75g\/2½oz unsalted pistachios,  ½ tsp ground nutmeg,  2 bunches fresh sage, leaves picked,  2 leaves gelatine,  200ml\/7fl oz hot chicken stock,  salt and freshly ground black pepper,  340g\/12oz plain flour, plus extra for dusting ,  75g\/2½oz strong white bread flour,  55g\/2oz cold unsalted butter, cut into roughly 1cm\/½in dice,  ½ tsp salt,  75g\/2½oz lard, plus extra for greasing,  1 egg yolk, beaten, to glaze,  150g\/5½oz soft light brown sugar,  50g\/1¾oz sultanas,  50g\/1¾oz currants,  125ml\/4fl oz malt vinegar,  2 eating apples, cored, roughly chopped,  3 tomatoes, roughly chopped,  1 shallot, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/game_raised_pie_with_87444"}