{"recipe_name":"Garlic mushrooms and cured ham on toasted brioche","author":"Mary Berry","programme":"Mary Berry's Absolute Favourites","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/garlic_mushrooms_and_09096_16x9.jpg","method":"Add the oil to a large, heavy-based frying pan and fry the ham over a high heat for 1-2 minutes until crisp. You may need to do this in two batches to avoid overcrowding the pan. Remove and set aside. Turn the heat down to medium and melt about a third of the butter in the pan. Fry the brioche slices until golden-brown on each side, you may have to do this in batches. Remove and set aside.  Melt another third of the butter in the pan, add the garlic, chestnut and shiitake mushrooms and fry over a high heat for 2–3 minutes. Lower the heat, cover with a lid and cook for a further 2 minutes. Remove the lid and fry over a high heat until tender and golden-brown, tossing until dry and any liquid has evaporated.  Add the remaining butter, along with the oyster and enoki mushrooms, and fry for 1–2 minutes until golden-brown. Season well with salt and pepper. Stir in the crème fraîche. Place a slice of toasted brioche on each plate, spoon over some of the garlic mushrooms, followed by a slice of fried ham and a sprinkling of chopped parsley. Serve immediately. ","ingredients":" 1 tbsp oil,  6 slices dry-cured ham, cut in half,  50g\/1¾oz butter,  6 thick slices brioche,  4 fat garlic cloves, crushed,  250g\/9oz chestnut mushrooms, sliced,  100g\/ 3½oz shiitake mushrooms, halved if large,  75g\/2¾oz oyster mushrooms, halved if large,  150g\/5½oz enoki mushrooms ,  2 tbsp full-fat crème fraîche,  chopped fresh parsley, to garnish,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/garlic_mushrooms_and_09096"}