{"recipe_name":"Baked celeriac and crispy duck egg salad","author":"Bryn Williams","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring a pan of salted water to a rolling boil. Lower the duck eggs in with a slotted spoon and boil for six minutes. Drain the eggs and place in ice-cold water for 30 minutes. Place the flour into a wide shallow bowl, the beaten eggs in another bowl and the breadcrumbs in a third bowl. Peel the duck eggs and roll them in flour, then the beaten eggs and finally in the breadcrumbs. Place them on a baking tray and set aside, covered, in the fridge. Preheat the oven to 180C\/350F\/Gas 4. Season the whole celeriac with salt and pepper.  Place a heavy-based oven-proof frying pan over a medium heat. Add the vegetable oil then fry the celeriac gently until golden-brown all over. This will take about 30 minutes. (You will need to balance the celeriac on the side of the frying pan to colour it on all sides.) When the celeriac is golden-brown all over, add the butter and the thyme sprig. Place the celeriac into the oven, and bake for 20-30 minutes, basting the celeriac with the butter 2-3 times, or until soft and cooked through. Set aside to cool. When cool enough, slice the celeriac very thinly.  Finely julienne a few slices of the celeriac and mix with the mayonnaise. Whisk the lemon juice, olive oil and grated truffle together with a pinch of salt and black pepper to make a dressing. Dress the slices of celeriac with the truffle dressing and a pinch of sea salt. Heat a deep fat fryer to 190C\/375F or place enough oil in a large saucepan to come halfway up the pan and heat until a bread cube dropped in the oil sizzles and turns golden-brown. (CAUTION: Hot oil may be dangerous. Do not leave unattended.) Deep-fry the egg straight from the fridge for one minute or until the breadcrumbs are golden-brown. Remove the egg from the oil with a slotted spoon and set aside to drain onto kitchen paper. To serve, divide the slices of celeriac among four serving plates - arrange them to get height and show texture.  Place a spoonful of the finely sliced celeriac in mayonnaise (remoulade) in the centre of each plate. Cut the top off each egg to reveal the runny yolk and place the egg on top of the celeriac.   Scatter the celery and watercress leaves and truffle slices over the dish and serve. ","ingredients":" 4 free-range duck eggs,  115g\/4oz flour ,  2 free-range eggs, lightly beaten,  115g\/4oz breadcrumbs ,  1 medium celeriac, peeled ,  salt and freshly ground black pepper,  1 tbsp vegetable oil,  50g\/2oz butter ,  1 sprig thyme,  3 tbsp mayonnaise,  ½ lemon, juice only,  3 tbsp extra virgin olive oil,  1 tsp grated truffle,  1 handful celery leaves ,  1 handful watercress, leaves picked,  1 fresh truffle, finely shaved","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/baked_celeriac_and_74227"}