{"recipe_name":"Garlic-crust pizza with Parma ham","author":"Lesley Waters","programme":null,"prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Makes 1 pizza","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/garliccrustpizzawith_90215_16x9.jpg","method":"Sift the flour into a large bowl with the salt, then stir in the yeast. Make a well in the centre of the flour. Stir together the warm water and olive oil, then stir the liquid in to the flour and mix to make a soft, moist dough (you may need to add a bit more water or olive oil). Place the dough onto a clean, lightly floured surface and, with floured hands, knead for 5-10 minutes, until it's smooth and elastic. Place the dough into a large, warmed, lightly oiled bowl. Cover with cling film and leave to rise in a warm place for about one hour, until the dough has doubled in size. Preheat the oven to 220C\/430F\/Gas 7. When the dough has risen, place it onto a clean floured surface and knead again to 'knock it back'. Gradually incorporate the chopped garlic. Roll the dough out into a large circle. Place it onto a lightly floured baking sheet or pizza stone and use your hands to push it out towards the edges of the stone or sheet. Slice the tomatoes and arrange them on top of the pizza and sprinkle over the sugar. Season with salt and freshly ground black pepper and finish with a generous drizzle of extra virgin olive oil. Bake for about 15-20 minutes, or until the pizza is crisp and the tomatoes have begun to brown. When the pizza is cooked, remove it from the oven, place onto a large plate or chopping board and add the toppings. Tear the Parma ham slices and the mozzarella balls and scatter over the pizza with the rocket and capers. Drizzle over some extra olive oil and serve. ","ingredients":" 340g\/12oz strong white bread flour, plus extra for flouring,  1 tsp salt,  1½ tsp easy-blend dried yeast,  about 200ml\/7fl oz warm water,  3 tbsp olive oil, plus extra for oiling,  2 cloves garlic, finely chopped,  4 large ripe plum tomatoes,  1 tsp caster sugar,  salt and freshly ground black pepper,  drizzle of extra virgin olive oil,  6-8 slices Parma ham,  large handful rocket,  2 x 125g\/4½ oz fresh mozzarella balls,  2 tbsp capers, rinsed,  olive oil, for drizzling","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/garliccrustpizzawith_90215"}