{"recipe_name":"Garlic roast chicken with honey-glazed baby veg","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the garlic roast chicken, place the chicken into a roasting tin. Cut the lemon in half and squeeze the juice over the chicken, then rub the chicken with the rock salt. Place the garlic, squeezed lemon halves and onion into the chicken cavity. Season the chicken all over with freshly ground black pepper and drizzle over a little olive oil.  Transfer to the oven and roast for 1¼ hours, or until the juices run clear when the chicken is pierced with a skewer and it is completely cooked through. Remove from the oven and allow to rest in a warm place for a few minutes before serving. For the honey-glazed baby veg, heat the butter in a pan until it foams, then add the caraway seeds, thyme and vegetables. Stir well and season with salt and freshly ground black pepper.  Add the honey and bring to the boil. Reduce the heat and simmer, stirring occasionally, until all the vegetables are coated and the honey has thickened.   Just before serving, take some of the roasted garlic from inside the chicken cavity and squeeze out of its skin over the vegetables. Drizzle over the balsamic vinegar and stir well. To serve, carve the chicken into portions and place onto serving plates with the honey-glazed baby veg. ","ingredients":" 1 x 3lb\/1.2kg whole chicken,  1 lemon,  2 tbsp rock salt, or to taste,  1 bulb garlic, cut in half across the centre,  1 onion, halved, skin left on,  freshly ground black pepper,  olive oil, for drizzling,  50g\/2oz butter,  1 tbsp caraway seeds,  1 tbsp chopped fresh thyme,  250g\/9oz baby carrots, trimmed and blanched,  250g\/9oz baby leeks, trimmed and blanched,  250g\/9oz baby beetroot, trimmed and blanched,  salt and freshly ground black pepper ,  100ml\/3½fl oz honey ,  1 tsp balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/garlicroastchickenwi_86779"}