{"recipe_name":"Gazpacho shots with pimenton and caraway seed twists","author":"Tim Kinnaird","programme":"MasterChef","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"20","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/gazpachoshotswithpim_93819_16x9.jpg","method":"Preheat the oven to 200C\/390F\/gas 6. Lightly grease 2 baking sheets.  Roll out the puff pastry on a lightly floured surface until 0.5cm thick. Cut the sheet into 10 strips, each 1cm\/½in wide. Brush each strip with olive oil and sprinkle lightly with pimenton, caraway seeds and salt. Twist each end of the strip and place onto the baking sheets, spaced apart. Chill for 10 minutes in the fridge.  Bake the twists for 10-15 minutes, or until crisp and golden-brown. Carefully transfer to a wire rack to cool.  For the gazpacho, place the cucumber, celery, garlic, spring onions, peppers and tomatoes into a food processor and blend until smooth. With the motor running, add the passata, olive oil, vinegar and Tabasco. Season, to taste, with salt, freshly ground black pepper and vinegar.  Spoon the gazpacho into chilled shot glasses and garnish with a sprinkling of chives and basil. Serve the pimenton and caraway seed twists alongside. ","ingredients":" 1 x 500g\/17½oz packet ready-made puff pastry,  plain flour, for dusting,  olive oil, for brushing,  pimenton (smoked paprika), for sprinkling,  caraway seeds, for sprinkling,  sea salt, for sprinkling,  2 cucumbers, trimmed and chopped,  2 celery stalks, trimmed and chopped,  3 garlic cloves, peeled, finely chopped,  1 small bunch spring onions, trimmed and chopped,  2 red peppers, seeds removed, chopped,  2 yellow peppers, seeds removed, chopped,  8 plum tomatoes, chopped,  4  tbsp passata ,  75ml\/2½fl oz extra virgin olive oil,  3 tbsp white balsamic vinegar, plus extra to taste,  splash Tabasco sauce, to taste,  salt and freshly ground black pepper,  1 small bunch fresh chives, finely chopped,  1 small bunch fresh basil leaves","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gazpachoshotswithpim_93819"}