{"recipe_name":"Gherkin salad with pan fried brill","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dressing, place the butterhead lettuce, gherkins and glucose into a food processor and blend to a very fine purée.  Pour into a cloth or paper lined sieve over a bowl then set aside to drain through, leaving the dressing in the sieve.  For the salad, place the cucumber into a bowl. Heat the caster sugar and rice wine vinegar in a small saucepan until just simmering then add the chilli and stir. Pour immediately onto the cucumber and stir to make sure all the cucumber is covered. Set aside to cool to room temperature. Pop the peas from their pods and cook for a minute in a pan of boiling water. Immediately drain the peas and put them into a bowl of cold water, to stop the cooking process.  Place the gherkins, radishes, capers, peas together in a bowl and mix together. Drain the cucumber, reserving the pickling liquor. Add the cucumber to the gherkin mixture and mix together. Add a little of the pickling liquour to the salad, just enough to coat the vegetables. Season the brill with salt and black pepper. Heat a frying pan until hot, add the butter and oil then add the brill and fry on each side for two minutes. To serve, using a pastry brush, brush a spoonful of the dressing onto each serving plate, then top with a handful of the salad, finishing with a scattering of coriander cress and pea shoots. Set the brill fillet alongside. ","ingredients":" 1 butterhead lettuce, roughly chopped,  50g\/2oz gherkin, roughly chopped,  80g\/2¾oz glucose,  1 cucumber, cut in half then sliced lengthways,  50g\/2oz caster sugar,  150ml\/5fl oz rice wine vinegar,  1 red chilli, finely diced,  16 pea pods,  3 medium gherkins, finely sliced lengthways,  12 breakfast radishes, sliced lengthways,  2 tbsp capers,  4 brill fillets, skinned and fully trimmed,  salt and freshly ground black pepper,  50g\/2oz butter,  1 tbsp olive oil,  2 tbsp coriander cress,  2 tbsp pea shoots","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gherkin_salad_with_pan_71661"}