{"recipe_name":"Gigot of lamb with rosemary on raspberry beer and redcurrant gravy","author":null,"programme":null,"prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. Make a few shallow slits in the lamb and push in 2-3 sprigs of fresh rosemary and a few slivers of garlic, just enough to add a little flavour without being overbearing. Place in a roasting tin, spread a very little fat over the top and roast in the centre of the oven for 90 minutes, basting occasionally, until the lamb is tender and still pink but not bloody. Immediately remove the rosemary and garlic and rest the lamb somewhere warm for about 20 minutes while you make the gravy. Pour the raspberry beer into a small pan, set aside a few stalks of redcurrants and add the rest to the pan, then bring slowly to simmering point and cook uncovered until reduced by about one-third, by which time the redcurrants will be tender. Strain beer into a jug, retaining the redcurrants. Pour off most of the fat from the roasting tin - lamb is fatty meat and you don't want greasy gravy - then heat on top of the stove, stirring in the plain flour to make a smooth roux, and cook it out until brown. Slowly stir in the reserved potato water, then simmer briskly until reduced by half to a thick gravy. Stir in the strained raspberry beer a little at a time until it reaches pouring consistency and is a deep crimson, then season with a pinch of salt to bring out the fruit and finally add the cooked redcurrants. To serve, carve the lamb in thick slices around the bone and set each slice on a pool of raspberry beer gravy, filling the 'bone hole' with hot redcurrants on the stalk. ","ingredients":" gigot of lamb (about 1kg\/2lb),  a few sprigs of fresh rosemary,  1 small clove garlic, cut into thin slivers,  a little fat for roasting,  290ml\/½ pint raspberry beer,  100g\/4oz redcurrants, prepared and washed,  ½tbsp\/8g plain flour,  290ml\/½ pint stock from cooking potatoes,  pinch salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gigotoflambwithrosem_6997"}