{"recipe_name":"Ginger parkin with ginger ice cream and sugared hazelnuts","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":null,"pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ginger ice cream, put the cream, ginger syrup, ground ginger and honey into a clean bowl. Whisk until soft peaks are formed in the cream when the whisk is removed. Stir in the chopped stem ginger, then transfer to a freezer-proof container and put in the freezer for 2 hours, or until solid. Remove from the freezer 10 minutes before serving to soften slightly. Preheat the oven to 140C\/120C Fan\/Gas 1. Butter a 30x20cm\/12x8in cake tin. For the parkin, put the brown sugar, butter, syrup and treacle in a small saucepan and melt over a low heat. Put the oats, flour, ginger, nutmeg, mixed spice and salt in a large bowl and mix. Add the eggs and milk. Pour the melted butter and sugar mixture into the bowl and mix together with a whisk until well combined. Pour into the prepared tin and bake for 1¼ hours, or until firm in the centre. Remove from the oven and leave in the tin to cool before turning out and cutting into squares.  For the sugared hazelnuts, reduce the oven temperature to 130C\/110C Fan\/Gas 1. Lightly beat the egg white with 1 tablespoon water. Add the hazelnuts and stir until well-coated. Mix the sugar and salt together and sprinkle over the nuts. Toss to coat, and spread evenly on a lined tray. Cook for 1 hour in the oven, stirring occasionally, until golden-brown. Remove and leave to cool.  For the decoration, heat a medium frying pan and add the sugar, leave on the heat until it turns to caramel (CAUTION: boiling sugar is extremely hot. Handle very carefully.)  Use a pastry brush to carefully brush the caramel on to serving plates.  Cut the ginger parkin into squares and place on the serving plates along with the sugared hazelnuts, strawberries and lemon verbena. Top with a scoop of the ginger ice cream and serve.  ","ingredients":" 500ml\/18fl oz double cream,  7 tbsp stem ginger syrup , from a jar,  ½ tsp ground ginger ,  4 tbsp honey,  110g\/3¾oz stem ginger from a jar, finely chopped,  150g\/5½oz soft light brown sugar,  150g\/5½oz softened butter, plus extra for greasing,  250g\/9oz golden syrup,  75g\/2¾oz black treacle,  125g\/4½oz oats,  175g\/6oz self-raising flour,  3 tbsp ground ginger,  1 tsp ground nutmeg,  1 tsp mixed spice,  pinch salt,  2 free-range eggs, beaten,  5 tsp milk,  1 free-range egg white ,  550g\/1lb 4oz whole hazelnuts,  200g\/7oz caster sugar ,  ¼ tsp sea salt ,  150g\/5½oz caster sugar,  200g\/7oz fresh strawberries,  lemon verbena","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ginger_parkin_with_93910"}