{"recipe_name":"Gingerbread Big Ben","author":"Danny Bryden","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Start by cutting out paper templates of the Big Ben structure. You will need: four clock faces (15 x 10.5cm rectangles); 12 tower sides (12 x 7.5cm rectangles); two clock top and bottoms (15cm square) and four triangular clock roofs (15cm wide at the base x 10cm high x 12.5cm sides). For the ginger bread, preheat the oven to 200C\/400F\/Gas 6. Sift the flour, baking powder and spices into a bowl. Tip half of the mixture into the food processor and add half the butter. Pulse until the mixture resembles breadcrumbs. Tip this into a mixing bowl and repeat with the remaining dry ingredients and butter. Stir in the sugar and mix thoroughly until combined. Make a well in the centre of the mixture and add in the syrups and molasses. Gradually add the beaten eggs, stirring all the time until the mixture comes together. Divide the dough into ten pieces. Place a piece of dough between two sheets of baking parchment, and roll out to a thickness of 5-6mm. Repeat with the remaining dough balls. Cut out the pieces using the templates to trace around, saving and re-rolling any trimmings. Use any leftover dough to create several strips of gingerbread to support the structure while it is being assembled.  Place the pieces on a baking tray lined with parchment paper and transfer to the fridge to rest for 20 minutes. Use a small knife to mark the lines for the bricks in the tower sides. To make the clock faces, place a neat circle of crushed boiled sweets in the centre of each 'clock face' rectangle. Bake for approximately 8-10 minutes until just colouring at the edges.  Remove from the oven and transfer to a wire rack to cool. When cooled, carefully trim any uneven edges with a sharp knife. For the sugar syrup, in a pan boil the caster sugar with 150ml\/5fl oz water until the colour darkens slightly and thickens, then reduce the heat to minimum so that syrup does not burn but stays warm. To assemble the gingerbread house, dip the short edge of one tower side piece in the sugar syrup and fix to another side piece. Allow to cool until the sugar syrup sets and then continue with two more pieces to form a square. Repeat until all the tower sides have been used to construct three squares. Stick the three squares together with sugar syrup, one on top of the other, to make a tower.  Use the same method to form the clock face and the pyramid for the roof.  Make up the royal icing by mixing 75ml of cold water with the royal icing sugar and whisking it until smooth. Spoon the icing into a piping bag fitted with a small, plain nozzle. Attach the clock face to the tower with the royal icing. Roll out the fondant icing into a large square. Cover the cake board with the fondant icing, trim off any excess and pat down the edges. Place the tower in the centre of the board. Decorate the clock faces and tower sides using the royal icing. Each tower side should have five vertical lines in icing. Make the clock hands with liquorice and fix to the face using royal icing. Cover the joins in the tower with liquorice attached with royal icing.  To form 'tiles' on the roof, use royal icing to fix the chocolate buttons in a neat pattern. When set, fix the roof on top of the clock face using royal icing. Place the flag on the top (if using).   ","ingredients":" 1kg\/2lb 4oz plain flour,  2½ tsp baking powder,  2½ tsp ground ginger,  2½ tsp cinnamon,  2½ tsp mixed spice,  500g\/1lb 2oz unsalted butter, diced,  pinch salt,  250g\/9oz muscavado sugar,  150g\/5½oz golden syrup,  3 medium free-range eggs, lightly beaten,  50g\/1¾oz ginger syrup (from a jar of stem ginger),  50g\/1¾oz pomegranate molasses ,  8-10 coloured boiled sweets, crushed ,  250g\/9oz caster sugar ,  450g\/1lb royal icing sugar,  soft eating liquorice in black and red, for the edging and clock hands (optional),  3 x 65g bags chocolate buttons,  100g\/3½oz ready-to-roll fondant icing ,  1 small paper flag, for decorating (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gingerbread_big_ben_48685"}