{"recipe_name":"Ginger sponge pudding with custard and brazil nut brittle","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the sponge pudding, grease a microwave-safe pudding bowl with butter then sprinkle with self-raising flour. Mix the flour, sugar, crystallised ginger and baking powder in a food processor. Add the butter and blend in the food processor. Add the eggs while mixing to form a sticky dough. Add the mixture to the pudding bowl and cover with cling film. Transfer to a microwave and cook on full power for five minutes. Remove from the microwave, remove the film and turn out onto a serving plate. To make the custard, place a small saucepan over a high heat. Add the vanilla seeds and the empty pod, milk and cream and bring to a simmer. Remove from the heat and allow to stand, letting the flavours infuse. Meanwhile, beat the egg yolks with the sugar in a large bowl. Remove the vanilla pod from the infused cream and gradually pour the vanilla cream into the egg mix whisking well continuously. Return the custard to the saucepan. Stir over a gentle heat until the custard thickens and coats the back of the spoon. To make the brazil nut brittle, place a small frying pan over a high heat. Add the caster sugar and brazil nuts to the pan and give the pan a shake every so often as the sugar caramelises. When the caramel reaches a deep, rich amber colour, remove from the heat and immediately pour the mixture onto a cold non-stick surface. Wait a few minutes and the mixture will set and become brittle. Shatter the brittle caramel with a rolling pin and set aside.  To serve, drizzle the custard over the sponge and serve the brazil nut brittle pieces as a garnish on top. ","ingredients":" 115g\/4oz unsalted butter, in cubes, plus more for greasing the bowl,  115g\/4oz self-raising flour, plus more for sprinkling,  115g\/4oz caster sugar,  50g\/1¾oz crystallized ginger,  1 tsp baking powder,  2 free-range eggs,  1 vanilla pod, seeds scraped out,  150ml\/5fl oz milk,  100ml\/3½oz double cream,  2 free-range egg yolks,  25g\/1oz caster sugar,  100g\/3½oz caster sugar,  25g\/1oz brazil nuts","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gingerspongepuddingw_78679"}