{"recipe_name":"Glazed duck, spiced quince and pancetta pinchos ","author":"Ben Tish","programme":"Christmas Kitchen with James Martin","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 8 skewers","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place all the ingredients for the poached quince, except the membrillo, in a saucepan and add 450ml\/16fl oz water. Bring slowly to the boil, then turn down to a simmer and cook for 1½-2 hours, or until the quince is cooked and has turned a deep red. Do not overcook otherwise the quince will fall from the skewers.  Leave the quince to cool in the poaching liquid, then remove and cut into 1.5cm cubes. Bring the poaching liquid to the boil and cook until the volume of liquid has reduced by half to a glaze. Whisk in the membrillo until dissolved. For the pinchos, heat a non-stick pan over a medium heat and then add the duck breasts skin-side down to render the fat and brown the skin. Pour off the fat 2-3 times as it cooks. Turn the breasts over and cook for 1-2 minutes before removing from the pan to cool and rest. When cool enough to handle cut the duck into 1.5cm cubes. Cut the pancetta into pieces the same size as the duck but half as thick. Thread a piece of duck onto each skewer followed by the pancetta and then the quince. Repeat this on each skewer. Heat a grill to medium; season the skewers and brush with a little oil. Grill for 2-3 minutes, turning as you go. One minute before they are ready brush with some of the quince glaze. The duck should still be pink, pancetta cooked through and there should be a sticky-glazed appearance. Serve the skewers along with a pot of the remaining glaze to dip into. ","ingredients":" 1 quince, peeled and cut in half,  200g\/7oz caster sugar,  1 star anise,  2 cloves,  1 cinnamon stick,  1 bay leaf,  ¼ orange, zest only ,  100g\/3½oz membrillo (quince paste),  8 wooden skewers, soaked in water for a few hours,  2 small duck breasts, trimmed,  60g\/2¼oz smoked pancetta,  salt and pepper,  olive oil, for cooking","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/glazed_duck_spiced_80525"}