{"recipe_name":"Baked ginger parkin with rhubarb","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01slcxr.jpg","method":"Preheat the oven to 140C\/275F\/Gas 1 and butter a 30cm\/12in x 20cm\/8in cake tin. For the parkin, put the soft brown sugar, butter, syrup and treacle into a small saucepan and melt over a gentle heat. Put the oats, flour, ginger, nutmeg, mixed spice and a pinch of salt into a large bowl, then add the eggs and milk. Pour the melted butter and sugar mixture into the bowl and mix together with a whisk until combined. Pour into the prepared tin and bake for 1¼ hours, or until firm in the centre.  Remove from the oven and leave in the tin to cool before turning out and cutting into squares. This is best kept kept in a tin for 2-3 days as it will become really sticky all the way through. For the rhubarb, put the butter, sugar and five tablespoons of water in a large frying pan with the orange zest and rhubarb. Place over a gentle heat to poach for 4-5 minutes, or until just tender, then remove from the heat. For the syrup, combine the golden syrup, cider and spices in a saucepan and bring to the boil. Reduce the heat and cook for 3-4 minutes, or until just thickened.  Serve the parkin in squares with a spoonful of rhubarb to one side and the syrup over the top. Finish with a scoop of ice cream.  ","ingredients":" 150g\/5½oz soft light brown sugar,  150g\/5½oz softened butter, plus extra for greasing,  250g\/9oz golden syrup,  75g\/2½oz black treacle,  125g\/4½oz oat flakes,  175g\/6oz self-raising flour,  3 tbsp ground ginger,  1 tsp ground nutmeg,  1 tsp mixed spice,  pinch of salt,  2 free-range eggs, beaten,  25ml\/1fl oz milk,  vanilla ice cream, to serve,  50g\/1¾oz butter,  75g\/2½oz caster sugar,  1 orange, zest only,  4 sticks rhubarb, cut into 5cm\/2in lengths,  200g\/7oz golden syrup,  100ml\/3½fl oz dry cider,  ½ tsp ground mixed spice,  ½ tsp ground ginger,  ¼ tsp ground nutmeg ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/baked_ginger_parkin_with_37593"}