{"recipe_name":"Glazed goats' cheese and beetroot, with salad of Welsh herbs and beetroot dressing","author":"Bryn Williams","programme":"Great British Menu","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 140C\/275F\/Gas 1. Put the cheeses in a bowl with a little olive oil and thyme and leave to marinate while you prepare the beetroot.  Melt the sugar in a heavy-bottomed saucepan on a moderate heat, then cook until the sugar has turned golden brown. Add the cooked beetroot and cook for a further three minutes, stirring until the beetroot are completely coated with the caramel. Remove from the heat and add the balsamic vinegar. Transfer to a food processor and blend to a smooth consistency.  Pour the purée into a muslin-lined colander set in a bowl and allow the liquid to drain through. Season the liquid to taste with salt and freshly ground black pepper and double the volume with olive oil to create a dressing. Season the purée with salt and freshly ground black pepper. Set both the dressing and purée aside. Wrap the baby beetroots and sprigs of thyme in foil to create an envelope. Place in the oven and bake for 10-12 minutes. Peel the beetroots and leave to cool. Remove the cheeses from the marinade and blot off any excess oil with kitchen towel. Glaze the tops of the cheeses using a mini blow torch (or under a hot grill) until golden brown.  Dress the Welsh herbs in the beetroot dressing.  To assemble, spread a tablespoon of beetroot purée on each plate. Add the dressed herbs and place the glazed cheeses on top. Drizzle over the remainder of the beetroot dressing and sprinkle with toasted pine nuts. ","ingredients":" 4 Welsh goats' cheeses, each 120g\/4oz,  olive oil,  thyme leaves,  120g\/4oz sugar,  3 large beetroots, cooked, peeled and roughly chopped,  2 tsp balsamic vinegar,  salt and freshly ground black pepper ,  12 raw baby beetroots,  2 sprigs thyme,  150g\/5½oz Snowdon mountain herbs, such as wood sorrel, hairy bittercress, pennywort (or other wild herbs),  20g\/1oz pine nuts, toasted, to garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/glazedgoatscheeseand_82161"}