{"recipe_name":"Glazed pot roast shoulder of lamb with kasha","author":"Martin Blunos","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb, preheat the oven to 160C\/320F\/Gas 2. Place all the vegetables and the rosemary in a deep lidded casserole.   With the point of a sharp knife, make twelve incisions in the lamb shoulder. Push the anchovies into the incisions in the lamb.   Place the joint on top of the vegetables in the pan, pour over the olive oil from the canned anchovy fillets and rub in well.   Season with freshly ground black pepper. Pour the wine and chicken stock around the lamb. Cover the pan with a tightly fitting lid. Place on a medium heat on the stovetop and bring to the boil. Transfer to the oven and cook for about 1¾ hours, or until the meat is tender and cooked through. When the meat is cooked, remove from the oven and carefully lift the meat out of the pan onto a shallow roasting tray.   Increase the oven temperature to 225C\/440F\/Gas 8. For the glaze, place all the glaze ingredients into a bowl and mix well. Brush the glaze over the joint. Place the joint into the oven and cook for 12-15 minutes, or until the glaze has become sticky and browned - reduce the heat if the meat is colouring too quickly. Remove the meat from the oven and set aside to rest for 10-15 minutes, keeping warm. Meanwhile, pour the initial cooking juices through a sieve into a clean pan. Using a spoon, skim any fat which will have risen to the surface and discard. Boil rapidly to reduce the liquid by half. When the cooking juices have reduced, remove from the heat and add the cream and a squeeze of lemon juice. Check the seasoning, adding salt and freshly ground black pepper to taste. Keep warm. For the kasha, set the oven temperature back to 200C\/400F\/Gas 6.  Heat a large lidded ovenproof pan over a medium heat, then add the bulgur wheat and toast for a few minutes, stirring occasionally, to avoid burning. Pour the stock into the pan with the bulgar wheat, season with salt and black pepper and add one-third of the butter. Cover with a lid, place in the oven and cook for 15-20 minutes, until the stock is all absorbed and the bulgar wheat is tender. Remove the kasha from the oven and fork through the remaining butter. To serve, remove the string from the joint and cut into thick slices. Spoon the kasha onto the centre of each plate and top with a couple of slices of lamb. Spoon the cream sauce over the top and serve with a handful of green salad. ","ingredients":" 2 medium onions, peeled and cut into thick slices,  1 large stalk celery, trimmed and cut into large chunks,  1 large carrot, peeled, trimmed and cut into large chunks,  1 large head garlic, cut in half,  1 sprig fresh rosemary,  1 x 1.5kg\/3lb 5oz shoulder of lamb, boned, trimmed of excess fat, rolled and tied,  6 canned anchovy fillets in olive oil, halved,  250ml\/9fl oz dry white wine,  300ml\/½ pint chicken stock,  salt and freshly ground black pepper ,  150ml\/5fl oz double cream,  1 lemon, juice only,  1 tbsp tomato ketchup,  1 tbsp tomato purée,  1 tbsp clear honey,  1 tbsp dark soy sauce,  1 tbsp malt vinegar,  1 tbsp Worcestershire sauce,  1 tbsp syrup from a jar of preserved ginger,  250g\/9oz bulgar wheat,  450ml\/16fl oz hot chicken stock,  salt and freshly ground black pepper ,  90g\/3½oz unsalted butter,  green salad","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/glazedpotroastshould_86163"}