{"recipe_name":"Gnocchi con granseola","author":"Rick Stein","programme":"Rick Stein: From Venice to Istanbul","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to180C\/160C Fan\/Gas 4.  For the spice mix, put all of the ingredients in a pestle and mortar and pound to a smooth mix. Alternatively use an electric spice grinder. Store in an airtight tin or box.   Bake the potatoes for 50 minutes, or until very soft and leave to cool.  Meanwhile, make the prawn stock, heat the olive oil in a large pan over a medium heat. Add the garlic and the prawn heads and shells. Stir-fry for a couple of minutes before adding the tomato purée, salt and 300ml\/10fl oz water. Cook for 10 minutes, then pass through a sieve, pushing down on the shells to extract as much of the prawn flavour as you can. Discard the shells and set the stock aside. When the potatoes are cool, scoop the flesh out from the skins and mash it or pass or through a potato ricer. Mix with the flour, salt and egg to make a firm dough. Roll the mixture into 1cm\/½in thick sausages, cut into 2cm\/¾in lengths. Cover and set aside. For the sauce, heat the olive oil in a pan over a medium heat and sweat the onion and garlic for 5 minutes, or until soft. Add the chilli flakes and Byzantine spice mix and stir for 1 minute. Add the prawn stock, bring to a simmer to reduce down a little, then whisk in the knob of butter. Bring a pot of salted water to the boil. Boil the gnocchi for 3 minutes, or until they rise to the surface. Drain and keep warm. Stir the parsley and crab meat into the sauce, then pour over the cooked gnocchi and serve. ","ingredients":" 1 slice of nutmeg,  pinch of coriander seeds,  4 cloves ,  1cm\/½in cinnamon stick,  pinch of ground ginger,  1 green cardamom pod, seeds only,  ⅛ tsp turmeric,  ⅛ tsp chilli powder,  225g\/8oz floury potatoes, in their skins,  80g\/2¾oz plain flour,  ¼ tsp salt,  ½ free-range egg, beaten (approximately 20g\/¾oz),  2 tbsp olive oil,  1 small garlic clove,  250g\/9oz prawn heads and shells,  1 tbsp tomato purée,  ½ tsp salt,  5 tbsp olive oil,  ½ small onion, grated,  1 garlic clove, grated,  pinch chilli flakes,  ¼ tsp Byzantine spice mix,  300ml\/10fl oz prawn stock,  knob of butter,  small handful finely chopped flatleaf parsley,  200g\/7oz white crab meat","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gnocchi_con_granseola_42070"}