{"recipe_name":"Baked heritage carrots with pan-fried scallops ","author":"Michael Caines","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the baked carrots, preheat the oven to 180C\/350F\/Gas 4. Line a baking tray with a large sheet of a aluminium foil. Place the carrots into the middle of the foil and add the butter, ginger slices, thyme, tarragon, garlic and orange peel.  Season with salt and freshly ground black pepper, gather up the edges of the foil and seal to make a parcel.  Bake in the oven for 40 minutes, or until the carrots are tender. Keep warm. For the carrot purée, steam the carrots for 8-10 minutes, or until tender. Blend the carrots in a blender to a smooth purée, then pass through a sieve.  Season, to taste, with the ginger juice, salt and freshly ground black pepper. Keep warm. For the carrot and ginger vinaigrette, whisk all of the ingredients together in a bowl until smooth. Season, to taste, with salt and freshly ground black pepper. For the coriander oil, heat the oil and coriander in a saucepan to 80C\/175F. Blend the mixture in a blender for 2-3 minutes, then pass through a sieve lined with muslin. To serve, blend the marmalade in a blender to a fine purée. Heat the olive oil in a frying pan and fry the scallops for 45 seconds on each side. Season, to taste, with salt and freshly ground black pepper and a squeeze of lemon juice. Meanwhile, swirl a spoonful of marmalade purée onto four serving plates. Slice the baked carrots in half and arrange them on the serving plates at interesting angles. Arrange the scallops in and around the carrots. Spoon three dollops of the carrot purée onto the plates. Spoon over some coriander oil and carrot vinaigrette.  Dress the carrot tops with a little olive oil and arrange on the plate, then scatter over the micro coriander.  ","ingredients":" 24 evenly sized heritage carrots, unpeeled,  40g\/1½oz unsalted butter ,   3 slices fresh ginger ,  large sprig fresh thyme ,  large sprig fresh tarragon ,  2 garlic cloves,  1 piece orange peel ,  500g\/1lb 2oz carrots, peeled and chopped,  1-2 tbsp ginger juice, to taste,  50g\/2oz carrot purée,  4 tsp orange juice,  5 tbsp carrot juice,  1 tbsp ginger juice,  5 tbsp rapeseed oil,  ⅓ lemon, juice only,  pinch ground cinnamon,  500ml\/18fl oz extra virgin olive oil,  50g\/2oz fresh coriander leaves,  300g\/10½oz marmalade,  2 tbsp olive oil, plus extra for drizzling,  8 large scallops or 12 medium scallops, cut in half lengthways,  ½ lemon,  small handful carrot tops or fresh chervil,  small handful micro coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/baked_heritage_carrots_15282"}