{"recipe_name":"Gnocchi with wild rocket","author":"Gennaro Contaldo","programme":"Spring Kitchen with Tom Kerridge","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the gnocchi, place the potatoes in a saucepan with lots of salted cold water. Bring to the boil and cook until the potatoes are tender, but not falling apart (about 15-20 minutes depending on the size of your potatoes).  Drain and allow to cool a little. When cool enough to handle, remove the skins. While the potatoes are still warm, mash them until smooth or pass through a ricer, then set aside to cool completely. Season the cooled potatoes with salt and pepper, stir in the egg yolks and add the flour. Bring the mixture together to form a dough.  On a clean work surface, sprinkle the rice flour and roll out the dough into long sausage shapes. With a sharp knife cut into dumpling shapes of about 2cm\/1in. Set aside. For the sauce, blanch the rocket and watercress for a minute in boiling salted water. Remove and refresh in cold water and drain well. In a large frying pan, heat the olive oil. Add the onion, garlic and chilli and fry until the onion is soft and translucent. Stir in the rocket, watercress and basil and stir fry for a couple of minutes to heat through. Season, to taste, with salt and pepper. To serve, drop the gnocchi into a pan of boiling water and simmer until they rise back to the top. As they come to the surface, lift them out with a slotted spoon, drain well and add to the sauce. Mix well taking care not to break up the gnocchi. Serve immediately with some freshly grated parmesan.  ","ingredients":" 700g\/1lb 9oz Desiree potatoes, roughly cut to pieces all the same size and unpeeled,  salt and pepper,  2 egg yolks,  150g\/5½oz plain flour,  rice flour, for dusting,  freshly grated parmesan, to serve (or a similar vegetarian hard cheese),  300g\/10½oz wild rocket, roughly chopped,  200g\/7oz watercress, roughly chopped, stalks discarded,  150ml\/5½fl oz extra-virgin olive oil,  1 small onion, finely chopped,  1 garlic clove, finely chopped,  1 small red chilli, finely chopped,  20 basil leaves, roughly torn,  salt and pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gnocchi_with_wild_rocket_14134"}