{"recipe_name":"Gnocchi with duck ragù","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the gnocchi, boil the potatoes for about 40 minutes, until tender. Remove from the heat, drain and leave to cool. Once cooled, mash well in a bowl.  Make a well in the centre of the mashed potato, add the egg to the centre and season with salt and freshly ground black pepper.  Add the flour and mix well to form a dough. Knead the dough for 3-4 minutes,  until it becomes dry to the touch. Divide the dough into three pieces. On a clean, well-floured surface, roll out the dough into 2cm\/1in diameter lengths, then cut into pieces at 2cm\/1in intervals. Place these gnocchi pieces into boiling water and cook for 2-3 minutes. When they rise to the top they are cooked. Scoop out with a slotted spoon and refresh in iced water. Drain, drizzle with olive oil and set aside. For the duck ragu, heat the oil in a large saucepan over a medium heat. Add the onions, carrots, celery, garlic, chilli and pepper and fry for 5-6 minutes, or until softened.  Add the tomato purée, stir well and cook for 7-8 minutes, until the mixture becomes a rich red colour. Add the wine, stock and rosemary sprig and bring to boil. Add the duck meat and reduce the heat to simmer for 45 minutes to an hour, or until the meat falls apart.  Finally add the gnocchi to the ragu and warm through. To serve, spoon out into bowls and garnish with shavings of Pecorino cheese. ","ingredients":" 600g\/1lb 5oz floury potatoes (such Russets), unpeeled,  1 large free-range egg,  salt and freshly ground black pepper,  450g\/1lb plain flour,  olive oil, to drizzle,  2 tbsp olive oil,  1 onion, finely chopped,  1 carrot, finely chopped,  1 stick celery, finely chopped,  4 garlic cloves, finely chopped,  1 red chilli, finely chopped ,  1 red pepper, finely chopped ,  150g\/5oz tomato purée,  450ml\/16fl oz red wine,  450ml\/16fl oz chicken stock,  sprig fresh rosemary,  450g\/1lb ready-made confit duck leg, meat removed from the bone ,  Pecorino cheese, shaved, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gnocchiwithduckragu_84330"}