{"recipe_name":"Goan-style lobster with chips","author":"James Martin","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lobster, put the lobsters in the freezer for two hours until almost frozen - this will render them unconscious.  Add them to a large pan of boiling salted water and simmer for two minutes. Remove the lobsters from the pan, immerse them in chilled water and then drain.  Remove all the meat from the shells, keeping them whole - discard the black intestinal vein that runs down the tail flesh and the stomach sac and gills from the head. The meat will just be blanched, not completely cooked at this stage. In a teaspoon of oil, lightly fry the coconut in a deep frying pan with the dried chillies, coriander seeds, cumin seeds, peppercorns and cloves for about two minutes, or until lightly coloured. Remove and set aside to cool slightly, then transfer to a food processor and blend until the coconut and spices are finely ground. Heat the remaining vegetable oil in a wok, add the onions and fry for 5-7 minutes, or until light and brown.  Stir in the garlic, ginger and green chilli and fry for 2-3 minutes. Add the coconut spice mixture and cook, stirring, for two minutes.  Add the turmeric and tamarind pulp and simmer for 2-3 minutes. Stir in the coconut milk, a little at a time, stirring to combine. Stir in the lobster pieces and simmer for two minutes, or until just warmed through. Sprinkle in the chopped coriander and set aside until ready to serve.  For the chips, bring a pan of salted water to the boil, add the chips and simmer for five minutes, or until just tender. Drain carefully and then pat dry. (You can freeze them at this point if you want to prepare in advance. Place the chips on a parchment lined tray in the freezer until frozen. They can be transferred, once frozen, into a plastic bag to store in the freezer. Defrost them before frying.) To finish the chips, heat the oil in a deep fat fryer to 180C\/350F\/Gas 4. Add the chips and fry for 4-5 minutes, or until golden-brown and cooked through. Drain, place on a plate lined with kitchen paper and sprinkle with sea salt.  To serve, spoon the lobster onto four plates, pour over the sauce and then pile the chips alongside. ","ingredients":" 4 live lobsters,  2 tbsp vegetable oil,  150g\/5oz desiccated coconut,  4 dried bird’s-eye red chillies,  1 tbsp coriander seeds,  1 tbsp cumin seeds,  1 tsp black peppercorns,  4 cloves,  2 onions, sliced,  1 green chilli, finely chopped,  1 garlic clove, finely grated,  5cm\/2in piece ginger, finely grated,  ¼ tsp ground turmeric,  50ml\/2fl oz tamarind pulp,  300ml\/11fl oz coconut milk,  2 tbsp finely chopped coriander leaves,  4 large chipping potatoes, peeled and cut into 1cm\/½in thick chips,  vegetable oil, for frying,  sea salt, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/goan-style_lobster_with_90994"}