{"recipe_name":"Goan mutton curry with spiced pilau rice","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/goan_mutton_curry_with_54906_16x9.jpg","method":"For the curry, heat a heavy-based frying pan until hot, add the cumin and coriander seeds and cinnamon and toast for a few seconds. Place the spices into a pestle and mortar or spice grinder and grind to a powder. Heat a large heavy-based saucepan pan or casserole dish until hot, add the vegetable oil and the mutton and cook until golden-brown all over. Remove using a slotted spoon and set aside. Add the onions and cook for 10 minutes, or until soft and golden-brown. Add the garlic, ginger, chilli, toasted spices and remaining spices and cook for one minute. Return the mutton to the pan then add the beef stock and bring to a simmer. Cover with a lid and cook over a gentle heat for one hour then remove the lid. Add the desiccated coconut and the coconut milk and return to a simmer. Cook for another 30 minutes, or until just thickened and the meat is tender. Season, to taste, with salt and freshly ground black pepper. For the rice, heat a saucepan until hot. Add the oil, onion, garlic and spices, and fry for two minutes.  Stir in the rice and add 600ml\/1pint 1fl oz water. Bring to the boil, cover and reduce to a gentle simmer. Cook for 18-20 minutes until the rice is tender and all the liquid absorbed. Season with salt, freshly ground black pepper, lemon juice, then stir in the coriander leaves. Spoon the mutton onto plates with a pile of rice alongside.Finish with a spoonful of yoghurt and mango chutney. ","ingredients":" 1 tsp cumin seeds,  1 tsp coriander seeds,  1 stick cinnamon,  1kg\/2lb 2oz mutton leg, boned and cut into 2.5cm\/1in cubes,  2 onions, finely sliced,  2 garlic cloves, crushed,  2.5cm\/1in piece fresh root ginger, finely grated,  2 long red chillies, sliced,  3 tbsp tamarind paste,  1 tsp mango powder (available from online retailers),  500ml\/18fl oz beef stock,  90g\/3½oz desiccated coconut,  1 x 400ml\/14fl oz can coconut milk,  2 tbsp fresh coriander leaves,  2 tbsp vegetable oil,  1 onion, finely diced,  1 garlic clove, crushed,  3 green cardamom pods, split,  1 tsp ground coriander,  1 tsp ground cumin,  1 tsp turmeric,  3 cloves,  1 cinnamon stick,  8 curry leaves,  400g\/14oz basmati rice,  ½ lemon, juice only,  200g\/7oz Greek-style yoghurt,  200g\/7oz mango chutney","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/goan_mutton_curry_with_54906"}