{"recipe_name":"Goats' cheese and shallot tarts","author":"Mary Berry","programme":"Mary Berry's Absolute Favourites","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 8 tarts","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/goats_cheese_and_shallot_60881_16x9.jpg","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Put a large baking tray in the oven to heat up. To make the pastry, put the flour, butter and a little salt into a food processor and pulse until the mixture resembles breadcrumbs. Alternatively, place in a mixing bowl and rub the butter into the flour using your fingertips. Add the beaten egg and a tablespoon water and mix until a ball of dough is formed.  Lightly flour a work surface and roll out the dough thinly (about 3mm\/⅛in thick). Sprinkle the chopped walnuts over the pastry. Cover with cling film and roll over the cling film to press the nuts into the pastry. Cut out 8 large circles using a pastry cutter or saucer as a guide and line the Yorkshire pudding tins. Place in the fridge to chill while you make the filling. Heat the oil in a lidded frying pan, add the shallots and cook over a high heat for 2 minutes, stirring frequently. Lower the heat, cover and cook for 10 minutes until soft. Add the vinegar and sugar and cook for 15 minutes, stirring every now and then, until the shallots are dark brown and caramelised. Set aside to cool. Put the goats' cheese, beaten eggs and half the parsley in a bowl. Season with salt and pepper and mix until smooth. Prick the bases of the chilled tart cases all over with a fork, then spoon in the shallot mixture. Pour the goats' cheese mixture over the shallots. Slide the tins onto the hot baking sheet and cook for 20 minutes, or until the pastry is crisp and the filling is just set and golden-brown. Sprinkle with the remaining chopped parsley and serve warm or cold. ","ingredients":" 175g\/6oz plain flour, plus extra for dusting,  100g\/3½oz cold butter, cubed ,  1 free-range egg, beaten,  30g\/1oz walnuts, roughly chopped,  salt and freshly ground black pepper,  1 tbsp oil,  500g\/1lb 2oz banana shallots, thinly sliced,  2 tbsp balsamic vinegar,  1 tbsp light muscovado sugar ,  300g\/10½oz soft goats' cheese,  2 free-range eggs, beaten,  2 tbsp chopped fresh parsley ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/goats_cheese_and_shallot_60881"}