{"recipe_name":"Cheeseburger with onion rings","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the burger, place the beef, garlic, breadcrumbs and egg into a small food processor, season well with salt and freshly ground black pepper and blend until well combined. Remove the mixture from the food processor and shape into a large pattie, using your hands. Heat a griddle pan and brush it with oil. Place the burger into the pan and cook for 4-5 minutes on each side, or until cooked to your liking. Remove the burger from the pan and set aside in a warm place. In the same pan, fry the goats' cheese for 1-2 minutes on each side, or until golden-brown. For the onion rings, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place the cornflour, plain flour and sparkling water into a bowl and whisk together to make a light batter. Dip the onion rings into this mixture to coat. Carefully place the onion rings into the hot oil and deep fry for 3-4 minutes, or until golden-brown and crisp. Remove from the oil using a slotted spoon and drain on kitchen paper. To serve, place the burger onto a slice of toasted ciabatta and top with the rocket and goats' cheese and the remaining slice of ciabatta, with the onion rings alongside. ","ingredients":" 200g\/7oz beef fillet, chopped ,  1 garlic clove, chopped,  25g\/1oz fresh breadcrumbs,  1 free-range egg,  salt and freshly ground black pepper ,  1 tbsp olive oil,  50g\/2oz goats' cheese ,  handful fresh rocket,  2 slices toasted ciabatta ,  200ml\/7fl oz vegetable oil, for deep frying,  50g\/2oz cornflour,  25g\/1oz plain flour,  3 tbsp sparkling water,  1 onion, peeled, cut into thick rings","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/goatscheeseburgerwit_84888"}