{"recipe_name":"Goats' cheese cannelloni with cherry tomatoes","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/goatscheesecannellon_86639_16x9.jpg","method":"Preheat the oven to 180C\/365F\/Gas 4. Place the tomatoes into a bowl and drizzle with the olive oil. Add the thyme and season well with salt and freshly ground black pepper. Place the ricotta, goats' cheese and parmesan into a clean bowl and mix well. Add the spinach and garlic and season well with salt and freshly ground black pepper.  Lay the pasta sheets onto a clean work surface. Place a line of the cheese and spinach mixture along the longer edge of each pasta sheet, then roll up like a cigar. Drizzle the cannelloni rolls with a little of the oil that the tomatoes have been sitting in, then pour the remaining oil into the bottom of an ovenproof dish that will hold all 12 cannelloni. Place the cannelloni tubes into the dish and place the tomatoes evenly over the top. Transfer to the oven to bake for 15 minutes, or until cooked through. To serve, place three cannelloni onto each of four plates. Sprinkle with parmesan shavings and place a spoonful of dressed mixed green salad leaves alongside. ","ingredients":" 400g\/14oz cherry tomatoes, halved,  125ml\/4fl oz extra virgin olive oil,  1 tbsp fresh thyme leaves,  salt and freshly ground black pepper,  400g\/14oz ricotta,  100g\/3½oz goats' cheese,  30g\/1oz parmesan (or a vegetarian alternative), grated ,  200g\/7oz baby spinach,  2 garlic cloves, crushed,  12 x 12cm\/5in x 10cm\/4in sheets fresh pasta ,  parmesan shavings,  green salad leaves, dressed with olive oil and balsamic vinegar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/goatscheesecannellon_86639"}