{"recipe_name":"Goats' cheese-stuffed chicken breast with roasted vegetables and boiled potatoes","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Use a sharp knife to cut a pocket into the side of each chicken breast. Slice the soft goat's cheese and press into the pocket in the chicken breasts. Season the breast with salt and freshly ground black pepper. Heat one tablespoon of the olive oil in an ovenproof frying pan over a medium heat. When the oil is hot, add the chicken breasts, presentation-side down and fry until golden-brown. Turn the breasts and cook for a further two minutes on the other side, then transfer the pan to the oven and roast for 15 minutes. Remove the pan from the oven and top with the remaining goats' cheese and return to the oven to cook for a further five minutes, until the chicken is completely cooked through and the cheese has melted. Meanwhile, heat a griddle pan until smoking. Place the red pepper, courgette and the aubergine slices into a bowl with the remaining two tablespoons of olive oil and season with salt and freshly ground black pepper. Place the vegetables onto the griddle pan and cook for five minutes, or until tender, turning once. To serve, place the chicken breasts onto two plates with a pile of chargrilled vegetables and some cooked potatoes alongside each. ","ingredients":" 2 boneless, skinless chicken breasts,  1 rosemary-coated soft goats' cheese,  salt and freshly ground black pepper ,  3 tbsp olive oil,  1 crotin goats' cheese (a small semi-firm disc of goats' cheese), sliced,  1 red pepper, quartered,  1 courgette, cut into thin strips,  1 aubergine, cut into 5mm\/¼in thick rounds,  200g\/7oz baby new potatoes, boiled, cut in half","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/goatscheesestuffedch_84592"}