{"recipe_name":"Gong bao haddock goujons","author":"Ching-He Huang","programme":"Chinese Food Made Easy","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the haddock goujons, mix the Shaoxing rice wine, grated ginger and chopped spring onion together in a shallow bowl and add the fish strips. Cover with cling film and leave to marinate in the fridge for 20 minutes.  Mix the dried chillies, sea salt and white pepper together with the breadcrumbs in a bowl, then tip onto a plate or tray. Dip the marinated strips of fish into the flour, then into the beaten egg, then roll in the seasoned breadcrumb mixture. Pat lightly to secure the breadcrumbs to the fish, then shake off any excess. Repeat with all of the fish strips. Quarter-fill a wok with groundnut oil and heat until a small cube of bread dropped in sizzles and turns golden-brown in 15 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the fish goujons in small batches and deep-fry for 2-3 minutes, or until golden-brown, then remove with a slotted spoon and drain on kitchen paper. Repeat with the remaining fish goujons.  For the gong bao sauce, heat all of the sauce ingredients together in a small saucepan, and, if necessary, thicken with the cornflour and water mixture. Remove from the heat and transfer to a small bowl or ramekin for dipping.  To serve, pile the fish goujons onto a serving plate and place the bowl of gong bao sauce on the side. Serve immediately with roast sweet potato wedges. ","ingredients":" 1 tbsp Shaoxing rice wine or dry sherry,  1 tbsp peeled and grated fresh root ginger,  1 small spring onion, finely chopped,  340g\/12oz haddock fillets, cut into strips ,  1 tbsp crushed dried chillies,  1 tsp sea salt,  1 tsp white pepper,  100g\/3½oz dry breadcrumbs,  100g\/3½oz plain flour,  2 free-range eggs, beaten,  groundnut oil, for deep-frying,  2 tbsp lemon juice,  2 tbsp hoisin sauce,  1 tbsp dark soy sauce,  1 tsp crushed dried chilli flakes ,  1 tbsp cornflour, mixed with 2 tbsp cold water, to thicken","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gongbaohaddockgoujon_89278"}