{"recipe_name":"Goose risotto","author":"The Hairy Bikers","programme":"The Hairy Bikers' Twelve Days of Christmas","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a large heavy-based pan over a medium heat, heat two tablespoons of the oil and gently fry the shallots for 2-3 minutes, or until softened but not coloured. Add the garlic and cook for a further 2-3 minutes, or until softened.  Meanwhile, place the stock into a pan and bring to a gentle simmer.  Add the rice to the pan with the garlic and onion and stir to coat in the oil. Cook for 1-2 minutes, or until the rice is translucent.  Add a few ladles of the hot stock to the rice and stir well, then add the peppercorns. Cook until most of the stock has been absorbed before adding another ladleful. Continue cooking until the rice is creamy but is still al dente, about 20 minutes (you may not need all of the stock).  Meanwhile, heat the remaining tablespoon of olive oil with one tablespoon of the butter in a frying pan until foaming. Add the mushrooms and fry for 1-2 minutes, or until tender.  Fold the mushrooms into the cooked risotto, followed by the chopped goose meat, fresh herbs and parmesan cheese. Season, to taste, with salt and freshly ground black pepper.  To serve, spoon the risotto into serving dishes. If desired, serve with a green salad alongside. ","ingredients":" 3 tbsp olive oil,  4 shallots, peeled, finely chopped,  2 garlic cloves, crushed,  1 litre\/1¾ pints chicken stock,  400g\/14½oz risotto rice (such as arborio or carnaroli),  1 tbsp whole green peppercorns,  2 tbsp butter,  250g\/9oz chestnut mushrooms, finely sliced,  500g leftover goose meat, finely chopped,  1 tbsp chopped mixed fresh herbs (sage, rosemary, parsley, tarragon, chives),  4 tbsp freshly grated parmesan,  salt and freshly ground black pepper,  dressed green salad, to serve (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gooserisotto_93080"}