{"recipe_name":"Granny's toad in the hole with my Mum's onion gravy","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01s2gt0.jpg","method":"Place the plain flour in a bowl and make a well in the centre. Whisk in the eggs and mustard and continue to whisk until just smooth, then gradually add the milk and salt and whisk to a smooth batter.  Place in the fridge for at least four hours, but preferably overnight. Preheat the oven to 220C\/425F\/Gas 7. Place three-quarters of the beef dripping into a roasting tin and heat in the oven. Heat a frying pan until hot, then add the remaining dripping. When it’s melted, add the sausages and fry on each side until browned. Remove the batter from the fridge and whisk once more to combine. Place the sausages in the roasting tin and pour over the batter. Place in the oven for 30 minutes, then briefly open the oven door to allow the steam to escape and cook for another 10 minutes. Make the gravy using the same pan that the sausages were cooked in. Place the pan on a high heat, then add the onion and fry for 10 minutes, or until just softened and browned. Add the yeast extract and cook for a minute, then add the red wine and cook until the volume of liquid has reduced by half. Whisk the gravy granules with a little water until smooth, then add 250ml\/9fl oz water and whisk once more. Add to the pan and cook for a few minutes then add the beef stock and simmer for five minutes. Add a knob of butter and season, to taste, with salt and pepper. Remove the toad in the hole from the oven and set aside for a few minutes. Serve a large spoonful of the toad with a ladleful of gravy and some buttered peas. ","ingredients":" 225g\/8oz plain flour,  8 free-range eggs,  1 tbsp wholegrain mustard,  570ml\/1 pint milk,  pinch salt,  75g\/2¾oz beef dripping (or lard),  6 good-quality sausages,  2 onions, finely sliced,  1-2 tbsp yeast extract,  75ml\/2½fl oz red wine,  1 tbsp gravy granules,  200ml\/7fl oz beef stock,  buttered peas, to serve,  knob of butter,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grannys_toad_in_the_hole_98879"}