{"recipe_name":"Baked cheesecake with blackberries, blueberries and  figs ","author":"Lorraine Pascale","programme":"Lorraine Pascale: How to be a Better Cook","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8-10","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/baked_ricotta_and_cream_48552_16x9.jpg","method":"Preheat the oven to 170C\/325F\/Gas 3 (150C fan). To make the base, melt the butter in a medium saucepan over a low heat (or a bowl in the microwave). Line the base of a 23cm\/9in springform cake tin with baking parchment, brushing a little of the melted butter on the base to help the paper stick. Break up the gingernut biscuits in a food processor to give fine crumbs. Mix well into the melted butter and then tip into the bottom of the prepared tin. Press the mixture well into the bottom so it is packed  tight and level. Place in the fridge to set for 20 minutes or so while you get on with the filling.  For the filling, put the cream cheese, ricotta, cream, eggs, sugar, cornflour and vanilla seeds into a large bowl and beat like mad for a few minutes until everything is combined and smooth. An electric mixer fitted with the whisk attachment will make this easier than by hand. Once the biscuit base is set, remove the tin from the fridge and pour this mixture in on top.  Sit on a baking tray and pop into the oven for 40-45 minutes. The cheesecake should be just set with a little wobble. When it reaches this stage, turn off the oven and leave to cool in there for about an hour. This (usually) stops the cheesecake from cracking. Also avoid moving the cheesecake around at this stage to help prevent cracking. However, don’t worry if it does crack as it will still taste delicious and will be nicely decorated. Once it has had an hour of cooling, remove the cheesecake from the oven. The cheesecake may still be a little bit warm, so you can either eat it like this or wait and eat it when it is completely cool. Arrange the berries and figs on top, dust with icing sugar and scatter over the mint leaves if using, and serve. The cheesecake will keep for a couple of days, covered in the fridge. ","ingredients":" 50g\/1¾oz unsalted butter, melted,  200g\/7oz gingernut biscuits (about 20 biscuits),  450g\/1lb full-fat cream cheese ,  250g\/9oz ricotta,  150g\/5½oz double cream ,  3 medium free-range eggs,  125g\/4½oz caster sugar,  2½ tbsp cornflour ,  1 vanilla pod, seeds scraped out,  125g\/4½oz fresh blueberries ,  125g\/4½oz fresh blackberries ,  2 figs, each cut into 6 evenly-sized wedges,  2 tsp icing sugar, sifted,  handful fresh mint leaves (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/baked_ricotta_and_cream_48552"}