{"recipe_name":"Gratinated scallops and lobster","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to a medium heat. Heat half of the butter in a pan over a medium heat. When the butter is foaming, add the chopped shallots and fry for 2-3 minutes, or until softened. Add the scallop roes and trimmings and the wine and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until the volume of liquid has reduced by half. Add the fish stock and return the mixture to the boil. Return the mixture to a simmer, and simmer for 1-2 minutes. Add the cream and mustard, stir well, and simmer for a further minute, or until the cream has warmed through. Strain the mixture into a clean pan (discard the solids), sprinkle over the chives, and season, to taste, with salt and freshly ground black pepper. Season the scallops, to taste, with salt and freshly ground black pepper. Heat a frying pan over a medium to high heat. When the pan is hot, add the remaining butter. When the butter is foaming, add the scallops, in batches if necessary, and fry for 15-20 seconds on each side, or until just cooked through. Remove from the pan and set aside. Mix together the julienned carrot and courgette. Place small piles of the julienned vegetables into the washed scallop shells. Layer the scallops and lobster meat alternately in each of the shells, arranging the shellfish layers in a fan shape. Spoon over the strained cream sauce. Mix the breadcrumbs and grated Gruyère together, then sprinkle the mixture generously over each scallop shell. Transfer the filled scallop shells to the preheated grill and grill for 2-3 minutes, or until the breadcrumbs are golden-brown and the cheese is bubbling. Serve immediately. ","ingredients":" 50g\/2oz butter,  2 shallots, peeled, finely chopped,  12 hand-dived scallops, in their shells, cut in half to create two thinner scallops (roes and trimmings reserved, rounded halves of shells washed and reserved),  200ml\/7fl oz white wine,  300ml\/10½fl oz fish stock,  225ml\/8fl oz double cream,  2 tsp Dijon mustard,  1 tbsp chopped fresh chives,  salt and freshly ground black pepper,  1 large carrot, peeled, julienned,  1 large courgette, julienned,  2 x 750g\/1lb 10½oz cooked lobsters, shell removed, meat roughly chopped,  25g\/1oz fresh breadcrumbs,  25g\/1oz Gruyère, finely grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gratinatedscallopand_92456"}