{"recipe_name":"Gravlax with dill and mustard mayonnaise and lettuce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dill and mustard mayonnaise, put the mustard seeds in a bowl. Heat the vinegar and honey in a non-reactive saucepan until the honey has dissolved. Pour the vinegar and honey mixture over the mustard seeds and mix thoroughly. Add the ale and stir until well combined.  Cover the bowl with cling film and set aside for at least four hours, preferably overnight. Once cooled, blend the mustard base mixture in a food processor until smooth (this will take a few minutes as all of the mustard seeds need to break down). Spoon the mixture into a bowl and set aside.  To make a mayonnaise, blend the egg yolks, white wine vinegar and Dijon mustard together in a food processor. With the motor running, slowly add the oil in a thin stream until the mixture comes together as a thick and creamy mayonnaise. (You may not need to use all of the oil.)  Mix the mayonnaise, mustard base and dill together in a bowl until well combined. Cover with cling film and chill in the fridge until needed. For the gravlax, mix the sugar, salt and dill together in a bowl.  Sprinkle half of this marinade mixture into the bottom of a shallow roasting tray, then place the salmon on top and sprinkle over the remaining marinade mixture. Cover the tray with cling film and place the salmon in the fridge to marinade for one hour. Rinse the marinade off under cold running water and pat dry with kitchen paper.  For the Little Gem lettuce, place the lettuce in a large bowl. Place the rest of the ingredients in a blender and blend until smooth and emulsified. Just before serving, toss the lettuce in the dressing. To serve, cut the salmon in thin slices on an angle and place on a serving platter. Serve with the salad, dill and mustard mayonnaise and buttered wholemeal sliced bread. ","ingredients":" 75g\/2½oz yellow mustard seeds,  40g\/1½oz brown mustard seeds,  50ml\/2fl oz white wine vinegar,  25g\/1oz honey,  110ml\/3¾fl oz light ale,  2 free-range egg yolks,  2 tsp white wine vinegar,  1 tsp Dijon mustard,  300ml\/10½fl oz vegetable oil ,  6 tbsp chopped fresh dill,  250g\/9oz caster sugar,  250g\/9oz fine salt,  50g\/1¾oz fresh dill, chopped ,  ½ side of salmon (about 500g\/1lb 2oz), filleted, skin removed, pin boned,  4 heads Little Gem lettuce, leaves separated,  1 free-range egg yolk,  1 tsp English mustard,  2 tsp clear honey,  2 tbsp cider vinegar,  150ml\/5fl oz vegetable or sunflower oil,  1 banana shallot, finely chopped,  1 garlic clove, finely chopped,  1 tbsp finely chopped flatleaf parsley,  1 tbsp finely chopped mint,  1 tbsp finely chopped basil,  1 tbsp finely chopped thyme,  wholemeal bread ,  butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gravlax_with_dill_and_34974"}