{"recipe_name":"Great British celebration ham ","author":"Tom Kerridge","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ham, preheat the oven to 140C\/275F\/Gas 1. Remove the skin, leaving behind a thin layer of fat. Score in a diamond pattern with the tip of a sharp knife. Stud the centre of each diamond with a clove and place the ham onto a rack in a roasting tray.  Squeeze the runny honey over the top of the ham and bake for an hour, basting the ham with the honey every 10 minutes. Sprinkle over the orange zest, cover with aluminium foil and set aside to rest for at least 30 minutes. Meanwhile, for the vegetables, preheat the oven to 200C\/400F\/Gas 6. Preheat the vegetable oil in a large roasting tin. Cook the potatoes in boiling salted water for 5-10 minutes, or until tender. Drain and set aside to dry completely in the steam. Carefully place the potatoes into the hot oil and roast in the oven for 40-50 minutes, turning every 10 minutes, until crisp and golden-brown. Meanwhile, cook the carrots and parsnips in boiling water until just tender and drain. Heat a little oil in a frying pan and fry the carrots and parsnips until golden-brown. Add the honey and continue to cook until caramelised. Melt the butter in a large lidded saucepan and fry the chestnuts for 2-3 minutes. Add the sprout tops, season with salt and freshly ground black pepper and stir until well combined. Remove the pan from the heat and cover with a lid. To serve, carve the ham into slices and serve with the vegetables and reduced chicken stock. ","ingredients":" 1 x 10kg\/22lb whole leg ham on the bone, cooked,  30 cloves,  500g\/1lb 2oz runny honey,  1 orange, zest only,  100ml\/3½fl oz vegetable oil, plus extra for frying,  20 potatoes (suitable for roasting), peeled and halved,  15 carrots, peeled,  15 parsnips, peeled,  100g\/3½oz honey,  75g\/3oz butter,  500g\/1lb 2oz peeled chestnuts,  2kg\/4lb 8oz Brussels sprout tops,  salt and freshly ground black pepper,  reduced chicken stock or chicken gravy","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/great_british_31279"}