{"recipe_name":"Great British soap opera cake","author":"Frances Quinn","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Makes 1 cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6 and line three 38x33cm\/15x13in baking trays with non-stick parchment paper.  For the joconde, put the egg whites and sugar in the bowl of a free-standing food mixer fitted with the whisk attachment. Whisk together until stiff peaks form when the whisk is removed from the bowl, cover with cling film and set aside.  In a separate mixing bowl, whisk together the ground almonds, icing sugar and eggs on medium speed until pale, thick and doubled in volume. Stir in the vanilla extract. Sift in the flour and fold through to incorporate, then gently fold in the meringue in three separate batches, followed by the melted butter. Divide the mixture between the baking trays and spread out evenly with a palette knife. Bake for seven minutes, or until spingy to the touch and lightly golden-brown. Using a pizza cutter, trim off the edge and then transfer to the wire cooling racks.  For the lavender syrup, place the sugar and 250ml\/9oz of water in a saucepan over medium-high heat. Simmer, stirring occasionally, until the sugar has dissolved – about 10 minutes. Leave to cool and stir in the lavender extract. For the French lemon buttercream, place the egg yolks and lemon zest in the bowl of a food mixer fitted with the whisk attachment. Whisk until thick. Set aside. Place the sugar, lemon juice and 50ml\/2fl oz of water in a heavy-based saucepan. Heat over a low heat, swirling the pan to dissolve the sugar completely. Do not stir.  When the syrup has turned clear increase the heat to medium and bring the syrup up to 121C\/250F (this will take about 10 minutes). Use a sugar thermometer for accuracy and wash down the inside wall of the pan with a wet pastry brush to help prevent sugar crystals from forming around the sides. Turn the mixer back on and pour the hot sugar syrup into the eggs in a thin steady steam. Once the syrup is fully combined, whisk for a further 5-8 minutes to cool down the mixture. Slowly add small pieces of butter with the mixer running. Halfway through introducing the butter, add the limoncello and extracts. Once all the butter has been added, you should be left with a thick creamy white buttercream. Set the bowl and contents aside till ready to use. For the ganache, heat the cream in a large bowl set over a pan of simmering water until it starts to simmer. Remove from the heat when bubbles appear around the edge of the cream and then add the white chocolate. Stir together until all the chocolate has melted and add the lavender extract and butter. Leave to cool and place in the fridge to thicken.  To assemble, put one of the sponges onto a tray lined with parchment paper and lightly brush the surface with the syrup and spread over some of the ganache, levelling the surface. Lay over another sponge layer and brush again with the syrup. Spread this layer with the buttercream and level with a spatula. Add the third sponge and brush with syrup and cover with ganache. Set aside the remaining ganache and syrup. Freeze the opera to set. While the cake is freezing, make the edible bath pearls and glaze. For the edible bath pearls, roll balls of fondant and marzipan on a surface lightly dusted with icing sugar to a variety of different sized bath-shaped pearls and score a line down their middles with a sharp knife. Place in the freezer to chill. When firm and cold, dust lightly with the pearlescent powder and set aside.  For the decoration, melt the remaining white chocolate ganache and pour it over the top of the opera cake and transfer to the freezer again to set. Grease a soap-shaped decorative cookie cutter with almond oil and place it on a piece of silicone baking parchment. Melt the white chocolate and pour it into the cookie cutter. Carve the word soap into it when almost set. Decorate the corners with gold leaf stuck down with some of the lavender syrup to act as glue.  Once set, place the cake on a giant soap dish and dot the edible bath pearls around. Top the cake with white chocolate moulded ‘soap’. Use melted dark chocolate to write the word ‘Opera’ on the cake using a small piping bag. Decorate with lavender sprigs, lemon zest curls and baking pearls.  ","ingredients":" 5 free-range egg whites,  25g\/1oz caster sugar,  175g\/6oz ground almonds,  175g\/6oz icing sugar,  5 free-range eggs (65g\/2¼oz each),  1 tsp vanilla extract ,  50g\/1¾oz plain flour,  50g\/1¾oz unsalted butter, melted,  250g\/9oz lavender sugar,  1 tsp lavender extract,  5 free-range egg yolks,  1 lemon, zest only,  300g\/10½oz caster sugar,  50ml\/2fl oz lemon juice,  500g\/1lb 2oz slightly salted butter, softened,  3 tsp limoncello,  1 tsp vanilla extract,  1 tsp lemon extract ,  300ml\/10fl oz double cream,  700g\/1lb 9oz white chocolate chips,  ½ tsp lavender extract,  30g\/1oz slightly salted butter, cut into small cubes,  500g\/1lb 2oz white marzipan,  500g\/1lb 2oz ready-to-roll white icing,  icing sugar, for dusting,  edible pearlescent powder,  almond oil, for greasing,  50g\/1¾oz white chocolate, chopped,  50g\/1¾oz dark chocolate, melted,  lavender sprigs, to serve,  lemon zest curls, to serve,  baking pearls","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/great_british_soap_opera_47286"}