{"recipe_name":"Great sausage casserole","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/great_sausage_casserole_73010_16x9.jpg","method":"Heat a tablespoon of the oil in a large non-stick frying pan and fry the   sausages gently for 10 minutes, turning every now and then until nicely browned all over. Transfer to a large saucepan or a flameproof casserole dish and set aside.  Fry the bacon pieces in the frying pan until they begin to brown and crisp then add to the sausages.  Place the onions in the frying pan and fry over a medium heat for five minutes until they start to soften, stirring often. You should have enough fat in the pan, but if not, add a little more oil.  Add the garlic and cook for 2–3 minutes more until the onions turn pale golden-brown, stirring frequently.  Sprinkle over the chilli powder or smoked paprika and cook together for a few seconds longer.  Stir in the tomatoes, chicken stock, tomato purée, Worcestershire sauce, brown sugar and herbs.  Pour over the wine, or some water if you’re not using wine, and bring to a simmer.  Tip carefully into the pan with the sausages and bacon and return to a simmer, then reduce the heat, cover the pan loosely with a lid and leave to simmer very gently for 20 minutes, stirring from time to time.  Drain the beans and rinse them in a sieve under cold running water. Stir the beans into the casserole, and continue to cook for 10 minutes, stirring occasionally, until the sauce is thick.  Season to taste with salt and freshly ground black pepper and serve with rice or slices of rustic bread. ","ingredients":" 1–2 tbsp sunflower oil,  12 good quality pork sausages,  6 rashers rindless streaky bacon, cut into 2.5cm\/1in lengths,  2 medium onions, thinly sliced,  2 garlic cloves, crushed,  ½–1 tsp hot chilli powder or smoked paprika,  1 x 400g\/14oz can chopped tomatoes,  300ml\/10fl oz chicken stock,  2 tbsp tomato purée,  1 tbsp Worcestershire sauce,  1 tbsp dark brown muscovado sugar,  1 tsp dried mixed herbs,  2 bay leaves,  3–4 sprigs of fresh thyme,  100ml\/3½fl oz red or white wine (optional),  1 x 400g\/14oz can butter beans or mixed beans,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/great_sausage_casserole_73010"}