{"recipe_name":"Greek-style roast chicken","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. In a large bowl, whisk together the egg whites, honey, lemon juice and lemon zest until well combined.  In a separate bowl, mix together the cumin seeds, cayenne pepper, ginger, cinnamon, allspice, salt and pepper until well combined. Sprinkle the mixture onto a plate. Dip the chicken first in the egg mixture, then roll it in the spice mixture until completely coated.  Place the coated chicken onto a baking tray and roast in the oven for 1¼-1½ hours, or until the skin is crisp and golden-brown and the chicken is cooked through. (NB: The chicken is cooked through when the juices run clear when a skewer is inserted into the thickest part).  Meanwhile, for the potatoes, heat the oil in a roasting tray in the oven until smoking. Add the parboiled potatoes and the chopped olives and season, to taste, with salt and freshly ground black pepper. Return to the oven and roast for 35-40 minutes, or until the potatoes are crisp and golden-brown and cooked through. Transfer the cooked potatoes and olives to a bowl, then stir in the lemon zest, butter and parsley until they coat the potatoes and olives. To serve, carve the chicken and divide the meat equally among four serving plates. Spoon the potatoes and olives alongside. Serve with the green salad and Greek-style yoghurt. ","ingredients":" 3 free-range egg whites, lightly beaten,  1 tbsp clear honey,  1 lemon, juice and zest,  2 tbsp cumin seeds,  ½ tsp cayenne pepper,  ½ tsp ground ginger,  ½ tsp ground cinnamon,  ½ tsp ground allspice,  salt and freshly ground black pepper,  1 x 1.3kg\/3lb whole chicken,  125ml\/4½fl oz olive oil,  500g\/1lb 2oz salad potatoes such as Anya or Charlotte, parboiled until tender in chicken stock,  100g\/3½oz black olives, pits removed, chopped,  salt and freshly ground black pepper,  1 lemon, zest only,  1 tbsp unsalted butter,  1 tbsp chopped fresh parsley,  lightly dressed mixed green salad,  Greek-style yoghurt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/greekstyleroastchick_92179"}