{"recipe_name":"Baked sea bass, parsley mayonnaise and walnut truffle pesto","author":"Adam Byatt","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the parsley mayonnaise, blend the parsley and vegetable oil in a blender until smooth. (This will take 1-2 minutes.) Blend the egg yolks, vinegar and mustard in a food processor until well combined. With the motor running, slowly add the parsley oil to form a thick mayonnaise.  Season with salt, freshly ground black pepper and a squeeze of lemon juice. For the walnut truffle pesto, heat the olive oil and walnuts in a frying pan over a medium heat for 4-5 minutes, or until golden brown. Set aside to cool.   Blend the cooled walnuts and olive oil, thyme, garlic, truffle, parmesan and white truffle oil in a food processor until smooth.  For the seabass, preheat the oven to 200C\/400F\/Gas 6 and place a large oven tray in the oven. Cut out four 10cm\/4in squares of greaseproof paper. Slice the seabass fillets at an angle into 0.5cm\/¼in thick slices. Divide the slices between the squares of greaseproof paper, overlapping each slice slightly.   Season with salt and lemon zest and drizzle over the olive oil.  Place the sea bass slices onto the preheated baking tray and roast for 2-3 minutes. Drain the endive leaves, pat dry and toss with some of the truffle pesto. To serve, place the seabass into the centre of serving plates and drizzle a little parsley mayonnaise over the top. Arrange the endive leaves around the edge and scatter over the parsley cress. ","ingredients":" bunch fresh flatleaf parsley, leaves only,  700ml\/1pint 4fl oz vegetable oil,  2 free-range egg yolks,  110ml\/3½fl oz white wine vinegar,  1 tbsp English mustard,  1 lemon, juice only,  150ml\/4½fl oz extra virgin olive oil,  250g\/9oz walnuts,  1 garlic clove,  2 sprigs fresh thyme, leaves picked,  15g\/½oz fresh black truffle,  10g\/¼oz parmesan, grated,  2 tsp white truffle oil,  4 sea bass fillets, pin bones removed,  1 lemon, zest only,  2 tbsp extra virgin olive oil,  2 red endive, leaves separated and placed into iced water,  10g\/½oz parsley micro cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/baked_sea_bass_parsley_49527"}