{"recipe_name":"Green coconut fish curry","author":"Anjum Anand","programme":"Indian Food Made Easy","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/greencoconutfishcurr_86736_16x9.jpg","method":"Heat the oil in a non-stick pan, add the mustard seeds, cloves, cardamom pods and cinnamon stick and stir fry for 20 seconds (be careful, the seeds might pop). Add half of the chopped onion and fry for 4-5 minutes until soft. Meanwhile, place the remaining onion, the ginger, garlic, ground coriander and 100ml\/3½fl oz of the coconut milk into a blender or food processor and blend to a smooth purée. Add this mixture to pan along with the whole green chillies and salt, to taste. Cover with a lid and cook over a low heat for 12-15 minutes, giving the pot an occasional stir. Add the remaining coconut milk, the water, the currry leaves, black pepper and garam masala and the fish and leave to cook undisturbed for about 3-5 minutes, until the fish is opaque and cooked through. To serve, stir in the lemon juice and coriander. Taste and adjust the seasoning if necessary, then pour into bowls and serve with rice. ","ingredients":" 2 tbsp vegetable oil,  ½ tsp brown mustard seeds,  4 cloves,  6 green cardamom pods, lightly crushed,  1 large piece cinnamon stick,  1 small onion, finely chopped,  5cm\/2in piece fresh ginger, peeled and quartered,  2 large garlic cloves ,  1 tsp ground coriander,  300ml\/10½fl oz coconut milk,  2-4 green chillies, left whole,  salt, to taste,  100ml\/3½fl oz water,  10 curry leaves (available from some supermarkets and Asian grocers),  ½-1 tsp freshly ground black pepper,  ¾ tsp garam masala,  500g\/1lb 2oz salmon or firm white fish fillets, cut into large pieces,  2-3 tsp lemon juice,  50g\/2oz fresh coriander leaves and stalks, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/greencoconutfishcurr_86736"}