{"recipe_name":"Green Thai kebabs and pad Thai noodles","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the kebabs, heat a wok over a high heat. Pour in the oil and heat until smoking. Add the green curry paste and cook, stirring, for one minute. Add the coconut milk and bring to the boil. Cook until thickened slightly. Remove from heat and cool completely, then add lime juice, nam pla and chopped coriander. Add the fish to the mixture and stir well. Cool. Transfer to a sealed plastic bag and refrigerate for one hour. Soak eight small wooden skewers in water. Thread the pieces of fish onto the skewers, alternating with the pineapple squares and the basil leaves.   Rub a griddle pan with a bit of oil, then heat over a high flame or barbecue. Cook the kebabs for about two minutes on each side or until the fish is cooked to your liking. As you grill, brush the skewers with some of the marinade and season with salt (if needed) before serving. For the pad Thai noodles, soak the rice noodles in a bowl of hot water for 25 minutes (or according to packet instructions). When the noodles are soft (but still al dente), drain well in a colander or sieve. Discard the water. Heat a wok over a high heat. When it is hot, add the oil. When it is very hot and slightly smoking, add the shallots, spring onions, chillies and garlic, and stir fry for one minute. Add the rice noodles, fish sauce or soy sauce, rice wine or sherry, lime juice, soy sauce, pepper, sugar and vegetarian oyster sauce, and continue to stir fry for two minutes, mixing well. Add the coriander and stir fry briskly for 30 seconds. Turn onto a warm platter, sprinkle with the peanuts and serve at once. ","ingredients":" 1 tbsp vegetable oil ,  3 tbsp Thai green curry paste,  125ml\/4fl oz coconut milk,  ½ lime, juice only,  1 tbsp nam pla (fish sauce),  1 tbsp chopped coriander leaves,  500g\/1lb 2oz firm fish, such as salmon, cut into medium-sized squares,  8 x 1cm\/½in slices of ripe pineapple, peeled and cut into squares ,  24 leaves basil or Thai basil ,  oil, for the grill,  225g\/8oz flat dried rice noodles,  2 tbsp groundnut (peanut) oil,  50g\/2oz shallots, finely chopped,  4 spring onions, finely sliced on the diagonal,  3 fresh red chillies (or green ones if you want a hotter dish), de-seeded and cut into thin strips  ,  3 tbsp coarsely chopped garlic,  3 tbsp fish sauce or light soy sauce,  1 tbsp Shaoxing rice wine or dry sherry,  1 tbsp lime juice,  1 tbsp light soy sauce,  freshly ground black pepper, to taste,  1 tbsp sugar,  2 tbsp vegetarian oyster sauce,  handful fresh coriander sprigs,  3 tbsp coarsely chopped roasted peanuts, for garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/greenthaikebabsandpa_74817"}