{"recipe_name":"Griddled chicken with sea-spiced aubergine","author":"John Torode","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/365F\/Gas 4. Place the aubergine strips in a wok or frying pan and cover with cold water.   Bring to the boil, remove from the heat, drain and allow to cool.   Dry the wok or frying pan, then place over a high heat with the vegetable oil and add the cooled aubergine.   Make sure the aubergine pieces are evenly seared, but avoid too much stirring as this will make it mushy.   Cook for 5-6 minutes until the aubergine is well browned. Stir in three-quarters of the sliced spring onions and half of the chillies. Pour off most of the oil, then return to the heat and stir in the oyster sauce and fish sauce. Cook for two minutes and set aside. In a small bowl mix together the remaining chillies and sliced spring onions with the coriander leaves and the ginger.  Gently peel back the skin from the chicken breasts and spread the herb mixture evenly over the flesh.   Pull the skin back over the flesh and brush with a little oil.  Heat a griddle or frying pan until smoking and cook the breasts, skin side down, for two minutes.   Turn and sear the other side for two minutes, then remove from the pan and place on a baking sheet.   Roast in the oven for 10-15 minutes, until completely cooked through, remove from the oven and allow to rest. Place a mound of aubergine on each plate and place a piece of chicken on top. Sprinkle with the deep-fried spring onions and serve. ","ingredients":" 2 medium aubergines, cut lengthwise, into 1½cm\/½in strips,  125ml\/4½fl oz vegetable oil, plus extra for brushing,  4 spring onions, thinly sliced diagonally,  3 red chillies, seeds removed, thinly sliced,  4 tbsp Thai oyster sauce,  1 tbsp fish sauce (nam pla),  2 tbsp coriander leaves,  2.5cm\/1 inch piece root ginger, peeled, cut into fine strips ,  4 chicken breasts, skin on ,  25g\/1oz deep-fried spring onions","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/griddledchickenwiths_87181"}