{"recipe_name":"Griddled rose veal rump with roasted ceps and mixed leaf and walnut salad","author":"Stuart Gillies","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the veal, heat a griddle pan until hot. Brush the veal with half of the olive oil and press the smallest pieces of rosemary onto the surface of the veal. Season with salt and freshly ground black pepper and place the veal directly on the griddle pan. Griddle on both sides for 1-2 minutes each (for rare), or until cooked to your liking, then remove and place on a warm plate, covered, to rest. Meanwhile, heat a frying pan until hot, add the remaining olive oil and the mushrooms. Fry for 2-3 minutes until browned, then season with a little salt and freshly ground black pepper.  Add the crushed garlic and butter to the pan, reduce the heat and cook for one more minute. Add the chopped parsley and lemon juice and stir to combine. Taste again and adjust the seasoning as necessary. For the salad, mix the salad leaves together with the walnuts in a salad bowl. In a small bowl, whisk the sherry vinegar and olive oil together. Pour the dressing over the salad leaves and mix well.  To serve, slice the veal on the diagonal, and place onto four serving plates. Spoon the mushrooms over the top and serve the salad on the side. ","ingredients":" 4 x 200g\/7oz veal rump steaks,  3 tbsp olive oil,  1 sprig rosemary, leaves only,  salt and freshly ground black pepper,  150g\/5oz fresh cep mushrooms, cleaned and thickly sliced,  3 garlic cloves, crushed to paste with a knife,  75g\/3oz butter,  25g\/1oz flatleaf parsley, coarsely chopped,  1 lemon, juice only,  1 head Castelfranco, leaves only, torn (use other radicchio if none is available),  1 Batavia lettuce, leaves picked and torn (use leaves from another type of lettuce if none is available),  1 head Treviso chicory, leaves only, torn (use other red chicory if none is available),  1 head chicory, leaves only, torn ,  75g\/3oz walnut halves, lightly crushed,  1 tbsp sherry vinegar,  3 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/griddledrosevealrump_90892"}