{"recipe_name":"Griddled salmon with fennel and pine nut salad","author":"Aaron Craze","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salmon, heat a griddle pan over a high heat. Rub the salmon fillets all over with olive oil and season on both sides with salt and freshly ground black pepper.  When the griddle pan is hot, add the salmon fillets and grill for 4-5 minutes, turning once, or until they have golden-brown chargrill marks on both sides and are just cooked through.  Transfer the salmon fillets to a warm plate. Pour over the lemon juice and set aside to rest. For the salad, in a large bowl, mix together the sliced fennel, fennel fronds, pine nuts and mi-cuit tomatoes until well combined. Stir in the crème fraîche, lemon juice and lemon zest and set aside. For the chilli and mint dressing, mix all of the chilli and mint dressing ingredients together in a bowl until well combined.  To serve, divide the fennel and pine nut salad equally among four serving plates. Place a piece of griddled salmon on top of each. Drizzle over the chilli and mint dressing and garnish with a lemon wedge. ","ingredients":" 4 x 175g\/6oz thick salmon fillets, skin and pin bones removed,  1 tbsp olive oil,  salt and freshly ground black pepper,  ½ unwaxed lemon, juice only,  2 bulbs fennel, outer leaves removed, cut in half, finely sliced on a mandoline (green fronds reserved),  100g\/3½oz pine nuts, lightly toasted in a dry frying pan,  8 mi-cuit tomatoes, chopped,  100g\/3½oz crème fraîche,  ½ unwaxed lemon, juice only, plus 1 unwaxy lemon, zest only,  1 chilli, seeds removed, finely chopped ,  3 fresh mint sprigs, leaves only, roughly chopped,  100ml\/3½fl oz olive oil,  squeeze lemon juice,  4 lemon wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/griddledsalmonwithfe_91326"}