{"recipe_name":"Grilled and hot smoked porcini, crisp egg yolk, celeriac and fresh thyme ","author":"Ben Tish","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the diced celeriac in a medium saucepan. Pour over the milk and season with salt and pepper. Bring to the boil, then turn to a simmer and cook until very tender. Drain the celeriac from the milk, reserving the milk, and place the flesh in a blender with half of the milk. Blend to a thick purée. Set aside. Heat the vegetable oil in a deep-fat fryer or medium sized, tall-sided pan to 170C\/340F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Prepare a bowl of ice cold water. Heat a small saucepan of water until boiling and then turn to a low simmer. Separate the egg yolk from the whites and then drop each yolk into the water and cook for two minutes until just set (a timer is useful for this); now quickly transfer the yolks to the cold water to cool down. Place the flour, beaten egg and breadcrumbs in three separate bowls ready for coating the yolks. Carefully drain the yolks and transfer to the flour bowl. Gently coat with the flour, followed by the beaten egg and then lastly the breadcrumbs. Set aside. Heat a griddle pan over a medium heat. Rub the porcini with the oil, season well with salt and pepper and add to the pan with the garlic. Once the porcini slices are cooked through and nicely caramelised, remove from the grill and reserve. To smoke the porcini, be sure to be working in a ventilated space. Place a medium pan over a high heat and add the drained smoking chips. On top of this add some scrunched up foil or metal baking rings to form a trivet and then a small colander or strainer. When the chips start to smoke, add the porcini to the colander and place a tight-fitting lid over the pan. Remove the pan from the heat and allow the porcini to smoke for 3-4 minutes, or until they catch the flavour of the smoke. Do not leave the mushrooms too long in the pan as they can turn acrid. Remove and set aside. Deep-fry the eggs in the hot oil until golden-brown and crisp. Carefully remove using a slotted spoon and drain on kitchen paper. For the thyme vinaigrette, whisk together the rapeseed oil and the vinegar in a small bowl, season well and then stir in the thyme leaves, lemon juice and Dijon mustard. To serve, spoon some of the warm celeriac purée onto serving plates and then top with the mushrooms and the the crisp yolk. Finally spoon over the thyme vinaigrette. ","ingredients":" 1 celeriac, diced,  400-500ml\/14-18fl oz full-fat milk (enough to cover the celeriac),  salt and freshly ground black pepper,  vegetable oil, for deep fat frying,  4 free-range eggs,  110g\/4oz plain flour, for dredging,  1 large free-range egg, beaten,  110g\/4oz Japanese Panko breadcrumbs, for dredging,  400g\/14oz cleaned and trimmed porcini mushroom (or king oyster) sliced lengthwise into 1cm\/½in pieces,  dash extra virgin olive oil ,  1 garlic clove, very finely chopped,  30g\/1oz oak wood chips, for smoking, soaked for an hour in a little water,  100ml\/3½fl oz rapeseed oil ,  5 tbsp moscatel wine vinegar,  sea salt and pepper,  ¼ bunch fresh thyme, leaves removed,  1 lemon, juice only,  ½ tsp, Dijon mustard ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilled_and_hot_smoked_26927"}