{"recipe_name":"Grilled monkfish cheeks with umeboshi and shiso dressing ","author":"Hamish Brown","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dressing, mix together the garlic, ginger and umeboshi in a bowl.  Add the lime juice and zest, then whisk in the oil. Stir in the herbs and set aside.   For the grilled monkfish, preheat the grill to high.  Place the monkfish cheeks in a shallow dish and pour over half of the dressing. Leave to marinate for 30 minutes. Heat a large saucepan of boiling water and blanch the asparagus for one minute, then remove and put into cold water to cool it, then drain. Cover the lettuce, avocado and asparagus in a little olive oil and sprinkle with salt to taste. Place the lettuce, avocado and asparagus under the grill. Remove the vegetables as they cook and are charred on each side. Reserve the grilled vegetables at room temperature. Grill the monkfish cheeks for 2-3 minutes on each side.  Once removed from the grill, toss the cheeks in some of the marinade.  Leave the cheeks to rest for three minutes to finish cooking. To serve, cut the vegetables into bite-sized pieces and toss with the edamame beans and mint leaves. Lay the vegetables on a serving platter and dress them. Lay the monkfish cheeks on top of the vegetables. Finish with the remaining dressing and serve. ","ingredients":" 25g\/1oz crushed garlic,  25g\/1oz fresh root ginger, grated with juice,  50g\/1¾oz umeboshi paste (made from pickled ume fruits), available from specialist Japanese suppliers,  1 lime, juice and zest only ,  200ml\/7fl oz light olive oil,  10 green shiso leaves, chopped,  ¼ bunch flatleaf parsley,  8 medium-sized monkfish cheeks,  4 baby gem lettuce, quartered,  1 avocado, firm but ripe, quartered,  6 asparagus spears,  sea salt,  light olive oil,  35g\/1¼oz edamame beans,  12 small mint leaves ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilled_monkfish_cheeks_52393"}