{"recipe_name":"Grilled salmon and scallop kebab","author":"Richard Phillips","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the kebabs, thread all the ingredients alternatively on a wooden skewer, only one of each, and place on a plate in the fridge until all the other components are ready to serve. For the naan, put the flour in a large bowl and add the sugar, salt and one teaspoon of vegetable oil and stir. Whisk together the milk and the egg in a separate bowl.. Gradually add the milk and egg to the flour. Knead to make a dough and cover with cling film. Leave to rest in a warm place for one hour.  Preheat the oven to 220C\/425F\/Gas 7. Dust two baking trays with flour. Once the dough has rested, pour the remaining oil over the dough and mix together.   Flour a clean work surface and roll or shape the bread into eight teardrop shapes and place on the floured baking trays. Bake for 8-10 minutes, or until golden-brown and puffed up. For the slaw, place all the ingredients in a large bowl and mix. Set aside in the fridge. For the garlic and chilli dipping sauce, put all the dipping sauce ingredients in a small bowl and mix until well combined. For the mint raita, put all the raita ingredients in a medium bowl and mix and set aside. To cook the kebabs, preheat the grill to hot. Place the kebabs on a tray under the grill and cook for 8-10 minutes, or until cooked through. To serve, place the raita on each plate and the slaw in the centre and kebab on top. Serve the dipping sauce in a small dish and a naan on the side. ","ingredients":" 250g\/9oz salmon fillet, skinned and cut into 2cm\/1in pieces,  4 scallops, coral removed,  8 cherry tomatoes, left whole,  1 green pepper, cut into 2cm\/1in pieces,  1 red onion, cut into 2cm\/1in pieces,  500g\/1lb 2oz plain flour, plus extra for rolling ,  ½ tsp caster sugar,  pinch salt,  3 tsp vegetable oil,  250ml\/9fl oz full-fat milk,  1 medium free-range egg,  ½ white cabbage, finely shredded,  ¼ daikon, finely julienned,  1 bunch spring onions, finely chopped,  pinch chilli flakes,  20g\/¾oz poppy seeds,  50ml\/2fl oz rice wine vinegar,  pinch caster sugar,  ¼ root fresh turmeric, peeled and grated,  1 garlic clove,  ½ tsp chilli flakes,  ½ tsp caster sugar,  1 tbsp white wine vinegar,  3 tbsp olive oil,  200g\/7oz natural yoghurt,  ½ cucumber, grated,  1 lime, juice only,  1 tbsp chopped fresh mint","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilled_salmon_and_76093"}