{"recipe_name":"Baked Alaska with poached rhubarb","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1-2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the baked Alaska, melt the butter in a frying pan, add the bread and fry until golden. Dust the fried bread with icing sugar on both sides and fry once more for 30 seconds on each side. Transfer onto a serving plate and leave to cool.  For the poached rhubarb, put the chopped rhubarb, butter, sugar, vanilla pod and brandy into a small saucepan. Bring to the boil, then reduce the heat to gently poach the rhubarb until it has softened. Add more sugar if the rhubarb is too sharp. Set aside to cool. Spoon two tablespoons of the rhubarb on top of the toasted, sugared bread. Top with the ice cream. For the meringue, whisk the egg whites until stiff peaks form when the whisk is removed. Gradually add the sugar, one spoonful at a time, whisking constantly, until it is all incorporated and the mixture is stiff and glossy.  Stir in the mixed spice and black pepper. Spoon the meringue mixture into a piping bag and pipe all over the ice cream to completely cover.  Using a mini-blowtorch, scald the outside of the meringue until it is slightly golden all over. Arrange the rest of the poached rhubarb around the edges of the plate and serve, garnished with lime wedges. ","ingredients":" 15g\/½oz butter,  1 slice bread, cut into a 15cm\/6in circle,  2 tsp icing sugar,  2 sticks rhubarb, chopped,  30g\/1oz butter,  4 tbsp caster sugar,  1 vanilla pod, split,  dash brandy,  200ml\/7fl oz vanilla ice cream,  3 free-range egg whites,  175g\/6oz caster sugar,  pinch ground mixed spice,  pinch ground black peppercorns,  lime wedges, to garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakedalaskawithpoach_86836"}