{"recipe_name":"Grilled sardines with crab mayonnaise and dukkah","author":"Ben Tish","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crab mayonnaise, put the egg yolk, crab, chilli, garlic and mustard in a bowl and whisk to combine. Mix the olive oil and vegetable oil in a jug. Slowly pour the oil into the bowl in a thin stream, whisking all the time until emulsified. Season with salt, pepper and lemon juice. Then stir in the buttermilk and chopped coriander. Set aside.  For the dukka, put the seeds and nuts in a dry frying pan and place over a medium heat. Cook carefully until the spices become fragrant and the nuts start to release their natural oils. Transfer everything to a pestle and mortar and pummel to a rough paste along with the olive oil and lemon juice. Season with salt and pepper and set aside. To cook the sardines, preheat the grill to a high heat. Drizzle the extra virgin olive oil over the sardines and Baby Gem quarters and then season with salt, black pepper, sumac and chilli flakes. Grill the Little Gem on all sides for about 2 minutes until lightly charred and softened Carefully lay the sardines skin-side up and cook for 2 minutes before flipping and cooking briefly on the flesh side. The sardines should be nicely charred and still a little pink inside. Squeeze some lemon juice over the sardines and lettuce. To serve, spoon a circle of mayonnaise on a plate and then arrange the sardines and Baby Gem quarters on top followed by the dukka and some sprigs of fennel herb. ","ingredients":" 1 large free-range egg yolk,  50g\/1¾oz brown crab meat, passed through a sieve,  ½ red chilli, finely chopped,  ½ garlic clove, finely chopped,  1 small tsp Dijon mustard,  100ml\/3½fl oz extra virgin olive oil,  5 tbsp vegetable oil,  lemon juice, to taste,  4 tsp buttermilk,  ½ small bunch coriander, finely chopped,  sea salt and freshly ground black pepper,  50g\/1¾oz sesame seeds,  50g\/1¾oz pistachio nuts,  10g\/¼oz nigella seeds,  5g cumin seeds,  25g\/1oz coriander seeds,  4 tsp extra virgin olive oil,  ½ lemon, juice only,  4 tsp extra virgin olive oil,  8 large sardines, scaled, butterflied and tails left in tact,  2 small Little Gem lettuce, cut into 4 lengthwise,  ½ tsp sumac spice mix,  ½ tsp chilli flakes,  ½ lemon, juice only,  sprigs of fennel herb","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilled_sardines_with_92256"}