{"recipe_name":"Grilled cardamom and horseradish mackerel with autumn salad","author":"Arthur Potts Dawson","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to its highest setting. Place the mackerel fillets flesh-side up onto a grill tray. Sprinkle with crushed cardamom seeds and the grated horseradish and season lightly with salt and freshly ground black pepper. Place under the grill for 3-4 minutes, then turn and cook the other side for 30 seconds, or until the fish is just cooked through. For the salad, place the potatoes into a pan of water, bring to the boil and simmer until tender. Drain and leave until cool enough to handle, then peel off the skins. Meanwhile, bring a large pan of salted water to the boil. Add the cauliflower and cook for three minutes. Add the beans and cook the cauliflower and beans for three minutes, or until just tender. Drain and set aside. Heat a frying pan until hot, add the olive oil, anchovy fillets, capers and garlic and fry for one minute. Add the potatoes, cauliflower and green beans and mix together well. To serve, place equal portions of the salad into the centre of each dish. Top each with two mackerel fillets and drizzle over any pan juices from the salad. ","ingredients":" 4 large mackerel fillets,  8 cardamom pods, seeds only, crushed,  3cm\/1in piece fresh horseradish, grated,  salt and freshly ground black pepper ,  1kg\/2lb 2oz new potatoes, washed,  300g\/11oz cauliflower, cut into florets,  300g\/11oz green beans, trimmed,  3 tbsp extra virgin olive oil,  12 salted anchovy fillets, rinsed and drained,  20g\/¾oz salted capers, soaked in water for 2 hours,  1 garlic clove, finely sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledcardamomandho_89899"}