{"recipe_name":"Grilled chicken with crispy pancetta, white asparagus and brown butter","author":"Frank Bordoni","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/390F\/Gas 6. Season the chicken supremes with salt and freshly ground black pepper and brush with a little of the olive oil.  Heat a frying pan over a medium heat and add the chicken. Fry for about two minutes on each side, or until golden. Transfer the chicken to a baking tray (keep the pan to one side for use later in the recipe) and cook in the oven for 20-25 minutes, or until cooked through.  At the same time, place the pancetta on a separate baking tray and cook in the oven for about 15 minutes, or until crispy. Remove and set aside on kitchen paper. Meanwhile, trim the woody ends off the asparagus. Bring a large pan of salted boiling water to the boil and blanch the asparagus. Drain the asparagus then refresh in cold water and set aside. Heat the remaining olive oil in the pan you used to cook the chicken and add the mushrooms. Cook for 4-5 minutes until just softened. Turn up the heat and add the blanched asparagus and the butter and allow to brown. Add the lemon juice and parsley. To serve, divide the asparagus and mushrooms between two warm plates. Top each with a chicken supreme, drizzle over any juices left in the pan and garnish with the crispy pancetta. ","ingredients":" 2 chicken supremes (breasts with the small bone still attached), skin on,  2 tbsp olive oil,  75g\/2½oz pancetta ,  8 spears of white asparagus,  120g\/4¼oz chestnut mushrooms, quartered,  60g\/3oz unsalted butter,  ½ a lemon, juice only,  1 small bunch of Italian parsley, chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledchickenwithcr_74661"}