{"recipe_name":"Grilled fillet of South Devon beef with a shallot and tomato sauce","author":"John Burton Race","programme":"Great British Menu","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the shallot and tomato sauce. Gently cook the shallots and garlic in 20g\/1oz of the butter until very soft. Purée in a blender and place in a clean pan with the tomatoes, tarragon, thyme and bay leaf. Cook gently for five minutes or until the tomatoes start to break down.  Add the white wine, bring to the boil and cook until the liquid is reduced by half. Pour in the Madeira and Port, boil and reduce again by half. Add the chicken stock and bring to the boil. Skim and simmer for 30 minutes.  Pass the sauce through a fine sieve, then let the sauce drip through a clean piece of muslin. It will quite a heavy residue behind. Discard the residue. Pour into a clean pan, bring to the boil and cook for about two minutes or until the desired consistency is achieved. Whisk in the remaining butter and season with salt and freshly ground black pepper. Set aside. For the herb butter sauce, combine the shallots, garlic, tarragon, vinegar and wine in a small heavy-bottomed saucepan. Boil until you have 1 tablespoon of syrupy liquid.  Add the cream, then over a gentle heat whisk in the butter a little at a time. The finished sauce will be creamy and a delicate yellow. Do not allow to boil. Season with lemon juice, cayenne, salt and freshly ground black pepper. Pass the sauce through a fine sieve into a bowl and set in a saucepan of hot water to keep warm.  Preheat the grill to its highest setting.  For the beef, season the fillet steaks with sea salt. Heat the oil in a heavy-bottomed frying pan, then brown the fillets on all sides.  Place under the hot grill and cook to your taste: five minutes for medium-rare, six minutes for medium etc. Remove from the heat and allow to rest for five minutes. Meanwhile, warm the shallot and tomato sauce. Add the tomatoes and chopped herbs to the butter sauce. To serve, heat the butter in a pan and sauté the girolle mushrooms for 2-3 minutes. Add the baby carrots and green beans and warm through. Season to taste with salt and freshly ground black pepper. Place the fillets on warm plates. Pour a pool of shallot and tomato sauce close to each fillet, then carefully spoon the herb butter sauce over the top of the steaks. Serve the vegetables alongside. ","ingredients":" 6 shallots, chopped,  1 clove garlic, chopped,  35g\/1½oz unsalted butter,  8 tomatoes, deseeded and roughly chopped ,  sprig tarragon ,  sprig thyme ,  1 bay leaf,  250ml\/9fl oz white wine,  200ml\/7fl oz dry Madeira,  100ml\/3½oz Port,  200ml\/7fl oz chicken stock,  salt and freshly ground black pepper,  60g\/2½oz shallots, chopped,  ½ clove garlic, chopped,  sprig tarragon,  2 tbsp white wine vinegar,  3 tbsp dry white wine,  1 tbsp double cream,  200g\/7oz cold unsalted butter, cubed,  lemon juice, to taste,  cayenne pepper,  salt and freshly ground black pepper,  2 tomatoes, skinned, deseeded and finely chopped,  1 tbsp chopped parsley ,  1 tbsp chopped chervil ,  ½ tbsp chopped tarragon, blanched,  ½ tbsp chopped chives,  4 mature South Devon beef fillet steaks, each 150g\/5½oz, or similar quality beef,  Maldon sea salt,  2 tbsp groundnut oil,  salt and freshly ground black pepper,  knob of butter,  100g\/3½oz girolle mushrooms,  12 baby carrots, blanched,  100g\/3½oz fine green beans, blanched,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledfilletofsouth_81781"}