{"recipe_name":"Baked apples with Calvados sauce","author":"Raymond Blanc","programme":"Raymond Blanc's Kitchen Secrets","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/bakedappleswithcalva_93269_16x9.jpg","method":"For the baked apples, preheat the oven to 170C\/350F\/Gas 4. Cut the bases off any apples that do not sit flat, making sure not to remove too much of the base. Remove the cores from the apples, using an apple corer or a small sharp knife.   Brush a shallow ovenproof dish with some of the melted butter and sprinkle over some of the sugar. Brush each apple with the remaining melted butter, then roll them in the remaining caster sugar. Place the apples into the ovenproof dish and bake in the oven for 30 minutes. If possible cook the apples in without fan assisted heat as this is too intense and will burst the skin of the apple before it is cooked. For the Calvados sauce, heat the sugar in a small saucepan over a medium heat until it reaches a dark golden caramel.  Stir in the butter and add the diced apples , cook for 30 seconds, without moving the pan (use a spoon to cover the apples in the caramel mixture). Add the apple juice and bring to the boil. Stir in the diluted arrowroot a little at a time, until it has thickened slightly, then remove from the heat and add the Calvados. For the garnish, mix together the bread cubes and half of the icing sugar. Sprinkle the mixture onto a baking tray. Mix the pistachios, whole and flaked almonds, Calvados and the remaining icing sugar together until well combined. Spread the mixture onto the same baking tray. Bake in the oven for 8-10 minutes, or until the nuts and bread cubes are golden-brown. Set aside to cool. To serve, place one baked apple into the centre of each of four serving plates. Spoon the Calvados sauce into the centre and sprinkle over the toasted garnishes. ","ingredients":" 4 Reines des Reinettes apples, or similar russet apples, washed, dried,  60g\/2½oz unsalted butter, melted,  4 tbsp caster sugar,  50g\/2oz caster sugar,  20g\/¾oz unsalted butter,  40g\/1½oz Braeburn apple, peeled, cut into 0.5cm\/¼in dice,  80ml\/3¼oz apple juice,  ½ tsp arrowroot, diluted in a little water,  1 tsp Calvados,  15g\/½oz bread, cubed,  15g\/½oz icing sugar,  15g\/½oz pistachio nuts,  10g\/¼oz whole almonds,  5g flaked almonds ,  1-2 tsp Calvados","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakedappleswithcalva_93269"}