{"recipe_name":"Grilled halibut steak with a seafood and vegetable broth, crisp squid and béarnaise sauce","author":"Ed Baines","programme":"Put Your Money Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the béarnaise sauce, put the shallot, tarragon, water, wine and vinegar in a small non-reactive saucepan and bring to the boil. Cook for two minutes, or until the liquid has reduced by half. Strain through a sieve and reserve the liquid.  Melt the butter in a saucepan until foaming and then cook gently for a further minute until a white foam begins to form on top. Skim the foam off and discard; then allow the butter to cool slightly. Add the egg yolks and vinegar reduction to the bowl of a blender and blend slowly. Add the melted butter in a slow, steady stream until the sauce has thickened and all of the butter is incorporated. Take your time so as not to curdle the sauce. Transfer to a bowl and set aside until needed. (The sauce can be reheated by placing the bowl over a pan of simmering water and stirring continuously until heated through.) For the halibut, preheat the grill to high. Rub the halibut steaks on each side with a little olive oil and season well with salt and freshly ground black pepper. Place under the hot grill and cook for four minutes on each side. Remove from the heat and transfer to a warmed serving plate to rest. For the broth, place the new potatoes into a pan of boiling salted water and cook for 8-10 minutes, or until just tender. Drain the potatoes and then plunge into a bowl of iced cold water to prevent them from cooking further. Drain, cut the potatoes into thick slices and reserve. In a large pan, heat the olive oil and gently fry the shallots and garlic for 2-3 minutes, or until staring to soften. Pour in the stock, add the saffron and bring to the boil.  Add the fennel, reduce to a simmer and cook for another two minutes. Add the peas and cook for a further two minutes and, just before serving, add the potato slices to warm through. Strain the broth through a sieve and reserve the vegetables and broth separately.  For the squid, lightly score the squid pieces with a sharp knife. Heat the vegetable oil in a deep heavy-bottomed saucepan until a breadcrumb sizzles and browns after 10 seconds when dropped in it. (CAUTION: hot oil can be dangerous - do not leave unattended.)  Dip the squid in the panko breadcrumbs to coat and deep fry in batches in the oil. When the squid is crisp and browned, remove with a slotted spoon and drain on kitchen paper. To serve, divide the reserved vegetables among four serving bowls and top each serving with a halibut steak. Pour the broth into the bowl, taking care not to pour the broth over the top of the fish. Spoon a little béarnaise sauce over the top of each halibut steak, top with the crisp squid and serve. ","ingredients":" 1 shallot, finely chopped,  2 tsp fresh tarragon leaves, chopped,  4 tbsp water,  4 tbsp dry white wine,  2 tbsp white wine vinegar,  175g\/6¼oz unsalted butter,  3 free-range egg yolks,  4 x 150-200g\/5¼-7¼oz halibut steaks,  dash olive oil,  salt and freshly ground black pepper,  8 new potatoes,  1 tbsp olive oil,  2 small shallots, sliced into fine rings,  1 garlic clove, finely chopped,  1 litre\/1 pint 15¼fl oz fresh fish stock,  pinch saffron,  1 fennel bulb, thinly sliced,  100g\/3½oz shelled fresh peas,  1 whole squid, quills and ink sack removed, cut into 4 pieces lengthways, cleaned under cold running water and patted dry,  vegetable oil, for deep frying,  100g\/3½oz Japanese panko breadcrumbs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledhalibutsteakw_91333"}