{"recipe_name":"Grilled lamb chop with braised pak choi, mustard couscous and stuffed pepper","author":"Brian Turner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the lamb chop, rub the chop with olive oil and salt and freshly ground black pepper and place in a hot griddle pan. Griddle for four minutes, then turn over and griddle for another 3-4 minutes on the other side, or until cooked to your liking. Remove from the heat and set aside to rest. For the braised pak choi, cook the pak choi in a saucepan of boiling salted water for two minutes, then drain. Heat a little oil in a wok and add the blanched pak choi. Drizzle over the honey and soy sauce and stir fry for a few seconds, until coated. For the mustard couscous, place the couscous into a large bowl and pour over enough chicken stock to cover the couscous by one centimetre. Cover with cling film and leave for four minutes. Remove the cling film and fluff up the grains with a fork. Add the mustard, olive oil, salt and freshly ground black pepper and cashews and stir well. Grease a ramekin dish and fill with half of the couscous mixture. Press down the couscous, then turn out onto a serving plate. Reserve the rest of the couscous for the stuffed pepper. For the stuffed pepper, cut the top off the pepper and deseed it but keep it whole. Rub the pepper with olive oil and season with salt and freshly ground black pepper. Place onto a baking sheet and transfer to the oven. Bake for 6-8 minutes, or until softened but still retaining its shape. Stuff the pepper with the reserved couscous. To serve, place the pak choi onto the serving plate, top with the lamb chop and place the stuffed pepper on the side. ","ingredients":" 100g\/3½oz lamb chop,  dash olive oil,  salt and freshly ground black pepper,  1 pak choi, halved,  dash vegetable oil,  1 tbsp honey,  2 tbsp soy sauce,  150g\/5½oz couscous,  about 300ml\/½ pint hot chicken stock,  2 tsp Dijon mustard,  dash olive oil,  salt and freshly ground black pepper,  50g\/2oz cashew nuts, toasted,  butter, for greasing,  1 baby red pepper,  dash olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledlambchopwithb_87918"}