{"recipe_name":"Grilled lamb cutlets filled with parma ham and herbs","author":"Gennaro Contaldo","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place all the herbs on a chopping board and chop very finely together. Place them in a bowl with the garlic, parmesan, butter and some salt and pepper and mix well until you get a smooth paste. Arrange the parma ham slices overlapping slightly on a piece of clingfilm and spread the paste evenly over them with a spatula. Then, with the help of the clingfilm, roll up the ham into a sausage shape, and tie the ends so the filling doesn't escape. Place in the fridge for at least half an hour. Slice each lamb cutlet horizontally through the centre, leaving it joined at one end, and open it up like a butterfly. With a meat tenderiser, flatten each piece. You can ask your butcher to do this for you if you prefer. Remove the filling from the fridge and discard the clingfilm. Cut the filling into 2.5cm\/1in slices, pressing slightly so it becomes flat. Place on one side of each cutlet and fold the other side over the top. Press together well, making sure that none of the filling escapes.  Transfer the cutlets to a baking tray lined with foil and season with salt and freshly ground black pepper.  Place under a hot grill and grill for about 2 minutes on each side for rare, 4 minutes for medium or, for well done, as long as you like. ","ingredients":" 12 lamb cutlets,  salt and freshly black ground pepper,  10 fresh sage leaves,  handful fresh rosemary needles,  handful fresh flat-leaf parsley leaves,  handful fresh basil leaves,  1 garlic clove, finely chopped,  6 tbsp freshly grated parmesan cheese,  110g\/4oz butter, slightly softened (remove from the fridge about an hour in advance),  6 slices parma ham","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledlambcutletsfi_70345"}