{"recipe_name":"Grilled lamb with aubergine and basil ratatouille","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the grilled lamb steak, place the lamb into a shallow glass dish or bowl. Add the thyme, garlic, olive oil and seasoning to the lamb and massage into the meat. Leave aside to marinate for five minutes, or up to an hour if time permits.  Heat a griddle pan until hot, then add the steak and griddle on both sides for 3-4 minutes, or until cooked to your liking. Set aside to rest for five minutes before serving. To make the ratatouille, heat one tablespoon of the olive oil in a non-stick frying pan and add the aubergine. Fry for ten minutes, or until softened and golden-brown all over.  In a separate non-stick frying pan, heat the remaining one tablespoon of olive oil, add the onion to the pan and fry over a gentle heat for five minutes, or until softened but not coloured. Add the garlic to the pan and cook for a further one minute.  Add the fried aubergine, canned cherry tomatoes and chilli flakes to the pan and cook for three minutes. Add the white wine to the pan and cook for another two minutes.  Stir in the basil to the pan and season well with salt and freshly ground black pepper.  To serve, spoon the ratatouille onto a plate and top with the griddled lamb. Garnish with sprig of thyme. ","ingredients":" 175g\/6oz lamb leg steak,  1 sprig fresh thyme, chopped,  ½ garlic clove, chopped,  1 tbsp olive oil,  salt and freshly ground black pepper,  2 tbsp olive oil,  ½ aubergine, cut into cubes,  ½ onion, chopped,  1 garlic clove, finely chopped,  200g\/7oz canned cherry tomatoes,  pinch chilli flakes,  2 tbsp white wine,  handful fresh basil, chopped,  salt and freshly ground black pepper,  sprig fresh thyme, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledlambwithauber_87005"}