{"recipe_name":"Grilled prawns with yoghurt and mint","author":"Nigel Slater","programme":"Nigel Slater's Simple Suppers","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2-3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the spice paste, place the chillies, garlic, ginger, peppercorns, cumin and coriander seeds and turmeric into a food processor and blend until roughly chopped. Add the fresh coriander and mint along with the creamed coconut and blend again to form a smooth paste that still has a little texture.  The paste will be quite thick at this point, so add just enough water so that it will coat the prawns. Toss the spice paste and prawns together in a bowl. You can leave to marinate overnight, covered with cling film in the fridge, if you wish. Heat a griddle pan until searingly hot. Meanwhile, making the dressing. Add the mint and coriander to a bowl with the lime zest (alternatively you could try using the zest of a lemon for the citrus note), then stir through the yoghurt.  Place the prawns onto the hot griddle pan and cook for 2-3 minutes on each side,  until opaque and pink in colour. Serve these immediately with the dressing and the reserved mint leaves. This spice paste is very versatile and can be used with chicken or fish. ","ingredients":" 2 red chillies, deseeded if you want less heat, roughly chopped,  2-3 large, juicy garlic cloves, roughly chopped,  fresh root ginger, peeled and cut into about 8 coin-shaped pieces,  sprinkling of whole black peppercorns,  good shake each of cumin seeds and coriander seeds,  good sprinkling of ground turmeric,  handful fresh coriander ,  handful fresh mint,  sachet of creamed coconut, or half a block of creamed coconut, grated ,  couple of handfuls of raw peeled tiger prawns,  handful each of fresh mint and coriander, roughly chopped (reserve a few extra mint leaves for  garnish),  1 lime, zest only,  good dollop or two plain yoghurt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledprawnswithyog_92524"}