{"recipe_name":"Grilled snapper with crisp noodle cake with roast peppers and garlic","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the grilled snapper, season the flesh, to taste, with salt and freshly ground pepper. Heat the oil in a griddle pan over a high heat. When the oil is smoking, cook the fish, skin-side down, for 2-3 minutes. Turn over the fish, turn off the heat and let the fish finish cooking in the residual heat of the pan. For the crisp noodle cake, mix the noodles with the sesame oil and soy sauce in a bowl. Transfer the noodles to a small frying pan and press down with the back of a wooden spoon into a 'cake'. Fry for 8-10 minutes, turning the cake over halfway through cooking. For the roast peppers and garlic, drizzle the olive oil over the pepper half and scatter over the chopped garlic.  Roast the pepper in the preheated oven for 8-10 minutes.  Remove the pepper from the oven, chop into pieces and mix with the extra virgin olive oil and balsamic vinegar. To serve, place the noodle cake onto a plate and top with the pepper and then the fish. Garnish with the whole chives. ","ingredients":" 1 red snapper, filleted, skin of one fillet scored several times with a sharp knife (the second fillet can be used in another recipe) ,  salt and freshly ground black pepper,  2 tbsp olive oil,  2 whole fresh chives, to serve,  1 handful egg noodles, cooked according to packet instructions, drained,  1 tbsp sesame oil,  1 tbsp soy sauce,  2 tbsp olive oil,  ½ red pepper,  2 garlic cloves, peeled, chopped,  1 tbsp extra virgin olive oil,  1 tbsp balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/grilledsnapperwithcr_92401"}