{"recipe_name":"Gruyère stuffed veal escalope with red wine sauce","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the veal, mix together the cheese, parsely, rosemary, capers and half the olive oil in a bowl. Spoon the mixture onto the veal escalope and roll up into a parcel, securing with toothpicks if necessary. Heat the remaining olive oil in an ovenproof frying pan, and fry the stuffed veal for 4-5 minutes, turning regularly until golden-brown on all sides. Add the brandy, heat briefly, then set light with a match. Let the flames flare up, then die down. Cook for 3-4 mins longer until most of the liquid has evaporated. (CAUTION: Keep the flames away from the eyes and face. Do not leave unattended.) Transfer to the oven and roast for 10 minutes, or until cooked to your liking. Remove from the oven and set the veal aside on a warm plate to rest for 10 minutes.  Meanwhile, for the red wine sauce, heat all the red wine sauce ingredients in a pan until the volume of liquid has reduced by half. Season, to taste, with salt and freshly ground black pepper. For the cavolo nero, heat the butter in a frying pan and fry the cavolo nero for 4-5 minutes, or until tender. Season, to taste, with salt and freshly ground black pepper. To serve, place the stuffed veal onto a serving plate. Spoon the cavalo nero alongside and spoon over the sauce. ","ingredients":" 55g\/2oz Gruyère, grated,  1 tbsp chopped fresh parsley,  ½ tbsp chopped fresh rosemary,  1 tsp capers,  2 tbsp olive oil,  100g\/3½oz veal escalope, battered until ½cm\/¼in thickness with a rolling pin,  1 tbsp olive oil,  1 tbsp brandy,  200ml\/7¼fl oz red wine,  55g\/2oz butter,  ½ beef stock cube,  1 tsp capers,  pinch sugar,  salt and freshly ground black pepper,  55g\/2oz butter,  100g\/3½oz cavolo nero, stalks removed, sliced finely,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gruyerestuffedveales_92849"}