{"recipe_name":"Beef, stout and chestnut casserole with leek colcannon","author":"The Hairy Bikers","programme":"The Hairy Bikers' Twelve Days of Christmas","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/320F\/Gas 2. For the casserole, place the flour in a plastic bag, add the sea salt and freshly ground black pepper and shake to mix together. Add the chunks of stewing steak and toss to coat them in the flour.  Heat a large frying pan over a high heat and add the vegetable oil. Brown the beef in small batches, frying until the beef is golden-brown all over. Transfer each bath of seared beef to a casserole dish and repeat the process as necessary. Fry the onions in the pan the beef was cooked in for 2-3 minutes, or until softened, then stir in the tomato purée and cook for a further two minutes. Transfer the mixture to the casserole dish.  Add the carrots, celery, beef stock, Irish stout, caraway seeds and raisins to the casserole and mix well to combine. Cover the casserole with a lid and cook in the oven for two hours, or until the beef is very tender.  Add the chestnuts and cook for a further 30 minutes.  Meanwhile, for the leek colcannon, cook the potatoes in a pan of simmering water for 15-20 minutes, or until the potatoes are tender. Drain the potatoes and set aside.  In a separate pan, bring the milk to a simmer and poach the leeks for 4-5 minutes, or until tender. Drain the leeks, reserving a few tablespoons of the milk.  Mash the potatoes and fold in the butter and the cream. Add the leeks and a few tablespoons of the reserved milk and mash together until creamy. Season, to taste, with sea salt and white pepper.  To serve, spoon the beef casserole into serving bowls and spoon the leek colcannon alongside. ","ingredients":" 2 heaped tbsp plain flour,  1 tsp sea salt flakes,  1 tsp freshly ground black pepper,  1kg\/2lb 3oz stewing steak, cut into chunks,  2 tbsp vegetable oil,  3 large onions, peeled, sliced,  1 tbsp tomato purée,  8 carrots, peeled and cut into discs,  2 sticks celery, chopped,  500ml\/17½fl oz beef stock,  250ml\/9fl oz Irish stout,  1 tsp caraway seeds,  1 tbsp raisins,  20 chestnuts, cooked and sliced,  2 tbsp chopped fresh parsley, to serve,  1kg\/2lb 3oz floury potatoes, such as King Edward or Maris Piper, peeled and cut into large chunks,  250ml\/9fl oz milk,  500g\/17½oz leeks, washed and cut into rounds,  2 tbsp butter,  1 tbsp double cream,  sea salt flakes and white pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/guinnessbeefandchest_93084"}