{"recipe_name":"Gymkhana chicken pie","author":"Atul Kochhar","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. In a large pan heat the oil before frying the cloves, peppercorns, cassia bark and curry leaves for about a minute. Add the ginger and onion and cook until the onion is translucent. Place the plain flour into a bowl with a little salt and freshly ground black pepper, to taste. Toss the chicken pieces in the flour until they are completly covered. Place the chicken pieces into the pan. Sauté the chicken briefly, browning it on all sides. Stir in the carrots, silverskin onions, beans and spices and cook for about one minute. Add the seasoned flour and cook for a further 2-3 minutes. Stir in the coconut milk and simmer for another five minutes before removing the pan from the heat.  Leave to cool. Spoon the filling into a pie dish until the filling almost reaches the top. In the centre of the dish place a pie funnel or egg cup. This will hold the pastry up as it cooks.  On a chopping board or clean surface, roll out the pastry so that it is slightly larger than the circumference of the pie dish. Use a little water or milk to wet the edges of the pastry and place it over the pie dish. Pinch the edges firmly to seal the pastry onto the dish. For the curst, use a mortar and pestle to crush the coriander, cumin, fennel and sesame seeds together. Brush the top of the pie with the beaten egg before sprinkling the spice crust over the top. Place the pie into the oven and cook for 10-15 minutes or until the pastry is golden-brown and crisp at the edges. Serve immediately. ","ingredients":" 1 tbsp coconut or vegetable oil,  2 cloves,  10 Tellicherry or ordinary black peppercorns,  2.5cm\/1in cassia bark (available in Asian stores and some supermarkets),  12 curry leaves,  1 tsp freshly grated root ginger,  1 medium onion, diced,  50g\/2oz plain flour,  salt and freshly ground black pepper, to taste ,  500g\/1lb 2oz chicken thighs, boneless and diced,  8-12 baby carrots, peeled, blanched and chopped ,  16-20 silverskin onions,  15 green beans chopped and blanched,  1 tsp ground turmeric ,  ½ tsp ground coriander ,  2 tbsp seasoned flour,  400ml\/14fl oz coconut milk,  110g\/4oz ready made puff pastry sheet,  1 free-range egg, beaten, to brush the pastry,  1 tsp coriander seeds,  ½ tsp cumin seeds,  1 tsp fennel seeds,  1 tsp black sesame seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/gymkhanachickenpie_86568"}