{"recipe_name":"Haddock 'ceviche' with crab salad and ciabatta","author":"Nick Nairn","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the haddock 'ceviche', cut away the thin ends of the  smoked haddock fillet (reserve these pieces for another recipe) and slice the remaining thick fillet into thin (2-3mm thick) slices. Divide the slices equally among four serving plates and set aside.  Place the lime juice, olive oil, crushed pink peppercorns and dill into a bowl, mix well and set aside. For the crab salad, mix the celeriac, apple, half of the mayonnaise, the crème fraîche and lemon juice together in a bowl until well combined. Add the crabmeat, the chopped parsley and the remaining mayonnaise, mixing gently until just combined.  Place a 5cm\/2in chefs' ring onto one of the serving plates, next to the haddock slices, and spoon in a quarter of the crab salad mixture. Remove the ring and repeat with the remaining mixture, placing a portion of crab salad onto each plate. Garnish each crab salad with the micro greens. For the ciabatta, preheat the oven to 210C\/425F\/Gas 7.  Place the ciabatta slices on a baking tray and drizzle with the olive oil. Season with salt and freshly ground black pepper and sprinkle over the thyme leaves. Bake in the oven for 4-5 minutes, or until golden-brown and crisp. Meanwhile, drizzle the lime juice mixture over the haddock a few minutes before serving.  To serve, arrange the toasted ciabatta slices next to the crab salad and haddock 'ceviche'. ","ingredients":" 200g\/7oz undyed smoked haddock fillet, skin removed,  25ml\/1fl oz lime juice,  25ml\/1fl oz olive oil,  ½ tsp pink peppercorns, crushed ,  2 tsp chopped fresh dill ,  200g\/7oz cooked white crabmeat,  75g\/3oz celeriac, peeled, finely chopped,  ½ Granny Smith apple, skin on, core removed, finely chopped,  75g\/3oz ready-made mayonnaise,  30g\/1½oz crème fraîche ,  1 lemon, juice only,  1 tsp chopped fresh parsley ,  2 punnets micro greens ,  1 ciabatta, sliced into 3-5mm thick slices,  2 tbsp olive oil,  2 sprigs fresh thyme, leaves only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/haddockcevichewithcr_92452"}