{"recipe_name":"Haggis, pickled neeps and tatties","author":"Tom Kitchin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the neeps, boil all the ingredients, except the turnip, in a pan. Remove from the heat, add the turnip and leave to infuse for 2-3 hours so it takes on the sweet and sour flavours of the pickling liquid. For the pork skin, preheat the oven to 180C\/160C Fan\/Gas 4. In a heavy bottomed pan, fry the carrots and onion gently in the butter for 4-5 minutes. Add the peppercorns, bouquet garni and garlic and fry for a further 1-2 minutes. Add the brandy, Madeira, port and red wine. Bring to the boil and cook until the volume of liquid has reduced by half.  Add the veal and chicken stocks and bring to the boil. Add the pork skin, cover the surface with a circle of baking paper and braise in the oven for 3-4 hours, adding more chicken stock if it starts to dry out.  Once cooked, carefully remove the pork skin and cut into 13x8cm\/5x3in pieces. Reserve the cooking liquor. Butter a large piece of alumimium foil and place the skin pieces side-by-side in a line, making sure they overlap. Place the haggis on top, roll into a sausage shape (so the haggis is wrapped in pork skin) and wrap in the foil. Place in a steamer and cook for 15 minutes.  For the crispy potatoes, mix the potato slices with the clarified butter and salt in a non-stick frying pan. Fan out the slices to make 4 circles about 5cm\/2in wide, cook on a gentle heat until crisp then set aside. Once steamed, slice the haggis into 5cm\/2in portions and place on serving plates. Top with the pickled neeps and put the crispy potato alongside. Pour over some of the reserved pork cooking liquor and serve.  ","ingredients":" 1 litre\/1¾ vegetable stock,  200ml\/7fl oz white wine vinegar,  200g\/7oz caster sugar,  1 bay leaf,  4 sprigs thyme,  6 peppercorns,  3-4 garlic cloves, sliced,  1 turnip, thinly sliced,  2 carrots, finely chopped,  1 onion, finely chopped,  75g\/2½oz unsalted butter,  5 peppercorns,  1 bouquet garnis, including celery, thyme, bay and parsley ,  2 garlic cloves, chopped,  100ml\/3½fl oz brandy,  200ml\/7fl oz Madeira ,  200ml\/7fl oz port,  500ml\/18fl oz red wine,  400ml\/14fl oz veal stock,  100ml\/3½fl oz chicken stock,  ½ pork belly skin ,  butter, for greasing,  1 whole haggis (cooked),  1 large potato, sliced thinly on a mandoline,  4 tsp clarified butter,  salt, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/haggis_pickled_neeps_and_98546"}