{"recipe_name":"Hake with chanterelles and a Swiss chard stew ","author":"José Pizarro","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Swiss chard stew, heat a little oil in a flame-proof casserole and gently fry the onion for 10 minutes until softened. Add the garlic and fry for a minute, then add the peppers and pimentón and fry for a few more minutes. Stir in the potatoes and stock. Season generously with salt and pepper then bring to a simmer. Cover and cook for 20 minutes  Meanwhile, for the hake, heat a little olive oil in a large pan and gently fry the shallots for 5–10 minutes until really soft. Add the garlic and sage and cook for 30 seconds, then increase the heat and add the mushrooms. Fry for 4–5 minutes, then add the stock and simmer for a couple of minutes. Season with salt and pepper and set aside. Heat a little oil in a heavy-based frying pan over a medium heat. Add the hake, skin-side down and cook for 4–5 minutes, or until almost cooked through. Turn and cook for 30 seconds on the other side. Place the cooked hake skin-side up into the pan containing the mushrooms. Cook for a minute or two more. Add the chard to the stew for the last few minutes, then serve with the hake and lots of crusty bread to mop up the juices. ","ingredients":" 2 tbsp olive oil,  2 shallots, finely chopped ,  2 garlic cloves, crushed,  few small sage leaves ,  300g\/10½oz chanterelle mushrooms, cleaned,  100ml\/3½fl oz fresh fish stock,  4 x 175g\/6oz hake fillets,  sea salt and freshly ground black pepper ,  2 tbsp olive oil,  1 large onion, finely chopped ,  2 garlic cloves, finely sliced ,  2 red peppers, deseeded and finely sliced ,  1 tsp pimentón (Spanish paprika),  500g\/1lb 2oz floury potatoes, sliced,  750g\/1lb 10oz Swiss chard, stalks roughly chopped and leaves shredded ,  750ml\/26fl oz pint fresh vegetable stock,  sea salt and freshly ground black pepper ,  crusty bread, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hake_with_chanterelles_25340"}