{"recipe_name":"Halibut with crab and lime croquettes","author":"Stephanie Moon","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Cover the base of a baking tray with rock salt, put the potatoes on top and bake for one hour.  Once cooked, allow to cool slightly before splitting the skins and scraping out the soft potato. For the vegetables, chop the carrots into large rounds, place in a pan of cold salted water, bring to the boil and boil for 10 minutes. The carrots should be al dente (with a slight bite). Drain well and refresh in a bowl of ice cold water. Drain again once cool.  To finish the crab and lime croquettes, mix the crab, lime and potatoes. Season and shape into barrel shapes using your hands, place on a plate and put in the fridge to chill and firm up.  Place the flour and breadcrumbs on separate shallow plates, and prepare a bowl of beaten egg for the egg wash. Once chilled, dip each croquette into the prepared flour, beaten egg then breadcrumbs until completely coated and set aside. To make the sauce, heat the fish stock in a pan, and gradually whisk in the butter until thick and glossy. Add the vermouth and season with salt and freshly ground black pepper.  For the vegetables, gently fry the mushrooms in a little butter and salt and pepper for around five minutes, or until cooked.  Stir the baby spinach in with the mushrooms so it just begins to wilt. For the fish, heat a dash of vegetable oil and fry the fish in a hot pan, skin-side down. Place in the oven to cook for 5-6 minutes, or until the fish is just cooked.  Heat some butter in a pan and fry the semi-cooked carrots so that they start to soften around the edges. Take the fish out of the oven, cover with foil and allow to rest for five minutes.  Heat the oil in a deep fat fryer or heavy-based saucepan to 190C\/375F. Carefully deep fry the croquettes for around five minutes, or until golden-brown. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Remove the croquettes from the fryer or pan using a slotted spoon and place on a plate lined with kitchen paper. To serve, place the spinach and mushrooms on each of six plates and the fish on top.  Place the carrots around the fish and top with a croquette. Serve with the sauce on the side. ","ingredients":" rock salt, to cover base of a baking tray,  3 large Maris Piper potatoes,  100g\/3½oz picked crab, white and brown meat,  2 lime, zest only,  100g\/3½oz plain flour,  ready-made breadcrumbs,  2 free-range eggs, beaten,  vegetable oil, for deep fat frying,  6 carrots,  200g\/7oz chestnut mushrooms, chopped into quarters,  knob of butter,  300g\/10½oz baby spinach,  1 litre\/1¾ pint fresh fish stock,  250g\/9oz butter,  50ml\/2fl oz vermouth,  salt and freshly ground black pepper,  dash vegetable oil,  6 pieces of halibut, skin on","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/halibut_with_crab_and_27912"}