{"recipe_name":"Halibut with lychee, cashew nut and miso salad","author":"James Martin","programme":"2007-16","prep_time":"overnight","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the halibut, place the sake and mirin into a pan and bring to the boil. Boil for 20-30 seconds to burn off the alcohol; then reduce the heat. Add the white miso paste and stir to dissolve. Turn the heat back up and add the sugar, stirring once more to dissolve. Remove from the heat, transfer to a bowl and allow to cool. Set a third of the miso aside for the salad. Place the halibut fillets into the remaining cold miso mixture, cover and place in the fridge for at least 24 hours, preferably 48 hours. Preheat the grill to high and the oven to 200C\/390F\/Gas 6. Remove the halibut from the miso and wipe off any excess before placing onto a grill tray. Place under the grill to cook for 2-3 minutes until golden-brown, then remove and place in the preheated oven. Cook for 5-8 minutes, or until the fish is cooked all the way through. For the salad, place all the salad ingredients except the lime juice and groundnut oil into a bowl and mix together. Place two tablespoons of the reserved miso into a bowl, add the lime juice and groundnut oil and whisk to combine. Season with salt and freshly ground black pepper. Add this dressing to the salad and stir to combine. To serve, spoon the salad onto each of four plates. Cut the halibut in half on the diagonal, place the fish on top of the salad and serve with a little more of the miso dressing over the top. ","ingredients":" 75ml\/3fl oz sake,  75ml\/3fl oz mirin,  225g\/8oz white miso paste,  110g\/4oz granulated sugar,  4 x 175g\/6oz halibut fillets, skin on,  110g\/4oz fresh lychees, peeled, stones removed, sliced,  75g\/3oz toasted cashew nuts,  1 small bunch mint leaves,  110g\/4oz mango, sliced,  1 small bunch coriander leaves,  1 red chilli, finely sliced on the diagonal,  50g\/2oz fresh coconut shavings,  110g\/4oz mizuna leaves,  50g\/2oz rocket leaves,  1 lime, juice only,  2 tbsp groundnut oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/halibutwithlycheecas_88171"}