{"recipe_name":"Halibut with spicy harissa sauce","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper and a pinch of paprika. Dredge the halibut fillets in the mixture until completely coated. Heat the vegetable oil in a frying pan over a medium heat. When the oil is hot, add the seasoned halibut fillets and fry for 2-3 minutes on each side, or until golden-brown on both sides. Place a knob of the butter on top of each halibut fillet and continue to cook. When the butter has melted, baste the fillets in the melted butter until completely cooked through, then squeeze over the lemon juice and set the halibut fillets aside on a warm plate.  Meanwhile, for the spicy harissa sauce, dry fry the bacon in a separate frying pan for 6-8 minutes, or until crisp and golden-brown. Add the dates and harissa paste and stir well to combine, then reduce the heat and continue to cook for 2-3 minutes. Add the Madeira wine, stock and olives and continue to cook for a further 4-5 minutes, or until the volume of liquid has reduced and the sauce has thickened.  To serve, divide the bulgar wheat or couscous equally among four serving plates. Place one fried halibut fillet on top of each. Pour over the Moroccan-style sauce and garnish with a lemon wedge. Sprinkle over the chopped fresh parsley. ","ingredients":" 4 x 150g\/5½oz halibut fillets,  125g\/4½oz plain flour,  salt and freshly ground black pepper,  pinch paprika,  1 tsp vegetable oil,  1 tbsp unsalted butter,  200g\/7oz bacon lardons,  200g\/7oz dates, stones removed, chopped,  1 tbsp ready-made harissa paste,  75ml\/2¾oz Madeira wine,  100ml\/3½fl oz chicken stock,  20 black Kalamata olives,  200g\/7oz cooked bulgar wheat or couscous,  4 lemon wedges ,  1 tbsp chopped fresh parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/halibutwithmoroccans_91624"}