{"recipe_name":"Halibut with salsa verde, crabcakes and baby vine tomatoes","author":"Si King","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/390F\/Gas 6. Season the halibut steaks with salt and freshly ground black pepper. Heat a frying pan until hot, add the butter, groundnut oil and halibut steaks and cook for three minutes on each side, or until lightly browned and completely cooked through. When the butter starts to bubble and turn brown, spoon it over the top of the fish. Remove from the pan. For the crabcakes, grate the potatoes into a large bowl. Add the white and brown crabmeat, parsley, lemon juice, anchovy essence and egg and mix carefully until combined. Season with salt and freshly ground black pepper. Roll the crab mixture into eight balls and flatten slightly with the palm of your hands. Roll each crab patty in the Japanese breadcrumbs. Heat the groundnut oil in a separate frying pan, add the crabcakes in batches, and cook for 3-4 minutes on each side until golden-brown on both sides and cooked through. For the baby vine tomatoes, place the tomato halves onto a baking tray and drizzle with the olive oil and balsamic vinegar. Season the tomatoes to taste with salt and freshly ground black pepper and cook in the oven for 8-10 minutes until softened slightly. For the salsa verde, blend all the salsa verde ingredients in a food processor to a purée the consistency of double cream. Season to taste with freshly ground black pepper. To serve, spoon some salsa verde onto each plate. Place the halibut on top and spoon over more salsa verde. Stack two of the crabcakes and a spoonful of the baby vine tomatoes next to it. ","ingredients":" 4 x 200g\/7oz halibut steaks, skins removed,  salt and freshly ground black pepper,  50g\/2oz unsalted butter,  2 tbsp groundnut oil,  350g\/12oz potatoes, peeled, cooked in boiling water and cooled,  200g\/7oz mixed white and brown crabmeat,  2tbsp chopped fresh flatleaf parsley,  ½ lemon, juice only,  ½ tsp anchovy essence,  1 free-range egg, beaten,  salt and freshly ground black pepper,  110g\/4oz Japanese breadcrumbs (often sold as panko),  5 tbsp groundnut oil,  250g\/9oz baby plum tomatoes, cut in half,  2 tbsp olive oil,  2 tbsp balsamic vinegar,  salt and freshly ground black pepper,  20g\/¾oz salted capers, washed and drained,  6 anchovy fillets in olive oil, drained,  40g\/1½oz fresh flatleaf parsley, leaves only,  10g\/½oz fresh tarragon, leaves only,  10g\/½oz fresh mint, leaves only,  2 garlic cloves,  1 lemon, zest and juice,  150ml\/5fl oz extra virgin olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/halibutwithsalsaverd_89441"}