{"recipe_name":"Ham hock and pea soup ","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01sh2xk.jpg","method":"For the ham hocks, put the ham into a deep saucepan, add all the other ingredients for the ham hock and cover with water. Bring slowly to the boil, then simmer for 1½-2 hours, then remove from the heat and allow to cool slightly. Remove the ham hocks from the stock and shred the meat from the bone, reserving the ham stock to make the soup. For the soup, heat a large pan until hot, add the butter, peas and parsley then stir in 750ml\/1¼ pint of the cooking liquor from the ham hock. Add the cream and bring to a simmer. Transfer to a blender and pulse to form a purée. Return to the saucepan to heat through, then season with salt and black pepper. Heat a griddle pan until hot, drizzle half of the rapeseed oil over the bread, then place on the griddle, cut-side down, and cook until charred. To serve, ladle the soup into serving bowls, top with some of the shredded ham, a drizzle of cream and the last of the rapeseed oil. ","ingredients":" 1 small ham hock (about 1kg\/2lb 4oz),  1 large onion, thickly sliced,  1 shallot, thickly sliced,  1 head garlic, cut in half horizontally,  2 carrots, cut into chunks,  1 stick celery, cut into chunks,  3 sprigs parsley,  1 sprig thyme,  6 whole peppercorns,  1 bay leaf,  25g\/1oz butter,  400g\/14oz frozen peas,  1 large bunch flatleaf parsley, roughly chopped,  750ml\/1¼ pint ham stock (from above),  150ml\/5fl oz double cream, plus extra to serve,  salt and black pepper,  2 tbsp rapeseed oil,  1 long baguette, cut in half lengthways, then widthways,  2 garlic cloves, cut in half","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ham_hock_and_pea_soup_18013"}