{"recipe_name":"Hand-raised chicken and bacon pie","author":"Paul Hollywood","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Makes 2 pies","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/hand-raised_chicken_and_12433_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. In a large mixing bowl, combine the flours then rub the butter in with your fingertips. Mix together the boiling water, salt and lard in small saucepan. Heat and stir together until the lard melts. Pour the lard and water mixture on top of the flour mixture, stirring with a spoon until everything comes together. Tip the dough onto a floured surface and bring together into a ball. Wrap a piece of clingfilm around two clean, empty, straight-sided jam jars (approximately 340g size). Divide the pastry in two, then remove a quarter from each half for the lids of the pies. With the remaining three-quarters of the pastry, place on a flat surface and place a jam jar on top of the pastry in the middle. Sculpt the still warm pastry around the dolly, try and make sure the pastry is an even thickness. Make sure the bottom is not too thick and that there are no holes in the pastry.  Chill the pie bases in the fridge for about 20 minutes. Roll out the reserved quarter of pastry into a circle to match the size of the pie top.  Make a hole in the centre of each one and chill in the fridge. Take the pastry cases out of the fridge and carefully pour boiling water from a kettle into each jam jar to soften the pastry and release it from the mould. If it softens too much and begins to sag you may need to chill again for 10 minutes or so. Trim the top of the pie shells to make sure they are even. Keeping  them separate, season  the chicken and bacon well with salt, pepper and fresh thyme. Now pack the filling into the pie, start with bacon, then chicken, then a layer of roughly chopped apricots. Repeat until the filling is all used up.  Place on the lid and crimp around the sides, sealing thoroughly.  Brush the lids of the pies with egg wash. Place on a baking tray and cook for 50-60 minutes, or until the pastry is nice and crisp all the way around. While the pies are baking, dissolve a chicken stock cube in 150ml\/5fl oz of hot water. Soak two leaves of gelatine in cold water for five minutes. When soft, squeeze out the excess water and whisk into the warm stock. When the pies are cooked, place them on a cooling rack and allow to cool for 10 minutes. Carefully pour the stock into the slit on the pie lid, to fill in any spaces inside the pie with (what will be) chicken stock jelly.  This must be done when the pie is hot, if done when cold the jelly will just sit on the top and not soak into every nook and cranny. Leave to set overnight before eating. ","ingredients":" 200g\/7oz plain flour,  40g\/1½oz strong flour,  50g\/1¾oz butter,  130ml\/4¼fl oz boiling water,  1 tsp salt,  60g\/2¼oz lard,  1 free-range egg, beaten, for egg wash,  300g\/10½oz chicken breast and thigh meat, cut into chunks,  300g\/10½oz smoked back bacon rashers,  2 sprigs fresh thyme ,  salt and freshly ground black pepper,   240g\/8½oz dried apricots, chopped,  2 leaves gelatine,  ¼ pint hot water,  1 chicken stock cube","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hand-raised_chicken_and_12433"}