{"recipe_name":"Hazelnut and chocolate roulade with strawberries","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Grease and line a 25cm\/10in x 35cm\/15in roulade tin with greaseproof paper. Crack the eggs into a large bowl, add the sugar and whisk until pale and thickened. Stir the melted butter into the egg mixture, then sift in the cocoa powder and flour.  Pour the mixture into the prepared tin and level the top with the back of a spoon. Transfer to the oven and bake for 10-12 minutes, until risen and cooked through. Place a clean tea towel onto a work surface and scatter over the chopped hazelnuts. Turn the cake out onto the tea towel. Leave to cool for five minutes, then remove the greaseproof paper. For the filling, place the whipped cream and hazelnuts into a bowl and mix well, then spread this mixture over the cake. Roll the roulade up like a cigar and place onto a large serving plate. For the chocolate sauce, place the chocolate and cream into a bowl set over a pan of gently simmering water and heat, stirring occasionally, until melted together to make a sauce. To serve, pour the chocolate sauce over the roulade and decorate with sliced strawberries. ","ingredients":" 5 free-range eggs,  125g\/4½oz caster sugar,  50g\/1¾oz butter, melted, plus extra for greasing,  30g\/1oz cocoa powder,  115g\/4oz plain flour,  50g\/1¾oz hazelnuts, chopped,  200ml\/7fl oz double cream, whipped until soft peaks form when the whisk is removed,  50g\/1¾oz hazelnuts, chopped,  200g\/7oz dark chocolate, chopped,  85ml\/3fl oz double cream,  6 strawberries, sliced, to garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hazelnutandchocolate_85290"}