{"recipe_name":"Healthy mini pizzas","author":"Natasha Corrett and Vicki Edgson","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 8 mini pizzas","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/healthy_mini_pizzas_72831_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6.  For the bases, mix the yeast with 170ml\/6fl oz of lukewarm water, cover and set aside in a warm room for about 15 minutes. Meanwhile make the sauce. Heat the oil in a pan and gently fry the onion and garlic until the onions start to go soft. Add a splash of water to cool then add the remaining ingredients. Simmer for 15 minutes, or until thickened. Set aside until ready to construct the pizzas. For the bases, whisk the yeast and water mixture and set aside for another five minutes.  Place the spelt flour and salt in a large bowl. Make a well in the centre and pour in the yeast mixture. Mix to combine then turn out onto a lightly floured work surface and knead for 5–10 minutes until smooth and silky to the touch, adding a little more flour if necessary. Divide the bread dough into eight pieces, roll each piece into a ball and place on a baking tray lined with baking parchment and flatten into a circle. Smear on some tomato sauce followed by your choice of toppings and bake for five minutes. Rotate and bake for a further five minutes, or until the base is crisp. ","ingredients":" ½ tsp active dry yeast,  285g\/9¼oz white spelt flour, plus extra for dusting,  ½ tsp Himalayan pink salt,  1 tbsp olive oil,  1 onion, chopped,  1 garlic clove, finely chopped,  2 tbsp capers, rinsed and drained,  pinch dried chilli flakes,  300g\/10½oz tomatoes, deseeded and finely chopped,  1 tbsp fresh oregano or 1 tsp dried oregano,  2 canned artichoke hearts, thinly sliced,  2 basil leaves, shredded,  20g\/¾oz buffalo mozzarella, torn into small pieces,  15g\/½oz courgette, thinly sliced,  3 strips of lemon rind, finely sliced,  15g\/½oz feta, crumbled,  10g\/1\/3oz fennel, thinly sliced,  15g\/½oz sweet potato, thinly sliced,  6g\/¼oz hard goats’ cheese, grated,  3 garlic cloves, roasted and squeezed out of the skins,  7g\/¼oz beetroot, thinly sliced,  10g\/½oz feta, crumbled","vegetarian":true,"calories":168.0,"protein":5.4,"carbs":29.5,"sugars":2.7,"total_fat":3.4,"saturated_fat":1.2,"fiber":2.4,"salt":0.4,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/healthy_mini_pizzas_72831"}