{"recipe_name":"Baked chocolate and orange cheesecake","author":"James Martin","programme":"Sweet Baby James","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cheesecake, preheat the oven to 180C\/350F\/Gas 4. Grease a 23cm\/9in springform cake tin. Cut a circle from the sponge flan case to fit the base of the tin, then cut this circle in half across the middle to make two thin discs. Use one of these to line the cake tin - the other disc can be used in another dish. Drizzle the sponge with one tablespoon of the orange liqueur. Mix together the sugar, orange zest and juice and cornflour in a bowl using a wooden spoon, then use an electric hand mixer to beat in the cream cheese. Crack in the eggs one by one, beating constantly until all the eggs are well incorporated. Add the vanilla seeds and the remaining two tablespoons of orange liqueur to the mixture and mix well. Add the cream and beat well until the mixture is smooth.   Pour a third of the mixture over the sponge base in the cake tin. Sprinkle over a third of the chocolate pieces and smooth over with a palette knife. Repeat twice more with the remaining cheesecake mixture and chocolate pieces. Place the tin into a baking tray filled with 2-3mm of warm water - this helps to create steam during cooking. Transfer to the oven and bake for 50 minutes, or until the top is lightly golden. Remove from the oven and leave to cool and set completely before removing from the tin. Meanwhile, for the marbled chocolate, place the white chocolate and dark chocolate into separate heatproof bowls set over pans of gently simmering water. Heat, stirring occasionally, until melted and smooth. Cover a baking tray tightly in cling film. Pour ladlefuls of the dark and white chocolate onto the tray. Allow to cool slightly, then use your finger to swirl the two chocolates together to create a marble effect. Place into the fridge to chill and set completely. When set, break into pieces. To serve, cut the cheesecake into wedges and place onto serving plates with a piece of the marbled chocolate and a drizzle of cream. ","ingredients":" butter, for greasing,  1 large ready-made sponge flan case,  3 tbsp orange liqueur,  200g\/7oz caster sugar,  2 oranges, zest of both and juice of 1 orange,  4 tbsp cornflour,  850g\/1½lb full-fat soft cream cheese,  3 medium free-range eggs ,  1 vanilla pod, seeds scraped out,  375ml\/13fl oz double cream, plus extra to serve,  345g\/12oz dark chocolate pieces ,  150g\/5oz white chocolate,  150g\/5oz dark chocolate","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakedchocolateandora_86397"}