{"recipe_name":"Hearty wholewheat pasta with Brussels sprouts, cheese and potato","author":"Nigella Lawson","programme":"Nigellissima","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/hearty_wholewheat_pasta_66804_16x9.jpg","method":"Preheat the oven to 200C\/400f\/Gas 6, and fill a large pot with water to cook the sprouts, potato and pasta. When the water boils, salt it generously, tip in the prepared sprouts, the potato dice and the pasta and let the water come back to the boil, then cook for about 8-10 minutes, or until the potato is tender and the pasta al dente. Just before draining, remove two cupfuls of the cooking liquid and put to one side. Tip the drained pasta, sprouts and spud into a roasting tin (or a lasagne dish) then add the ricotta and diced Gruyère and a cupful of cooking water, and toss well to combine. Add more liquid if you feel the pasta is too dry. Warm the butter and garlic oil in a small saucepan and, when melted and beginning to sizzle gently, add the sage and fry for about 30 seconds before spooning or dribbling the butter and sage leaves over the pasta bake. Sprinkle with the parmesan and bake in the oven for 20 minutes, by which time the surface will be scorched a light gold. I like this best if it’s left to stand for at least 15 minutes before eating. ","ingredients":" 750g\/1lb 10oz Brussels sprouts, trimmed and halved,  250g\/9oz baking potato, peeled and cut in 2-3cm dice,  500g\/1lb 2oz wholewheat tortiglioni or penne,  salt,  100g\/3½oz ricotta,  250g\/9oz Gruyère, cubed,  50g\/2oz unsalted butter, softened,  1 tbsp garlic oil,  4 sage leaves, shredded,  50g\/2oz parmesan (or similar vegetarian hard cheese), grated","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hearty_wholewheat_pasta_66804"}