{"recipe_name":"Herb-crusted lamb with truffle gnocchi, honey-glazed shallots and roast artichokes","author":"Jun Tanaka","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"1-2 hours","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. For the jus, make a stock by placing the bones on a roasting tin and roasting in the oven for 20 minutes, or until they are a dark-brown colour. Gently fry the carrot, onion, celery, thyme and rosemary in a large saucepan for five minutes. Add the bones and cover with chicken stock. Bring to the boil, then reduce the heat and simmer for approximately three hours, skimming off any scum that comes to the surface.  For the gnocchi, prick the potatoes and bake in the oven for an hour. When cooked, remove from the oven and set aside to cool. Once the stock is cooked, strain through a sieve. In a large pan, gently fry the shallots and peppers with a little oil for five minutes. Add the balsamic vinegar and the strained stock. Continue cooking until the jus has reduced to a consistency thick enough to coat the back of a spoon. Strain through a sieve and keep warm until ready to serve. For the herb crust, blend the parsley, dried bread, garlic and rosemary in a food processor, until combined and the consistency of fine breadcrumbs. Season to taste with salt and freshly ground black pepper and set aside on a baking tray to dry out. For the gnocchi, once the potatoes have cooked and cooled, remove the skin and pass the flesh through a sieve or a potato ricer into a bowl. Sift in the flour and season to taste with salt and freshly ground black pepper. Stir in the truffles, half the beaten egg and combine to form a soft dough. If the mix is too dry to forma a dough, add a little more egg.  On a lightly floured surface, roll the dough into slim sausage shapes, and cut into small squares. Place on a tray and leave in the fridge to chill. For the lamb and artichokes, heat a frying pan and add the oil and butter. Gently fry the artichokes with a little salt and pepper until they begin to colour. Transfer to a roasting tray and roast in the oven for 15-20 minutes, or until tender.  In the same frying pan, fry the whole shallots. Add the honey and vinegar and gently simmer for 25 minutes, or until the shallots are soft. Prepare the lamb fillets by cutting them into 2-3 portions (depending on the size) and seasoning with salt and pepper. Dip in the egg white and transfer to the tray containing the herb crust mix. Roll the lamb around to ensure the fillets are covered evenly.  Add a little olive oil and butter to an ovenproof pan. Fry the lamb fillets for a minute (you may need to do this in batches), flip over and transfer to the oven for 6-7 minutes for medium rare (cook for a further 3-4 minutes if you prefer your lamb well done). Remove the lamb from the oven and set aside to rest.  For the gnocchi, in a pan of boiling salted water, cook the gnocchi for a few minutes (the gnocchi is cooked when it floats to the surface). Remove with a slotted spoon and then fry in olive oil until golden-brown. To serve, put the shallots, artichokes and gnocchi on serving plates. Top with the lamb and spoon over the jus.  ","ingredients":" 1kg\/2lb 4oz lamb bones (from the lamb and artichokes below),  1 carrot, roughly chopped,  1 onion, roughly chopped,  1 stick celery, roughly chopped,  sprig thyme, leaves picked ,  sprig rosemary, leaves picked,  1litre\/1¾ pint fresh chicken stock,  oil, for frying,  2 shallots, sliced,  2 red peppers, sliced,  100ml\/3½fl oz balsamic vinegar,  500g\/1lb 2oz Desiree potatoes,  125g\/4½oz ‘00’ pasta flour,  salt and pepper,  50g\/1¾oz preserved truffles, finely chopped,  2 large free-range eggs, beaten,  olive oil, for frying,  1 large bunch parsley,  4 slices dried white bread ,  1 garlic clove, chopped,  sprig rosemary, leaves picked,  salt and freshly ground black pepper,  500g\/1lb 2oz Jerusalem artichokes, peeled and chopped into evenly sized cubes,  oil, for frying,  butter, for frying,  salt and freshly ground black pepper,  500g\/1lb 2oz shallots, peeled,  100g\/3½oz honey,  100ml\/3½fl oz red wine vinegar,  4 x 4-bone best end of lamb, bones removed and reserved ,  2 free-range egg whites","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/herb-crusted_lamb_with_96093"}