{"recipe_name":"Herb crusted rack of lamb with broad bean and pea ragoût","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Season the rack of lamb with salt and black pepper. Heat an ovenproof frying pan until hot, add half the olive oil and the rack of lamb, flesh side down. Cook on each side for one minute, until browned, then remove from the pan. Brush the meat with the mustard. Mix the breadcrumbs and fresh herbs together with a little salt and black pepper then press onto the mustard coated lamb. Return the lamb racks to the pan and roast in the oven for 12-14 minutes, then remove from the oven and set aside to rest while you make the ragoût. Heat a frying pan add the remaining oil, then the shallot, garlic and rosemary and fry gently over a medium heat until just softened. Add the potato and fry for 3-4 minutes until the cubes are golden on each side and just tender. Add the chicken stock and bring to a simmer, then add the broad beans and peas and cook for two minutes until tender. Whisk in the butter to thicken slightly, then season with salt and black pepper.  To serve, spoon the ragoût onto each serving plate and carve the lamb into cutlets and place on top. ","ingredients":" 2 x 6-bone racks of lamb, French-trimmed,  salt and freshly ground black pepper,  2 tbsp olive oil,  1 tbsp Dijon mustard,  5 tbsp fresh breadcrumbs,  2 tbsp finely chopped mixed fresh herbs (e.g. chives, parsley, thyme),  1 shallot, finely diced,  1 clove garlic, finely diced,  1 sprig rosemary, leaves picked and finely chopped,  1 large potato, peeled and diced,  300ml\/10fl oz chicken stock,  115g\/4oz broad beans, podded weight,  115g\/4oz fresh peas, podded weight,  50g\/2oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/herb_crusted_rack_of_72326"}