{"recipe_name":"Herb-crusted lamb with dauphinoise and hasselback potatoes","author":"Brian Turner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the herb-crusted lamb, place the breadcrumbs, three tablespoons of the olive oil, the Dijon mustard, melted butter, chopped chives and chervil into a food processor. Season well with salt and freshly ground black pepper and process until well combined. Heat an ovenproof griddle pan until hot, season the lamb chop with salt and freshly ground black pepper and rub with the remaining tablespoon of olive oil. Place into the pan and sear on both sides. Pack the herb crust onto one side of the lamb chop and transfer the griddle pan to the oven to cook for 8-10 minutes, or until cooked to your liking.  For the dauphinoise potatoes, heat the oil in a frying pan and gently fry the onion and garlic until starting to colour, about 4-5 minutes. Add the chopped potato and continue to cook for a further 3-4 minutes. Add the white wine and simmer until reduced slightly, then stir in the cream and milk and bring to a gentle simmer for 3-4 minutes, or until the potato is cooked through. Stir in the chopped fresh chives. For the hasselback potatoes, make vertical cuts widthways at regular intervals along the potatoes, until they are almost in slices but still just attached at the bottom. Heat the olive oil in an ovenproof frying pan and fry the potatoes, turning, until they start to colour. Transfer to the oven and cook until they have slightly opened up and cooked through, about 8-10 minutes. Serve the dauphinoise potatoes with the herb-crusted lamb chop on top and the hasselback potatoes to one side. ","ingredients":" 85g\/3oz white breadcrumbs,  4 tbsp olive oil,  1 tsp Dijon mustard,  2 tbsp melted butter,  3 tbsp chopped fresh chives,  3 tbsp chopped fresh chervil,  salt and freshly ground black pepper,  1 boneless lamb chop,  1 tbsp olive oil,  ½ onion, finely chopped,  1 garlic clove, finely chopped,  2 large new potatoes, chopped,  50ml\/2fl oz white wine,  50ml\/2fl oz double cream,  30ml\/1fl oz whole milk,  2 tbsp chopped fresh chives,  2 large new potatoes,  2 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/herbcrustedlambwithd_88459"}