{"recipe_name":"Herb-crusted rack of lamb with roast butternut squash with lemon and mustard","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Firstly, make the herb crust. Preheat the oven to 120\/C248F\/Gas 1. Lay the ciabatta, lemon rind, capers, anchovies, onions and olives on a baking sheet, and place them in the oven to dry out for two hours. Transfer the mixture to the bowl of a food processor fitted with a metal blade and blend until fine breadcrumbs form (about two minutes). Preheat the oven to 180C\/356F\/Gas 4. Season the lamb and then warm a large heavy-based frying pan. Add enough oil to cover the base and seal the lamb on each side with the fat (about two minutes). Brush the lamb with mustard so that it is completely covered and then roll it in the herb crust. Place the meat in a shallow baking dish and bake in the oven until medium rare, about 12 minutes, turning halfway through. Remove from the oven and leave to rest. For the butternut squash, heat the oven to 190C\/375F\/Gas 5. Cut the squash in half, scoop out the seeds, then peel and chop the flesh into even-sized chunks. Place in a bowl and add the garlic, lemon zest and juice, olive oil and half the melted butter. Toss the ingredients together then spread out in a roasting pan. Scatter over the thyme leaves and roast in the oven for about 20 minutes, until the squash feels tender when pierced with the tip of a knife. Scoop the roasted squash into a food processor or blender with the remaining butter, mustard, cream and seasoning. Blend to a smooth purée and serve. To serve, cut the lamb racks into cutlets. On each plate, arrange a few cutlets on a bed of butternut squash mixture. ","ingredients":" 200g\/7¼oz ciabatta, roughly torn ,  40g\/1½oz lemon rind, grated,  40g\/1½oz capers, rinsed,  40g\/1½oz anchovies,  40g\/1½oz onions, roughly chopped,  40g\/1½oz black olives, pitted and roughly chopped,  1 bunch parsley,  1 bunch basil,  2 racks of lamb, 8 bones in each,  vegetable oil, for frying,  2 tsp Dijon mustard,  sea salt and freshly ground black pepper,  2 butternut squash (about 650g\/1lb 7oz each),  2 garlic cloves, crushed,  2 lemons, zest and juice only,  1 tbsp olive oil,  100g\/3½oz butter, 70g\/2½oz melted and the rest chilled,  1 sprig fresh thyme, leaves only,  2-3 tbsp course-grained mustard,  5 tbsp double cream,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/herbcrustedrackoflam_73595"}