{"recipe_name":"Herbed orange couscous, seared lamb and chilli honey glaze","author":"Tony Tobin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the couscous, place the couscous into a large bowl with the stock, orange zest, coriander seeds, raisins and black pepper. Cover with a plate and leave for five minutes. Fluff the couscous with a fork, then add the orange juice and stir. Add the mint, tarragon, spring onions, red pepper and lime juice, and fluff again with a fork to combine.  For the lamb, rub the meat with a tablespoon of the oil and season with the salt and pepper.  Heat the remaining oil over a medium heat in an ovenproof frying pan. Add the lamb and cook until it is browned on all sides.  Drizzle the lamb with the honey and sprinkle it with the chilli flakes, then put it into the oven to roast for 7-8 minutes. Remove from the oven, set the lamb aside to rest, and retain the juices in the pan. Squeeze the orange juice into the same frying pan, then add the vanilla seeds. Simmer the juice over a medium heat for 3-4 minutes, until it has reduced and thickened slightly, to form a glaze. To serve, spoon a helping of the couscous onto a serving plate. Cut the lamb into three slices, and place it on top of the couscous. Drizzle with the honey chilli glaze. ","ingredients":" 200g\/7oz couscous,  250ml\/9fl oz hot chicken stock,  1 orange, zest and juice only,  1 tsp coriander seeds, crushed,  25g\/1oz raisins,  freshly ground black pepper,  2 tbsp chopped fresh mint,  1 tbsp chopped fresh tarragon,  4 spring onions, sliced,  ¼ red pepper, chopped,  1 lime, juice only,  150g\/5½oz lamb fillet,  3 tbsp olive oil,  salt and freshly ground black pepper,  2 tbsp honey,  ½ tsp chilli flakes,  1 orange, juice only,  1 vanilla pod, seeds only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/herbedorangecouscous_89355"}