{"recipe_name":"Herby couscous with butternut squash tagine and pan-fried black bream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the butternut squash tagine, heat one tablespoon of the olive oil in a frying pan over a medium heat. Add the onion and fry for 4-5 minutes. Add the garlic and fry for a further 3-4 minutes, or until softened. Add the cayenne pepper, ground ginger, ground coriander, ground cumin, cinnamon stick and ground turmeric and stir well. Continue to cook for 3-4 minutes, or until the spices are fragrant.  Add the butternut squash cubes and stir well to coat the squash in the spices. Add the chopped tomatoes, stock, preserved lemons and honey, then season, to taste, with salt and freshly ground black pepper. Bring the mixture to a simmer and cook for 3-4 minutes, or until the butternut squash is tender but still holds its shape. Heat the remaining tablespoon of oil in a frying pan over a medium heat.  Season the skin side of the black bream fillets with salt and freshly ground black pepper. When the pan is hot, add the black bream fillets, skin-side down, and fry for 2-3 minutes, or until the skin is crisp and golden-brown. Turn the black bream fillets over carefully and continue to fry for a further 1-2 minutes, then turn off the heat and leave the black bream fillets in the pan to cook on the residual heat until they're just cooked through. (NB: The black bream fillets are cooked through when the flesh is opaque.)  Meanwhile, for the herby couscous, place the couscous into a large bowl and pour over the hot chicken stock. Cover the bowl with cling film and set aside until the couscous has absorbed all of the stock, about three minutes.  Fluff up the couscous using a fork, then stir in the lemon zest, flaked almonds, chopped herbs and olive oil until well combined.  To serve, place a 6-7cm\/2-3in chefs' ring into the centre of a serving plate. Spoon a quarter of the herby couscous into the chefs' ring and pack down gently. Spoon over a quarter of the butternut squash tagine. Carefully remove the chefs' ring. Top each portion with one of the pan-fried black bream fillets. Sprinkle over the coriander cress. Repeat the process three more times to create four plates. ","ingredients":" 2 tbsp olive oil,  1 onion, peeled, finely chopped,  2 garlic cloves, peeled, finely chopped,  ½ tsp cayenne pepper,  1 tsp ground ginger,  1 tsp ground coriander,  2 tsp ground cumin,  1 cinnamon stick,  1 tsp ground turmeric,  1 butternut squash, peeled, seeds removed, cut into 1cm\/½in cubes,  200g\/7oz canned chopped tomatoes,  200ml\/7fl oz chicken stock,  3 preserved lemons, rind only, roughly chopped,  1 tbsp clear honey,  salt and freshly ground black pepper ,  4 black bream fillets, skin left on,  400g\/14oz couscous,  600ml\/1 pint 2fl oz hot chicken stock,  2 lemons, zest only,  100g\/3½oz toasted flaked almonds,  1 tbsp chopped fresh parsley,  1 tbsp chopped fresh chives,  1 tbsp chopped fresh coriander,  2 tbsp olive oil,  small handful coriander cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/herbycouscouswithbut_92552"}