{"recipe_name":"Home-cured salmon with pickled ginger and wasabi dressing","author":"Eric Chavot","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cured salmon, place the salmon fillets into a large, deep dish. In a bowl, mix together all of the remaining cured salmon ingredients until well combined. Place the salmon fillets into a large deep dish and pour the curing mixture all over it.  Place a second, slightly smaller dish on top of the salmon fillets and place a heavy object, such as a bag of sugar, into the second dish to flatten the salmon fillets. Cover the dish with cling film, then transfer the dish with the salmon fillets to the fridge and leave to cure for 1-2 days, turning the salmon fillets twice a day (about eight hours apart). When the salmon fillets have cured, rinse away the curing liquid and pat the salmon fillets dry using kitchen paper. Carve the salmon fillets into thin slices, then chill in the fridge, covered, until needed. For the wasabi dressing, blend the egg yolks, egg whites, English mustard, wasabi paste, white balsamic vinegar, rice wine vinegar and caster sugar to a purée in a food processor. With the motor still running, gradually add the olive oil and grapeseed oil to the purée, one after the other, in a thin stream, until the dressing mixture thickens. Season, to taste, with salt and freshly ground black pepper, then set aside. For the dill oil, blend the dill oil ingredients in a clean food processor to a very fine purée. Set aside. For the salad, using a melon baller, carve 20 balls from the peeled cucmbers. Place the cucumber balls into a bowl and drizzle over two tablespoons of the olive oil and all of the sparkling water. Season, to taste, with salt and freshly ground black pepper. Cover the bowl and microwave on full power for one minute. Drain the liquid from the bowl. Add the cooked potato cubes to the drained cucumber balls, then pour over a little of the lemon vinaigrette and mix well to coat the cooked vegetables. Heat one tablespoon of the olive oil in a frying pan over a medium heat. Add the focaccia cubes and fry for 1-2 minutes on all sides, or until they become crisp and golden-brown croûtons.  Heat the caster sugar in a separate, non-reactive pan over a low to medium heat. When the sugar has melted and caramelised, add the focaccia croûtons and stir well to coat them in the melted sugar.  Add the lemon zest, lemon juice and the remaining tablespoon of olive oil and stir to coat the croûtons. To serve, drain the fennel slices and pat dry with kitchen paper. Brush four serving plates with the wasabi dressing, then sprinkle over the pickled ginger and drained fennel slices and dot with the wasabi fish roe. Divide the salad equally among the plates and top with a serving of cured salmon slices. Sprinkle over the croûtons, chopped dill, shiso cress and tahoon cress. Drizzle the dill oil around the edge of the plate. ","ingredients":" 1kg\/2lb 2oz salmon fillet, trimmed, skin scored with a sharp knife, cut into four equal-sized fillets ,  110g\/4oz good quality sea salt flakes,  110g\/4oz fine sea salt,  200g\/7oz caster sugar,  1 tsp coriander seeds,  1 tsp black peppercorns,  1 lemon, zest and juice,  ½ orange, zest and juice,  200ml\/7fl oz water       ,  small bunch dill, chopped,  2 free-range egg yolks,  3 free-range egg whites,  50g\/2oz English mustard ,  50g\/2oz wasabi paste ,  75ml\/3fl oz white balsamic vinegar,  1 tbsp rice wine vinegar,  2 tsp caster sugar,  110ml\/4fl oz olive oil ,  110ml\/4fl oz grapeseed oil ,  salt and freshly ground black pepper ,  200g\/7oz dill, roughly chopped,  110ml\/4fl oz vegetable oil ,  110ml\/4fl oz olive oil ,  2 cucumbers, peeled,  4 tbsp olive oil,  50ml\/2fl oz sparkling water,  salt and freshly ground black pepper ,  75g\/3oz Charlotte potatoes, cooked, drained, cut into 1cm\/½in cubes,  4-5 tbsp ready-made lemon vinaigrette,  2 medium-sized, ready-made focaccia, cut into 30 1cm x 2.5cm\/½in x 1in cubes,  50g\/2oz caster sugar,  1 lemon, zest and juice,  40g\/1½oz pickled ginger,  40g\/1½oz fennel, very finely sliced, set aside in a bowl of iced water,  10g\/½oz wasabi-flavoured fish roe (available from specialist Japanese suppliers),  small bunch dill, chopped,  1 x 20g\/¾oz punnet shiso cress (available from specialist suppliers and online),  1 x 20g\/¾oz punnet tahoon cress (available from specialist suppliers and online)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/homecuredsalmonwithp_91466"}