{"recipe_name":"Homemade gravad lax with cucumber salad and mustard sauce","author":"Simon Hopkinson","programme":"The Good Cook","prep_time":"overnight","cooking_time":"no cooking required","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/homemade_gravadlax_with_08463_16x9.jpg","method":"To cure the salmon, blend together the sugar, salt, alcohol, white pepper and dill in a food processor to make a paste. Place half of the mixture into a container that will accommodate the fish snugly (say the plastic container the fish was bought in). Lay the salmon on top of this flesh-side down, press it down, then cover with the other half of the mixture, smearing it well over the surface of the fish. Secure with a lid or cling film and leave to chill in the fridge for 48 hours, turning the fish occasionally, until firm to the touch.  For the cucumber salad, mix all the ingredients together in a bowl and leave to macerate for an hour in the fridge. Drain off the liquid, put the cucumber into a serving dish and chill in the fridge. The salad should be served really cold. For the sauce, mix the mustard, lemon juice, sugar, salt, pepper and dried dill in a bowl until well combined. Gradually whisk in the oil until you have a loose, thick dressing. You may need a little more oil. Pour into a small serving bowl. Carefully rinse the fish under cold running water, but not so much that no remnants of dill remain. Dry with kitchen paper. Thinly slice the gravad lax at an angle and present on a large serving dish. Serve alongside the cucumber salad and the mustard sauce with buttered rye bread. ","ingredients":" 85g\/3oz caster sugar ,  70g\/2½oz flaky sea salt,  2 tbsp schnapps, gin or vodka,  2 tsp freshly ground white pepper ,  100g\/3½oz fresh dill ,  500g\/1lb 2oz centre-cut salmon fillet, skin on, bones removed,  1 large cucumber, peeled, thinly sliced ,  1 tsp sea salt,  2 tsp caster sugar ,  freshly ground white pepper ,  1-2 tbsp white wine vinegar ,  3 tbsp Dijon mustard,  squeeze lemon juice,  2 tsp caster sugar,  1-2 tsp dried dill ,  salt and pepper,  2-3 tbsp sunflower oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/homemade_gravadlax_with_08463"}