{"recipe_name":"Baked egg custard with summer fruits","author":"Antony Worrall Thompson","programme":"Great British Menu","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/325F\/Gas 3.  For the baked custard, heat the cream and milk together until boiling, then remove from the heat.  Beat the egg yolks and half the honey together, then pour in the hot cream. Strain into a jug.  Drizzle the remaining honey into 4 non-stick dariole moulds, grate a little nutmeg on top of the honey, then pour in the custard. Sprinkle the top with a little more nutmeg. Place the dariole moulds on a baking tray and pour in hot water to come halfway up the sides of the moulds. Place in the oven and bake for 50-60 minutes or until just set.  Remove the moulds from the water and allow to cool. Refrigerate until half an hour before serving. For the sauce, purée the raspberries with the lemon and orange juices in a blender until smooth. Pass through a fine sieve into a non-reactive saucepan. Discard the pips.  Add the sugar and red wine and bring to the boil over a moderate heat. Reduce the heat and simmer until the liquid is reduced to about 300ml\/10fl oz. Skim off any scum that may come to the surface and discard. Set aside in a cool place until ready to use. For the compote, place the fruit in a non-reactive pan and cook for 3 minutes. Remove from the heat and allow to cool, then add the crème de framboise. Using a slotted spoon, spoon the fruit into four dariole moulds lined with cling film. Cover with the overhanging cling film, then weigh down each with a light weight to compress the fruit. Leave overnight. To serve, turn the custards out onto four plates. Turn out the fruit compotes beside the custard, then add a swirl of the raspberry sauce. ","ingredients":" 400ml\/14fl oz double cream,  175ml\/6fl oz full-fat milk,  6 free-range egg yolks,  6 tbsp runny honey,  freshly grated nutmeg,  450g\/1lb ripe raspberries ,  2 lemons, juice only,  1 orange, juice only,  175g\/6oz caster sugar,  1 750ml\/1¼ pints bottle red wine,  450g\/1lb raspberries,  55g\/2oz redcurrants, hulls removed,  55g\/2oz blackcurrants, hulls removed,  85ml\/3fl oz crème de framboise","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakedeggcustardwiths_81729"}