{"recipe_name":"Homemade jaffa cakes","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 12 cakes","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/homemadejaffacakes_91480_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. For the cakes, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the eggs and sugar to the bowl and beat continuously for 4-5 minutes, or until the mixture is pale, fluffy and well combined.  Add the flour, beating continuously, until a thick, smooth batter forms.  Half-fill each well in a 12-hole muffin tin with the cake batter. Transfer the tin to the oven and bake the cakes for 8-10 minutes, or until pale golden-brown and cooked through (the cakes are cooked through when a skewer inserted into the centre of the cakes comes out clean.) Remove from the oven and set the cakes aside, still in their tray, until cool.  Meanwhile, for the filling, in a bowl, mix together the jelly, marmalade and boiling water until the jelly has dissolved and the mixture is smooth. Pour the filling mixture into a shallow-sided baking tray or large dish to form a 1cm\/½in layer of jelly. Set aside until completely cooled, then chill in the fridge until set.  When the jelly has set and the cakes have cooled, cut small discs from the layer of jelly, equal in diameter to the cakes. Sit one jelly disc on top of each cake.  Bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the chocolate and stir until melted, smooth and glossy, then pour over the cakes. Set aside until the melted chocolate has cooled and set. ","ingredients":" 2 free-range eggs,  50g\/2oz caster sugar,  50g\/2oz plain flour, sieved,  1 x 135g\/4¾oz packet orange jelly, chopped,  1 tbsp orange marmalade,  125ml\/4½fl oz boiling water ,  200g\/7oz good quality dark chocolate, minimum 70 per cent cocoa solids, broken into pieces","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/homemadejaffacakes_91480"}