{"recipe_name":"Honey confit of duck with Puy lentils","author":"James Martin","programme":"2007-16","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the honey confit of duck, preheat the oven to 140C\/275F\/Gas 1. Mix the salt, herbs and garlic in a bowl with the duck legs to coat them. Cover the bowl and leave for 24 hours in the fridge. Rinse the duck legs and wash the salt mix off the duck. Place in an ovenproof saucepan with a lid and add the duck fat and bay leaves. Bring to a simmer, then put the lid on and cook in the oven for 2½ hours. Remove the duck from the fat and set aside. For the Puy lentils, heat a sauté pan or a large frying pan then add the butter and oil. Once hot, add the onion and cook for two minutes. Add the garlic, carrot, celery and leek and cook for a further two minutes. Add the lentils and red wine and bring to the boil. Cook until the wine has reduced by half then add the stock and cook the lentils for 25-30 minutes. Mix in the sherry vinegar and coriander. To finish the duck legs, heat the oil in a frying pan, once hot add the honey. Cook the duck legs in the honey for two minutes basting the legs all the time. To serve, place a pile of the lentils on the plate with a leg next it, and crumble the cooked pancetta on top of the lentils. ","ingredients":" 4 duck legs,  15g\/½oz table salt per kilo of duck legs,  2 tsp thyme leaves,  2 tsp finely chopped rosemary,  2 garlic cloves, finely chopped,  600ml\/20fl oz duck fat,  2 bay leaves,  2 tbsp olive oil,  4 tbsp honey,  50g\/1¾oz unsalted butter,  2 tbsp olive oil,  1 onion, finely chopped,  1 garlic clove, finely sliced,  1 small carrot, finely chopped,  1 stick celery, finely chopped,  ¼ leek, finely chopped,  300g\/10½oz Puy lentils,  175ml\/6fl oz red wine,  450ml\/16fl oz beef stock,  2 tbsp good sherry vinegar,  2 tbsp chopped fresh coriander,  4 slices pancetta, cooked","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honey_confit_of_duck_58484"}