{"recipe_name":"Honey mustard chicken with avocado and tomato salsa and hummus sauce","author":"Lesley Waters","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, cut the chicken breasts into finger-length strips.  In a bowl, combine the mustard, honey and lemon juice. Add the chicken strips to the mixture and season with black pepper. Heat the rapeseed oil in a wok or large frying pan until very hot. Add the chicken strips and and stir-fry for 5-6 minutes, or until golden-brown and cooked through.  For the avocado and tomato salsa, place the diced avocado in a bowl and squeeze over the lime juice. Add the remaining ingredients to the bowl and season with a little salt and lots of freshly ground black pepper For the hummus sauce, place the chickpeas, tahini paste and garlic in a food processor and blend until smooth. Add the lemon juice, olive oil and two tablespoons of water.  Blend again until very smooth. Stir in the yoghurt and season generously with salt and pepper. Serve the chicken with the warm pitta breads, avocado and tomato salsa and hummus sauce.  ","ingredients":" 4 large skinless and boneless chicken breasts,  6 tbsp wholegrain mustard,  2 tbsp clear honey,  2 lemons, juice only,  freshly ground black pepper,  2 tbsp rapeseed oil,  8 warm pitta breads ,  2 large ripe avocados, stoned, peeled and diced (1cm\/½in cubes),  1 lime, juice only,  2 shallots, finely chopped,  8 cherry tomatoes, quartered,  1 large red chilli, seeds removed, finely chopped,  1 garlic clove, finely chopped,  pinch sugar,  1 tbsp extra virgin olive oil ,  salt and freshly ground black pepper,  410g\/14oz can chickpeas, drained and rinsed,  4 tbsp tahini paste,  2 garlic cloves, roughly chopped,  1 lemon, juice only,  8 tbsp extra virgin olive oil,  3 tbsp Greek yoghurt,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honey_mustard_chicken_09043"}