{"recipe_name":"Honey, pears and madeleines","author":"Brian Turner","programme":"A Taste of Britain","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 12 madeleines","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a heavy-based saucepan, melt the 85g\/3oz butter and 2 tablespoons honey together gently, then set aside. Put the eggs in a large bowl, then add the caster sugar, brown sugar, vanilla seeds and salt. Whisk until doubled in size. Sieve together the flour and baking powder. Carefully fold the flour into the egg mixture using a large metal spoon. Gently pour the melted butter and honey down the side of the bowl and carefully fold it in. Cover with cling film and chill in the fridge for 30 minutes. Meanwhile, preheat the oven to 220C\/425F\/Gas 7. Brush 12 madeleine moulds with a little melted butter, then dust them with flour. Put the batter into a piping bag with a 1.5cm\/½in plain nozzle fitted. Pipe a fat, solid line down the centre of each mould, being careful not to overfill it. Bake for 5-8 minutes, depending on size, until golden-brown. Keep your eye on them as they cook quickly. Take the madeleines out of moulds immediately and set aside to cool on a wire rack. Meanwhile, for the pears, melt the butter in a saucepan, add the pears and then the honey and wine. Poach for 5-10 minutes, or until the pears are just cooked, then remove from the pan using a slotted spoon and put to one side.  Increase the heat and reduce the cooking liquor down in volume until it becomes a syrup. Return the pears to the pan to coat them in the syrup. Serve the pears with the madeleines. ","ingredients":" 85g\/3oz unsalted butter, plus 1 tbsp melted butter for brushing,  2 tbsp honey,  2 large free-range eggs,  55g\/2oz caster sugar,  2 tsp soft brown sugar,  1 vanilla pod, seeds only,  pinch salt,  85g\/3oz plain white flour, plus extra for dusting,  ½ tsp baking powder,  55g\/2oz butter,  2 pears, peeled and cut into small dice,  2 tbsp honey,  150ml\/5fl oz sweet white wine","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honey_pears_and_91279"}