{"recipe_name":"Honey roast duck with cabbage, smoked bacon, roast garlic, girolle mushrooms and spiced jus","author":"Michael Caines","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 4. For the duck sauce, place the duck carcasses in a roasting tray and cook in the oven for 20-30 minutes. Just before they finish roasting, sprinkle the bones with the Chinese five-spice.  Remove the carcasses from the oven and place over a low heat on the hob. Add the onions and garlic. Cook until the onions are translucent and just starting to colour. Add the thyme.  Remove the bones and set them aside to cool. Deglaze the roasting tin with the chicken stock. Set aside In a saucepan, bring the honey to a rolling boil and cook for three minutes (be careful not to burn the honey as it will make the sauce bitter). Add the vinegar and cook until the volume of liquid has reduced by a third.  Add the cooled duck carcasses and chicken stock to the pan, along with the veal stock, peppercorns and cream. Bring to the boil and skim off the scum from the surface. Reduce the heat to a simmer and cook for 30 minutes.  Strain the sauce through a colander and then pass through a fine sieve to remove any fragments of bone. Return to the pan, bring to the boil and cook until reduced to a sauce consistency. Season with salt.  For the duck breasts, using a sharp knife score the fatty skin of the duck breast in a criss-cross pattern, but be careful not to cut the meat. Season with salt and pepper. Heat a little oil in a heavy-bottomed frying pan and add the duck breasts skin-side down. Cook at a fairly high temperature so that the skin renders out the fat, but take care not to burn the skin.  When the skin is golden-brown and crisp, turn the breast over and cook the other side for a minute before returning it once more to its skin side. Crisp the skin a little more before turning the breast onto its other side again and finish cooking to your liking.  Meanwhile, put the garlic cloves in a pan of cold water and bring to the boil, refresh in cold running water and repeat twice more. Once the duck is cooked, remove it from the pan and brush the honey and five-spice over the crisp skin. Set aside in a warm place to rest before serving.  Place the garlic cloves in a heavy-bottomed pan with a little butter and season with salt and pepper. Cook slowly until soft and lightly golden-brown then add the blanched celeriac into the pan to warm through.  For the savoy cabbage, add the cabbage to a pan of boiling salted water and cook until tender (about 3-4 minutes). Refresh in ice-cold water. Drain well and pat dry.  In a frying pan, gently fry the finely chopped shallots in the butter until translucent, then add the smoked bacon. Add the cooked cabbage and cook until dry and the bacon is crisp. Stir in the garlic purée and season, to taste, with salt and pepper.  To serve, heat the butter small frying pan and, once hot, add the mushrooms and gently fry for a minute. If necessary, reheat the duck in a low oven for a few minutes, and then slice thinly. Place the cabbage down the middle of the serving plates and place the duck on top. Add the celeriac and garlic around the outside of the duck and then pour over the sauce.  ","ingredients":" 1kg\/2lb 4oz duck carcasses, chopped into small pieces,  5g Chinese five-spice powder,  1 large onion, cut into thick rings ,  ½ garlic bulb,  15g\/½oz fresh thyme leaves ,  700ml\/1¼ pint chicken stock ,  100g\/3½oz clear honey ,  50ml\/1¾fl oz sherry vinegar ,  300ml\/10½fl oz veal stock,  5g white peppercorns ,  50ml\/1¾fl oz cream ,  2g salt ,  4 x 180g\/6oz duck breasts, chilled in the refrigerator,  salt and pepper,  vegetable oil, for frying,  12 garlic cloves, peeled and left whole,  2 tbsp clear honey mixed with pinch of Chinese five-spice powder ,  1 tbsp butter,  ½ celeriac, peeled, finely chopped and blanched ,  350g\/12oz savoy cabbage, sliced,  4g finely chopped shallots,  40g\/1½oz unsalted butter,  40g\/1½oz smoked back bacon, chopped,  20g\/¾oz garlic purée,  salt and freshly ground black pepper,  50g\/1¾oz unsalted butter,  80g\/3¾oz girolle mushrooms ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honey_roast_duck_with_20554"}