{"recipe_name":"Honey roasted duck confit with Puy lentils, mashed potatoes and celery leaves","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 140C\/120C Fan\/Gas 1. Mix the salt, thyme and garlic in a large bowl. Coat the duck legs with the mixture then place on a tray with any remaining mixture on top and underneath. Refrigerate for 24 hours. Rinse the duck legs under cold running water to wash away the salt mixture.  Place the duck in a flameproof casserole with a lid and add the duck fat and bay leaves. Bring to a simmer, then put the lid on and cook in the oven for 2½ hours. Remove the duck from the fat and set aside. Discard the fat. For the Puy lentils, heat the oil in a sauté pan or a large frying pan. Once hot, add the pancetta and shallot and cook for 2 minutes. Add the garlic, carrot, celery and leek and cook for a further 2 minutes. Add the lentils and red wine and bring to the boil. Cook until the volume of liquid has reduced by half. Add the stock and cook for 25-30 minutes. When the lentils are tender, stir in the sherry vinegar and parsley. Place the potatoes in a large pan of salted water and bring to the boil. Reduce the heat and simmer for 12-15 minutes, or until the potatoes are tender. Drain and return the potatoes to the pan. Place over the heat for a minute to drive off any excess moisture. Pass through a potato ricer or mash thoroughly until smooth. Stir in the butter and cream, beating until smooth. To finish the duck confit, heat the olive oil in a frying pan. Once hot, add the honey and the duck legs. Cook the duck for 2 minutes on each side, basting all the time. Divide the lentils and mashed potatoes between serving plates. Serve the duck legs on top of the Puy lentils and garnish with celery leaves. ","ingredients":" 15g\/½oz sea salt ,  2 tsp finely chopped thyme leaves,  2 garlic cloves, finely chopped,  4 duck legs,  600ml\/20fl oz duck fat,  2 bay leaves,  2 tbsp olive oil,  4 tbsp honey,  4 tbsp celery leaves, to garnish ,  2 tbsp rapeseed oil,  100g\/3½oz pancetta, diced,  2 shallots, finely chopped,  1 garlic clove, finely chopped,  1 small carrot, finely chopped,  1 stick celery, finely chopped,  ¼ leek, finely chopped,  300g\/10½oz Puy lentils,  175ml\/6fl oz red wine,  450ml\/16fl oz veal jus or stock,  2 tbsp good-quality sherry vinegar,  2 tbsp chopped fresh parsley,  1kg\/2lb 4oz floury potatoes, peeled and cut into chunks,  125g\/4½oz butter,  125ml\/4fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honey_roasted_duck_49176"}