{"recipe_name":"Honey and black pepper-glazed duck breast with fragrant rice and pepper chilli sauce","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To prepare the duck breast, place the meat skin-side down on a board and with a sharp knife, trim off the sinew and the excess fat from the breast. Now turn it over and score lines into the skin in a cross-hatch pattern. Season the duck breast on both sides with freshly ground black pepper and a pinch of sea salt. Place the duck skin-side down into a cold ovenproof frying pan and set over a medium heat. As the fat begins to render during cooking, tip it off into a bowl. When the skin is browned, drizzle over the honey and place the pan into the oven. Roast for about 12-15 minutes, or until the meat is cooked. Remove the duck from the pan and set aside to rest for a few minutes. Put the pan back on the heat, pour in the red wine and scrape up the bits from the bottom of the pan with a wooden spoon. Simmer for 3-4 minutes, or until slightly reduced. Stir in the butter. For the fragrant rice, heat the oil in a pan and gently fry the onion and garlic for 5-7 minutes until translucent. Add the turmeric and crushed coriander seeds and stir. Tip in the rice and stir to coat the grains with the oil. Pour in the water and season with salt and freshly ground black pepper. Bring to the boil, then turn the heat down to a simmer and cook for 10-12 minutes, or until the rice is tender. For the pepper chilli sauce, heat the oil in a pan and gently fry the onion and garlic for 5-7 minutes. Add the pepper and chilli and continue cooking until they are beginning to soften, about 3-4 minutes. Pour over the stock, season with salt and freshly ground black pepper and bring to the boil. Simmer for around 8-10 minutes. Process the sauce with a hand-held blender until smooth. To serve, spoon some of the fragrant rice onto a serving plate. Cut the duck into four slices diagonally and arrange them on top, drizzling over the glaze from the pan. Finally spoon the pepper chilli sauce around the outside of the plate. ","ingredients":" 1 duck breast, skin on,  salt and freshly ground black pepper ,  2 tbsp clear honey,  2 tbsp red wine,  25g\/1oz butter,  1 tbsp olive oil,  ½ onion, cut into wedges,  1 garlic clove, roughly chopped,  1 tsp ground turmeric,  ½ tsp coriander seeds, crushed,  200g\/7oz basmati rice,  300ml\/½ pint boiling water,  salt and freshly ground black pepper ,  1 tbsp olive oil,  ¼ onion, finely chopped,  1 garlic clove, finely chopped,  ½ red pepper, chopped,  1 fresh red chilli, seeds removed, finely chopped,  150ml\/¼ pint vegetable stock","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyandblackpepperg_88175"}