{"recipe_name":"Honey and soy-roasted pork with cashew nut crust on pineapple 'carpaccio' and crisp cabbage","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the honey and soy-roasted pork, season the pork all over with salt and freshly ground black pepper. Heat the oil in an ovenproof frying pan, add the pork and garlic and fry the pork, turning frequently, until lightly browned on all sides. Transfer the frying pan to the oven and cook the pork for five minutes, or until almost cooked through. Remove the pan from the oven and put back on the heat. Add the soy sauce and honey to the pan and fry for one minute. Remove the pork from the pan and roll in the crushed cashew nuts to coat on all sides. Return to the pan and fry for one minute on each side, then set aside to rest in a warm place. For the crisp cabbage, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully place the sliced cabbage into the oil and deep fry for 2-3 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. To serve, place the pineapple slices onto a serving plate. Slice the pork and place it on top of the pineapple 'carpaccio'. Top with the crisp cabbage and garnish with orange wedges. ","ingredients":" 150g\/5½oz pork tenderloin,  salt and freshly ground black pepper ,  2 tbsp olive oil,  1 garlic clove, lightly crushed,  1 tbsp soy sauce,  1 tbsp honey,  85g\/3oz cashew nuts, crushed,  300ml\/10fl oz vegetable oil, for deep frying,  ¼ savoy cabbage, very finely sliced,  ½ pineapple, peeled and very thinly sliced,  1 orange, cut into wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyandsoyroastedpo_85573"}