{"recipe_name":"Honeycomb ice cream with pistachio shortbread","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the honeycomb, place the sugar and golden syrup into a pan over a low heat and warm until the sugar dissolves. Increase the heat and cook until a golden-brown caramel is formed. The longer you heat the caramel the darker it becomes - don't cook it too long as it should be golden-brown. Add the bicarbonate of soda and stir well, then pour onto a greased, lined baking tray and allow to cool. For the ice cream, whip the cream until it becomes thick, but not fully whipped. Carefully fold in the vodka and condensed milk and whisk the cream mixture until stiff peaks form when the whisk is removed. Break up the honeycomb into small pieces and fold gently into the cream mixture. Transfer the ice cream mixture into a freezer container and freeze for at least eight hours; there is no need to churn this ice cream. For the pistachio shortbread, preheat the oven to 180C\/365F\/Gas 4. Place the butter and sugar into a clean bowl and beat together until light and combined. Add the flour and processed pistachios and mix well. Pour the shortbread mixture out onto a greased, lined baking sheet. Use a knife to score 5cm\/2in x 7cm\/3in rectangles into the mixture, then place into the oven to bake for 8-10 minutes, or until cooked and golden. Remove the shortbread from the oven and allow to cool on a wire rack. Turn out of the baking tray and break or cut into the pre-marked rectangles. To serve, place two scoops of honeycomb ice cream into each bowl and place two pieces of shortcake on top or alongside. ","ingredients":" 75g\/3oz caster sugar,  2 tbsp golden syrup,  2 tbsp bicarbonate of soda, sifted,  600ml\/1 pint double cream,  3 tbsp vodka,  200ml\/7fl oz condensed milk,  350g\/12oz unsalted butter,  150g\/5oz caster sugar,  500g\/1lb 2oz plain flour,  150g\/5oz pistachio nuts, shells removed, blended until fine in a food processor","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeycombicecreamwit_86476"}