{"recipe_name":"Honey-glazed duck served with coriander and mango couscous","author":"Garrey Dawson","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Season the scored duck breast with salt and freshly ground black pepper. Heat an ovenproof pan until smoking hot, add the duck breast, skin side down and fry for 3-4 minutes, or until golden-brown. Turn the duck breast over and transfer the pan into the oven to roast for five more minutes.  Remove from the oven and drizzle the duck breast with the honey and insert the cloves into the skin. Return to the oven for five minutes, or until the duck is cooked but still slightly pink in the middle. Remove from the oven and rest in a warm place for five minutes, discard the cloves and slice the meat thinly. For the coriander and mango couscous, heat the olive oil in a saucepan, add the couscous and fry for 2-3 minutes. Add enough stock to the pan to just cover the couscous, and add the chilli flakes, mango and coriander. Season, to taste, with salt and freshly ground black pepper and stir well. Leave for 2-3 minutes or until the couscous grains have soaked up the liquid and are light and fluffy. Fluff up the couscous with a fork.  To serve, spoon the couscous into the middle of a serving plate and place the thinly sliced duck in a fan shape around the side. Drizzle any pan juices over the duck. ","ingredients":" 1 duck breast, skin scored,  salt and freshly ground black pepper,  1 tbsp clear honey,  3 cloves,  1 tbsp olive oil,  150g\/5½oz couscous,  300ml\/½ pint hot chicken stock,  pinch chilli flakes,  ½ mango, peeled, stone removed, diced,  2 tbsp chopped fresh coriander,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyglazedduckserve_88148"}