{"recipe_name":"Honey glazed gammon with potato and carrot mash","author":"Ed Baines","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place a large flameproof casserole dish on a low heat and gently melt the butter with the olive oil.   Add the gammon and seal until golden on both sides, about ten minutes.  Remove the gammon and place to one side. Now add the garlic, onions and apple to the casserole and cook until the onion is translucent.  Add the flour and cook for one minute.   Add the cider, bring to boil and reduce by half.   Then add the piccalilli, honey, sage leaves and mustard, and cook for five minutes.  Season. Now put the gammon steaks back into the casserole, squeeze in the lemon juice and pour in the stock.   Add another good pinch of salt and pepper, cover and simmer for a further 20-30 minutes. For the mash, half-fill a pot with water (about two litres\/3½ pints), add salt, cover and bring to boil.   Add the potatoes and carrots to the boiling water, together with the sugar and garlic.  Boil for 20 minutes on a moderate heat until the vegetables are tender.   Drain and mash vigorously, mix in the olive oil, chopped parsley, a squeeze of lemon juice, and seasoning to taste. Return to a low heat and stir gently for 2-3 minutes.   Serve the mash with the gammon. ","ingredients":" 60g\/2½oz butter,  2 tbsp olive oil,  4 gammon steaks, each about 175g\/6oz,  1 garlic clove, chopped,  1 Spanish onion, finely chopped,  1 eating apple, peeled, cored and diced,  30g\/1oz flour,  500ml\/17fl oz dry cider,  2 tbsp piccalilli,  1 tsp honey,  4 sage leaves,  1 tsp Dijon mustard,  salt,  freshly ground black pepper,  ½ lemon, juice only,  150ml\/5fl oz meat or vegetable stock,  4 large potatoes, quartered,  2 large carrots cut into chunks,  1 tsp sugar,  2 garlic cloves, peeled,  2 tbsp olive oil,  a handful of chopped parsley,  ½ lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyglazedgammonwit_71920"}