{"recipe_name":"Honey-glazed pork belly with stir-fried garlic, sesame Chinese leaves and oyster mushrooms","author":"Galton Blackiston","programme":"Put Your Money Where Your Mouth Is","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the glazed pork, preheat the oven to 160C\/320F\/Gas 3. Heat the vegetable oil in a wok and fry the pork until browned on all sides.  Transfer the pork and all the remaining glazed pork ingredients (except the honey) into a casserole dish with a lid. Place over a medium heat and bring to the boil. Once boiling, cover with the lid and place the casserole in the oven for one hour. For the oyster mushrooms, combine all the ingredients in a bowl and leave to stand (covered) for at least one hour. To continue the glazed pork, remove the pork from the cooking liquid and place to one side. Add the honey to the liquid in the casserole and boil rapidly to reduce in volume by two-thirds.  Increase the heat of the oven to 220C\/430F\/Gas 7. Place the pork belly onto a roasting tray, brush with the reduced cooking liquid and place in the oven. Cook the pork for about 15 minutes, basting regularly until the meat has a lacquered appearance. For the garlic and sesame Chinese leaves, heat the vegetable oil in a wok until smoking. Add the garlic and fry for 30 seconds. Add the kai lan (or Tenderstem broccoli) and stir fry for a further minute. Just before serving, add the sesame oil and the oyster sauce. Serve the pork with the oyster mushrooms, garlic and sesame Chinese leaves and steamed sticky rice on the side. ","ingredients":" vegetable oil, for frying,  1kg\/2lb 3¼oz pork belly, rind removed, cut into 4 equal pieces,  200ml\/7¼fl oz soy sauce,  200ml\/7¼fl oz water,  3 garlic cloves, peeled and crushed,  4 star anise,  2 cinnamon sticks, broken up,  ½ orange, zest only,  150ml\/5½fl oz clear honey,  200g\/7¼oz oyster mushrooms, sliced very finely,  1 lemon, juice only,  1 tbsp soy sauce,  1 tsp sesame oil,  2 tbsp vegetable oil,  2 garlic cloves, peeled and thinly sliced,  1 tbsp sesame oil,  500g\/1lb 1½oz kai lan (Chinese broccoli, substitute Tenderstem broccoli if none available), blanched in a pan of boiling water and refreshed in cold water,  3 tbsp oyster sauce,  steamed sticky rice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyglazedporkbelly_91253"}