{"recipe_name":"Honey-glazed pork stuffed with mushrooms with fried rosemary and garlic sweet potatoes","author":"Gino D'Acampo","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the stuffed pork, remove some of the fat and rind from the chop with a sharp knife. Place the pork chop between two pieces of cling film.  Flatten out the pork with a meat mallet or the end of a rolling pin until 1cm\/¼in thick. With a sharp knife cut a slit in the rind side of the pork chop to make a pocket. Heat a tablespoon of the olive oil in a small frying pan, add the sliced mushroom and chilli flakes and cook for three minutes.  Remove the pan from the heat and leave the mushroom mixture to cool.  Once cool enough to handle fill the pocket of the pork with the mushroom mixture.  Heat the remaining tablespoon of olive oil in the frying pan.  Add the pork and cook on both sides for five minutes or until golden-brown.  Add the soy sauce and clear honey and cook for 1-2 minutes, or until the pork is completely cooked through. Remove the pan from the heat, cover it in tin foil and leave the pork to rest for five minutes. For the fried sweet potatoes, the heat the vegetable oil in a small frying pan, add the sweet potatoes and fry for six minutes.  Add the garlic and rosemary and season well with salt and freshly ground black pepper and cook for a further 1-2 minutes or until golden-brown and cooked through. To serve, place the potatoes on a clean plate and top with the stuffed pork chop. ","ingredients":" 225g\/8oz  pork chop,  2 tbsp olive oil,  1 large flat mushroom, sliced,  pinch dried chilli flakes,  2 tsp soy sauce,  1 tbsp clear honey,  1 tbsp vegetable oil,  1 sweet potato, peeled and sliced into discs,  1 garlic clove, sliced,  1 sprig fresh rosemary, leaves picked,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyglazedporkstuff_84594"}