{"recipe_name":"Honey-roast duck with sautéed potatoes, chilli spinach and plum chutney","author":"Gino D'Acampo","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the sautéed potatoes, boil the potatoes for ten minutes, until soft, then drain and slice in half lengthways. Heat the oil in a frying pan over a medium heat. Add the garlic and rosemary and fry for one minute. Add the slices of potato and sauté for eight minutes, turning once, until golden on both sides. To make the chutney, heat the oil in a frying pan over a medium heat. Add the onions and fry for five minutes until softened. Add the brown sugar and plums and cook to caramelise with the onions for two minutes. Add the red wine and lime juice, bring to the boil and simmer to reduce to a thick chutney consistency. For the duck, rub the duck with the oil and season well with salt and freshly ground black pepper. Place a frying pan over a medium heat. When hot, add the duck skin-side down and fry for five minutes, to release some of the duck fat. When the skin has browned, pour off the excess duck fat, then turn the breast and cook for a further three minutes. Drizzle over the honey and cook for a further two minutes, or until cooked to your liking. Remove from the heat and allow to rest on a warm plate for two minutes. For the spinach, heat the oil in a frying pan over a medium heat. Add the onions, garlic and chilli and fry for 3-4 minutes, until softened. Add the spinach and sauté for 4-5 minutes, until wilted down. Drain any excess moisture from the spinach and season, to taste, with salt and freshly ground black pepper. To serve, place the spinach in the centre of a warm plate. Place the duck breast on top of the spinach, arrange the sautéed potatoes around the plate and spoon over the chutney. ","ingredients":" 250g\/9oz new potatoes,  1 tbsp olive oil,  2 cloves garlic, roughly chopped,  25g\/1oz fresh rosemary leaves,  1 tbsp olive oil,  ½ red onion, finely sliced,  1 tbsp brown sugar,  2 plums, stones removed and chopped,  100ml\/2½ fl oz red wine,  1 lime, juice only,  salt and freshly ground black pepper,  1 duck breast, skin scored,  1 tbsp olive oil,  salt and freshly ground black pepper,  2 tbsp honey,  75g\/2¾oz spinach,  1 tbsp olive oil,  1 clove garlic, finely chopped,  pinch dried chilli flakes,  ½ red onion, finely sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyroastduckwithsa_80925"}