{"recipe_name":"Honey-roast duck with spiced Puy lentils","author":"James Martin","programme":"Stately Suppers","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. To make the lentils place the onion, garlic, ginger and chilli in a blender with the ground spices, and a drop of water. Blend to a paste, then fry the paste in a little butter for a few minutes, stirring all the time. Add the lentils and wine and simmer gently for 20-25 minutes until the lentils are cooked.  Meanwhile, for the duck, place a dry large frying pan on the heat. Add the honey and cook over a low heat until golden and bubbling.  Place the duck breasts in the pan, skin-side down. Season with salt and freshly ground black pepper and move around in the pan, using tongs, to coat the duck breasts in the honey. Transfer the duck breasts to a roasting tin, skin-side up. Pour the honey from the pan over the top. Place in the oven for 8 minutes or more, until cooked to your liking, then remove and allow to rest before slicing. Remove the lentils from the heat and add the lime zest and juice, soy and chopped coriander. Season with salt and freshly ground black pepper. Serve the sliced duck on a bed of creamy mash with the lentils spooned round the edge. ","ingredients":" 1 small red onion, finely chopped,  1 tsp finely chopped fresh ginger,  2 cloves garlic, finely chopped,  ½ red chilli, chopped,  ½ tsp ground ginger,  ½ tsp ground chilli,  ½ tsp ground cloves,  ½ tsp ground mace,  knob of butter,  100g\/3½oz Puy lentils,  150ml\/5fl oz red wine,  2 limes, zest and juice,  1 tbsp soy sauce,  25g\/1oz fresh coriander, chopped,  salt and freshly ground black pepper,  creamy mash, to serve,  2-3 tbsp runny honey,  4-6 duck breasts,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyroastduckwithsp_81021"}