{"recipe_name":"Honey-roasted pork belly with roasted salmon and sautéed savoy cabbage","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 170C\/340F\/Gas 3. Score the fat of the pork belly diagonally in a criss-crossed fashion. Pour a kettle-full of boiling water over the pork to tighten the skin, then drain and pat dry with kitchen paper. Place the onion, thyme, and white wine into a deep roasting tray and season well with salt and freshly ground black pepper. Place the pork into the roasting tray and transfer to the oven to roast for two hours, basting occasionally. Remove the pork and increase the oven heat to 220C\/425F\/Gas 7. Take the pork out of the tray and place onto a chopping board. Set aside the tray containing the cooking liquor. Cut the pork into 10cm\/4in squares and place onto a clean roasting tray. Pour half of the honey over the squares of pork belly then place the tray into the oven and cook for 15 minutes, or until the pork top is golden-brown and crisp, and the meat completely cooked through. Meanwhile, strain the cooking liquor into a pan over a medium heat and add the remaining honey. Bring to the boil, season well with salt and freshly ground black pepper, and reduce the liquid volume by a third. Heat an ovenproof frying pan until hot. Season the salmon with salt and freshly ground black pepper and place into the pan. Cook for 1-2 minutes on each side, until golden-brown all over, then place the pan in the oven alongside the pork and cook for 5-6 minutes, or until just cooked through. Heat a clean large frying pan until hot and add the olive oil, cabbage and parsley. Stir-fry for 3-4 minutes, until the cabbage has softened, but retains a little bite. Season, to taste, with salt and freshly ground black pepper. To serve, place a spoonful of cabbage in the centre of each plate. Top with a piece of pork and then place a piece of salmon on top of the pork. Spoon the reduced pan juices around the plate and serve. ","ingredients":" 1.2kg\/2½lb pork belly,  1 onion, roughly chopped,  2 sprigs fresh thyme,  200ml\/7fl oz dry white wine,  salt and freshly ground black pepper ,  4 tbsp clear honey,  4 x 85g\/3oz salmon fillet, skinned,  1 tbsp olive oil,  ½ savoy cabbage, finely chopped,  2 tbsp roughly chopped fresh flatleaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyroastedporkbell_86161"}