{"recipe_name":"Honey-roasted spicy leg of lamb","author":"Anjum Anand","programme":"Indian Food Made Easy","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 5-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Blend together all the ingredients for the marinade in a blender or food processor. Trim the excess fat and membranes from the leg of lamb. Make deep regular cuts all over the flesh with a short, sharp knife. Rub in the marinade, making sure you get it into the deep cuts. Place the lamb in a plastic food bag with the marinade and leave in the fridge, ideally for 24 hours, or for a minimum of 6-8 hours.  For the honey rub, blend together 70g\/2½oz of the almonds, the yoghurt and half the honey in a blender or food processor. Take the lamb out of the fridge and remove the plastic bag. Rub the honey blend into the lamb and ideally leave the lamb for another two hours (or at least 30 minutes), covered, in the fridge. Remove the lamb from the fridge and bring to room temperature before cooking.  Preheat the oven to 225C\/425F\/Gas 7 and place the lamb on a rack with a roasting tray underneath. Cook for 15 minutes then lower the heat to 180C\/350F\/Gas 4 and cook for another 1 hour 40 minutes, or until the meat juices run fairly pink when pierced, basting every 20-30 minutes. Scatter over the remaining almonds and drizzle over the remaining honey and roast for another ten minutes. Check if the meat is cooked using a meat thermometer. The temperature should be 130-150C. The higher the temperature the more well cooked the meat will be.   Remove the lamb from the oven. Cover it with foil and allow to rest for 15 minutes. Pour out the juices, spoon off any excess fat, and serve it on the side. Serve the lamb with roasted potatoes and a vegetable of your choice. ","ingredients":" 2.2kg\/41b 13½oz leg of lamb,  2 tbsp vegetable oil,  5 tbsp lemon juice,  15g\/½oz fresh ginger, peeled and roughly chopped,  6 large cloves garlic, peeled and roughly chopped,  1 tbsp ground cumin ,  1 tbsp ground coriander ,  ¼tsp red chilli powder,  salt, to taste ,  1 tbsp garam masala,  ½tsp freshly ground black pepper,  2 tbsp water,  100g\/3½oz almonds, blanched,  100ml\/3½fl oz Greek yoghurt,  1½ tbsp honey","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/honeyroastedspicyleg_86764"}