{"recipe_name":"Horseradish and mustard beef casserole","author":"Mary Berry","programme":"Mary Berry's Absolute Christmas Favourites","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/horseradish_and_mustard_10990_16x9.jpg","method":"Heat 2 tablespoons of the oil in a deep, heavy-based, flameproof, lidded casserole over a high heat. Add the beef, in batches if necessary, and fry for 4-5 minutes, or until browned all over. Remove the meat from the casserole using a slotted spoon and set aside.  Heat the remaining oil in the pan, add the onions and garlic and fry, stirring well, for 4-5 minutes, or until softened, scraping up any browned bits from the bottom of the casserole using a wooden spoon. Stir in the beef stock. In a large bowl, whisk the flour with a little of the wine until smooth, then gradually pour in the remaining wine, whisking until combined to a smooth batter with the consistency of double cream. Return the browned beef to the casserole, then pour over the wine and flour mixture. Bring to the boil, stirring until thickened, then add the Worcestershire sauce and sugar and season, to taste, with salt and freshly ground black pepper. Cover the casserole with the lid, reduce the heat until the mixture is simmering, and simmer very gently for 2 hours, stirring from time to time (alternatively, cook the casserole in a low oven).  After 2 hours, add the mushrooms, return the mixture to the boil, then cover again, reduce the heat until the mixture is simmering, and simmer for a further ½ hour, or until the meat is tender. Mix the mustard, horseradish and double cream (if using) in a bowl until well combined. Just before serving, stir it into the casserole. Serve with mashed potatoes and steamed vegetables.  ","ingredients":" 3 tbsp sunflower oil,  1.5kg\/3lb 5oz braising steak, diced,  3 large onions, roughly chopped,  6 garlic cloves, crushed or finely chopped,  300ml\/10fl oz beef stock,  50g\/1¾oz plain flour,  300ml\/10fl oz dry white wine,  3 tbsp Worcestershire sauce,  1 tbsp light muscovado sugar ,  salt and freshly ground black pepper,  500g\/1lb 2oz chestnut mushrooms, halved,  3 tbsp Dijon mustard,  3 tbsp creamed horseradish sauce,  3-4 tbsp double cream (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/horseradish_and_mustard_10990"}