{"recipe_name":"Hot and sour chicken","author":"Ching-He Huang","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Add the washed sushi rice to a large saucepan. Add 500ml\/18fl oz water and bring to the boil. Once boiling, put a tight lid on and reduce the heat to a simmer. Cook the rice for 30 minutes, or until the water has evaporated, the base is slightly golden-brown and the rice is toasted (when turned out of the pan the rice should come out in one whole layer). Take off the heat and half cover – this will keep the rice warm, but also let the steam scape to keep the bottom crisp. For the sauce, put all the ingredients into a bowl and set aside. For the chicken, heat a wok over a high heat until smoking hot. Add the groundnut oil and swirl around the oil to coat the sides of the pan. Add the garlic and ginger and toss around the pan. Then add in the chicken and brown all over. Pour in the Shaoxing rice wine.  Add all the sauce ingredients and cook over a high heat, stirring all the time, until the sauce has reduced and is glossy and thick. Take off the heat. For the courgette noodles, fill a large pan with 1 litre\/1¾ pint boiling water and add the courgette strips. Keep them moving around in the water for 1-2 minutes, then drain thoroughly and add to a bowl. Stir in the remaining ingredients and set aside. To serve, turn out the rice onto a large round sharing plate. Dress the hot and sour courgettes around the sides of the rice and pour the hot and sour chicken in the middle (including the pan juices). To garnish, sprinkle over some spring onions, ground fried dry shrimp and toasted Sichuan pepper. ","ingredients":" 350g\/12oz premium grade sushi rice, washed well and rinsed in cold water until the water runs clear,  2 medium red chillies, seeds removed and sliced,  4 garlic cloves, finely chopped,  1 tbsp chilli bean paste ,  1 tbsp tamari,  2 tbsp rice vinegar,  4 tbsp organic honey,  1 tbsp groundnut oil,  1 garlic clove, finely chopped,  2.5cm\/1in piece fresh root ginger, peeled and sliced into matchsticks,  4 large chicken thighs, skin off, de-boned, and sliced into 1cm\/½in cubes,  1 tbsp Shaoxing rice wine, or dry sherry ,  2 large courgettes, sliced into long, thin strips sliced using a peeler,  1 garlic clove, finely chopped,  1 tsp grated root ginger,  1 medium red chilli, seeds removed and finely chopped,  1 tsp tamari ,  1 tsp Chinkiang black rice vinegar or balsamic vinegar ,  ½ tbsp toasted sesame oil,  1 tsp Sichuan chilli oil,  1 spring onion, finely chopped,  1 small handful ground, fried dry baby shrimp,  1 pinch ground toasted Sichuan peppercorns","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hot_and_sour_chicken_08241"}