{"recipe_name":"Hot paper bag sandwiches of pastrami, fontina and pickled cucumber","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03fgkr6.jpg","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Bring the rice wine vinegar to a simmer in a non-reactive saucepan with the sugar, salt and mustard seeds, stirring until the sugar has dissolved.  Put the cucumber slices into a bowl and pour over the hot vinegar mixture. Stir in the dill and set aside to infuse. Meanwhile, toast all the sourdough slices and spread with butter. Spread 4 slices with mustard and top each with a layer of pastrami. Divide half of the cheese slices equally among the 4 bread slices, then arrange a layer of pickled cucumber on top of the cheese.  Repeat this layering process with another slice of bread and the remaining butter, mustard, pastrami, cheese and pickled cucumber. Finish each sandwich with a piece of bread.  Wrap each sandwich in a large sheet of baking parchment, then secure with cooking string. Transfer the parcels to a baking tray and bake in the oven for 10 minutes, or until the sandwiches have warmed through and the cheese has melted.  Heat the oil in a deep-fat fryer to 160C\/325F. Alternatively, heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.) Carefully lower the parsnip and carrot slices into the oil in batches and fry for 4-5 minutes, or until crisp but not browned – the aim is to dry out the vegetables without burning them. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Season with salt and freshly ground black pepper.  Serve the hot sandwiches on plates in their parcels, with a pile of parsnip and carrot crisps alongside each. ","ingredients":" 150ml\/5fl oz rice wine or cider vinegar,  50g\/2oz caster sugar,  2 tsp sea salt,  1 tsp yellow mustard seeds,  1 cucumber, thinly sliced,  1 small bunch fresh dill, leaves only, roughly chopped,  12 slices sourdough bread, preferably a mixture of wheat and rye,  40g\/1½oz softened butter,  1 tbsp Dijon mustard ,  300g\/10½oz thinly sliced pastrami,  400g\/14oz fontina, sliced,  vegetable oil, for deep frying,  3 parsnips, peeled and cut into wafer-thin slices using a potato peeler ,  3 carrots, peeled and cut into wafer-thin slices using a potato peeler ,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hot_paper_bag_sandwiches_01464"}