{"recipe_name":"Spiced pollack and Piadina flatbreads","author":"Rick Stein","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the flatbreads, sift the flour into a large bowl and add the salt, oil and water. Mix into a dough. If it is too dry to come together add a tablespoon or two more water. Turn onto a lightly floured board (or into a food mixer with a dough hook) and knead for 5-10 minutes until smooth and elastic. Divide the dough into eight pieces and roll into balls. Roll the balls out into 20-23cm\/8-9in circles. Preheat a non-stick frying pan on a high heat. Lay a circle of dough in the pan and cook for a minute or so, until it puffs up. Turn over and cook for another minute (it will develop dark ‘spots’). Repeat to cook the rest of the flatbreads. Keep warm. For the spiced pollack, put the couscous in a shallow bowl. Season the fish lightly with salt and turn over in the couscous. Heat the oil in a frying pan, then gently fry the fish for three minutes, turning halfway through. Transfer to a plate, add the garlic and ginger to the pan and fry with the residual couscous for 1-2 minutes.  To serve, place the fish in the centre of each flatbread. Sprinkle with the bok choi and beansprouts, then spoon over the garlic, ginger, couscous and oil from the pan. Sprinkle with the spring onions and coriander, and then drizzle over the Tabasco and soy sauce. Fold up the flatbreads and serve two per person.  ","ingredients":" 500g\/1lb 2oz plain white flour, plus extra for dusting,  1 tsp fine sea salt,  75ml\/2½fl oz olive oil,  250ml\/9fl oz warm water,  90g\/3¼oz couscous,  400g\/14oz pollack fillet (or coley, hake, leatherhead jacket or whiting), skinned and cut into 1cm\/½in slices,  1 tsp salt,  90ml\/3fl oz vegetable oil,  2 garlic cloves, peeled and grated,  15g\/½oz fresh ginger, peeled and grated,  60g\/2¼oz bok choi or salad cabbage, thinly sliced,  60g\/2¼oz beansprouts ,  8 spring onions, sliced on the diagonal,  small handful fresh coriander, roughly chopped,  ½ tsp Tabasco or Sriracha sauce,  ½ tsp soy sauce","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hot_pollack_and_piadina_83316"}