{"recipe_name":"Hot lemon curd soufflés","author":"Delia Smith","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Pre-heat the oven to 170C\/325F\/Gas 3. First of all make the lemon curd by lightly whisking the egg in a medium-sized saucepan, then add the rest of the lemon curd ingredients and place the saucepan over a medium heat. Now whisk continuously using a balloon whisk until the mixture thickens; this won't take long  When you're ready to make the soufflés, separate the eggs, putting the yolks into a medium-sized bowl and the whites into a spanking-clean larger one. Now, using an electric hand whisk, whisk the whites to the stiff-peak stage, which will take 4-5 minutes start on a slow speed, gradually increasing to medium and then high. Then add the dessertspoon of caster sugar and whisk on a high speed for 30 seconds more. Next add the zest and lemon juice and the remaining 2 oz (50 g) of sugar to the yolks and mix them together briefly. Now take a tablespoon of the whites and fold them into the yolks to loosen the mixture, then fold the rest of the whites in using a light cutting and folding movement so as not to lose the precious air. Spoon the mixture into the prepared ramekins, piling it high like a pyramid, then run a finger round the inside rim of each one.  Next place them on the baking sheet and put this in the oven on the centre shelf for 15-17 minutes or until the tops are golden. Then remove them and let them settle for about 5 minutes to allow the lemon curd to cool. They will sink a little, but that's normal. Just before serving, place them on smaller plates and give them a light dusting of icing sugar. ","ingredients":" 3 large eggs ,  2 oz (50 g) golden caster sugar and 1 level dessertspoon golden caster sugar ,  grated zest and juice 1 medium lemon (2 tablespoons juice) ,  grated zest and juice 1 small lemon ,  1 large egg ,  1½oz (40 g) golden caster sugar ,  1 oz (25 g) cold unsalted butter, cut into small cubes ,  1 level teaspoon cornflour ,  a little sifted icing sugar, to serve:","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hotlemoncurdsouffls_68026"}