{"recipe_name":"Almond-rolled goats' cheese","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/almondrolledgoatsche_86765_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. For the beetroot, cut the beetroot into cubes and place into a bowl. Season well with salt and freshly ground black pepper and drizzle with the olive oil. Place onto a baking tray and transfer to the oven to roast for 30-40 minutes, or until soft. Remove from the oven and place into a bowl. Drizzle with the balsamic vinegar and stir to coat. For the goats' cheese, half-fill a deep, heavy-bottomed pan with the oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cut the goats' cheese into eight equal pieces and roll up into balls. Dredge the balls in the flour. Spread the flaked almonds out on a plate and roll the cheese balls in the flaked almonds, pressing them into the cheese, to completely coat (don't worry if the almond flakes break up a bit) . Carefully add the cheese balls to the hot oil and deep-fry for about 30 seconds - one minute, or until golden-brown all over. Carefully remove with a slotted spoon and drain onto kitchen paper. For the dressing, place the basil, smoked almonds, garlic, parmesan and olive oil into a food processor and blend until smooth. To serve, place a small amount of watercress onto each plate and place a piece of deep fried goats' cheese on top. Place a few cubes of beetroot around the cheese and spoon over a little of the dressing. ","ingredients":" 250g\/10½oz fresh beetroot,  salt and freshly ground black pepper,  75ml\/3fl oz olive oil,  1 tbsp balsamic vinegar,  vegetable oil, for deep frying,  200g\/7oz soft goats' cheese,  75g\/3oz plain flour,  200g\/7oz flaked almonds,  200g\/7oz fresh basil leaves,  75g\/3oz smoked almonds,  1 garlic clove,  100g\/3½oz parmesan cheese, or similar vegetarian hard cheese,  100ml\/3½fl oz olive oil,  small handful watercress, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/almondrolledgoatsche_86765"}