{"recipe_name":"How to make an omelette","author":"Jane Hornby","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/how_to_make_an_omelette_22250_16x9.jpg","method":"Preheat the grill to high (250-275C\/480-520F). Slice the courgettes in quarters lengthways, and chop into smallish chunks. Cut the asparagus into short lengths, discarding the last 5cm\/2in or so of each stalk. Beat the eggs with some salt and pepper and most of the dill.  Heat the oil in a medium frying pan, approximately 23cm, and fry the courgette over a high heat for two minutes or so to soften them, stirring often. Add the asparagus and cook for two minutes, until bright green and just tender and the courgette is browned here and there. Meanwhile, crush the garlic and finely slice the spring onions. Cut the cheese into small chunks. Add the garlic and two-thirds of the spring onions to the pan, grate in most of the lemon zest, fry for one minute, then pour in the eggs and scatter in half the cheese. With the pan over a medium heat, cook the omelette slowly, stirring gently to allow the runny egg on top to meet the heat of the pan. The egg will start to set like ribbons. When the egg is softly set all the way through, and slightly runny on top, remove from the heat.   Scatter the omelette with the rest of the onions and cheese, then grill for two minutes or until just golden-brown.  Finish with the rest of the dill and lemon zest, and a drizzle of extra virgin olive oil of you like, then serve in wedges. ","ingredients":" 2 medium courgettes,  200g\/7oz asparagus spears,  8 large eggs,  salt and freshly ground black pepper,  handful fresh dill, roughly chopped,  1 tbsp extra virgin olive oil, plus a little drizzle to finish,  1 garlic clove,  bunch spring onions,  100g\/3½oz round goats’ cheese,  ½ unwaxed lemon, zest only","vegetarian":true,"calories":351.0,"protein":26.0,"carbs":4.0,"sugars":4.0,"total_fat":25.0,"saturated_fat":9.0,"fiber":2.5,"salt":0.9,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/how_to_make_an_omelette_22250"}