{"recipe_name":"Easy apple crumble pie","author":"William Leigh","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/how_to_make_apple_59768_16x9.jpg","method":"Lightly cover the work surface with flour, then roll out the shortcrust pastry until it is about 3cm\/1½in larger than the pie plate.  Flip the pastry up over the rolling pin, then lift the pastry over the plate or tin. Press it into the tin, then trim the edge with a sharp knife. Chill the pastry while you make the filling.  Preheat the oven to 190C\/375F\/Gas 5 and put a baking sheet on the middle shelf. For the crumble topping, sift the flour and salt into a large bowl, then add the butter. Rub the butter into the flour using your fingertips until the mix looks like rough breadcrumbs.  Stir in the sugar and, if you like, a handful of oats. Chill the crumble topping in the fridge while you prepare the apples.  Peel the apples, cut in half, then into chunky slices, cutting out the core as you go. Toss the apple slices with the lemon juice in a large bowl. Sift over the flour, cinnamon and nutmeg and mix well to coat. Tip in the sugar, reserving some for the topping, and add in the raisins or fruit, if using. Mix well. Pile the apples into the pastry lined tin, scatter with the crumble mix and then a final sprinkling of sugar. (It will seem to be heaped high but will reduce and settle during baking.) Bake the pie for 30 minutes, or until the pastry and crumble are golden and crisp. Serve warm with cream or ice cream.  ","ingredients":" 375g\/13oz pack ready-made sweet, all-butter shortcrust pastry,  4-6 Bramley apples (about 800g\/1lb 12oz) ,  1 tbsp lemon juice,  1½ tbsp plain flour ,  ½ tsp ground cinnamon,  ½ tsp freshly grated nutmeg,  100g\/3½oz golden caster sugar, plus a little extra for sprinkling,  50g\/2oz raisins or sultanas, or fresh blackberries (optional),  85g\/3oz plain flour,  pinch fine salt,  85g\/3oz unsalted butter, cut into small cubes,  4 tbsp caster sugar ,  handful porridge oats (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/how_to_make_apple_59768"}