{"recipe_name":"How to make brownies","author":"Stacie Stewart","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 16 - 20","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/how_to_make_brownies_14648_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4.  Place a medium saucepan containing an inch of boiling water from the kettle onto the hob and bring to a simmer. Meanwhile, use a little butter to grease the inside of a 23cm\/9in square baking tin. Cut a square of baking parchment a bit bigger than your tin (roughly 27cm\/11in). Snip a 5cm\/2in cut diagonally from the corners toward the centre. Push the paper into the tin and ease the paper into the corners neatly - they will overlap slightly. Trim if needed.  Using a large sharp knife, chop the dark chocolate into small pieces (the smaller the pieces, the quicker it will melt). Place the chopped dark chocolate with the butter into a large mixing bowl that will sit on top of your pan of simmering water.  Set the bowl over the pan of simmering water, making sure that the bottom of the bowl does not touch the water. Keep the heat low - the water should not be boiling furiously underneath, but quietly bubbling. After a few minutes the chocolate and butter will start to melt. Stir occasionally, until the chocolate is mostly melted. Remove the bowl from the pan and set aside. The residual heat in the chocolate will finish off the melting process. While the chocolate is melting, chop the white (or white and milk) chocolate into bigger pieces - about the size of a penny. Set these aside. Whisk the sugar into the melted chocolate, then add the eggs and whisk together well until the mix is slightly bubbly.  Sift the flour, cocoa powder and the salt into a separate bowl. Using a large metal spoon, add the flour mix into the chocolate mixture a third at a time, and gently fold into the chocolate mixture until thoroughly combined.  Gently pour the batter into the prepared tin, and scatter the remaining chunks of chocolate on top. Bake the brownies for 20-25 minutes. The brownies should still wobble slightly in the middle, as they will continue to cook for a little while when removed from the oven. An over-baked brownie is dry and crumbly, rather than moist and fudgy, so keep an eye on them. Let the brownies cool completely in their tin. Lift them out of the tin onto a board, using the baking paper to help, then cut into squares. Sift over a little icing sugar or cocoa powder. Store in an airtight tin. ","ingredients":" 200g\/7oz dark chocolate (70% cocoa solids),  150g\/5½oz unsalted butter, plus extra for greasing the tin,  100g\/3½oz milk or white chocolate, or a mix of both ,  125g\/4½oz dark muscovado sugar,  125g\/4½oz golden caster sugar,  4 free-range eggs, at room temperature,  85g\/3oz plain flour,  2 tbsp cocoa powder, plus a little extra for dusting, if you like,  ¼ tsp fine salt","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/how_to_make_brownies_14648"}