{"recipe_name":"How to make French onion soup","author":"Paul Merrett","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/how_to_make_french_onion_87434_16x9.jpg","method":"Melt the butter in a medium-sized ovenproof pan, add the onions and garlic and gently fry over a low heat for 30-35 minutes, stirring occasionally, until the onions are really soft and a rich dark brown colour. This stage of the recipe is really important, the long slow cooking of the onions gives this soup its lovely rich flavour and colour. Add the white wine, stirring the bottom of the pan to loosen all the browned onion. Bring it back to the boil then add the Madeira and beef stock. Bring to the boil and then simmer for about 10-12 minutes. Meanwhile make the croutons. Toast the bread on both sides and rub the toast with the cut side of a garlic clove. Top with the grated cheese and place under the grill until the cheese has melted.  Taste the soup to check the seasoning, and add salt and freshly ground black pepper to taste. Add another few tablespoons of Madeira to the soup, to boost the flavour and stir well.  Lay the croûtons on top of the soup and scatter with fresh chopped parsley. To serve, ladle the soup into bowls, making sure each serving has a cheesy croûton. Serve immediately, before the croûton goes soggy.  ","ingredients":" 50g\/2oz butter ,  1kg\/2lb 4oz onions, thinly sliced ,  2 garlic cloves, chopped ,  100ml\/3½fl oz white wine ,  2 tbsp Madeira, plus extra once cooked, to taste,  1 litre\/1¾ pint fresh beef stock ,  salt and freshly ground black pepper,  chopped parsley to garnish,  8 thick slices French bread ,  2 cloves garlic, cut in half,  100g\/3½oz Gruyère cheese, grated ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/how_to_make_french_onion_87434"}