{"recipe_name":"How to make meringues","author":"William Leigh","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 8 sandwiched meringues","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/how_to_make_meringues_70958_16x9.jpg","method":"Preheat the oven to 140C\/275F\/Gas 1 and line two flat baking sheets with baking parchment.  Separate the eggs into a clean, large bowl, preferably metal or glass. Gently crack the shell against the side of a small bowl. Slowly pull the shell apart as cleanly as possible along the crack, tipping the yolk into one half of the shell. Let the white drain away into a bowl below. Drop the yolk into another small bowl. Separate the next egg over a third bowl - that way if you accidentally break the yolk, it won’t contaminate the clean whites.  (You can use the yolks for another recipe, such as custard or ice cream.) Using an electric hand whisk, whisk the whites until stiff peaks form when the whisk is removed, but the mixture should not look too dry.  Add one tablespoon of the sugar to the egg whites, and continue to whisk until the mixture comes back to stiff peaks. Add the sugar one tablespoon at a time until it has all been used, and the meringue is thick and glossy.  Using two dessertspoons, scoop 16 rugby-ball shaped meringues onto the baking paper, leaving plenty of space between them.  Bake for an hour until the meringues are pale, golden-brown, crisp and lift away easily from the baking paper. Open the oven door slightly and leave the meringues to cool in the oven. Meanwhile, make the chocolate filling (ganache). Use a large, sharp knife to chop the chocolate into small pieces. Pour the cream into a small saucepan, then bring it to just below boiling. Take the pan from the heat, add the chopped chocolate, swirl the pan to help combine the chocolate and then stir until smooth. Tip the ganache out of the pan and leave to cool, it will thicken as it cools.  When the ganache has cooled, spread it over the flat side of half of the meringues, then sandwich meringues together. To make these a little more luxurious, whip some double cream, then spoon on top of the ganache before sandwiching the meringues together.  ","ingredients":" 3 free-range eggs, whites only,  150g\/5½oz golden caster sugar,  150ml\/¼pt double cream ,  150g\/4½oz dark chocolate (70% cocoa solids),  double cream, whipped, used to sandwich meringues together","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/how_to_make_meringues_70958"}