{"recipe_name":"How to make pea and ham soup","author":"Jane Hornby","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2-4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/how_to_make_pea_and_ham_17426_16x9.jpg","method":"Heat the oil in a large saucepan on low or medium heat, then add the onion and potato, season with salt and pepper, then stir to coat the vegetables in the oil.  Take a piece of baking paper large enough to cover the top of the pan, scrunch it up then unfold it. Lay the paper over the surface of the vegetables, sealing them in right to the edges of the pan (this helps cook the vegetables more quickly). Put a lid on the pan, cook on a low heat for 8-10 minutes, until the potatoes are tender and the onions are soft and translucent.   Remove the paper. Add the peas and stock to the pan, then bring to the boil. Cook for a couple of minutes, or until all of the peas have floated to the top and are tender and bright. Take the pan off the heat. Using a stick blender, process the peas until very smooth. Add the milk (or, if preferred, use more stock, water or cream). Tear in most of the ham. Bring the soup back to a simmer, then season to taste with salt and pepper, remembering that the ham is fairly salty.  To serve, ladle the soup into bowls then scatter with the rest of the ham and a few torn mint leaves.  ","ingredients":" 1 tbsp vegetable oil,  1 medium onion, finely chopped,  1 large potato (about 250g\/9oz), cut into small cubes,  300g\/10½oz frozen petits pois or garden peas,  400ml\/14fl oz chicken stock, or vegetable stock if preferred,  200ml\/7fl oz semi-skimmed or whole milk,  100g\/3½oz thick cut ham,  small handful fresh mint leaves, optional,  salt and freshly ground black pepper","vegetarian":false,"calories":236.0,"protein":17.0,"carbs":25.0,"sugars":7.0,"total_fat":6.0,"saturated_fat":2.0,"fiber":6.0,"salt":0.9,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/how_to_make_pea_and_ham_17426"}