{"recipe_name":"Baked macaroni with meatballs","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the cheese sauce, place the milk and bay leaves into a pan and place over a medium heat. Heat the milk to scalding point (do not boil) and then remove from heat. Leave to infuse. In a clean saucepan, melt the butter over a medium heat, then stir in the flour and cook for three minutes. Be careful not to let the mixture turn brown. Remove the bay leaves from the milk mixture and add a little milk to the flour and butter mixture. Stir to combine the milk and flour paste over a low heat, then repeat the process, gradually adding milk and stirring in, until a smooth paste is formed. Add the rest of the milk and bring to boil, stirring all the time, then reduce the heat and simmer for three minutes. Remove the pan from the heat and add the cheese, mustard and season, to taste, with salt and freshly ground black pepper. For the meatballs, heat one tablespoon of the oil in a saucepan over a medium heat. Add the onion, garlic and oregano and fry until softened, then remove from heat and allow to cool. Place the onion mixture into a bowl and add the minced meat. Season well with salt and freshly ground black pepper, and mix together to combine.  Roll the mince mixture into small 2.5cm\/1in meatballs. Heat the remaining tablespoon of oil in a clean frying pan over a medium heat. Add the meatballs and fry, turning occasionally, until brown all over and completely cooked through.  For the pasta, heat the oil in a large frying pan. Add the shallots and fry for two minutes to soften, then add the cooked pasta and stir well. Add the tomatoes and oregano and cook for 2-3 minutes, then add the meatballs and the cheese sauce. (You may need to add a little milk to loosen the cheese sauce.) The sauce should coat, not swamp, the macaroni. Transfer the macaroni and meatballs to either a large ovenproof dish or into 10cm\/4in ramekins. Top with parmesan and place into the oven to bake for 15 minutes if using a large dish, 7-8 minutes if using the ramekins. Preheat the grill to its highest setting and place the dish or ramekins under the grill to melt and brown the cheese before serving. ","ingredients":" 1 litre\/1 pint 15fl oz whole milk,  2 bay leaves,  40g\/1½oz unsalted butter,  50g\/2oz plain flour,  250g\/10½oz mature cheddar or gruyere, grated,  1 tsp English mustard,  salt and freshly ground black pepper,  2 tbsp olive oil,  ½ onion, finely chopped,  1 garlic clove, crushed,  1 tsp dried oregano,  250g\/10½oz minced rump steak,  1 tbsp olive oil,  4 shallots, sliced,  400g\/14oz macaroni, cooked according to packet instructions,  20 cherry tomatoes, halved,  12 sun-blushed tomatoes ,  1 tsp dried oregano,  2-3 tbsp milk, if needed,  2 tbsp grated parmesan","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakedmacaronimeatbal_84603"}