{"recipe_name":"Hyderabadi biryani of vegetables in a pumpkin shell","author":"Vivek Singh","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Wash the rice and soak in cold water for 20 minutes. For the pumpkin, mix the tamarind, chilli and salt and smear it on the inside of the hollowed out pumpkin. Bake it in the oven (without the pumpkin lid) for 30-50 minutes. When cooked, remove from the oven and set aside. Mix all the ingredients for the marinade.  For the vegetables, place all the vegetables in a heavy-based casserole and add the marinade. Set aside for 15 minutes.  For the rice, boil 3 litres\/5¼ pints of water and add the whole spices and salt.  When the water is boiling, add the strained soaked rice and boil for about 6-8 minutes until two-thirds cooked then drain using a colander. Meanwhile bring the vegetables to a simmer over a low heat. Preheat the oven to 200C\/400F\/Gas 6. To finish, soak the saffron in the warm milk for 3-5 minutes then mix in the ghee and rosewater (or kewra water) and set aside. Fill the bottom of the pumpkin with layers of the vegetables and rice, sprinkling some chopped mint and the soaked saffron mix over the rice as you go.  Put on the pumpkin lid. You may wish to seal the lid using some dough to create a pressure cooking effect. Bake in the oven for 20-25 minutes. To serve, take the lid off the pumpkin and garnish the rice with raisins. ","ingredients":" 250g\/9oz basmati rice,  3 green cardamoms,  2 bay leaves,  4 cloves,  2 blade mace,  1 tbsp cumin,  3 tbsp salt,  1 tbsp chilli flakes,  100g\/3½oz tamarind purée,  ½ tsp salt,  1 large pumpkin, top removed, seeds and flesh scraped out,  2 medium onions, sliced and deep fried until golden-brown,  2 tbsp ginger and garlic paste,  1 tbsp red chilli powder,  1 tsp turmeric,  1 tsp garam masala,  1\/8 nutmeg grated,  6 green chillies, slit lengthways,  ½ bunch fresh coriander, chopped,  1 lemon, juice only,  2 tbsp vegetable oil,  150ml\/5fl oz natural yoghurt,  75ml\/2½fl oz single cream,  1 tsp salt,  1 tsp sugar,  ½ turnip, cut into 1cm\/½in cubes ,  1 carrot, cut into 1cm\/½in cubes ,  ½ swede, cut into 1cm\/½in cubes ,  ¼ celeriac, cut into 1cm\/½in cubes ,  ½ sweet potato with orange flesh, cut into 1cm\/½in cubes ,  2 Jerusalem artichokes, cut into 1cm\/½in cubes ,  10 fine beans, chopped,  200g\/7oz Portabello mushrooms, cut into 1cm\/½in cubes  ,  ½g saffron,  50ml\/2fl oz warm milk,  50g\/1¾oz ghee,  2 tbsp rosewater or kewra water (screw pine essence),  1 small bunch mint, chopped,  a little dough made from flour and water, optional, to seal the pumpkin lid,  50g\/1¾oz raisins, for garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/hyderabadi_biryani_of_73883"}