{"recipe_name":"Iberico pork pluma, herb vinaigrette and piquillo pepper purée","author":"Jun Tanaka","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the brine, put 1 litre\/1¾ pint water and all the ingredients in a saucepan and heat until the salt and sugar dissolve. Leave to cool then place the pork in the brine, cover and leave in the fridge for 2 and a half hours. Remove from the brine, rinse well in fresh cold water and pat dry. To make the herb vinaigrette, mix all the ingredients in a bowl and season with salt and pepper. To make the pepper purée, gently cook the shallots and garlic in olive oil for 5 minutes. Add the peppers followed by the vinegar and chicken stock. Cook for 5 minutes then blitz in a blender. Season to taste with salt and pepper. For the chickpeas, heat the oil in a deep fat fryer or a deep-sided, heavy bottomed pan to 180C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended). Deep-fry the chickpeas for 2 minutes. Mix the spices and salt together, drain the chickpeas and season with the spiced salt. Lightly oil the pork on both sides and place on a hot griddle. Cook for 2 minutes then flip over and cook for a further 2-3 minutes.  To serve, slice the pork and place on a large plate, spoon the vinaigrette over the top then add a spoon of purée to the side. To finish, scatter the chickpeas over the pork. ","ingredients":" 80g\/2¾oz sea salt,  40g\/1½oz caster sugar,  sprig thyme,  4 x 200g\/7oz Iberico pluma,  2 tbsp olive oil,  ½ bunch parsley, finely chopped,  ¼ bunch oregano, finely chopped,  1 garlic clove, crushed,  1 green chilli, seeds removed and finely chopped,  ¼ tsp cumin seeds, crushed,  ¼ tsp sweet paprika ,  ½ shallot, finely chopped,  50ml\/2fl oz red wine vinegar,  100ml\/3½fl oz extra virgin olive oil,  salt and freshly ground black pepper,  1 shallot, thinly sliced,  1 garlic clove, thinly sliced,  olive oil,  150g\/5½oz piquillo peppers,  25ml\/1fl oz sherry vinegar,  50ml\/2fl oz chicken stock,  50g\/1¾oz cooked chickpeas,  ¼ tsp cumin seeds, crushed,  ¼ tsp sweet paprika,  1 tsp salt,  vegetable oil, for deep-frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/iberico_pork_pluma_herb_48331"}