{"recipe_name":"Iberico pork pluma with spring onion and black pepper miso","author":"Ross Shonhan","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the miso, put all of the ingredients in a blender and blend until smooth. This will make more miso than required, but it will keep in the fridge for weeks and can be rubbed on almost any meat For the salad, mix all of the ingredients together, put in a colander and wash under running water for about 10 minutes. Drain well. For the salad dressing, mix the lemon juice and salt together.  To cook the pork pluma, heat a non-stick frying pan to medium heat and add the butter and oil. Rub the pork heavily with the miso rub and place in the pan. Cook for about 2-3 minutes on each side or until cooked through. Remove from the pan and leave to rest for 1 minute.  Remove the pan from the heat and de-glaze it with the rice vinegar. Add a tablespoon of the fresh miso to mix through to make a sauce. Lightly dress the salad just before serving.  Slice the pork and place on a serving plate with a spoon of sauce and the salad on top.  ","ingredients":" 55g\/2oz freshly ground black peppercorns ,  400g\/14oz spring onions, finely chopped,  60g\/2¼oz garlic, finely chopped,  250g\/9oz white miso paste,  large pinch sea salt ,  50ml\/2fl oz soy sauce,  5 tbsp rice vinegar ,  5 tbsp vegetable oil,  20g\/¾oz carrot, cut into fine julienne strips,  20g\/¾oz cucumber, cut into fine julienne strips,  20g\/¾oz daikon, cut into fine julienne strips,  20g\/¾oz leek, white part only, cut into fine julienne strips,  10g shiso leaves (available online), cut into fine julienne strips,  3 tbsp freshly squeezed lemon juice,  pinch sea salt,  2 pork pluma (each weighing approximately175-225g\/6-8oz), trimmed,  100g\/3½oz unsalted butter,  50ml\/2fl oz vegetable oil,  5 tbsp rice vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/iberico_pork_pluma_with_01362"}