{"recipe_name":"Iced strawberry nougat","author":"Michel Roux Jr.","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 140C\/275F\/Gas 1.  For the strawberry sauce, mix the strawberries and runny honey together in a bowl, then tip out onto a wire rack set over a baking tray. Dry the strawberries in the oven for four hours, or until dry but still soft.  Reserve some strawberries for the garnish and blend the remainder in a blender until smooth. Add sugar, to taste. For the caramelised hazelnuts, heat the sugar in a pan over a high heat until melted and golden-brown. Stir in the hazelnuts and continue to cook for another 1-2 minutes. Tip the mixture out onto a tray lined with greaseproof paper. Set aside to cool completely, then break into small pieces using a rolling pin. Put the egg whites and sugar in a bowl set over a pan of simmering water (do not let the base of the bowl touch the water). Whisk the mixture until frothy and the sugar has dissolved. Remove the bowl from the heat and continue to whisk until the base of the bowl is cool and the mixture holds firm peaks when the whisk is removed. Fold in the caramelised hazelnuts, strawberries, vanilla and cream. Spoon the mixture into six lightly oiled individual moulds or a terrine. Freeze overnight.  To serve, dip the moulds in a little hot water for a few seconds, then turn out onto a plate. Drizzle the strawberry sauce around the plate. ","ingredients":" 250g\/9oz strawberries, hulled, halved if large,  2 tbsp runny honey,  sugar, to taste,  100g\/3½oz caster sugar,  100g\/3½oz blanched hazelnuts,  6 free-range egg whites,  225g\/8oz caster sugar,  125g\/4½oz strawberries, hulled, halved if large,  2 tsp vanilla extract,  375ml\/13fl oz whipping cream, whipped until soft peaks form when the whisk is removed","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/iced_strawberry_nougat_42977"}