{"recipe_name":"Indian barbecue rack of lamb and jalfrezi lamb shoulder","author":"Paul Rankin","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb shoulder, heat half of the oil in a large pan and brown the lamb shoulder with the cumin seeds until nicely coloured.  Set aside in a large bowl.  Heat two tablespoons of oil in a large pan and fry the sliced onion with the ginger, garlic, chilli, and all the spices.  Add the lamb to the pan and enough stock to just cover the meat. Put a lid on the pan and cook for 2-2½ hours, or until tender.  For the barbecue rack of lamb, make a paste by blending the ginger and garlic in a food processor. Transfer to a bowl and stir in the oil, yoghurt, lime zest and lime juice. Season to taste with salt and freshly ground black pepper.  Cover the lamb racks with the paste and leave to marinate for an hour, or longer if time allows. Heat a tandoor oven.  Thread the lamb racks onto skewers and roast in the tandoor oven for 12-15 minutes. Carefully remove the meat from the oven and allow to rest before carving. Carve in half to serve. For the cumin potato cakes, steam the potatoes for 25 minutes, or until softened. Once cool, grate half of the potatoes into a bowl and roughly crush the remaining half in a separate bowl. Combine both textures of potatoes. Stir in the ground cumin powder, chilli, garlic and coriander. Season to taste with salt and freshly ground black pepper. Shape into four patties or cakes using your hands. Heat the butter and oil in a pan and fry the cumin potato cakes until lightly browned. For the aubergine, heat the oil in a large pan and roast the cumin seeds with the garlic, ginger, chilli and onion for a few minutes until softened.  Add the turmeric, salt to taste and stir in the aubergine and a squeeze of lemon juice. Heat for 2-3 minutes, reduce the heat and cook slowly for 15-20 minutes. Stir in chopped coriander when ready to serve. For the lamb shoulder, remove the lamb from the pan and blend the sauce until smooth. Strain the sauce, re-heat and season to taste with salt and pepper. Put the lamb back into the sauce to warm through before serving.   For the mint chutney, blend the mint, coriander, chilli, garlic, lime zest and juice in a food processor until smooth. Add caster sugar to taste and a little oil, pulse again to combine. Season to taste with salt and freshly ground black pepper. To serve, serve the aubergine, potato cakes, mint chutney, two bones from the rack and a piece of shoulder and some sauce on each plate. ","ingredients":" 4-6 tbsp vegetable oil,  ½ lamb shoulder, trimmed, boned and cut into 4 pieces ,  2 tsp cumin seeds,  1 onion, peeled and sliced,  2.5cm\/1in piece fresh root ginger, peeled and chopped,  2 garlic cloves, peeled and chopped,  1 green chilli, seeds removed, chopped,  2 tsp garam masala,  1 tsp ground cinnamon,  4 cardamom pods, crushed,  2 cloves,  2 star anise (optional),  600ml\/20fl oz brown meat stock (lamb, chicken or beef),  salt, to taste,  2.5cm\/1in knob ginger, peeled and finely chopped,  2 garlic cloves, peeled and finely chopped,  1 tbsp vegetable oil,  100ml\/3½fl oz natural yoghurt,  1 lime, zest and juice only,  salt and black pepper,  1 x 8 bone rack of lamb, French trimmed (and cut into 4 x 2-bone joints),  300g\/10½oz Charlotte potatoes, or waxy potatoes, peeled,  1 tsp ground cumin powder,  1 green chilli, chopped (seeds removed, optional),  2 garlic cloves, peeled and finely chopped\/grated,  handful of coriander, chopped,  salt and pepper,  oil, for frying,  butter, for frying,  2 tbsp vegetable oil,  1 tsp cumin seeds,  2 garlic cloves, peeled and grated,  2.5cm\/1in ginger, peeled and grated,  ½ green chilli, seeds removed (optional), finely diced,  1 onion, finely chopped,  1 tsp ground turmeric ,  salt,  1 aubergine, cut into chunks,  squeeze of lemon juice,  small handful of coriander, chopped,  1 small bunch fresh mint, shredded,  1 small bunch fresh coriander, shredded,  ½ green chilli, finely chopped,  1cm\/½in piece ginger, finely chopped,  1 small garlic clove, peeled and chopped,  1 lime, zest and juice only,  1 tsp caster sugar, to taste,  2 tbsp vegetable oil, to blend,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/indian_barbecue_rack_of_30534"}