{"recipe_name":"Baked mushroom rarebit with apple and tomato chutney","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the rarebit, place the cheese and milk into a saucepan and heat until the cheese is melted, stirring occasionally to prevent it catching. Add the breadcrumbs and flour and cook for 2-3 minutes, stirring all the time to prevent lumps. Remove from the heat and allow to cool, then add the Worcestershire sauce, eggs and mustard powder. Mix thoroughly and season, to taste, with salt and white pepper. Place the mushrooms onto a baking sheet. Spoon the rarebit mix over the mushrooms.  Drizzle over a little olive oil and place into the oven to bake for 10-15 minutes, or until the mushrooms are soft and the rarebit is bubbling and golden-brown. For the chutney, place the sugar, sultanas and half of the vinegar into a saucepan over a high heat and melt down to a sticky caramel. Add the rest of the ingredients except the rosemary and bring to the boil.  Add the rosemary and reduce the heat to simmer for 30-40 minutes, taking care not to burn the base. Allow to cool, then season, to taste, with salt and freshly ground black pepper.  To serve, place the toasted ciabatta slices onto plates. Place the mushrooms onto the ciabattas with some of the mushroom juices poured over. Place a spoonful of chutney alongside. ","ingredients":" 6 large field mushrooms, stalks removed,  225g\/8oz Stilton cheese, crumbed,  110g\/4oz Cheddar cheese, grated,  50ml\/2fl oz milk,  25g\/1oz flour,  25g\/1oz breadcrumbs,  dash of Worcestershire sauce,  1 free-range egg,  1 free-range egg yolk,  ½ tsp English mustard powder,  salt and white pepper,  2 tbsp olive oil,  ciabatta bread, sliced and toasted,  225g\/8oz Demerara brown sugar,  110g\/4oz sultanas,  275ml\/10floz malt vinegar,  10g\/½oz fresh ginger, finely chopped,  2 red chillies, finely chopped,  1kg\/2lb 2oz ripe tomatoes, roughly chopped,  500g\/1lb 2oz apples, peeled and chopped,  200g\/7oz shallots, roughly chopped,  1 tbsp fresh rosemary, roughly chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakedmushroomrarebit_83846"}