{"recipe_name":"Indian-spiced soft shell crab with mango chutney","author":"James Martin","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the crabs, place all of the ingredients except the crabs into a bowl and mix to a paste. Add the crabs and turn gently in the mixture to coat well. (Ideally leave for 30 minutes to infuse the flavours.) Heat an ovenproof frying pan until hot then add enough vegetable oil to coat the bottom of the pan. Add the crabs and fry for 2-3 minutes on each side, then transfer to the oven and cook for 8-10 minutes, or until completely cooked through. For the mango chutney, heat a frying pan until hot. Add all of the spices and toast for 30 seconds, or until the mustard seeds start to pop. Add the green mango and ripe mangoes and cook for 1-2 minutes. Add the sugar and cook until dissolved into the mango juices, then add the vinegar. Cover the mango mixture and reduce the heat to simmer for 25 minutes, or until the mango has broken down and the mixture resembles chutney. Place half of the chutney mixture into a food processor and blend to a purée, then return to the pan and mix with the remaining unblended chutney. Pour the chutney into sterilised jars and allow to cool before serving. To serve, place a soft shelled crab onto each plate with a spoonful of mango chutney alongside. ","ingredients":" 4 tsp grated fresh ginger,  2 tsp chopped garlic,  2 tsp ground coriander,  2 tsp ground cumin,  1 tsp red chilli powder,  4 tbsp chopped coriander leaves,  4 tbsp gram flour (also sold as besan or chickpea flour),  2 limes, juice only,  2 tbsp groundnut oil,  4 small soft shell crabs,  1 tsp black mustard seeds,  1 tsp black peppercorns,  1 tsp cumin seeds,  1 tsp dried chilli flakes,  1 tsp coriander seeds,  1 green mango, peeled and sliced,  2 ripe mangoes, peeled and sliced,  125g\/4½oz light soft brown sugar,  110ml\/4fl oz malt vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/indianspicedsoftshel_88174"}