{"recipe_name":"Indian-style fish curry","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sprinkle the salt and ground turmeric onto a plate. Dredge the pieces of fish in the mixture until completely coated.  Heat 1-2 tablespoons of the oil in a frying pan over a medium to high heat. Add the coated fish pieces, then fry for 2-3 minutes, or until crisp, golden-brown and cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.  Heat the remaining 1-2 tablespoons of the oil in a separate pan. Add the mustard seeds, cover the pan with a lid, and fry until they start to pop. (CAUTION: Popping seeds can be dangerous. Keep the pan away from the eyes and face.) Add the onion and curry leaves and continue to fry for a further 4-5 minutes. Add the tomatoes, ginger, garlic, chilli and garam masala and continue to fry, stirring well, for 3-4 minutes. Add the grated coconut cream and stir until dissolved. Bring the mixture to the boil, then reduce the heat and simmer until the sauce has thickened. Add 1-2 tablespoons of water to the mixture to loosen the mixture, as necessary.  Add the fried fish pieces to the sauce and cook until heated through.  To serve, spoon the rice onto four serving plates. Spoon the fish curry on top of the rice, then garnish with the coriander. ","ingredients":" 1 tsp fine sea salt,  1 tsp ground turmeric,  400g\/14oz white fish fillets, such as hake, pomfret or whiting, skin removed, cut into large pieces,  3-4 tbsp vegetable oil,  1 tsp black mustard seeds,  1 onion, peeled, grated,  10 fresh curry leaves,  4 ripe tomatoes, chopped,  2.5cm\/1in piece fresh root ginger, grated,  1 garlic clove, peeled, crushed to a paste with the edge of a knife,  1 green birds'-eye chilli, finely chopped,  1 tsp garam masala,  200g\/7oz creamed coconut, grated,  1-2 tbsp water (as necessary),  basmati rice, cooked according to packet instructions,  handful fresh coriander leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/indianstylefishcurry_92835"}