{"recipe_name":"Indian-style pollack with spicy chickpeas","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spice paste, heat a frying pan until hot, then add the mustard seeds, cumin and coriander seeds and dry fry until the mustard seeds start to pop. Transfer the toasted spices into a pestle and mortar and grind to a fine powder. Place the spice powder into a bowl and add the remaining spice paste ingredients. Whisk to form a paste. For the pollack, preheat the grill to its highest setting. Take half the spice paste and smear it all over each pollack fillet. Place the pollack onto a grill tray and place under the grill to cook for 3-4 minutes, or until just cooked through. Meanwhile, heat a clean frying pan until hot. Add the oil and shallots and fry for 1-2 minutes. Add the remaining spice paste and cook for one minute. Add the chickpeas and continue to cook until the chickpeas are heated through. Add the tomatoes and coriander and season, to taste, with salt and freshly ground black pepper. To serve, place a large spoonful of the chickpea mixture onto each plate and top with a pollack fillet and a wedge of lime. ","ingredients":" 1 tbsp mustard seeds,  2 tsp cumin seeds,  2 tsp coriander seeds,  1 tsp ground turmeric,  ½ tsp smoked sweet paprika,  1 tsp fenugreek,  ½ tsp ground cinnamon,  ½ tsp salt,  2 tbsp vegetable oil,  4 x 175g\/6oz pollack fillets, skinned,  2 tbsp vegetable oil,  2 shallots, finely sliced,  1 x 400g\/14oz can of chickpeas, rinsed and drained,  3 tomatoes, skinned, seeds removed, chopped,  3 tbsp roughly chopped fresh coriander,  salt and freshly ground black pepper,  2 limes, quartered, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/indianstylepollockwi_88632"}