{"recipe_name":"Individual toad in the holes","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sift the flour and salt into a bowl. Combine the water and milk in a jug. Add the eggs and half of the milk and water mixture to the flour and whisk until smooth. Add the rest of the milk and water mixture and the vinegar and whisk to combine. Leave to stand for 30 minutes. Preheat the oven to 200C\/440F\/Gas 6. Place a tablespoonful of dripping (or vegetable oil) into each of six holes of a muffin tin. Place the tin into the oven to heat the dripping to smoking hot. Carefully pour a sixth of the batter into each hole with dripping or oil, then add a sausage to each. Return to the oven to cook for 25 minutes. Do not open the oven door during this time! For the gravy, heat the oil in a frying pan and fry the onions until soft. Add the sugar and tomato purée and cook for five minutes. Add the gravy browning or soy sauce, Worcestershire sauce, ale and stock. Bring to the boil, then reduce the heat to simmer for 25 minutes. Remove from the heat and add the butter a little at a time, whisking to combine to make a glossy sauce. Remove the toad in the holes from the oven and place each onto a plate. Pour over a generous amount of gravy and serve. ","ingredients":" 1 large cup plain flour,  pinch salt,  ½ cup water,  ½ cup milk,  1 cup free-range eggs,  1 tbsp malt vinegar,  125g\/4oz beef dripping (you can substitute with vegetable oil),  6 just cooked top quality sausages,  1 tbsp vegetable oil,  2 onions, sliced,  1 tbsp sugar,  1 tbsp tomato purée,  1 tbsp gravy browning or soy sauce,  1 tbsp Worcestershire sauce,  150ml\/5fl oz dark ale or beer,  250ml\/9fl oz beef stock,  50g\/2oz cold butter, cut into cubes","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/individualtoadintheh_88684"}