{"recipe_name":"Isle of Man queen scallop pad Thai","author":"Dave Myers","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the red curry paste, place all the curry paste ingredients into a pestle and mortar and grind to a smooth consistency. (Alternatively, use a coffee grinder or mini food processor.)  For the pad Thai, place the rice noodles in a bowl of hot, but not boiling, water and leave to soak for ten minutes, or until tender but not too soft, or they will fall apart when cooked. Drain the noodles and refresh under cold water, then drain again and place in a bowl. Add one tablespoon of the groundnut oil and the rice vinegar to the noodles and mix well - the groundnut oil and vinegar will stop them from sticking to each other. Heat a wok and add two tablespoons of the oil, ginger and onion and cook until soft. Add the curry paste and cook for a further 2-3 minutes.  Add the noodles and coat well with the onion, ginger and curry paste mixture. Add the fish sauce and soy sauce.  Add the bean sprouts, spring onion and pak choi and cook for a further 2-3 minutes. Meanwhile, heat the remaining groundnut oil in a frying pan. Add the queen scallops and prawns and sauté for one minute, or until completely cooked through. Add the scallops and prawns to the wok and stir in.  To serve, divide the pad thai between four serving dishes and garnish with the crushed roasted peanuts and the lime wedges. ","ingredients":" 4 dried red chillies, deseeded,  1 small shallot, diced,  3 garlic cloves,  1 tbsp galangal, chopped,  2 lemongrass stems, outer leaves removed, finely chopped,  1 lime, juice and zest only,  2 tsp chopped fresh coriander, use the root if you can,  ½ tsp white peppercorns,  1 tsp coriander seeds,  ½ tsp cumin seeds,  2 tsp Thai shrimp paste,  200g\/7oz dried flat rice noodles,  4 tbsp groundnut oil,  2 tsp rice vinegar,  1 tbsp chopped fresh ginger,  ½ onion, chopped,  2 tsp red curry paste,  2 tbsp nam pla (Thai fish sauce),  1 tbsp light soy sauce,  150g\/5oz fresh bean sprouts,  2 spring onions, finely sliced,  110g\/4oz pak choi, finely sliced,  500g\/1lb 2oz queen scallops,  200g\/7oz raw king prawns, peeled and de-veined,  2 limes, cut into wedges,  50g\/2oz roasted peanuts, crushed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/isleofmanqueeniescal_87332"}