{"recipe_name":"Ital carrot and sweet potato soup","author":"Levi Roots","programme":"Caribbean Food Made Easy","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring the carrot juice to the boil in a pan.  Add the leeks, sweet potatoes, chickpeas, creamed coconut, chilli, ginger, garlic and thyme and reduce the heat to a simmer. Simmer the mixture for 4-5 minutes.  Add the shredded callaloo or spinach, if using, to the mixture and continue to simmer for a further 4-5 minutes, or until the sweet potato pieces are tender. Once the vegetables are tender, the soup can be served straightaway. However, if you prefer a thick, chunky soup, mash the vegetables in the soup lightly using a potato masher. If you prefer a smooth soup, blend the mixture in a food processor until smooth. (NB: You may need to add extra carrot juice to the soup if mashing or blending it as it will thicken considerably.)  Add the butter to the soup and stir until melted, then season, to taste, with freshly ground black pepper.  To serve, ladle the carrot and sweet potato soup into four serving bowls. Garnish each serving with a drizzle of soured cream or a teaspoonful of Greek-style yoghurt, then sprinkle over the fresh coriander. ","ingredients":" 1 litre\/1¾ pints fresh carrot juice,  2 leeks, trimmed, chopped,  2 sweet potatoes, peeled, cut into 2cm\/¾in pieces,  1 x 400g\/14oz can chickpeas, drained and rinsed,  4cm\/1½in piece creamed coconut,  1 Scotch bonnet chilli, chopped (remove the heat-giving seeds if desired),  2cm\/¾in piece fresh root ginger, peeled, finely chopped ,  1 garlic clove, finely chopped,  2 sprigs fresh thyme, leaves only, finely chopped,  large handful callaloo leaves or spinach leaves, washed, shredded (optional),  knob of butter ,  freshly ground black pepper,  4 tsp soured cream or Greek-style yogurt,  1 tbsp chopped fresh coriander leaves","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/italcarrotandsweetpo_91711"}