{"recipe_name":"Italian grissini","author":"Ali Imdad","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 10-15 breadsticks","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Add the yeast and sugar to 280ml\/10oz warm water in a large bowl. Add 75g\/2½fl oz of the flour, whisk and then leave for ten minutes for the yeast to activate. Add the oil and then mix well. Gradually add the remaining flour, salt, cheeses, Italian seasoning, garlic powder and the chopped jalapeños until completely incorporated. Turn the dough out onto a lightly oiled surface and knead for about 5-8 minutes. Put the dough into an oiled bowl, cover and leave for 30 minutes. Preheat the oven to 190C\/375F\/Gas 5. Oil and flour at least two baking trays. For the rub, combine all the rub ingredients in a small bowl. Roll out the dough until at least 28cm\/11in long. Brush with the egg yolk, sprinkle over the rub and gently press it in so that it sticks. Using either a knife or a pizza cutter, cut out strips of the dough, and holding from either ends of the strip, twist the dough gently and quickly to create a spiral and place onto a baking tray straightaway. Bake for 15-20 minutes, or until the breadsticks are lightly golden-brown and feel firm to the touch. Remove the breadsticks from the oven and leave to cool on the baking trays. ","ingredients":" 1 X 7g\/⅛oz packet dried yeast,  1 tsp sugar,  500g\/1lb 2oz plain white bread flour, plus extra for flouring,  1 tbsp olive oil, plus extra for oiling,  1 tsp sea salt,  5 tbsp grated parmesan (or similar vegetarian cheese),  1 heaped tsp blue cheese,  3 tsp Italian seasoning ,  3 tsp garlic powder,  2 tbsp chopped jalapeños, from a jar,  1 free-range egg ,  50g\/1¾oz grated parmesan (or similar vegetarian hard cheese),  2 tbsp garlic powder,  1 tsp Italian seasoning,  2 tsp jalapeño chilli powder ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/italian_grissini_86213"}