{"recipe_name":"Jamaican coconut fish parcels","author":"Levi Roots","programme":"Bank Holiday BBQ with Olly Smith and Levi Roots","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a frying pan and gently fry the onion and peppers until just soft. Add the chillies and ginger and cook for another 2 minutes. Stir in the coconut cream and heat until warmed through, but don’t boil. Stir in the lime juice and sugar. Season with salt and pepper and taste – there should be a nice balance of sweet and tart.  Cut out eight pieces of foil big enough to loosely wrap one fish fillet in. Place two squares on top of each other to make a double layer parcel. Pull the sides up so the filling doesn’t run out, then divide the coconut cream mixture equally between the parcels, laying the fish fillet on top. Season with salt and pepper. Scrunch the edges of the foil together to make a well-sealed, but loose, parcel. Light the barbecue about 30 minutes before you want to eat, so that the flames have died down, the coals are covered in grey ash and producing a steady heat.   Set the parcels on a hot barbecue and cook for about 12 minutes. Check if they are ready by carefully unwrapping one of the parcels – the fish should be cooked through and opaque.  Serve the fish in their parcels, opening them up at the table to reveal the contents. Sprinkle over the coriander and serve immediately with lime wedges.  Rice is also particularly good with this dish. ","ingredients":" 1 tbsp groundnut oil,  1 onion. thinly sliced,  1 red pepper and 1 green pepper, seeds removed and sliced,  2 red chillies, seeds removed and thinly sliced,  1½cm\/¾in piece fresh root ginger, grated,  2 x 160ml tins coconut cream,  2 limes, juice only,  2 tbsp soft light brown sugar,  4 x 180g\/6oz fish fillets, such as salmon, sea bass, haddock or cod,  salt and freshly ground black pepper,  2 tbsp roughly chopped fresh coriander,  lime wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/jamaican_coconut_fish_71579"}