{"recipe_name":"Jamaican rum truffles ","author":"Lorraine Pascale","programme":"Lorraine Pascale: How to be a Better Cook","prep_time":"overnight","cooking_time":"less than 10 mins","serves":"Makes 40 truffles","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/jamaican_rum_truffles_09151_16x9.jpg","method":"Heat the cream in a small pan, removing it from the heat just before it comes to the boil.  Meanwhile, put the milk chocolate and dark chocolate in a large bowl and, once the cream comes off the heat, pour it over the chocolate. Stir well until melted and smooth.  Add the butter and enough rum to taste and mix well. Leave to cool and then cover the chocolate mixture with cling film and transfer to the fridge for at least four hours, or overnight – the chocolate will be set firm. Line a large tray with parchment paper. Sift half of the cocoa powder onto each of two large plates. One will be to dust your hands and the other to coat the truffles. Use a teaspoon or melon baller to scoop up walnut-sized pieces (about 15g\/½oz) of the chocolate mixture. Press the palms of your hands into one of the cocoa powder plates to lightly coat and roll the truffle pieces quickly into a ball. Don’t roll the chocolate in your hands for too long or it will begin to melt.  Roll the truffle around in the cocoa powder on the other plate to lightly coat and place on the tray. Repeat until all of the mixture is used up to give about 40 truffles in total, pressing your hands into more cocoa powder when necessary to avoid sticking. It is best to wash your hands a few times throughout the process, but be sure to rinse them in cold water before drying so that they are nice and cold to avoid melting the truffles. Cover and chill in the fridge for at least 30 minutes before serving.  ","ingredients":" 250ml\/9fl oz whipping cream,  100g\/3½oz milk chocolate, finely chopped,  200g\/7oz dark chocolate, finely chopped ,  25g\/1oz unsalted butter, diced,  2-3 tbsp dark rum,  5 tbsp cocoa powder, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/jamaican_rum_truffles_09151"}