{"recipe_name":"Jamaican-style bean curry with battered chicken","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the curry, heat the vegetable oil in a medium frying pan. Add the garlic, shallot, paprika and mixed spice and cook for two minutes. Add the red wine, tomato ketchup, gungo beans and grated coconut and cook for a further eight minutes. Season, to taste, with salt and freshly ground black pepper. To make the battered chicken, heat a deep saucepan one-third full of oil until a breadcrumb sizzles in it. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) Place the self-raising flour, egg yolk, oregano, cayenne pepper and sparkling water into a large bowl and whisk together to form a batter mixture. Dredge the chicken strips in the seasoned plain flour, then dip the chicken into the batter mixture. Carefully add the battered chicken strips into the oil and fry in batches for four minutes, until puffed up and golden. Carefully remove with a slotted spoon and drain on kitchen towels. Sprinkle lightly with salt. To serve, spoon the curry onto a warm plate and place the chicken strips on top. ","ingredients":" 2 tbsp vegetable oil,  1 garlic clove, finely sliced,  ½ shallot, finely sliced,  1 tsp paprika,  1 tbsp ground mixed spice,  3 tbsp red wine,  2 tbsp tomato ketchup,  100g\/3½oz tinned gungo beans, rinsed and drained,  25g\/1oz fresh coconut, grated,  salt and freshly ground black pepper,  vegetable oil, for deep frying ,  100g\/3½oz self-raising flour ,  1 free-range egg yolk,  1 tbsp oregano,  1 tsp cayenne pepper,  150ml\/5fl oz sparkling mineral water,  1 skinless chicken breast, cut into strips,  55g\/2oz plain flour, seasoned, to taste, with salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/jamaicanstylebeancur_79687"}