{"recipe_name":"Japanese tea tower","author":"Howard Middleton","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 20-30","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lapsang souchong biscuits, in a large mixing bowl, cream the butter and sugar with the tea using a wooden spoon. Add the egg and beat in until well combined. Add the flour and mix in to make a dough. Using your hands, gather the dough together into a ball, then wrap it in cling film and leave in the fridge to chill for an hour. (While the dough is chilling you can cut out templates for all the square biscuits – it’s best to make these using sheets of squared paper.) Preheat the oven to 175C\/350F\/Gas 4. On a floured work surface, roll out the dough to an even thickness of 4-5mm\/¼in and then cut eight 9cm\/3½in square biscuits. (Save any spare dough, rewrap and pop back in the fridge – you can make extra biscuits later if you like.) Transfer to greased and lined baking trays and bake for about 12 minutes, or until visibly evenly baked and starting to tinge golden-brown at the edges. Slide the sheets of baking parchment (with biscuits on top) from the trays to wire racks.  Allow the biscuits to cool before attempting to remove them from the baking parchment. For the Earl Grey biscuits, follow the same method as for the lapsang souchong biscuits, but cream the butter and sugar with bergamot zest or Earl Grey tea. Cut into 8 x 7.5cm\/3in square biscuits (you can cut more than eight if you have enough dough). Bake for about 10 minutes and cool on wire racks. For the rose pouchong biscuits, follow the same method as before, but cream the butter and sugar with a few drops of rosewater. Cut into 6cm\/2½in square biscuits. Bake for about eight minutes. For the green tea biscuits, follow the same method as before, but cream the butter and sugar with the green tea powder. Cut out the following: 1 x 15cm\/6in square, 1 x 13cm\/5in square, 1 x 11cm\/4¼in square, 2 x 7cm\/2¾in squares, 2 x 5cm\/2in squares; 2 x 3cm\/1¼in squares, 4 x curlicues made with 4cm\/1½in and 2cm\/¾in circle cutters, 5 x 2cm\/¾in circles, 4 x 1.5cm\/⅝in circles. Take the three largest squares of dough (these are the curled roof sections). Cut similar size squares of baking parchment and attach each one to the underside of a corresponding round cake tin with a smidge of butter (so the 15cm\/6in square goes over the base of a 15cm\/6in round cake tin, and so on). Place the dough on top so that its four corners hang over the sides. Bake for 10-15 minutes depending on size.  Leave the biscuits to cool on the tins before attempting to remove. Bake the rest of the shapes of dough on flat baking trays for 4-9 minutes, depending on size.  Slide the sheets of baking parchment (with biscuits on top) from the trays to the wire cooling racks.  Allow the biscuits to cool before attempting to remove them from the baking parchment. For the royal icing, put the egg whites in a large mixing bowl and whisk them for about 30 seconds using an electric hand whisk. Gradually add the icing sugar, a bit at a time, beating continuously.  Add the lemon juice and scrape down the sides of the bowl with a spatula. Keep beating for about five minutes, or until the icing holds its shape. Mix in the blue and green food colours to make a light turquoise coloured icing. Cover with cling film until needed. To assemble, put the icing into a piping bag fitted with a small plain nozzle. Working on the board you’re using to serve the cake or a plate, stack the eight lapsang souchong biscuits, sandwiching each layer with royal icing.  Stack each biscuit at a 45-degree angle to the last, so the first biscuit has a flat side towards you, the second has a point towards you, and so on.  Take the largest green tea roof and stick this on top with more icing. Stack the eight Earl Grey biscuits as before, sandwiching each layer with royal icing and checking the levels throughout. Stick the medium-sized green tea roof on top. Stack the eight rose pouchong biscuits as before. Stick the small green tea roof on top. Take the remaining square green tea biscuits and stack them in descending order to form a pyramid roof.  Put a blob of icing on the back of the four curlicues and place one on each of the four sides of the roof. Using the icing, separately stack four of the 2cm\/¾in circles and then the 1.5cm\/⅝in circles to form a finial for the top of the roof, add another 2cm\/¾in circle on its edge on top of the finial and then put aside to set. Decorate the architectural features with the icing. Hold your breath and attach the finial. ","ingredients":" 200g\/7oz unsalted butter, softened,  200g\/7oz caster sugar,  2 tsp lapsang souchong tea (use very finely ground tea leaves from inside good-quality tea bags),  1 large free-range egg, lightly beaten,  400g\/14oz plain flour, plus extra for dusting,  200g\/7oz unsalted butter, softened,  200g\/7oz caster sugar,  ½ fresh bergamot, finely grated zest (or alternatively use 2 tsp finely ground Earl Grey tea leaves),  1 large free-range egg, lightly beaten,  400g\/14oz plain flour, plus extra for dusting,  100g\/3½oz unsalted butter, softened,  100g\/3½oz caster sugar,  few drops rosewater,  ½ large free-range egg, lightly beaten ,  200g\/7oz plain flour, plus extra for dusting,  200g\/7oz unsalted butter, softened, plus a little extra for greasing,  200g\/7oz caster sugar,  2 tsp matcha or sencha green tea powder,  1 large free-range egg, lightly beaten,  400g\/14oz plain flour, plus extra for dusting,  2 large free-range egg whites, at room temperature,  450g\/1lb icing sugar,  ½ lemon, juice only,  few drops blue and green food colouring","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/japanese_tea_tower_13818"}