{"recipe_name":"Japanese tofu, aubergine and lotus root stew","author":"The Hairy Bikers","programme":"The Hairy Bikers' Asian Adventure","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01t7nzx.jpg","method":"Bring a large pan of water to the boil. Peel the lotus root, cut off a third and set it aside. Add the rest of the lotus root to the pan. Turn the heat down and cook the root for 30 minutes at a very gentle simmer. Make sure you cook the root immediately after peeling as it will darken quickly. If preparing it in advance, put the lotus root in water with a little vinegar. Canned lotus root does not need preparing in this way and can be added straight to the stew. Finely slice the remaining third of the root on a mandolin or, using a very sharp knife, thinly to use it to make crisps. For the lotus root crisps, heat a wok or deep-fat fryer with 500ml\/18fl oz of vegetable oil to about 180C\/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cook the thinly sliced lotus root in two or three batches for about five minutes, or until golden-brown. Remove with a slotted spoon and drain on a plate lined with kitchen paper. Season with salt and shichimi togarashi and set aside.  Carefully pour the hot oil out of the wok you used for the crisps, reserving about five tablespoons in the bottom. Sprinkle the rice flour onto a plate and coat the tofu evenly. Heat the oil in the wok and fry the tofu in a couple of batches on a medium heat, turning until lightly golden-brown, slightly crispy and a little puffy - this will take about eight minutes.  Drain on a plate lined with kitchen paper to absorb the excess oil, and keep warm. Clean the wok and add the sesame oil and two tablespoons of fresh vegetable oil. Fry the onion for a few minutes, add the leeks and cook until soft and just slightly golden-brown. Add the sliced aubergine and cook for further six minutes, or until soft. Add the grated garlic and the grated ginger.  Fry again for a further couple of minutes stirring continuously, so that the garlic doesn't burn. Cut the cooked lotus root into 5mm slices and add it to the onion and aubergine mixture. Tip in the shimeji mushrooms, add two heaped tablespoons of miso paste and fry for a minute.  Add the mirin, soy sauce and 300ml\/10fl oz of boiling water. Bring back to the boil, and carefully fold in the tofu.  Place into serving bowls and top with the lotus root crisps. ","ingredients":" 1 fresh lotus root (medium size, about 400g\/14oz),  500ml\/18fl oz vegetable oil, plus a little extra for cooking ,  flaked sea salt,  shichimi togarashi (Japanese seven-spice seasoning) ,  4 tbsp rice flour (or cornflour if none available),  2 pieces firm tofu, about 375g\/13oz, cut into 2.5cm\/1in squares,  2 tbsp sesame oil,  1 medium onion, finely chopped,  2 medium leeks, trimmed, washed and sliced into 1cm\/½in diagonal slices,  2 Japanese aubergine, cut into 2cm\/¾in discs (alternatively you can use a normal aubergine cut into 2cm\/¾in discs),  4 garlic cloves, finely grated,  2 tbsp finely grated ginger ,  150g\/5½oz brown shimeji mushrooms, trimmed ,  2 tbsp heaped miso paste ,  4 tbsp mirin,  5 tbsp soy sauce","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/japanese_tofu_aubergine_65332"}