{"recipe_name":"Jerk pork belly with fresh pea and potato mash-up","author":"Ainsley Harriott","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Rub the pork belly with the jerk seasoning and place in a heavy-based frying pan, fat-side down. Cook for a few minutes until golden-brown then quickly sear on all sides to seal. Remove the pan from the heat and leave to rest for about five minutes. Pour the cider into a large jug with the chicken stock. Place the onion rings in a roasting tin and scatter over the garlic and thyme. Lay the rested pork belly on top, skin-side up, and pour the cider mixture around the meat. Season to taste with sea salt and freshly ground black pepper. Cover with tin foil and braise in the oven for 2½-3 hours, or until the pork is tender and completely soft. Remove the foil and turn the oven up to 230C\/450F\/Gas 8. Roast the meat for another 20-25 minutes until lightly crisp and golden-brown. Remove from the oven and set aside to rest. Meanwhile, place the potatoes in a large pan of salted water and bring to a boil. Cover and simmer for 12-15 minutes until tender then drain well. Tip the drained potatoes into a large bowl and gently crush each potato with the back of a fork until it just splits. Drizzle over the oil, season with sea salt and freshly ground black pepper and mix carefully until all the oil has been absorbed. Meanwhile, cook the peas in a separate pan of boiling, salted water for 3-4 minutes until tender then drain well. Mix the peas through the crushed potatoes and season to taste with sea salt and freshly ground black pepper. Arrange the mash-up on plates with slices of the pork belly. Serve at once with hot pepper sauce. ","ingredients":" 1.5kg\/3lb 5oz pork belly, rind removed,  1 tbsp dry jerk seasoning,  300ml\/10fl oz dry cider,  475ml\/17fl oz chicken stock,  1 onion, sliced into 1cm\/½in rings,  4 garlic cloves, sliced,  4 sprigs fresh thyme,  sea salt and freshly ground black pepper,  hot pepper sauce, to serve,  675g\/1lb 8oz new potatoes, scraped or scrubbed,  100ml\/3½fl oz extra virgin olive oil,  225g\/8oz fresh shelled peas","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/jerk_pork_belly_with_99669"}