{"recipe_name":"Jerk chicken with rice and peas","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the jerk chicken, place the vegetable oil into a deep, heavy- bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place the chicken legs into a large bowl and dredge in the jerk  seasoning to coat all over. Carefully place into the hot oil and deep fry, turning occasionally, for about 12 minutes, or until golden-brown  and completely cooked through. Remove from the oil with a slotted  spoon and drain on kitchen paper. Meanwhile, for the rice and peas, heat the oil in a large lidded  pan and fry the onion until softened but not coloured. Add the rice and stir well, then add the water and bring to the boil. Add the coconut milk, kidney beans and thyme, reduce the heat and simmer,  covered, for about 20 minutes, or until the rice is cooked. Season, to taste, with salt and freshly ground black pepper. To serve, place a good spoonful of the rice into a cup, then turn out onto a serving plate. Repeat with each serving and place 2-3 chicken legs on top of each pile of rice. Sprinkle with fresh coriander. ","ingredients":" vegetable oil, for deep frying,  12 chicken legs,  200g\/7oz good-quality jerk seasoning ,  50ml\/2fl oz vegetable oil,  1 onion, finely chopped ,  300g\/10½oz long grain rice,  400ml\/14fl oz water,  400ml\/14fl oz coconut milk,  400g\/14oz tin kidney beans, rinsed and drained,  3 tbsp chopped fresh thyme,  salt and freshly ground black pepper,  fresh coriander leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/jerkchickenwithricea_86519"}