{"recipe_name":"Jerusalem artichoke soup with crisp leeks and rocket pesto","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the soup, heat the oil and butter in a saucepan and gently soften the onion and garlic for 4-5 minutes. Add the artichokes and thyme and continue to cook for 3-4 minutes. Add the white wine and reduce for 2-3 minutes. Then add the stock and bring up to the boil. Reduce the heat and simmer until the artichoke is tender, about five minutes. Season with salt and freshly ground black pepper, and finally stir in the yoghurt. For the crisp leeks, heat the oil in a pan until a small cube of bread turns golden-brown in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) When the oil is hot, carefully lower the leek into the hot oil, using a slotted spoon, and fry for about 30 seconds or until starting to turn golden-brown. Remove with the slotted spoon and drain on kitchen paper. Sprinkle with salt to taste. For the rocket pesto, place the olive oil, lemon juice and rocket into a bowl. Using a hand-held blender, blend until smooth. Season with salt and freshly ground black pepper. To serve, pour the soup into a serving bowl, arrange the leeks on top and drizzle the pesto on top in a circle. ","ingredients":" 1 tbsp olive oil,  25g\/1oz butter,  ½ onion, finely chopped,  1 garlic clove, finely chopped,  200g\/7oz Jerusalem artichokes, peeled and chopped,  1 sprig fresh thyme, chopped,  75ml\/2½fl oz white wine,  300ml\/½ pint vegetable stock,  salt and freshly ground black pepper ,  2 tbsp Greek yoghurt,  150ml\/5½fl oz vegetable oil, for shallow frying,  ¼ leek, finely sliced into matchsticks,  salt ,  4 tbsp olive oil,  ½ lemon, juice only,  small handful fresh rocket leaves,  salt and freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/jerusalemartichokeso_88168"}