{"recipe_name":"John Dory with orange, fennel and caper salad","author":"Matt Tebbutt","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the parboiled potatoes into a bowl with the olive oil and season, to taste, with salt and freshly ground black pepper. Stir until well combined. Heat a griddle pan over a medium heat until hot. Add the potatoes in batches and cook for four minutes on each side or until tender and golden-brown on both sides. Remove from the pan and keep warm. Repeat the process with the remaining batches of potatoes. Sprinkle the flour onto a plate. Season with salt and freshly ground black pepper. Dust the John Dory in the seasoned flour. Heat half the butter in a frying pan over a medium heat until foaming and fry the John Dory for three minutes on each side or until the fish is just cooked through (do this in batches if necessary). Add the remaining butter and the lemon juice to the pan and cook for another minute, basting the fish with the lemon and butter mixture. For the fennel and caper salad, drain the fennel thoroughly and place into a large bowl with the orange segments. Add the capers and one-third of the dill. Stir until well combined. To make the dressing, place the reserved juice from the oranges into a small bowl and add the oil, white wine vinegar and the remaining dill. Whisk until well combined. Drizzle the dressing over the fennel and orange salad and mix well. To serve, place one John Dory fillet onto each of four serving plates. Spoon the potatoes and orange and fennel salad alongside and garnish with the anchovy fillets and caper berries. ","ingredients":" 400g\/14oz new potatoes, cut into 2.5cm\/1in slices, parboiled,  2 tbsp olive oil,  200g\/7oz flour,  salt and freshly ground black pepper,  4 fillets John Dory,  50g\/1¾oz butter,  ½ lemon, juice only,  2 fennel bulbs, thinly sliced, (set aside in a bowl of ice cold water),  2 oranges, peeled, segmented, juice reserved,  2 tsp baby capers, drained,  1 bunch chopped fresh dill,  3 tbsp olive oil,  1 tbsp white wine vinegar,  8 salted anchovies, cut in half lengthways,  4 tsp caper berries","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/johndorywithorangefe_92735"}