{"recipe_name":"Jungle curry of guinea fowl with coconut and lime rice","author":"John Torode","programme":"MasterChef","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the curry paste, wrap the shrimp paste in a foil parcel and toast in a dry hot frying pan or directly on a gas burner until fragrant. In a large pestle and mortar, crush together the Thai shallots, garlic cloves, yellow or green chillies, red chillies, galangal, palm sugar, turmeric, salt and rehydrated dried shrimps. For the curry, in a large wok, heat the vegetable oil until hot. Add the curry paste and green cardamons and cook to a dry paste. Add the guinea fowl joints and fry for a few minutes. Add the krachai, the lime leaves, fish sauce, Shaoxing wine and chicken stock. Cook until the guinea fowl is cooked through. This will take around 30 minutes.  Taste and add caster sugar to taste. Meanwhile, cook the rice. Wash the rice three times and leave to sit for 10 minutes. Place all the ingredients for the rice into a pot and cover with water. Place a lid on, bring to the boil and cook for four minutes and turn off and allow to stand covered for 12 minutes, or until cooked to your liking. Garnish the finished dish with snake beans, bamboo shoots, lime leaves and sliced red chilli. ","ingredients":" 75g\/2½oz shrimp paste,  6 Thai shallots,  3 garlic cloves,  4 small yellow or green chillies, cut in half, seeds removed,  6 long red chillies, seeds removed,  50g\/1¾oz galangal, peeled,  40g\/1½oz palm sugar,  20g\/¾oz fresh turmeric,  2 tsp fine salt,  30g\/1oz dried shrimps, soaked for 30 minutes then drained,  2 tbsp vegetable oil,  12 green cardamom pods,  1 guinea fowl, divided into eight joints, skin slashed with a knife,  5 stems of krachai, shredded (a milder version of galangal and ginger, from the same family),  3 lime leaves, spines removed, shredded,  50ml\/2fl oz fish sauce,  100ml\/3½fl oz Shaoxing rice wine,  500ml\/18fl oz chicken stock,  caster sugar, to taste,  200g\/7oz long grain rice,  50g\/1¾oz thick coconut milk (chill the can of coconut milk in the refrigerator for 30 minutes, spoon the thick coconut milk from the top of the can),  1 tsp salt,  pinch caster sugar,  6 lime leaves, torn,  4 snake beans, cut into 1cm\/½in  pieces,  1 bamboo shoot, shredded,  2 lime leaves, shredded,  1 red chilli, sliced and seeds removed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/jungle_curry_of_guinea_73580"}