{"recipe_name":"Kale and kohlrabi kimchi with pulled pork","author":"Tom Hunt","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the raw kale with sesame seeds and honey, pull the kale leaves off the thick stalks. Finely chop the stalks and roughly chop the leaves, then wash both. Drain well, Place the kale in a bowl with the salt, lemon juice and honey. Massage the dressing into the leaves for 2-3 minutes, bruising them so they soak up the juices. Leave for 30 minutes, then pour off the excess liquid. Add the ginger and sesame seeds, mix and dress with extra virgin olive oil, if using.  For the kale and kohlrabi kimchi, bring 400ml\/14fl oz water to a gentle simmer and add the rice flour. Keep stirring for a few minutes until it thickens and starts to bubble. Simmer for another 1-2 minutes until it becomes an opaque porridge.  Using a hand-held blender or a food processor, blend the garlic, onion and fish sauce to a purée. Transfer to a bowl, add the flour mixture and chilli powder. Mix well, then add the kohlrabi, carrot and leek and finally the raw kale. Mix well. Put into a sterilised non-metallic tub, press down to pack it in and cover with a lid. Eat it fresh with sesame seeds sprinkled on top, or leave it in a cool room for 2-3 days. After two days, check if you can see any tiny bubbles; they will prove it is fermenting. If not, leave it out of the fridge a little longer, until the fermentation process starts. Keep the kimchi in a sealed container in the fridge and eat within three weeks. The raw kale is best eaten immediately. To serve, heat a griddle pan. Slightly oil and rub the garlic and salt into the bread and cook for 1-2 minutes on each side. Shred leftover pork and reheat it in a frying pan until hot right through. Serve on the bread with a spoonful of kimchi on top. ","ingredients":" 400g\/14oz kale,  1 tsp salt,  ½ lemon, juice only,  1 tbsp honey,  2-3cm\/1in piece fresh root ginger, finely chopped,  2 tbsp sesame seeds,  extra virgin olive oil (optional),  4 tbsp rice flour (alternatively use spelt or plain flour),  8 garlic cloves, chopped,  1 onion, roughly chopped,  50ml\/2fl oz fish sauce,  4 tbsp Korean chilli powder, or 2 tbsp cayenne pepper,  1 small kohlrabi (about 250g\/9oz), peeled and cut into 5mm\/¼in matchsticks,  1 carrot, cut into matchsticks,  1 leek, thinly sliced,  raw kale with sesame seeds and honey (from above),  sesame seeds (optional),  500g\/1lb 2oz leftover pulled pork or shredded belly pork ,  1 loaf sourdough bread, cut into thick slices,  1 whole bulb of garlic, cut in half,  2 tbsp sea salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/kale_and_kohlrabi_kimchi_63904"}