{"recipe_name":"Keralan seafood pie","author":"Vivek Singh","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pie, preheat the oven to 200C\/400F\/Gas 6. First make the sauce. Heat the oil in a large frying pan, add the curry leaves, onion, ginger and green chillies and cook, stirring, until the onion is soft.  Add the mussels and turmeric, followed by the rice flour.  Mix the rice flour in evenly, then add coconut milk and salt, and bring to a simmer.  Cook for 2-3 minutes, until the mussels open up and sauce begins to turn glossy.  Remove the mussels and take the meat out of the shell, discarding the shells. Set the mussels aside, and continue to cook the sauce until it thickens and becomes very thick. Remove the sauce from the heat, cool and mix the raw seafood and the mussel meat through the sauce. Divide the pie filling equally among four shallow cast-iron skillets, garnish with the green chillies and curry leaves and cover with the puff pastry disc. Brush the pies with egg, sprinkle with black onion seeds and bake in the oven for 15 minutes, or until the fish is cooked through and the pastry crisp and golden brown. For the salad, mix together all the ingredients for the salad. Serve the pie with the sprouted fenugreek and moong lentil salad alongside. ","ingredients":" 2 tbsp coconut oil or vegetable oil,  10 fresh curry leaves,  1 large onion, sliced,  2.5cm\/1in fresh root ginger, cut into fine strips,  4 green chillies, split open lengthways,  500g\/1lb 2oz mussels in the shell, cleaned,  ½ tsp ground turmeric,  ½ tbsp rice flour,  500ml\/18fl oz extra thick coconut milk,  1 tsp salt,  250g\/9oz peeled and deveined raw prawns,  200g\/7oz undyed smoked haddock fillet, diced into 1 inch pieces,  200g\/7oz cleaned squid tubes or cuttle fish, scored ,  375g\/13oz all butter puff pastry – rolled 3mm\/1\/8in thick, 4 x 16cm diameter discs,  2 eggs, lightly beaten,  1 tbsp black onion seeds,  115g\/4oz sprouted fenugreek seeds,  115g\/4oz sprouted moong beans,  1 tomato, deseeded, cut into ½ cm\/¼ in dice,  ½ cucumber, deseeded, cut into ½ cm\/¼ in dice,  1 green chilli (optional), finely chopped,  ½ lemon, juice only,  ½ tsp salt,  ½ tsp sugar,  2-3 tbsp olive oil,  10 fresh curry leaves,  2 green chillies, split open lengthways","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/keralan_seafood_pie_15063"}