{"recipe_name":"Keralan crab with Currimbhoy salad","author":"Cyrus Todiwala","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Keralan crab, make sure that all the ingredients are prepared before you start cooking. Place the oil in a wok or kadhai (a traditional Indian iron wok) and bring the heat up until it forms a haze. Add a couple of mustard seeds to check if they crackle immediately - take care doing this as they will pop as they hit the pan. When the oil is ready, carefully add the mustard seeds and, if possible, cover the pan with a lid for a few moments to prevent the seeds from flying off and hitting you.  As soon as the crackling dies down and the aroma resembles the smell of roasting, add the ginger, garlic, curry leaves and the green and red chillies. As soon as the garlic turns pale, but not deep golden-brown, add the shallots and continue to fry until soft. Add the coconut and fry for 3-4 minutes. Add the chilli powder and ground turmeric. Fry for a further 30 seconds before adding the crabmeat, mixing well with a wooden spoon for a further minute. Add the tomato and coriander and mix to combine. Add salt and freshly ground black pepper, to taste. For the Currimbhoy salad, start by making the mayonnaise. Place the egg yolk, vinegar and mustard into a food processor and blend until pale and creamy. With the motor running, gradually pour in the oil in a steady stream until the mayonnaise has thickened. Measure 200g\/7oz of the mayonnaise into a large bowl (any remaining mayonnaise should be covered and placed in the fridge - do not keep it for longer than two days).  Add the garlic, chillies, coriander leaves and lime juice to the mayonnaise in the bowl and mix thoroughly. Season with salt and freshly ground black pepper and set aside. Heat a frying pan until hot and add the olive oil. Add the bread, season with salt and freshly ground black pepper and fry for 2-3 minutes or until golden-brown and crisp on all sides. Remove the fried bread (croûtons) from the pan and drain on kitchen paper. Add the chopped eggs and lettuce leaves to the flavoured mayonnaise and mix - take care not to over mix as the lettuce will go limp very rapidly.  Add half of the croûtons to the bowl while mixing, reserving the rest for garnish. To serve, pile the salad onto a plate, top with more croûtons and coriander leaves and spoon the crab alongside. Serve immediately. ","ingredients":" 1 tbsp sunflower oil,  1 tsp mustard seeds,  2.5cm\/1in fresh ginger, peeled and finely chopped,  1 garlic clove, finely chopped,  3-4 curry leaves, finely shredded,  1 green chilli, chopped,  1 small dried red chilli, soaked in water, then drained and finely sliced,  2 small shallots, finely chopped,  75g-110g\/3oz-4oz fresh coconut, grated,  ½ tsp red chilli powder,  ¼ tsp ground turmeric ,  200g\/7oz white crabmeat, picked and all shell removed,  1 plum tomato, seeds removed, finely chopped,  1 tbsp fresh coriander leaves, roughly chopped,  salt and freshly ground black pepper,  1 free-range egg yolk,  1 tsp white wine vinegar,  ½ tsp Dijon mustard,  150ml\/5fl oz rapeseed oil,  2 garlic cloves, finely chopped,  2 green chillies, finely chopped,  3 tbsp coriander leaves, roughly chopped,  ½ lime, juice only,  salt and freshly ground black pepper,  2 tbsp olive oil,  4 thin slices white bread, cut into cubes,  4 hard boiled eggs, roughly chopped to about ½cm\/0.2in ,  250g\/9oz Cos lettuce or any large leafy lettuce, cut into 2.5cm\/1in pieces,  small handful fresh coriander leaves, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/keralancrabwithcurri_87982"}