{"recipe_name":"Kerala-style Syrian Christian water buffalo sirloin steak","author":"Atul Kochhar","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the marinade, place all the spices into a dry frying pan and heat until lightly toasted. Remove the spices from the pan and place in a bowl with the vegetable oil. Mix well. For the curry, place the steaks in a shallow non-reactive bowl. Spoon half of the marinade over the steaks and rub in. Leave the meat to marinate for 5-10 minutes, and set the remaining marinade aside. Heat a frying pan over a medium heat and add the vegetable oil. Add the mustard seeds (CAUTION: the mustard seeds will start to pop. Keep the pan well away from your face and eyes.)  After the mustard seeds have started to pop, add the sliced shallots. Fry the shallots until light brown in colour, then add the garlic, ginger, curry leaves and coconut slices. Fry for 2-3 more minutes and then add half a teaspoon of the reserved marinade spice mixture. Stir in the tomato and coconut milk. Bring to a boil, reduce the heat and simmer for two minutes. Heat a griddle pan until hot, add the steaks and cook for 2-3 minutes on each side. Remove the meat from the pan, cover and leave in a warm place for a couple of minutes to allow the meat to rest.  To serve, place a steak onto each plate, spoon some curry sauce over and finish with the micro cress leaves to garnish. ","ingredients":" 1 tsp dried chilli flakes,  1 tsp coriander seeds,  1 tsp ground turmeric ,  5 black peppercorns,  1 tsp cumin seeds,  1 tsp fennel seeds ,  1 tsp ground cinnamon,  1 tsp ground cloves,  1 tsp ground cardamom,  1½ tsp vegetable oil,  4 water buffalo sirloin steaks,  2 tbsp vegetable oil,  1 tsp mustard seeds,  3 large banana shallots, finely sliced,  2 garlic cloves, finely sliced,  1 thumb-sized piece fresh root ginger, peeled and finely sliced,  10 curry leaves (available from specialist Indian stores),  ¼ fresh coconut, peeled and cut into 8-10 slices,  1 tomato, chopped,  110ml\/4fl oz coconut milk,  1 small bunch fresh micro cress leaves, to garnish (available from specialist suppliers online)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/keralassyrianchristi_91000"}