{"recipe_name":"Key lime and elderflower pie","author":"Emily Angle","programme":null,"prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/key_lime_and_elderflower_59661_16x9.jpg","method":"For the biscuit base, finely crush the biscuits by placing into a sealed plastic bag and bashing with a rolling pin (alternatively, pulse to crumbs using a food processor). Transfer to a mixing bowl and add the sugar, stirring well to combine. Pour the melted butter over the biscuit crumbs and mix until thoroughly combined. Place the crumb mixture in a 23cm\/9in springform cake tin, and press into the tin evenly with your fingers. Build up the sides of the crust to a height of about 4cm\/1½in. Place in the fridge for 20 minutes, or until firm.  Preheat the oven to 170C\/325F\/Gas 3. For the filling, in a large mixing bowl whisk together the condensed milk with the lime juice, lime zest, elderflower cordial, egg yolks and half the cream until the mixture thickens. Pour mixture into the pie crust, give the tin a little shake to level the top and bake for 15-20 minutes. The pie is ready when the filling has a slight wobble.  Set aside to cool for half an hour in the baking tin, then chill the pie in a refrigerator for as long as possible.  When ready to serve, whip the remaining cream with icing sugar, to taste. Be careful not to overwhip it; the cream should remain soft and billowy.  Spoon the whipped cream onto the top of the pie.  Serve in slices with a few mint leaves for garnish. ","ingredients":" 175g\/6oz digestive biscuits (or ginger biscuits),  80g\/3oz butter, melted,  50g\/2oz caster sugar,  1 x 400g\/14oz tin condensed milk,  100ml\/3½fl oz freshly squeezed lime juice (about 3 limes),  1 lime, zest only, finely grated ,  75ml\/2½fl oz elderflower cordial (one that has a 1 to 10 dilution ratio),  3 free-range egg yolks,  200ml\/7fl oz double cream,  icing sugar, to taste,  mint sprigs, for garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/key_lime_and_elderflower_59661"}