{"recipe_name":"Key lime pie","author":"Ryan Chong","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes one very large pie, or 2 small pies","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/key_lime_pie_53484_16x9.jpg","method":"For the sweet ginger pastry, sift the flour, icing sugar, ground ginger and salt into a large mixing bowl.   Rub in the cubed butter until the mixture resembles breadcrumbs. Mix the egg yolk into the water and add into the flour mixture, stirring with your hands until the mixture just comes together as a dough.  Add olive oil if the dough is a little dry.  Wrap the pastry in cling film and set aside in the fridge for 20-30 minutes.  Preheat the oven to 200C\/400F\/Gas 6. Roll out the dough on a lightly floured surface to the thickness of a pound coin.   Drape the dough over the rolling pin and use it to transfer the pastry to a 30cm\/12in tart case.  Press the pastry into the tin, ensuring there are no gaps in the corner. Allow the excess pastry to overhang the tin.  Cover with clingfilm and chill for 20 minutes. Prick the bottom of the pastry case with a fork. Line the case with baking paper and weigh it down with baking beans, rice or lentils. Bake blind for 15 minutes, then remove the baking beans and paper and bake for a further 5-10 minutes.  Set aside to cool on a rack. Reduce the oven temperature to 170C\/325F\/Gas 3. For the lime filling, in a large mixing bowl whisk together the condensed milk with the lime juice, lime zest and egg yolks until the mixture thickens. Stir in the chopped stem ginger.  Taste the filling, and fold in some icing sugar, if needed.  Pour mixture into the pie crust, smooth the top with a palette knife and bake for 15-20 minutes.  The pie is ready when the filling has a slight wobble or when the temperature in the centre has reached 70C when checked with a probe thermometer.  Set aside to cool for half an hour in the baking tin, then chill the pie in a refrigerator for as long as possible.   Place the sugar in a heavy-based deep saucepan with six tablespoons water over a medium heat. Bring the mixture to the boil without stirring, brushing down any sugar crystals on the side of the pan with a wet pastry brush. Remove the syrup from the heat when it reaches 120C\/248F (the firm ball stage). In a free-standing mixer, whisk the egg whites until stiff peaks form when the whisk is removed. While whisking, pour the boiling syrup onto the egg whites in a thin, steady stream, being careful not to pour the syrup on to the whisk as it may splash onto your hands. Continue to whisk the egg whites until the mixture is stiff, shiny and stable. Place the meringue into a piping bag fitted with a 1.5cm round nozzle.   Once the pie is chilled, sprinkle the reserved lime zest and grated chocolate over the top of the pie.   Pipe the meringue around the edge of the pie in generous swirls.   Using a cook’s blowtorch, gently caramelise the meringue so that the top is light golden-brown. Finish by placing the lime slices and mint sprigs on the meringue and dust over some icing sugar. ","ingredients":" 400g\/14oz plain flour ,  80g\/3oz icing sugar,  4 tsp ground ginger,  pinch salt,  250g\/9oz cold unsalted butter, cut into cubes,  3 free-range eggs, yolks only ,  50ml\/2fl oz ice cold water,  1 tbsp olive oil (if needed),  2 x 400g tins condensed milk,  240ml\/8½fl oz freshly squeezed lime juice (about 7 limes),  4 tsp grated lime zest (about 7 limes), plus extra for garnish,  4 eggs, separated,  225g\/8oz sugar,  3 lumps of stem ginger, chopped,  1 lime, very thinly sliced,  1 tsp grated plain chocolate,  6 sprigs mint,  icing sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/key_lime_pie_53484"}