{"recipe_name":"Baked Roquefort with figs and balsamic onions","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. In a bowl, crush the oatcakes and mix in the melted butter, then press into a 25cm\/10in springform cake tin.  For the filling, place the ricotta cheese, soft cheese, eggs and salt and freshly ground black pepper into a food processor and pulse until smooth.  Add the Roquefort cheese and dried figs to the food processor and pulse again.  Spoon the cheese mixture onto the oatcake base and transfer to the oven to bake for one hour. Remove from the oven and allow to cool. For the onions, place the balsamic vinegar, caster sugar, nutmeg, baby onions and garlic into a small pan over a medium heat. Bring to the boil, then reduce the heat to simmer until the onions have softened and the liquid has reduced to a syrup. To serve, cut the cheesecake and place a wedge of the cheesecake onto each plate. Top with some of the onions and place a small handful of watercress, mustard cress and beetroot leaves alongside. Drizzle around the remaining syrup from the onions. ","ingredients":" 250g\/8½oz oatcakes,  125g\/4½oz melted butter,  700g\/1lb 8½oz ricotta cheese,  300g\/10½oz full-fat soft cheese,  6 free-range eggs, beaten,  salt and freshly ground black pepper,  200g\/7oz Roquefort cheese,  200g\/7oz dried figs, chopped,  200ml\/7fl oz balsamic vinegar,  200g\/7oz caster sugar,  1 tsp freshly grated nutmeg,  200g\/7oz baby onions,  1 garlic clove, crushed,  salt and freshly ground black pepper,  watercress,  small punnet mustard cress, snipped,  beetroot leaves","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakedroquefortwithfi_87000"}