{"recipe_name":"Kids’ minestrone soup ","author":"Jo Ingleby","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/kids_minestrone_soup_40496_16x9.jpg","method":"Kid’s job: Chop all of the vegetables into tiny pieces, as small as you can (you can leave the peas whole). You can use your fingers, or a salad knife (with an adults help) or use clean child-friendly scissors to chop the herbs, cabbage and spring onions. Adult’s job: Heat a large saucepan and add a teaspoon of olive oil or butter. Gently fry the spring onion or leek for five minutes, stirring often. Adult’s job: Add the garlic, the rest of the vegetables, dried herbs and tomato puree and stir for a minute. Adult’s job: Add the tinned tomatoes and stock and bring to the boil. Adult’s job: Add the pasta and any meat or beans you want to use and cook for 8 more minutes. Kid’s job:Get your grown up to spoon a little of the soup into a small bowl for you and let it cool a little. Have a taste and see what you think…if you like you can add a squeeze of lemon juice, a little sugar or some black pepper.  Adult’s job: spoon into bowls to serve. You can either sprinkle herbs on top or put them in a small bowl on the table for the kids to taste first. The soup is great served with chunky bread. ","ingredients":" 1 tsp olive oil or butter, for frying,  2 spring onions or a small leek ,  1 carrot ,  handful peas (frozen or fresh) ,  small handful green beans (frozen or fresh),  couple of cabbage leaves (any type of cabbage, kale, spinach or greens will do),  1 garlic clove, finely chopped by an adult ,  1 tsp dried oregano, basil or thyme or mixed dried herbs ,  1 tsp tomato purée,  1 x 400g\/14oz tin chopped tomatoes,  1 x 400g\/14oz tin cannellini beans,  2 rashers cooked back bacon or ham, chopped (optional),  600ml\/20fl oz reduced-salt vegetable stock,  30g\/1oz dried small pasta such as orzo, stars, alphabet shapes or broken dried spaghetti,  small bunch fresh basil or parsley, chopped,  lemon juice, to taste,  sugar, to taste,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/kids_minestrone_soup_40496"}