{"recipe_name":"Baked salmon served with seafood and  pesto potato","author":"Gino D'Acampo","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Place the salmon in the middle of a large roasting tin (at least 10cm tall). Stuff the belly of the salmon with the lemons, garlic cloves and some of the parsley. Surround the salmon with the clams, prawns, mussels, cherry tomatoes and any remaining lemons and garlic. Pour over the white wine and the olive oil and season with salt and freshly ground black pepper.  Completely cover the salmon with the remaining parsley. Cover with foil and place in the oven. Bake for approximately 45 minutes, until the fish is cooked and the flesh starts to come away from the bone easily. Remove from the oven and place on a large dish surrounded by the cooked clams, prawns, mussels and tomatoes. Drizzle all over with any roasting juices. For the potatoes, heat a saucepan of water and bring to the boil. Add a pinch of salt, then add the potatoes and cook until al dente. Drain the potatoes, allow them to cool down and then cut them in half. In a large bowl mix the pesto sauce and potatoes together. Season with salt and freshly ground black pepper and serve immediately with the salmon. ","ingredients":" 1.5kg\/3lb 5oz fresh salmon, cleaned,  4 unwaxed lemons, quartered,  5 garlic cloves, cut in half,  1 large bunch fresh flatleaf parsley,  200g\/7oz clams,  200g\/7oz fresh prawns ,  200g\/7oz mussels,  200g\/7oz fresh cherry tomatoes,  2 glasses dry white wine,  8 tbsp extra virgin olive oil,  salt and freshly ground black pepper to taste,  1kg\/2¼lb new potatoes,  3 tbsp pesto sauce,  salt and freshly ground black pepper to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakedsalmonservedwit_78845"}