{"recipe_name":"King crab, asparagus, garlic and hazelnuts","author":"Aggi Sverrisson","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the vegetable stock, place all ingredients into a saucepan and cover with 400ml\/14fl oz of water. Bring to a boil and simmer for 10 minutes. Allow to cool then strain. For the vegetable broth, place all ingredients into a saucepan and set aside. For the bonito and garlic dressing, place all ingredients into a bowl. For the crab, place a frying pan over a medium heat with a little olive oil and bring the saucepan of vegetable bonito broth to the boil. Put the crab in the frying pan and gently fry for about two minutes, or until cooked. Place the chopped asparagus in the broth and cook for 30-40 seconds. Add the blanched garlic cloves and wild garlic leaves and set aside. Once the crab is cooked, place the crab into a bowl with the bonito and garlic dressing and mix together. To serve, place the asparagus, wild garlic cloves and leaves into serving bowls with a little bonito broth. Place the dressed crab into separate bowls and serve. ","ingredients":" 4 carrots, finely diced,  2 onion, finely diced,  2 celery sticks, finely diced,  1 leek, finely diced,  pinch salt,  400ml\/14fl oz vegetable stock (see above),  pinch salt,  1 tsp lemon juice,  100ml\/3½fl oz olive oil,  40ml\/1½fl oz bonito vinegar (available from specialist Japanese suppliers),  10g\/¼oz new season garlic, blanched and chopped,  10 wild garlic leaves, blanched and chopped,  ½ tsp finely chopped parsley,  ½ tsp finely chopped chives,  10g\/¼oz shelled roasted hazelnuts, chopped roughly,  pinch salt ,  lemon juice, to taste,  dash olive oil,  240g\/8½oz fresh crabmeat or king crabmeat ,  8 spears asparagus, chopped,  8 new season garlic cloves, peeled and blanched until soft and tender,  8 wild garlic leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/king_crab_asparagus_12453"}