{"recipe_name":"King prawns in coconut curry sauce","author":"Vivek Singh","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2-3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the boiled basmati rice, add 600ml20fl oz of water to the saucepan, then add the rice and salt. Cook on a low heat until all the water has disappeared. Place a lid on top and set aside for 20 minutes. For the prawns, marinate the prawns with the turmeric and salt in a shallow dish in a cool place for 30 minutes to an hour. Heat 60ml\/2fl oz of the oil in a pan and add the bay leaves and onion paste. Fry gently for 6-8 minutes on medium heat, or until very light brown. Meanwhile heat the remaining oil in a non-stick frying pan and fry the prawns briefly for a minute or two. Set aside. Mix the ground cumin, turmeric and ginger-garlic paste in 75ml\/2½fl oz of water and add to the onions, reduce the heat and cook for 2-3 minutes stirring regularly.  Add salt, green chillies and the prawns and stir for one minute. Mix in the coconut milk and simmer for 2-3 minutes, or just until the prawns are cooked, adding a little shellfish stock if necessary.  Season to taste with sugar. Sprinkle over the cardamom powder and coriander and a squeeze of lime. Stir the ghee and smoked salt into the rice and serve immediately. ","ingredients":" 350g\/12oz basmati rice ,  1 tbsp ghee,  pinch smoked salt,  ½ tsp ground turmeric,  1 tsp salt,  400g\/14oz freshwater prawns, peeled and de-veined (the largest size you can find),  90ml\/3fl oz vegetable oil,  2 bay leaves,  3 medium red onions, blended to a fine paste,  1 tbsp ground cumin,  1 tsp ground turmeric,  2 tbsp ginger and garlic paste,  1 tsp salt,  2 green chillies, slit lengthways ,  75ml\/2½fl oz coconut milk,  shellfish stock, if needed,  ½ tsp sugar (optional),  ½ tsp ground green cardamom,  1 tbsp chopped fresh coriander,  ½ lime, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/king_prawns_in_coconut_61536"}