{"recipe_name":"Kipper fishcakes with tartare sauce and watercress salad","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the kipper fishcakes, place the kippers and milk into a saucepan and bring to the boil. Remove from the heat and set aside to cool. Once cool, drain and flake the fish, removing as many bones as possible, and set aside. (Discard the milk.) Mash the cooked potatoes in a large bowl until smooth, then add the parsley, egg yolk and kippers. Season, to taste, with salt and freshly ground black pepper. Stir until well combined. Shape the mixture into four equal-sized patties, then chill in the fridge for two hours. Sprinkle the flour onto a plate. Beat the eggs in a bowl. Sprinkle the Japanese panko breadcrumbs onto a separate plate. Once the fishcakes have chilled, dredge each in the flour, then dip in the egg and finally roll in the breadcrumbs. Heat the olive oil in a frying pan over a medium heat and fry the fishcakes for three minutes on each side, or until golden-brown on each side. Keep warm in the oven. For the tartare sauce, blend the egg yolks, white wine vinegar, Dijon mustard and salt in a food processor. While the motor is running, gradually pour the oil into the food processor in a steady stream until the mixture thickens. Stir in the cornichons, capers, parsley, chives and lemon juice. Season, to taste, with salt and freshly ground black pepper. For the watercress salad, place the watercress in a bowl, add the oil and season, to taste, with salt and freshly ground black pepper. Mix together until well combined. To serve, spoon the tartare sauce into a four small bowls and place one onto each of four serving plates, along with a kipper fishcake. Divide the watercress salad among the plates and garnish with the lemon wedges. ","ingredients":" 4 kipper fillets,  400ml\/14fl oz whole milk,  450g\/1lb floury potatoes (such as King Edward or Maris Piper), peeled, cut into equal-sized pieces, boiled until tender,  2 tbsp chopped fresh parsley,  1 free-range egg yolk,  salt and freshly ground black pepper,  200g\/7oz plain flour,  3 free-range eggs, beaten,  200g\/7oz Japanese panko breadcrumbs (available from specialist websites and some Asian supermarkets),  2 tbsp olive oil,  2 free-range egg yolks ,  1 tsp white wine vinegar,  ½ tsp Dijon mustard,  1 tsp salt ,  275ml\/10fl oz rapeseed oil,  2 cornichons, drained, finely chopped ,  2 tsp capers, drained, finely chopped ,  1 tbsp chopped fresh parsley ,  1 tsp chopped fresh chives ,  1 lemon, juice only,  salt and freshly ground black pepper,  2 bunches watercress leaves, washed,  1 tbsp extra virgin olive oil,  Salt and freshly ground black pepper,  lemon wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/kipperfishcakeswitht_92672"}