{"recipe_name":"Kipper pâté with bruschetta, beetroot salsa and caper dressing","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the kipper pâté, place all of the pâté ingredients into a food processor, season with salt and freshly ground black pepper and blend to a smooth paste. To make the dressing, place the capers and olive oil into a clean food processor. Season, to taste, with salt and freshly ground black pepper and blend together until smooth.  To make the salsa, whisk together the lemon juice and olive oil in a large bowl. Add the beetroot, onion and herbs, season, to taste, with salt and freshly ground black pepper and toss together to coat the beetroot. To make the bruschetta, heat a griddle pan until smoking. Drizzle the soda farl with olive oil, season, to taste, with salt and freshly ground black pepper and place onto the griddle pan to char-grill for two minutes on each side. Remove from the griddle and cut the farl into even slices. To serve, spoon the pâté into the centre of a plate. Drizzle the dressing and the beetroot salsa around the plate and serve the soda farl bruschetta alongside. ","ingredients":" 1 tbsp olive oil,  100g\/3½oz cream cheese ,  2 spring onions, finely chopped,  1 kipper, skin removed and chopped,  50g\/1¾oz Greek yoghurt,  1 lime, juice only,  1 tbsp chopped fresh chives ,  salt and freshly ground black pepper,  50g\/1¾oz capers,  50ml\/2fl oz olive oil,  salt and freshly ground black pepper,  1 tbsp olive oil,  ½ lemon, juice only,  1 cooked beetroot, finely chopped,  1 tbsp red onion, finely chopped,  1 tbsp finely chopped fresh chervil ,  1 tbsp chopped fresh dill,  salt and freshly ground black pepper,  1 tbsp olive oil,  1 slice ready-made soda farl","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/kipperpatewithbrusce_80190"}