{"recipe_name":"Indian stuffed sea bass with a tomato patia","author":"Cyrus Todiwala","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Blend half of the lime juice with the turmeric. Apply inside all of the fish and set aside. Put the prawns and the remaining ingredients (apart from the oil) in a blender and blend together. Season with more salt if required and add the remaining lime juice. Fill each fish with the prawn mixture. Press the fish down to get a straight shape and transfer to the fridge. Meanwhile, make the patia. Heat the oil in a deep saucepan and add the cinnamon and cook for 30 seconds. Add the onions and sauté until soft and brown, stirring regularly. Meanwhile blend the dry powders in a small bowl with the vinegar and a little water to make a smooth paste. Cover and set aside. When the onions are brown add the ginger, garlic and chillies. Sauté for 2-3 minutes. Add a little water to the pan to release any sugars from the onion stuck to the bottom of the pan. Add the blended powders to the pan. When the mixture becomes dry add the tomatoes, tamarind and jaggery and cook gently for a further 4-5 minutes. Season with salt, add the coriander and remove from the heat.  Preheat the oven to 160C\/140C Fan\/Gas 3.   To cook the fish, heat the oil in a large frying pan with an oven-proof handle. Carefully add the fish to the pan and cook over a medium heat. When the fish has browned on one side, turn it over. The best way is to turn the fish from the centre and keep either a fork or a spatula on top and a flat fish slice or spatula at the bottom. When both sides of the fish are brown, place in the oven for 10-12 minutes until cooked through.  Divide the fish between 4 plates and pour over the patia. Sprinkle the coriander on top and serve with steamed rice or warm chapattis. ","ingredients":" 1 lime, juice only,  2 tbsp turmeric powder,  4 small whole sea bass or brill, weighing approximately 300-350g\/10½ -12oz each, butterflied, head left on (preferably), you can ask your fishmonger to do this for you,  500g\/1lb 2oz prawns, deveined and chopped,  2-3 green chillies, chopped,  5cm\/2in piece ginger, finely chopped,  15-20 fresh mint leaves, chopped,  6-8 coriander stalks with leaves, chopped,  ½ tsp salt ,  vegetable oil, for frying,  3 tbsp vegetable oil,  cinnamon stick, approximately 7cm\/2¾in ,  2 onions, finely chopped,  1 heaped tsp red chilli powder,  2 tsp cumin powder,  1 tbsp coriander powder,  2 tbsp cider vinegar,  5cm\/2in piece ginger, chopped,  3 garlic cloves, chopped,  3 fresh green chilli, roughly chopped,  4 medium tomatoes, chopped,  2-3 tbsp tamarind pulp,  5cm\/2in piece jaggery or cane sugar,  2 tbsp chopped coriander,  steamed rice,  chapattis,  4 tbsp chopped fresh coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/kolmi_ni_bharaei_34818"}