{"recipe_name":"Lamb belly in ale with flageolet bean and cauliflower mash","author":"Andi Oliver","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/130C Fan\/Gas 2. Heat a splash of oil to an ovenproof casserole. Fry the onion and garlic and until soft. Add the lamb belly and brown on both sides, then add the remaining ingredients.  Cook in the oven for 4–5 hours until the lamb pulls away easily from the bone. Remove the lamb and reserve the cooking liquor. Pull the lamb from the bones and set aside.  Return the cooking liquor to the heat and reduce until you have a thick consistency that will coat the meat. Mix together and transfer to a serving dish. Keep warm until ready to serve. For the mash, pulse the roasted onion, garlic and parsley in a blender. Transfer to a saucepan and add the remaining ingredients, except the stock and butter.  Stir in the stock a little at a time until you reach the desired soft consistency. Add the butter a little at a time until the mixture is rich in taste. Season with salt and pepper and keep warm until ready to serve. For the crispy onions, heat the oil in a deep-fat fryer or a deep-sided, heavy bottomed pan to 190C, or until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended). Pour the milk into a bowl and soak the onions for a couple of minutes. Put the flour and paprika in another bowl and season with salt and black pepper. Drain the onions thoroughly, then dredge them in the flour. Fry in the hot oil until crisp and golden-brown. Drain on kitchen paper. Serve the lamb with the mash on the side and crispy onions on top. ","ingredients":" rapeseed oil, for frying ,  3 white onions, finely chopped ,  12 garlic cloves, crushed,  2kg\/4lb 8oz lamb belly (bone in),  568ml\/1 pint India pale ale,  3 fresh bay leaves,  12 cloves,  1 tbsp ground mace,  10g fresh thyme leaves,  40g\/1½oz treacle,  2 roasted onions,  8 cloves roasted garlic,  ½ bunch parsley, roughly chopped,  2 x 400g tins flageolet beans,  ½ head roasted cauliflower florets ,  200ml\/7fl oz vegetable or chicken stock ,  60g\/2¼oz unsalted butter,  salt and freshly ground black pepper,  200ml\/7fl oz milk,  1 white onion, sliced very thinly on a mandoline,  200g\/7oz plain flour,  1 tsp paprika","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_belly_in_ale_with_97447"}