{"recipe_name":"Lamb chops with harissa glazed aubergine","author":"Marcus Wareing","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb chops, marinate in pomace oil, rosemary, thyme and garlic for at least an hour. For the harissa glazed aubergine preheat the oven to 180C\/160C Fan\/Gas 4 and line a baking tray with foil. Heat a griddle until hot. Brush the aubergine with oil and season with salt.  Griddle well on each side then transfer to the tray. Cook in the oven for 15 minutes. Meanwhile mix the harissa paste, agave, lemon juice together with 4 teaspoons of water and a pinch of salt. Set aside. Remove the aubergine from the oven and brush with the harissa mix. Return to the oven for 5 minutes. Mix the yoghurt with the lemon juice, zest and pinch of salt. Set aside. For the chutney, in large saucepan of boiling, salted water blanch the beans for 1-2 minutes. Refresh them in cold water, then drain. Mix the mint, garlic, shallot, vinegar and oil in a bowl. Stir in the beans and set aside. To finish the lamb, preheat the grill to high. Season the chops and grill until cooked to your liking. To serve, put the aubergine on a large plate and dot the yoghurt around, sprinkle with peanuts and chilli and garnish with the coriander. Serve with the lamb chops and green bean and mint chutney. ","ingredients":" 1 rack lamb, cut into 8 chops,  50ml\/2fl oz pomace oil,  2 sprigs rosemary, leaves removed,  2 springs thyme, leaves removed ,  2 garlic cloves, sliced ,  sea salt and freshly ground black pepper,  1 small aubergine, cut into 6 pieces lengthways,  2 tbsp rapeseed oil,  50g\/1¾oz rose harissa paste,  30g\/1oz agave syrup,  1 tsp lemon juice,  75ml\/2½fl oz coconut yoghurt,  ½ lime, zest and juice,  sea salt,  300g\/10½oz fine green beans,  2 sprigs mint, leaves removed and chopped,  1 garlic clove, crushed ,  1 large banana shallot, diced,  4 tsp malt vinegar,  50ml\/2fl oz rapeseed oil ,  50g\/1¾oz roasted, salted peanuts, roughly chopped,  handful coriander cress,  ½ red chilli, thinly sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_chops_with_harissa_88196"}