{"recipe_name":"Lamb cutlet in tandoori spices with pearl barley, greens and raita","author":"Aktar Islam","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. For the marinade, combine all the ingredients to make a paste. Coat the lamb and set aside for 10 minutes, or longer if possible.  To cook the lamb, heat the oil in an ovenproof pan and sear the lamb on all sides until browned. Then place the onion in the bottom of the pan and rest the cutlet on top. Roast for 5–6 minutes. Meanwhile for the vegetables, heat the oil in a large frying pan or sauté pan. Once hot, add the cumin seeds, shallots, butter and a sprinkle of salt. Gently fry until the shallots are soft. Stir in the curry powder, chilli flakes and a splash of water and cook for 1–2 minutes. Add the choi sum and toss. Add the pearl barley and cook through for a minute or so before adding the mangetout and pequillo peppers. Squeeze in a little lime juice and stir in the coriander. Remove the lamb from the oven and set aside to rest for 5–10 minutes. For the raita, combine all the ingredients together, taste, and adjust the seasoning if necessary.  To serve, place a few tablespoons of the vegetables in the middle of the serving plates. Carve the cutlet into two equal pieces and place to the side of the vegetables. Finish with the raita. ","ingredients":" 2 tsp corn oil,  1 tsp garlic and ginger paste,  ¼ tsp Kashmiri chilli powder,  1½ tsp tandoori masala spice mix,  1 tsp cracked coriander seeds,  ¼ tsp salt,  1 tsp thick Greek yoghurt,  1 lime, juice only,  1 x 175g\/6oz double bone lamb cutlet (ask your butcher for this),  1 tbsp vegetable oil, for frying,  ½ onion, peeled,  1 tbsp olive oil,  ¼ tsp cumin seeds,  60g\/2¼oz shallots, sliced into rings,  10g\/¼oz butter,  1 tsp mild curry powder,  ¼ tsp chilli flakes,  4 stalks choi sum (or other oriental greens), finely chopped ,  100g\/3½oz cooked pearl barley (see tip),  60g\/2¼oz mangetout, sliced into thin strips,  50g\/1¾oz piquillo peppers, sliced,  lime juice, to taste ,  handful coriander, chopped,  150ml\/5fl oz Greek yoghurt,  100g\/3½oz cucumber, finely chopped,  salt, to taste,  chaat masala, to taste (available in Indian grocery stores)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_cutlet_in_tandoori_08184"}