{"recipe_name":"Lamb rendang with coriander and lime rice","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb rendang, heat a large casserole or ovenproof pan and add two tablespoons of oil. Fry the lamb shanks to seal them all over and set aside. In a dry frying pan, gently toast the coriander seeds, cumin seeds, turmeric, cinnamon stick, cardamom seeds and the star anise until fragrant. Tip into a spice grinder and grind to a powder (alternatively place in a mortar and pound with a pestle until the spices are as fine as possible). In a large pan heat the remaining oil and, once hot, add the onion, garlic, chillies, ginger and pounded lemongrass. Cook gently until the onions have softened and the mixture starts to smell fragrant.  Add the ground spices and the bay leaf and fry for a few minutes more until the mixture is really bursting with aroma. Add the lamb shanks, increase the heat and stir to brown the meat and completely coat it in the spices – this will take a few minutes.  Add the tamarind paste and coconut milk, bring to the boil and then add the warm stock.  Increase the heat to high and continue cooking to reduce the volume of liquid in the pan. Stir occasionally until the sauce has reduced to a thick paste, then reduce the heat to low and keep cooking and stirring until the sauce is really thick and coats the meat – approximately 2½ hours. For the coriander rice, place the rice in a pan with 365ml\/12fl oz salted water. Cook over a low heat until the water has evaporated, then remove from the heat, cover with a lid and leave to steam for 10 minutes. When the rice is cooked, stir through the coriander leaves and lime juice. To serve, pile the rice onto serving plates and place a lamb shank on top and spoon over the rendang sauce. ","ingredients":" 4 tbsp vegetable oil,  4 lamb shanks,  20g\/¾oz coriander seeds,  ½ tsp cumin seeds,  ½ tsp turmeric powder,  1 cinnamon stick,  3 cardamom pods, crushed and seeds removed,  1 star anise,  1 large onion, sliced,  3 garlic cloves, chopped,  3 red chillies, seeds removed and chopped,  1 thumb-sized piece of fresh root ginger, peeled and chopped,  1 lemongrass stalks, pounded,  1 bay leaf,  50g\/1¾oz tamarind paste,  1 x 400g\/14oz tin coconut milk,  250ml\/9oz warm beef stock,  200g\/7oz basmati rice,  1 tbsp coriander leaves,  1 lime, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_rendang_with_83481"}