{"recipe_name":"Lamb rump with roasted onion squash and salsa verde","author":"Theo Randall","programme":"Saturday Kitchen Best Bites","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb, preheat the oven to 190C\/375F\/Gas 5. Pour the lemon juice and olive oil into a bowl. Add the six whole garlic cloves and all of the rosemary and mix together. Add the lamb rump and rub it all over with the marinade. Set aside for at least one hour. Meanwhile, for the salsa verde, finely chop the herbs and cover with oil immediately so that they don’t turn brown. Pound the garlic, capers and anchovies to a paste in a pestle and mortar (or in a food processor).   Mix the herbs into the paste, then stir in Dijon mustard, to taste.  Season, to taste, with salt and freshly ground black pepper (remember that anchovies and capers are both quite salty).  For the roasted onion squash, place the cubes of onion squash into an ovenproof dish. Mix with the olive oil, the thyme and  the chopped garlic. Cover the dish with aluminium foil and cook for 30 minutes, or until softened. Remove the aluminium foil and return the squash to the oven for a further 5-10 minutes, or until golden-brown. Keep warm. Remove the lamb from the marinade and pat dry. Season all over with salt and freshly ground black pepper. Heat an ovenproof frying pan over very high heat. When the pan is hot, add the marinated lamb rump and fry on all sides, or until browned all over. Transfer the lamb to the oven and roast for 10-12 minutes (for medium, depending on the size of the rump). Remove the lamb from the oven and set aside to rest for a couple of minutes. While the lamb is resting, bring a pan of salted water to the boil. Add the spinach and boil for one minute, or until wilted. Drain into a colander and press lightly with the back of a wooden spoon to remove any excess water. Season, to taste, with salt and freshly ground black pepper and drizzle over a little olive oil. To serve, spoon a little of the roasted onion squash into the centre of each of four serving plates. Pile a little spinach on top of each portion of squash. Carve each lamb rump lengthways into three slices and rest them against the spinach and squash. Spoon some of the salsa verde on top of the lamb. ","ingredients":" 2 lemons, juice only,  75ml\/3fl oz olive oil,  6 garlic cloves, left whole,  2 tbsp chopped fresh rosemary,  4 lamb rumps, with fat on,  salt and freshly ground black pepper,  50g\/2oz fresh flatleaf parsley leaves,  25g\/1oz rocket leaves,  15g\/½oz fresh mint leaves,  15g\/½oz fresh marjoram leaves,  4-6 tbsp olive oil (to cover the herbs),  ¼ garlic clove,  1½ tbsp capers,  6 anchovy fillets,  1 tbsp Dijon mustard, or to taste,  salt and freshly ground black pepper,  4 onion squash (or other small autumn squash), peeled and cut in half, seeds removed, flesh cut into 3cm\/1¼in cubes,  35ml\/1¼fl oz olive oil, plus extra for drizzling,  1 tsp fresh thyme leaves,  1 garlic clove, finely chopped,  800g\/1lb 12oz fresh spinach,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_rump_with_roasted_47021"}