{"recipe_name":"Lamb sausages in prosciutto with fresh green salad","author":"Tana Ramsay","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb sausages, preheat the oven to 190C\/375F\/Gas 5. Lightly grease a baking tray Place the lamb mince in a large bowl and break it up using a fork. Add the ground coriander, cumin, onion, parsley, chilli and breadcrumbs and stir. Add the egg, season, to taste, with salt and freshly ground black pepper and mix until well combined. Divide the mixture in 12 portions, shape each portion into a sausage using your hands, then wrap in a slice of prosciutto. Place the sausages onto the prepared baking tray and bake for 20-25 minutes, or until golden-brown and cooked though. Meanwhile, for the yoghurt and cucumber dip, mix all of the ingredients together in a bowl and season, to taste, with salt and freshly ground black pepper. For the fresh green salad with bacon, steam the peas and broad beans for three minutes, or until tender. Refresh the peas and broad beans in a bowl of iced water, then drain and pat dry with kitchen paper. Fry the bacon in a frying pan for 1-2 minutes on each side, or until crisp. Set aside to drain on kitchen paper. For the creamy mustard vinaigrette, whisk all of the ingredients together in a small bowl. Place the rocket, baby spinach, peas, broad beans and bacon into a large bowl, pour over the dressing and mix until well combined. To serve, place the sausages onto each of four serving plates and spoon the salad alongside. Serve the yoghurt and cucumber dip in a small bowl alongside. ","ingredients":" vegetable oil, for greasing,  500g\/1lb 1oz lamb mince,  1 tbsp ground coriander,  2 tbsp ground cumin,  ½ red onion, finely chopped,  3 tbsp finely chopped fresh flatleaf parsley,  1 red chilli, seeds removed, finely chopped,  4 tbsp fresh breadcrumbs,  1 free-range egg, beaten,  salt and freshly ground black pepper,  12 prosciutto slices,  150g\/5¼oz fresh peas (shelled weight),  150g\/5¼oz fresh broad beans (podded weight),  6 smoked bacon rashers, cut into strips,  small handful rocket,  Small handful baby spinach,  6 tbsp olive oil,  2 tbsp white wine vinegar,  1 tsp wholegrain mustard,  2 tbsp crème fraîche,  200g\/7¼oz natural yoghurt,  ¼ cucumber, peeled, diced,  2 tbsp chopped fresh mint,  salt and freshly ground black pepper.","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_sausages_in_82136"}