{"recipe_name":"Lamb shoulder pastilla, baked beetroot, salsa verde, ewes’ milk curd","author":"Paul Ainsworth","programme":"2007-16","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb brine, mix all the ingredients except the lamb together in a saucepan with 2 litres\/3½ pints of water and bring to a simmer, just to dissolve the sugar and salt.  Leave to cool, then submerge the lamb into the brine, cover and place in the fridge for 24 hours. For the confit of lamb, melt the fat with the herbs and garlic in a roasting tin over the hob to 85C\/185F (using a food thermometer to check). Take the lamb shoulder out of the brine, pat it dry and carefully place it into the hot fat.  Cover with foil and cook for four hours either on the hob, or in the oven at 100C\/225F\/Gas ¼, checking and turning the lamb every hour.  The lamb is cooked when you can push a roasting fork or skewer through the meat like a block of butter.  Leave the lamb to cool completely in the fat and rest.  For the baked beetroot, preheat the oven to 180C\/350F\/Gas 4. Cut four squares of baking paper and foil the same size, big enough to wrap the beetroot and have a little excess at the top.  Heat the sherry in a pan and cook until it has reduced to half its volume. Cut the beetroots at the top with a cross nearly all the way through, season with the olive oil, salt and pepper all over making sure you get it inside the beetroot.  Drizzle a little bit of the reduced sherry all over the beetroots and finish with a few slices of the picked thyme and rosemary.  Pull the sides of the foil and baking paper up then add a splash of water to each beetroot. This will help steam them during cooking.  Now wrap them up, bringing the baking paper and foil together to seal the parcel. Bake in the oven for one hour. Take the beetroots out the oven and keep warm. Don’t open until you are ready to serve. For the salsa verde, heat a large, deep saucepan of water until boiling. Have a bowl of iced water ready to cool the herbs down.  Add all the fresh herbs to the pan of boiling water and make sure they are completely submerged for 10 seconds.  Take the herbs out, shaking them off then plunge them into the iced water.   Fry the shallot and garlic in a pan with a little oil for three minutes with a pinch of salt.  When the shallot is soft, add the mustard and anchovies. Mix well, take off the heat to cool and add 200ml\/7fl oz of the olive oil. Drain the herbs and stir them into the shallot mixture. Add the capers. Place the mixture in a food processor and start to blend, gradually adding the remaining 100ml\/4fl oz of olive oil. Don’t blend for too long – leave the mixture with some texture. Season to taste with salt and sherry vinegar.  Keep the salsa verde at room temperature in a bowl covered with cling film.   For the ewes’ milk curd, season the curd with the lemon juice and cracked black pepper to taste. Add a little salt, to taste, depending on how salty the curd is already. Set aside. For the pastilla, pick the meat from the soft confit lamb into a bowl removing any big lumps of fat or gristle (but don’t take all the fat away as this is great for flavour).  Add the chopped mint, reduced lamb sauce, seasoning and sherry vinegar to taste.  Add a little of the salsa verde, just to coat, without getting the mixture too wet. Set aside. Heat the clarified butter in a pan until warm, but not hot. Place the potato on a mandoline and wind round to make potato string.  Place the potato string into the clarified butter making sure the butter coats all the potato.  Lay out two sheets of filo pastry about 20cm\/8in wide and 20cm\/8in long on top of each other. Divide the meat mixture into four portions and roughly shape each portion in your hand like a sausage.  Place a sausage shape of the mixture on the filo and roll up like a spring roll, folding the sides over and brushing with the clarified butter to help it stick.  Finally wind the string potato around the filo parcel. Repeat with the remaining filo and mixture and place on a tray to leave to set in the fridge for 30 minutes. Heat a deep fat fryer to 180C\/350F. (CAUTION: Hot oil can be dangerous. Don't leave unattended). Add the pastillas to the deep fat fryer and fry until golden-brown and crisp, about three minutes. Remove with a slotted spoon and drain on kitchen paper. Lightly season with salt and cumin and carve how you wish. To serve, place the warm beetroots in the foil package on each of four plates and open up the top of the foil and baking paper.  Place a dollop of the ewes' curd on top of the beetroot. Finish with a little olive oil and fresh pea shoots. Place a spoonful of the salsa verde on the plate.  Place the pastille on the plate, drizzle with a little more olive oil and serve. ","ingredients":" 50g\/2oz demerara sugar,  150g\/5oz fine salt,  1 sprig thyme,  1 sprig rosemary,  1 bay leaf,  1 star anise,  2 garlic cloves, crushed,  1 lemon, peel only,  1kg\/2lb 4oz boneless lamb shoulder,  1.5kg\/3lb 5oz duck fat,  3 large sprigs thyme,  3 large sprigs rosemary,  1 bay leaf,  ½ head of garlic,  200ml\/7fl oz sherry,  4 small fresh beetroot, peeled,  rock salt and cracked white pepper,  olive oil,  10g\/¼oz fresh thyme leaves,  10g\/¼oz chopped rosemary,  175g\/6oz picked mint,  110g\/4oz picked flat leaf parsley,  75g\/3oz picked basil,  1 shallot finely chopped,  1 garlic clove, very finely sliced,  pinch salt,  2 tsp English mustard,  6 fillets of anchovies marinated in brine,  300ml\/10fl oz extra virgin olive oil,  10g\/½oz capers, drained,  sherry vinegar,  100g\/4oz ewes' milk curd, at room temperature,  lemon juice, to taste,  pinch cracked black pepper,  salt, to taste,  50g\/2oz chopped mint,  250ml\/9floz reduced lamb sauce,  salt and freshly ground black pepper,  sherry vinegar, to taste ,  25g\/1oz salsa verde (from above),  2 large roasting potatoes (such as Maris piper or Lovers), peeled,  250g\/9oz clarified butter,  8 sheets filo pastry,  vegetable oil, for deep frying,  pinch ground cumin,  drizzle olive oil,  1 punnet pea shoots ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_shoulder_pastilla_74296"}