{"recipe_name":"Lamb shoulder with harissa and lamb stovies","author":"Tony Singh","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat oven to 200C\/180C Fan\/Gas 6. For the spice paste, toast all the spices in a hot dry pan for a few minutes until aromatic. Grind them to a fine powder in a spice grinder or pestle and mortar. Mix the ground spices, honey and lemon juice with the harrisa paste and transfer to a piping bag. Prepare the lamb by making deep slashes into the flesh as many or as little as you like depending on the amount of heat you want from the harrissa, as we will be filling these with the paste. Smear oil over the meat and season with salt and pepper. Put the head of garlic, onions, rosemary and thyme in the bottom of a large, deep oven dish. Place the lamb on top and pipe the spice paste into the slashes. Cover with tin foil and seal the edges. Roast in the oven for 15 minutes then reduce the temperature to 160C\/140C Fan\/Gas 3 and leave it to roast for 4 hours. Do not open to check the meat during cooking. Remove from the oven, cover with aluminium foil and leave to rest for 20 minutes before serving. For the stovies, take a heavy-based, lidded pan that is large enough to fit all the ingredient. Heat the butter in the pan and fry the onions to soften them without colouring. Add the garlic purée and fry until the onions are translucent Tie the bay leaves and thyme sprigs together with kitchen string. Add them to the pan. Add the diced lamb and the potatoes and season with salt and white pepper. Cover with the lid and cook on a low to medium heat until the meat starts to give off its juices. This will take 1-2 hours. Stir in the stock and bring to the boil, then simmer with the lid on until the potatoes are breaking down into the liquid and are cooked through. Take off the heat, stir in the chopped herbs and season, to taste, with salt and pepper. To serve, place the shoulder on a serving board with a bowl of the stovies on the side. ","ingredients":" 1 tsp caraway seeds,  3 tsp coriander seeds,  6 tsp cumin seeds,  1-2 tbsp honey,  1 lemon, juice only,  200g\/7oz harissa paste,  1 shoulder of lamb (about 2.5kg\/5lb 8oz) ,  3 tbsp rapeseed oil,  1 whole head of garlic, cut in half,  3 onions, cut in half,  few sprigs rosemary,  few sprigs thyme,  salt and freshly ground black pepper,  250g\/9oz unsalted butter,  600g\/1lb 5oz onion, finely chopped (about 4-6 onions),  50g\/1¾oz garlic purée,  6 bay leaves,  100g\/3½oz sprigs thyme,  1kg\/2lb 4oz lamb belly (also known as breast), skinned and cut into 2cm\/1in dice,  2kg\/4lb 8oz floury potatoes, peeled and cut into 0.5cm\/¼in dice,  300ml\/10fl oz strong lamb stock,  20g\/¾oz chopped curlyleaf parsley,  10g picked tarragon leaves,  20g\/¾oz finely chopped chives,  salt and white pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_shoulder_with_90539"}