{"recipe_name":"Lamb stew with black pepper, coconut and clove","author":"Cyrus Todiwala","programme":"The Incredible Spice Men","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lamb_stew_with_black_83254_16x9.jpg","method":"Place the prepared lamb or mutton into a casserole dish that has a tight-fitting lid. Add the cinnamon, cloves and peppercorns, and enough cold water to just cover the meat. Cover the pan tightly (line the edge of the lid in aluminium foil to increase the tightness if necessary). Bring to the boil, then reduce the heat to low and simmer for 30 minutes.  Partly uncover the pan, allowing steam to escape and the liquid to reduce, and continue to simmer on the lowest heat for a further hour.  In a separate pan, heat the oil and cook the onions gently until soft, giving them a good seasoning of salt. Add the flour to the onions and stir for 3–4 minutes, or until the flour is absorbed into the oil and is cooked.  Add the onion mixture to the meat pan and mix well. Bring to the boil, then reduce the heat to low and simmer for 10–15 minutes, stirring, until well combined and thickened. Add the coconut milk and simmer for a further 30 minutes, stirring frequently. Check the texture of the lamb or mutton: it will go from being quite hard to very tender quite suddenly; this is the point at which the stew is ready.   When the meat is tender add the cooked potatoes, and simmer for a minute until the potatoes are warmed through. Taste and adjust the seasoning if necessary. Serve with crusty bread and some vegetables. ","ingredients":" 1kg\/2lb 4oz boneless lamb shoulder or mutton haunch, well cleaned of all skin, sinew, fat, gristle and cut into 1cm\/½in cubes,  4 x 2.5cm\/1in pieces cinnamon stick, discard tiny pieces that break off,  10 cloves,  1 tsp black peppercorns, or more to taste,  2 tbsp rapeseed oil or vegetable oil,  2 red onions, cut into quarters and sliced,  1½ tbsp plain flour,  1 x 400ml\/14fl oz tin coconut milk,  salt,  3 large potatoes, peeled, cut into large cubes and boiled until soft","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_stew_with_black_83254"}