{"recipe_name":"Lamb three ways","author":"Stephanie Moon","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the slow-cooked lamb shoulder, preheat the oven to 160C\/325F\/Gas 3. Season the lamb shoulder with salt and freshly ground black pepper, to taste. Heat a dash of vegetable oil in a hot pan and cook the lamb until coloured on all sides.  Transfer to a roasting tray and add the onion, carrots, thyme and garlic.  Cover with the red wine and stock and cover tightly with aluminium foil.  Cook in the oven for three hours, or until tender. Reserve any cooking juices for the jus. For the lamb bon bon, fry the onion in a pan with oil until softened. Add the lamb trimmings and allow to colour.  Pour in the wine and stock and leave to braise over a low heat for 2½-3 hours, or until tender. In a food processor, blend the braised trimmings with the parsley. Drain off the juice (retaining it) and, using your hands, form into balls.  Set aside. For the lamb cutlet, preheat the oven to 180C\/350F\/Gas 4 and season the lamb with salt and pepper. Heat a dash of oil in a large pan and fry the lamb until browned. Transfer to the oven and cook for 10-12 minutes, or until medium-rare (you may wish to cook the lamb longer if medium-rare isn’t to your liking). Remove from the oven and leave to rest before carving.  For the beetroot and chard, boil the beetroot in a pan of salted water until softened. Drain well and leave to cool. Once cooled, peel and then cut into quarters.  To serve, fry the beetroot quickly in a touch of oil with salt and pepper. For the leaves, melt the butter in a pan and wilt the leaves for 1-2 minutes.  For the potato gratin, preheat the oven to 180C\/350F\/Gas 4. Layer the potato slices in a gratin dish, seasoning with salt and pepper between each layer. Add the thyme leaves and crushed garlic alternatively between the layers. Pour over the double cream and leave to sit for 10 minutes.  Cook for 50 minutes to one hour, or until golden-brown. Cut into squares to serve.  For the jus, strain the liquid leftover from the slow-cooked shoulder. Boil the liquid in a saucepan until the volume of liquid has reduced by half. Add any reserved cooking liquor from making the bon bon and reduce again. Thicken the jus if necessary with a little cornflour mixed to a paste with cold water. To finish the lamb bon bon, prepare a plate of flour, a bowl of lightly beaten egg and a plate of Japanese panko breadcrumbs.  Heat the oil in a deep fat fryer to 180C\/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Dust the bon bons in flour, dip in the beaten egg and coat in the breadcrumbs. Fry in the deep-fat fryer until cooked through, then carefully remove with a slotted spoon and place on a plate lined with kitchen paper. For the mint salsa, blend the onions (or shallots), mint, coriander, parsley, lemon zest, lemon juice and garlic until smooth in a food processor. Gradually add enough oil to make a smooth, dropping consistency. Season to taste. To serve, arrange the potato gratin on each of four serving dishes. Put the lamb shoulder pieces alongside. Spoon the beetroot quarters and wilted leaves next to the lamb shoulder and sit the lamb cutlet on top. Arrange the lamb bon bons alongside and spoon the mint salsa next to meat. Drizzle with the jus to serve.  ","ingredients":" 1 x 1.5kg\/3lb 5oz lamb shoulder, boned and tied,  salt and freshly ground black pepper,  dash vegetable oil,  1 onion, chopped,  2 carrots, peeled and chopped,  few sprigs thyme,  4 garlic cloves,  1 bottle red wine,  500ml\/18fl oz lamb stock,  1 onion, finely chopped,  olive oil, for frying,  1.5kg\/3lb 5oz lamb trimmings (shoulder and leg),  1 bottle red wine,  1.2 litres\/2 pints lamb stock,  1 small bunch fresh parsley,  plain flour, for dusting,  2 free-range eggs,  100g\/3½oz Japanese panko breadcrumbs,  vegetable oil, for deep-fat frying,  2 racks of lamb (5 bones in each rack), French-trimmed,  dash vegetable oil,  4 raw beetroot,  salt and freshly ground black pepper,  dash vegetable oil,  butter, for frying,  handful of chard\/beetroot leaves, blanched,  1.5kg\/3lb 5 oz potatoes, peeled and sliced thinly on a mandoline,  salt and freshly ground black pepper,  2 tbsp thyme leaves,  6 garlic cloves, crushed,  1.8 litres\/3 pints double cream,  cooking liquid leftover from the shoulder of lamb and bon bons,  1 tsp cornflour (if needed to thicken the jus),  1 small onion or 2 shallots, roughly chopped,  small bunch fresh mint, chopped,  small bunch fresh coriander, chopped,  small bunch fresh flatleaf parsley, chopped,  1 lemon, zest and juice,  2 garlic cloves, chopped,  olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_three_ways_54983"}