{"recipe_name":"Lamb with torn bread and apricot stuffing and caramelised chicory","author":"Bill Granger","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb, heat the butter in a large frying pan over a medium heat.  Add the onion and cook, stirring occasionally, for 6-8 minutes, or until softened.  Add the crushed garlic and half of the cumin seeds and cook for another minute.  Tip the mixture into a large bowl and add the torn bread, chilli flakes, dried apricots and pistachio nuts and season well with sea salt and freshly ground black pepper. Set aside until needed. Preheat the oven to 190C\/375F\/Gas 5.  Mix the olive oil with the remaining cumin seeds and brush this mixture over the entire surface of the lamb.  Place the lamb in a large roasting tin and cook for 1 hour 20 minutes in total. However, 15 minutes before the end of cooking, place the stuffing mixture into the pan around the lamb and return it to the oven.  Meanwhile, for the caramelised chicory, place the chicory and onions in a baking dish and sprinkle with the sugar and chilli flakes.  Drizzle with the oil and vinegar and season to taste with sea salt and freshly ground black pepper. Place in the oven and cook for 35-45 minutes, or until golden-brown and caramelised.  Once the lamb is cooked, cover loosely with foil and leave to rest for 15 minutes before carving.  Serve the lamb in slices with the caramelised chicory and stuffing alongside.. ","ingredients":" 60g\/2¼oz unsalted butter,  1 onion, chopped,  1 garlic clove, crushed,  2 tsp cumin seeds,  200g\/7oz sourdough bread, torn into bite-sized pieces ,  2 tsp dried chilli flakes,  150g\/5oz dried apricots, roughly chopped,  50g\/2oz shelled pistachio nuts, roughly chopped,  sea salt and freshly ground black pepper,  1 tbsp olive oil, for brushing,  2kg\/4lb 8oz lamb leg, bone in ,  4 chicory heads, halved lengthways,  3 red onions, cut into wedges,  3 tbsp soft brown sugar,  ½ tbsp dried chilli flakes,  2 tbsp olive oil,  2 tbsp cider vinegar,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lamb_with_torn_bread_and_53988"}