{"recipe_name":"Lamb curry with basmati rice","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lambcurrywithbasmati_84339_16x9.jpg","method":"Heat a large saucepan and add one tablespoon of the vegetable oil and then the lamb. Cook over a high heat for 3-4 minutes, or until the lamb is golden-brown all over, then remove and set aside. Reduce the heat and add the remaining tablespoon of vegetable oil. Add the onions, garlic, chillies and ginger and fry for 2-3 minutes, until golden and softened. Add all the turmeric, garam masala, cumin and chilli powder and fry, stirring well, for one minute. Add the flour and cook for a further minute. Add the tomatoes and coconut milk and heat to bring to a simmer. Add the lamb and enough chicken stock to just cover the lamb. Stir well, scraping the bottom of the pan to deglaze and release any residue at the bottom of the pan. Heat the mixture until simmering, then cover and cook on a low heat for about one hour, or until the lamb is tender and cooked through. Skim off any excess fat from the surface of the sauce, then add the spinach and pomegranate. Cook for 1-2 minutes, until the spinach has wilted. Add the yoghurt, season, to taste, with salt and freshly ground black pepper and stir well. Serve onto warmed plates with steamed basmati rice alongside. ","ingredients":" 2 tbsp vegetable oil,  900g\/2lb lamb fillet, cut into 3cm\/1in cubes,  2 onions, roughly chopped,  3 garlic cloves, peeled and crushed,  2 green chillies, finely chopped,  1 tbsp grated fresh ginger,  1 tbsp ground turmeric,  1½ tbsp garam masala,  1½ tbsp ground cumin,  1 tbsp chilli powder,  1 tbsp plain flour,  6 large tomatoes, roughly chopped,  400ml\/14fl oz coconut milk,  600ml\/1 pint chicken stock,  250g\/9oz baby spinach leaves,  1 pomegranate, seeded,  200g\/7oz plain yoghurt,  salt and freshly ground black pepper,  steamed basmati rice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambcurrywithbasmati_84339"}