{"recipe_name":"Lamb cutlets in a parsley caper crust with warm potato, ham & spring onion salad","author":"Brian Turner","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Cut 2.5cm\/1in deep into the cutlets and trim off the excess fat, being careful to leave some fat remaining for flavour. Dredge the cutlets in the seasoned flour, shaking off the excess flour. Beat the eggs in a bowl. Mix the breadcrumbs with the capers and parsley. Dip the floured cutlets one at a time into eggs then into breadcrumb mix. Shake off the excess coating and tap gently to shape with a palette knife. Heat oil in a frying pan. Place the cutlets into the pan, presentation side down. Add the butter and cook for two minutes on each side, until coloured nicely. Take out and drain on kitchen towels. Meanwhile, to make the salad, cook the small potatoes skin on in boiling salted water. When just cooked take them out and drain in a colander. Chop up the ham and mix with the rest of the salad ingredients in a bowl. Mix the dressing ingredients. Set half aside and pour the other half onto the salad. Cut warm potatoes in half lengthwise into bowl. Check for seasoning. Place a portion of salad in middle of a dish with the 2 cutlets on top. Sprinkle the rest of the dressing around and serve. ","ingredients":" 8 lamb cutlets,  115g \/4oz plain  flour, seasoned with salt and freshly ground black pepper, to taste,  2 free-range eggs,  115g\/4oz white breadcrumbs,  2 tbsp capers, chopped,  2 tbsp fresh flatleaf parsley, chopped,  2 tbsp oil,  55g\/2oz butter,  500g\/1lb small new potatoes,  170g\/6oz cooked ham,  1 shallot, finely chopped,  10 gherkins, chopped,  3 spring onions, thinly sliced,  1 tbsp chives, chopped,  2 tbsp red wine vinegar,  2 tbsp Dijon mustard,  8 tbsp olive oil,  salt & freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambcutletsinaparsle_78338"}