{"recipe_name":"Lamb dopiaza pancake with spicy salsa","author":"Brian Turner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb dopiaza, heat the oil in a frying pan over a medium heat and cook the onion until soft. Add the lamb and fry for 3-4 minutes. Add the tomato, curry powder and yoghurt, stir well and bring to a simmer, then set aside to keep warm. For the pancake, place the flour, egg and milk into a large bowl and whisk together to form a batter the consistency of double cream. Heat the vegetable oil in a frying pan over a medium heat and wipe out the excess with kitchen paper. Place a large spoonful of the pancake batter into the pan and swirl to coat the base of the pan. Cook until the base is golden-brown, then flip or turn over using a fish slice and cook on the other side. For the salsa, place all the salsa ingredients (not the yoghurt) into a bowl, season with salt and freshly ground black pepper and mix well. To serve, place the pancake onto a serving plate, fill with the lamb dopiaza and roll up like a cigar. Top with the salsa and a dollop of yoghurt. ","ingredients":" 1 tbsp vegetable oil,  ½ onion, finely sliced,  100g\/3½oz lamb leg steak, cut into strips 1cm\/½in thick,  1 ripe tomato, seeds removed, chopped,  1 tsp curry powder,  1 tbsp Greek-style yoghurt,  5 tbsp plain flour,  1 free-range egg,  50ml\/1¾fl oz milk,  1 tbsp vegetable oil, for frying,  1 garlic clove, finely chopped,  pinch chilli powder,  ¼ onion, finely chopped,  ½ ripe tomato, seeds removed, finely chopped,  small handful fresh coriander, chopped,  1 tbsp olive oil,  1 tsp white wine vinegar,  salt and freshly ground black pepper ,  Greek-style yoghurt, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambdopiazapancakewi_85303"}