{"recipe_name":"Lamb fillet with flageolet beans and leek chutney","author":"Mike Robinson","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Pound the sage, thyme garlic and olive oil to a thick paste, using a pestle and mortar. Smear this over the lamb fillets.  Put the beans, red onion, garlic, thyme, tomatoes and parsley in a pan with the olive oil. Place over medium heat and simmer for 3-4 minutes, stirring, to heat through. Add a splash of balsamic vinegar and a squeeze of lemon juice. Season with salt and freshly ground black pepper. Set aside and keep warm.  Meanwhile make the chutney. Cook the finely shredded leeks in olive oil for a few minutes, then add the balsamic vinegar and brown sugar.  Cook for five minutes on a medium-low heat. For the lamb heat a heavy-based frying pan over medium-high heat until hot. Add the lamb and sear for two minutes on each side. Transfer to a warm plate.  Reduce the heat to medium-low. Add a large glug of balsamic vinegar to the pan. Sizzle for a few seconds, scraping up any sediment from the pan. Season with salt and pepper then add to the chutney mixture. To serve, spoon the bean mixture onto warm serving plates. Place the lamb on top and drizzle on the hot leek chutney. ","ingredients":" 1 tbsp finely chopped sage,  1 tbsp finely chopped thyme,  2-3 garlic cloves, finely chopped,  olive oil,  2 lamb fillets, weighing about 175g\/6oz each,  400g\/14oz canned flageolet beans, drained and rinsed,  1 red onion, finely chopped,  2 garlic cloves, chopped,  2 thyme sprigs ,  ½ punnet of cherry tomatoes, quartered,  1 tbsp chopped flatleaf parsley,  1 tbsp olive oil,  splash of balsamic vinegar,  good squeeze of lemon juice,  salt ,  freshly ground black pepper,  1 leek, finely sliced ,  1 tbsp olive oil,  1 tsp brown sugar ,  50ml\/2fl oz balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambfilletwithflageo_71653"}