{"recipe_name":"Lamb fillet wrapped in brik pastry with tomato 'confit', artichokes and lamb jus","author":"Daniel Galmiche","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb, place the softened butter into a bowl, add the chervil, tarragon, anchovies, garlic and lemon juice and beat well to combine. Season the lamb with freshly ground black pepper. Place a piece of brik pastry on a clean work surface or chopping board and brush with the clarified butter. Place one lamb fillet in the middle of the pastry sheet, spread half of the anchovy butter on the top, then put another fillet on top. Fold the pastry into a parcel, enclosing the lamb entirely. Lay a second sheet of pastry on the work surface, brush with clarified butter. Place the wrapped lamb on top and fold up once more. Repeat with the remaining two fillets and pastry. Tie both parcels tightly with kitchen string. Place on a plate or tray and transfer to the fridge to rest for at least one hour. To cook the lamb, preheat the vegetable oil in a deep fat fryer to 180C\/350F. (CAUTION: hot oil can be dangerous - do not leave unattended.) Carefully place the lamb parcels into the fat fryer, one at a time, and cook for 12-14 minutes, without turning as the pastry is very fragile. Remove the lamb from the fryer using a large slotted spoon, drain on kitchen paper and leave the lamb to rest in a warm place for five minutes. For the artichokes, slice the artichokes finely and rub with the lemon juice. Heat a frying until hot, add the butter, olive oil, sliced artichokes and the garlic and fry for 2-3 minutes, or until tender. Add the chervil and season with salt and freshly ground black pepper, to taste. For the sauce, heat a separate pan until hot. Add the butter and when it has turned nut-brown in colour, add the olive oil, lamb jus and sherry vinegar. Simmer for a further two minutes. For the tomato 'confit', gently heat the olive oil and tomatoes in a pan and cook for a few minutes until just softened. To serve, cut excess pastry from the lamb parcels and discard it. Cut each parcel into four thick slices. Place the artichokes onto the centre of each serving plate, then top with two pieces of pastry-wrapped lamb per person. Spoon the sauce over the top and arrange a tomato half on one side of the plate. Serve at once. ","ingredients":" 150g\/5oz unsalted butter, softened,  2 sprigs chervil, roughly chopped,  2 sprigs tarragon, roughly chopped,  2 fresh anchovy fillets, roughly chopped,  1 garlic clove, roughly chopped,  ½ lemon, juice only,  4 x 200g\/7oz lamb fillets, trimmed,  freshly ground black pepper ,  4 sheets brik pastry (available in specialist North African stores or online, alternatively use filo pastry),  110g\/4oz clarified butter, melted,  vegetable oil, for deep fat frying,  4 large globe artichokes, leaves removed, cut short and middle choke removed with a teaspoon,  ½ lemon, juice only,  50g\/2oz butter,  1 tbsp olive oil,  1 garlic clove, finely chopped,  2 sprigs chervil, roughly chopped,  salt and freshly ground black pepper,  50g\/2oz butter,  1 tbsp olive oil,  110ml\/4fl oz ready-made lamb jus or reduced lamb stock,  2 tbsp sherry vinegar,  4 tbsp olive oil ,  2 ripe tomatoes, halved lengthways","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambfilletwrappedinb_90937"}