{"recipe_name":"Lamb kabob mashwi with spicy flatbreads and yoghurt dressing","author":"Merrilees Parker","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/430F\/Gas 7. For the kebabs, place all the  kebab ingredients in a large bowl. Season generously with plenty of salt and freshly ground black pepper and mix together really well. Divide the mixture into eight rough sausage shapes then put each onto a skewer, ensuring they are firmly wrapped around the skewers. Refrigerate until ready to use. In the meantime, prepare the flatbreads and dressing. When you're ready, heat a large frying pan or flat griddle until smoking hot and cook the kebabs for 4-5 minutes or until cooked through. For the flatbreads, place the flour in a bowl and mix in the sugar, salt, oregano and chilli flakes. Make a well in the centre of the flour mix and pour in the dried yeast. Add enough of the tepid water to form a rough dough.  Drizzle the olive oil over the dough and knead for about ten minutes. Divide into four balls and then roll out into long ovals.   Place the flatbreads on lightly greased baking trays that have been pre-heated in the oven. Prick all over really well then place in the oven and cook for three minutes on each side. For the dressing, place all the dressing ingredients into a blender and blend to form a smooth paste. To serve, lay a flatbread on a serving plate with a couple of kebabs on top, drizzle with the dressing and garnish with some of the lemon-soaked onions and fresh mint leaves. ","ingredients":" 700g\/1lb10oz finely ground lamb mince,  1 onion, very finely chopped ,  2 tsp chopped fresh marjoram or oregano or 1 tsp good quality dried,  2 tbsp chopped fresh mint,  ½ tsp chilli powder,  pinch ground cardamom,  Maldon sea salt and freshly ground black pepper ,  500g\/1lb 2oz plain flour ,  ½tsp sugar,  1 tsp fine sea salt,  2 tsp dried oregano,  2 tsp chilli flakes,  1 packet dried yeast,  250ml\/8fl oz tepid water,  1 tbsp olive oil,  2 tbsp extra virgin olive oil,  5 tbsp thick Greek yoghurt,  2 tbsp tahini (sesame seed paste),  1 tbsp fresh lemon juice,  I garlic clove, crushed,  2 tbsp chopped fresh coriander,  Fresh mint leaves ,  1 small red onion, finely sliced and soaked in lemon juice,  8 wooden skewers, pre-soaked in water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambkabobmashwiwiths_79721"}