{"recipe_name":"Lamb neck fillet tagine with tabbouleh","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb tagine, mix the ras-el-hanout, ground cinnamon, ground ginger, smoked sweet paprika, ground cumin, freshly ground black pepper and ground turmeric together in a bowl. Add the lamb neck fillet pieces and turn in the mixture to evenly coat.  Heat a large pan until smoking, then add a tablespoon of the olive oil and sear the neck fillet pieces on all sides for 2-3 minutes, or until golden-brown all over. Remove the lamb pieces from the pan and set aside Add the remaining olive oil to the same pan and fry the onions and garlic for 2-3 minutes, or until softened. Add the lamb pieces back to the pan and stir well, then add all of the remaining tagine ingredients except for the coriander and salt and freshly ground black pepper and bring to a simmer.  Chop the coriander, reserving the leaves for later, and add the stalks to the pan. Reduce the heat, cover the pan with a lid and allow to simmer for one hour and 30 minutes, or until the lamb is tender.  Remove the lid and cook for a further 30 minutes, or until the tagine is slightly thickened. Season, to taste, with salt and freshly ground black pepper. Meanwhile, for the tabbouleh, place the bulgar wheat into a pan with the chicken stock, bring to the boil then reduce the heat to a simmer. Cover the pan with a lid and cook for 15-20 minutes over a low heat. When the bulgar wheat is tender, drain off the excess stock. Remove from the heat and allow to cool slightly, then transfer the bulgar wheat to a bowl. Add the red onion, pistachios, lemon juice, olive oil and herbs and mix well. Season, to taste, with salt and freshly ground black pepper.  To serve, divide the tabbouleh among four serving plates, then spoon the lamb neck fillet tagine alongside. Chop the reserved coriander leaves and sprinkle over the tagine. ","ingredients":" 1 tsp ras-el-hanout,  ½ tsp ground cinnamon,  ½ tsp ground ginger,  ½ tsp smoked sweet paprika,  ½ tsp ground cumin,  ¼ tsp freshly ground black pepper,  ¼ tsp ground turmeric,  3 tbsp olive oil,  1kg\/2lb 3oz lamb neck fillet, cut into large chunks,  1 onion, thickly sliced,  2 cloves garlic, peeled, finely chopped,  1 x 400g\/14oz tin chopped tomatoes,  2 tbsp pomegranate molasses (available from Middle Eastern grocers and some supermarkets),  ½ tsp saffron,  350ml\/12fl oz chicken stock,  125g\/4½oz stoneless dried apricots, halved,  110g\/4oz green olives, stones removed,  75g\/2½oz whole almonds,  1 small bunch fresh coriander,  salt and freshly ground black pepper,  175g\/6oz bulgar wheat,  700ml\/1 pint 5fl oz chicken stock,  2 small red onions, peeled, finely chopped,  300g\/10½oz pistachio nuts, shells removed, roughly chopped,  1 lemon, juice only,  3 tbsp extra virgin olive oil,  5 tbsp chopped fresh flatleaf parsley ,  5 tbsp chopped fresh coriander leaves,  5 tbsp chopped fresh mint ,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambneckfillettagine_91764"}