{"recipe_name":"Lamb rack in hot pepper paste with sesame spinach","author":"Nic Watt","programme":"2007-16","prep_time":"overnight","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb, place the hot pepper paste, sake, soy, mirin, dried chilli, garlic, ginger and toasted sesame oil into a bowl and whisk together to form a smooth paste. Wrap the lamb bones in small pieces of tin foil and pinch tight to prevent them burning. Lightly brush the lamb racks with half of the hot pepper marinade (reserving the rest for later) and place the lamb onto a tray. Transfer to the fridge to marinate overnight, preferably for 24 hours. Allow to return to room temperature before cooking. Preheat the oven to 180C\/365F\/Gas 4. Heat a large ovenproof frying pan until hot and add the olive oil and marinated lamb. Cook on each side until golden-brown all over, then brush all over with some more of the marinade (reserve a little marinade for serving). Transfer to the oven and cook for 10-12 minutes, or until cooked to your liking. Remove from the oven and leave to rest in a warm place for five minutes. For the sesame spinach, place the sesame seeds, sesame paste, sweet white miso, ginger juice, dashi stock, rice vinegar, lemon juice and sesame oil into a bowl and whisk together to combine. Heat a frying pan until hot, then add the spinach and cook until just wilted. Add the yama gobo and the sesame dressing mixture and mix to combine. To serve, spoon the sesame spinach into the centre of each plate in a neat pile. Slice the lamb rack into chops and place four onto each plate, arranged over the spinach. Add a little of the remaining marinade to each plate and serve. ","ingredients":" 250g\/9oz hot pepper paste or gochugang (Korean chilli bean paste; available from Asian supermarkets),  75ml\/3fl oz sake,  25ml\/1fl oz soy sauce,  75ml\/3fl oz mirin (available from Asian supermarkets),  pinch dried chilli,  40g\/1½oz garlic paste (available from Asian supermarkets), or four garlic cloves, pounded to a paste,  40g\/1½oz ginger paste (available from Asian supermarkets), or thumb-sized piece of ginger, pounded to a paste,  2 tsp toasted sesame oil,  4 x 4 bone lamb racks, French cut (ask your butcher to prepare this for you),  1 tbsp olive oil,  1 tbsp toasted sesame seeds,  60g\/2½oz sesame paste or tahini,  10g\/½oz sweet white miso (available from Asian supermarkets and health food shops),  1 tsp ginger juice (grate the ginger and squeeze to collect the juice),  3 tbsp dashi stock (dried sachets of dashi are available from Asian supermarkets, add the appropriate amount of water, following packet instructions),  2 tsp rice vinegar,  1½ tsp lemon juice,  2 tsp sesame oil,  500g\/1lb2oz spinach leaves,  1 tsp chopped yama gobo\/Japanese burdock root (available from Asian supermarkets)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambrackinjapaneseho_86628"}