{"recipe_name":"Spiced lamb rack with spinach, chickpeas and crème fraîche dressing","author":"Matt Tebbutt","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the marinated lamb, place the rack of lamb into a large  bowl and add the garlic, lemon juice and ground coriander. Mix well until the lamb is coated in the mixture. Cover the bowl with cling film and chill in the fridge for at least one hour. Heat the oil in a large ovenproof frying pan, over a medium heat. Add the marinated lamb and cook on each side for 2-3 minutes or until golden-brown all over. Brush any remaining marinade over the lamb and transfer to the oven to roast for 10-12 minutes (for medium), or until cooked to your liking. Remove from the oven and set aside in a warm place for five minutes. Meanwhile, for the spinach and chickpeas, heat the oil in a frying pan over a medium heat, add the chickpeas and ground coriander and fry for four minutes. Add the spinach and continue to cook; stirring well, until the spinach has wilted. Season, to taste, with salt and freshly ground black pepper. Set aside and keep warm. For the crème fraîche dressing, place the crème fraîche into a bowl with the garlic, coriander and oil and season, to taste, with salt and freshly ground black pepper. Stir until well combined. To serve, place the chickpeas and spinach into the centre of four serving plates, cut the rack of lamb into individual chops and place one on top of each portion of the chickpeas. Drizzle over the crème fraîche dressing. ","ingredients":" 1 x 4-bone lamb racks French trimmed (ask your butcher to prepare this for you),  1 garlic clove, peeled, finely chopped,  1 lemon, juice only,  1½ tsp coriander seeds, toasted, ground to a powder,  1 tbsp olive oil,  1 tbsp olive oil,  400g\/14oz canned chickpeas, drained, rinsed,  ½ tsp coriander seeds, toasted, ground to a powder,  200g\/7oz baby spinach leaves, washed,  Salt and freshly ground black pepper,  1 tbsp crème fraîche,  1 garlic clove, peeled, finely chopped,  Bunch chopped fresh coriander,  2 tbsp olive oil,  Salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambrackwithspinacha_92736"}