{"recipe_name":"Lamb, rosemary and olive casserole with cauliflower purée","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/355F\/Gas 4. Heat the oil in a large casserole over a medium heat and fry the lamb pieces quickly to brown on all sides. Remove the meat from the pan and place in a clean bowl. Reduce the heat slightly, and add the onion, garlic, celery and carrot to the casserole. Fry for 5-6 minutes, until the vegetables are softened. Add the wine, stock and peppercorns and bring the mixture to the boil. Return the meat to the pot and transfer to the oven to cook for two hours in the oven. Meanwhile, to make the cauliflower purée, place the cauliflower into a large saucepan and pour over the chicken stock. Cover with a lid and bring to the boil. Cook for 7-8 minutes, or until the cauliflower is tender. Place the cauliflower into a food processor and add the cream and curry powder. Blend to a smooth paste, then pass the mixture through a sieve. Remove the casserole from the oven. Add the olives and season, to taste, with salt and freshly ground black pepper. To serve, spoon generous portions out onto plates. Sprinkle with parsley and place a spoonful of cauliflower purée alongside. ","ingredients":" 1 tbsp vegetable oil,  1kg\/2lb 3oz lamb shoulder, cut into large cubes,  1 large onion, roughly chopped,  1 garlic clove,  6 sticks celery, roughly chopped,  3 carrots, roughly chopped,  750ml\/1 pint 7fl oz red wine,  350ml\/12½fl oz beef stock,  salt,  20 black peppercorns,  200g\/7oz mixed olives,  1 cauliflower head, broken into large florets,  100ml\/3½fl oz chicken stock,  200ml\/7fl oz double cream ,  pinch curry powder,  salt and freshly ground black pepper,  fresh parsley, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambrosemaryandolive_85239"}