{"recipe_name":"Lamb rump with spiced chickpea stew","author":"Atul Kochhar","programme":"Put Your Money Where Your Mouth Is","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb, mix all the ingredients, apart from the lamb, in a shallow non-reactive dish. Score the rumps with a sharp knife and rub the mixture all over the rumps. Leave in the dish, covered, to marinate for at least two hours in a cool place.  Preheat the oven to 200C\/390F\/Gas 6.  Brown the lamb well in a hot frying pan, before placing in the oven to roast for 15-20 minutes - longer if you prefer your meat well done. Leave to rest in a warm place for at least five minutes before serving. Meanwhile, for the vegetable stew, heat the oil in a pan over medium heat and fry the bay leaves, cardamom pods and garlic cloves for one minute.  Add the onions and fry until lightly coloured. Stir in the ginger and garlic paste and cook for a further two minutes, until fragrant.  Add the coriander, chilli powder, cumin, turmeric, salt, tomatoes, potato, turnips and carrots. Stir well and simmer for 30 minutes. Once the potatoes and other vegetables are tender when tested with the point of a knife, add the drained chickpeas. Cook for a further five minutes.  Scatter the coriander over the stew and serve it topped with the lamb rump. ","ingredients":" 4 sprigs rosemary, leaves only, roughly chopped,  5 garlic cloves, finely chopped,  1 tbsp ground turmeric,  1 tbsp ground coriander,  1 tbsp mild red chilli powder,  1 tbsp garam masala,  3 tbsp vegetable oil,  4 x 200g\/7¼oz boned rumps of lamb (chumps),  4 tbsp vegetable oil,  2 bay leaves,  2 green cardamom pods, crushed,  5 garlic cloves, peeled,  200g\/7¼oz onions, sliced,  1 tbsp ginger and garlic paste (from a jar),  1 tsp ground coriander ,  1 tsp red chilli powder ,  1 tsp ground cumin,  1 tsp ground turmeric,  2 tsp salt,  200g\/7¼oz tomatoes, roughly chopped,  1 large potato, peeled and cubed,  2 large turnips, peeled and cubed,  1 large carrot, peeled and cubed,  150g\/5¼oz canned chickpeas, drained and rinsed,  handful fresh coriander, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambrumpwithspicedch_91277"}