{"recipe_name":"Lamb-stuffed rolled marrow with salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the lamb mince, heat a frying pan until hot, add the olive oil, onion and garlic and cook for 3-4 minutes, until just softened. Add the lamb mince and cook for 2-3 minutes, until browned. Add the cumin, coriander, cinnamon and tomato puré and cook for a further minute. Add the lamb stock, sultanas and pine nuts and bring to the boil, then reduce the heat and simmer for 15 minutes. Add the fresh coriander and season, to taste, with salt and freshly ground black pepper. Remove from the heat and leave to cool slightly. For the rolled marrow, heat a separate frying pan until hot. Add half of the olive oil, the onion and garlic and cook for 2-3 minutes, until softened. Add the tomatoes, sugar and ground coriander seeds and bring to the boil. Reduce the heat and simmer for 20 minutes, or until the sauce has thickened. Season, to taste, with salt and freshly ground black pepper. Heat a separate frying pan until hot, add the remaining olive oil and the sliced marrow strips in batches and fry on each side for 30-50 seconds, until just softened and starting to turn golden-brown. Remove and drain on kitchen paper while you cook the remaining strips. Place the marrow slices onto a clean work surface and season well with salt and freshly ground black pepper. Spoon some of the lamb mince mixture into the centre of each marrow slice and roll it up around the mince. Transfer each stuffed roll into an ovenproof dish, seam-side down. Spoon the tomato sauce over the stuffed marrow rolls, then top with pieces of mozzarella and sprinkle with parmesan. Cover the dish with aluminium foil and place into the oven to bake for 15 minutes. Remove the foil and return to the oven for a further 5-8 minutes, or until golden-brown all over. For the salad, whisk the lemon juice and olive oil together in a bowl and season to taste with salt and freshly ground black pepper. Place the salad leaves into a serving bowl and drizzle with the dressing. Toss the salad to coat well. To serve, place two stuffed marrow rolls onto each plate and spoon a little sauce over. Serve with the salad alongside. ","ingredients":" 2 tbsp olive oil,  1 onion, finely chopped,  1 garlic clove, finely chopped,  400g\/14oz minced lamb,  1 tsp ground cumin,  1 tsp ground coriander seeds,  ½ tsp ground cinnamon ,  1 tbsp tomato purée,  300ml\/11fl oz lamb stock,  75g\/3oz sultanas,  50g\/2oz pine nuts, toasted,  3 tbsp fresh coriander leaves, roughly chopped,  salt and freshly ground black pepper ,  4 tbsp olive oil,  1 onion, finely chopped,  2 garlic cloves, finely chopped,  400g\/14oz canned chopped tomatoes,  1 tsp caster sugar,  1 tsp ground coriander seeds,  salt and freshly ground black pepper ,  2 marrows, peeled and sliced thinly lengthways,  1 ball mozzarella, thickly sliced,  3 tbsp freshly grated parmesan ,  1 lemon, juice only,  4 tbsp olive oil,  salt and freshly ground black pepper ,  1 bag mixed salad leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambstuffedrolledmar_89438"}