{"recipe_name":"Lamb with aubergine and tzatziki","author":"Antony Worrall Thompson","programme":"Saturday Brunch","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a griddle pan. Cut the aubergines lengthways into four slices and brush with olive oil. Sear on both sides. Remove from the heat and put to one side. Put the paste ingredients in a food processor and blend together. Take the paste and smear it over the inside of the leg of lamb. Place the aubergine slices on top. Roll up the leg and tie at 5cm\/2in intervals. Allow to rest for as long as possible, overnight if you can. Preheat the oven to 200C\/400F\/Gas 6. Rub the oregano, salt, pepper and lemon juice on to the meat. Put the meat into a hot pan to sear on each side before placing in the oven. Roast for 15 minutes per 500g\/1lb plus 15 minutes more, turning occasionally. Cover the meat with foil for the first 30 minutes' cooking to keep moist. Remove from the oven and rest the meat for one third of the time it took to cook. This ensures a perfectly pink result. To make the lime tzatziki, peel the cucumber, remove the seeds and grate finely. Squeeze out all the moisture before combining with all the rest of the ingredients. Chill for an hour to allow the flavours to blend. Sprinkle over the dill just before serving. Serve the meat with the tzatziki on the side. ","ingredients":" 1 medium aubergine, cut lengthways into 1cm\/½in thick slices,  olive oil, to coat the aubergines,  1 leg of lamb, bone removed,  115g\/4¼oz kalamata black olives, pitted,  2 tbsp grated orange zest,  1 tsp grated lemon zest,  2 tbsp chopped sage,  2 tbsp chopped garlic,  2 tbsp chopped anchovy ,  1 tsp crushed black pepper,  2 tbsp olive oil,  2 tbsp dried oregano,  salt and freshly ground black pepper,  1 lemon, juice only,  1 cucumber, halved, de-seeded and coarsely grated,  450g\/1lb Greek yoghurt,  2 limes, zest only, grated,  2 large cloves of garlic, crushed,  1 bunch spring onions, finely sliced,  1 red chilli, finely chopped,  chopped dill, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lambwithaubergineand_71920"}