{"recipe_name":" Banoffee millefeuilles with chocolate and caramel icing","author":"Holly Bell","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Makes 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":" Preheat the oven to 220C\/425F\/Gas 7. Line three baking trays with greaseproof paper. For the pastry, place the butter and lard in a bowl and mash with a fork until soft and creamy. Spread evenly on the bottom of the bowl and use a knife to mark into quarters.  Put the flour into a clean bowl and add the salt. Take one quarter of the butter and lard mixture and rub into the flour. Add the white wine vinegar and using a blunt knife mix in enough cold water to form a dough (you may not need all the water). Turn out onto a floured work surface.  Using your hands, shape the pastry into a rectangle then roll the pastry to a 1cm\/½in thickness. Tease the corners back into place if they have stretched. Put your hands under the pastry and allow the pastry to shrink back a little.  Using a palette knife, dot another quarter of the butter\/lard mixture across the pastry rectangle being careful not to get too close to the edges. Leave one short edge 3cm\/1¼in free of the fat mixture. Fold the pastry into thirds, rubbing off any excess flour as you do so.  Repeat steps 4 and 5 twice more then roll and fold the pastry a few more times to add more layers. Cover in cling film and put into the fridge for at least 30 minutes.  For the caramel, heat the brown sugar and butter on the hob until the sugar has dissolved. Add the condensed milk and stir until the first bubbles appear on the surface. Remove from the heat and set aside to cool.  Remove the pastry from the fridge and roll on out a floured work surface to a 3mm\/⅛in thickness. Lift the pastry up and allow it to shrink back a little.  Cut 36 x 13cm x 8cm\/5in x 3in rectangles. Place 12 rectangles onto one of the lined baking trays, prick with a fork, dredge with lots of icing sugar and chill in the freezer for five minutes.  Place 12 rectangles onto each of the remaining baking trays and chill in the fridge.  Remove the baking tray from the freezer and bake in the oven for 10-12 minutes, or until the pastry is beginning to brown on top. Cover the pastry rectangles with a piece of greaseproof paper and place another baking tray on top. Return to the oven and bake for a further 7-10 minutes then set aside to cool on a wire rack.   Chill the remaining pastry rectangles in the freezer for five minutes, then repeat step 10.  Meanwhile, whip the cream until it forms stiff peaks, fold in the banana liqueur and add icing sugar to taste. Spoon the mixture into a piping bag fitted with a medium plain nozzle and place in the fridge.   When the caramel is cool, pour into a squeezy bottle and place in the fridge. For the icing, mix the cocoa and icing sugar in a bowl, then add the boiling water and mix to a stiff paste.   Spread the icing over 12 of the rectangles using a palette knife, applying it to the less flaky surface for a better finish. Squeeze four lines of the caramel across the top of each and immediately drag a toothpick in the opposite direction to give the traditional feathered decoration.     To assemble the millefeuilles, pipe cream onto one un-iced pastry rectangle and drizzle over a little caramel. Place over another uniced rectangle, repeat the cream and caramel and top with an iced rectangle. Repeat with the remaining rectangles and dust with icing sugar just before serving.  ","ingredients":" 300g\/10½oz unsalted butter, at room temperature,  300g\/10½oz lard, at room temperature,  800g\/1lb 12oz plain flour,  1 tsp salt,  2 tbsp white wine vinegar,  600ml\/1 pint water, chilled,  icing sugar,  150g\/5½oz soft brown sugar,  150g\/5½oz butter,  1 x 397g\/14fl oz tin condensed milk,  500ml\/18fl oz double cream,  2 tbsp banana liqueur,  icing sugar, to sweeten ,  2 tsp cocoa powder,  225g\/8oz icing sugar,  2-3 tbsp boiling water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/_banoffee_mille_feuille_37951"}