{"recipe_name":"Lancashire cheese sausages","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sausages, place the cheese, breadcrumbs, onions, thyme, parsley, eggs, egg yolks, milk and garlic into a large bowl. Season well with salt and freshly ground black pepper, then mix your hands to combine the ingredients well. Place the sausage mixture into the fridge to chill for 2-3 hours, then remove and mould it into sausage shapes. (You should get about 12 normal-sized sausages from this quantity of mixture, depending how big you like your sausage.) Heat the oil in a deep frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully add the sausages to the oil and fry them, turning if necessary, for 4-5 minutes, or until golden-brown, then remove with a slotted spoon and drain onto kitchen paper. (NB: you can also shallow fry or grill the sausages.) For the potatoes, melt the butter in a separate frying pan. Add the potatoes and sauté for 4-5 minutes, or until crisp and golden.  To serve, place a few sausages onto each plate with a large spoonful of sautéed potatoes alongside. Add a dollop of tomato chutney or ketchup. ","ingredients":" 600g\/1lb 5oz Lancashire cheese, grated,  200g\/7oz fresh breadcrumbs,  6 spring onions, chopped,  30g\/1oz fresh thyme leaves, chopped,  30g\/1oz fresh parsley, chopped,  3 free-range eggs,  3 free-range egg yolks,  50ml\/2fl oz milk, to bind,  2 garlic cloves, crushed,  salt and freshly ground black pepper,  400g\/14oz Maris Piper (or similar) potatoes, peeled, cubed and boiled for ten minutes,  200g\/7oz butter,  tomato chutney or tomato ketchup","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lancashirecheesesaus_85483"}