{"recipe_name":"Bakewell tart with cranberry frangipane","author":"Andi Oliver","programme":"Christmas Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/bakewell_tart_with_20773_16x9.jpg","method":"Preheat the oven to 180C\/160C Fan\/Gas 4.  For the pastry, mix together the flour and salt in a bowl. Rub in the butter until the mixture resembles fine breadcrumbs. Add 1–2 tablespoons cold water, or just enough to bring the pastry together into a soft, malleable dough. Wrap in cling film and refrigerate for 30 minutes. Roll out the dough on a lightly floured surface until large enough to line a 23cm\/9in tart tin. It should be a few millimetres thick. Carefully transfer the dough into the tin and press, using a spare piece of dough, into every corner of the tin. Do not trim. Line the pastry with baking paper, then fill it with baking beans (or uncooked rice). Bake for 12 minutes. Remove the beans and paper and bake for a further 5 minutes. Meanwhile, for the frangipane filling, gently melt the butter and sugar together in a saucepan. Beat in the ground almonds, flour and eggs. Spread the pastry case with the cranberry compôte. Top with the frangipane mixture. Sprinkle over the flaked almonds. Bake for 25–35 minutes, or until golden-brown. Set aside to cool for at least 10 minutes.  For the icing, mix the icing sugar with enough lukewarm water to create a paste thick enough to coat the back of a spoon. Drizzle the icing over the tart and serve. ","ingredients":" 300g\/10½oz plain flour, plus extra for dusting,  big pinch salt,  150g\/5½oz cold butter, cubed,  100g\/3½oz butter,  100g\/3½oz caster sugar,  100g\/3½oz ground almonds,  25g\/1oz plain flour,  2 free-range eggs, beaten,  6 tbsp cranberry compôte (or good-quality cranberry sauce without vinegar) ,  40g\/1½oz flaked almonds,  80g\/3oz icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bakewell_tart_with_20773"}