{"recipe_name":"Lancashire hotpot with braised red cabbage","author":"Marcus Wareing","programme":"Great British Menu","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6.  First make the stock. Remove the meat from the middle neck of lamb and set aside. Chop the bones and put them in a roasting tray. Roast until lightly browned. Meanwhile, cook the carrot, onion and garlic in a little olive oil in a large heavy-bottomed stockpot until lightly browned. Add the herbs and salt, then stir in the tomato purée and cook for a couple of minutes. Add the roasted bones and cover with the water. Bring to the boil, then turn down to a simmer and cook for one hour, skimming off any fat or scum regularly. Pass the liquid through a fine sieve into a clean pan. Return to the heat and reduce until you have 1 litre\/1¾ pints of stock. Turn the oven down to 150C\/300F\/Gas 2. To make the hot pot, cut the lamb into 2cm\/1in thick slices. Dust them with flour. Heat the oil in a pan and quickly fry until lightly coloured on both sides. Remove and set aside.  In the same oil, quickly fry the onion, carrots and garlic until lightly browned. Layer the lamb, onion and carrots in a heavy casserole dish, filling it to 1cm\/½in from the top. Season each layer with salt and freshly ground black pepper, and the herbs, spooning liberal amounts of stock between each layer. Arrange the potatoes neatly all over the top of the dish. Dot a few small knobs of butter on the potatoes, cover with a tight-fitting lid and cook in the oven for 1½ hours. Remove the lid and cook for a further 45 minutes. Meanwhile, make the red cabbage. Mix together all of the ingredients. Put into a roasting tray and cover with foil. Place in the oven and cook for about 1½ hours, stirring regularly, until most of the liquid has evaporated. Serve the hot pot from the casserole onto warm plates with the cabbage. ","ingredients":" 1 large carrot, cut into 3 pieces,  1 onion, cut into quarters,  2 cloves garlic,  sprig rosemary,  sprig thyme,  1 bay leaf,  pinch rock salt ,  1 tbsp tomato purée,  2 litres\/3½ pints water,  1 middle neck of lamb with bones, about 1kg\/2¼lb,  plain flour, for dusting,  2 tbsp olive oil,  1 Spanish onion, thinly sliced,  2 carrots, thinly sliced,  1 clove garlic, thinly sliced,  salt and freshly ground black pepper,  1 tbsp thyme leaves,  1 tbsp chopped rosemary,  3 Maris Piper potatoes, very thinly sliced,  unsalted butter,  1 small red cabbage, cored and sliced,  1 red onion, finely chopped,  150g\/5½oz unsalted butter,  200ml\/7fl oz red wine vinegar,  50g\/2oz clear honey,  100g\/3½oz demerara sugar,  1 bay leaf,  sprig thyme,  salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lancashirehotpotwith_81803"}