{"recipe_name":"Langosi (sweet pancakes with hazelnut cream)","author":"The Hairy Bikers","programme":"The Hairy Bikers","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the pancake batter, mix the flour, salt, sugar and baking powder together in a large bowl.  Make a well in the centre and add the eggs and milk and mix together. Add the melted butter and mix well. For the hazelnut cream filling, place the butter, cocoa powder and sugar in a bowl placed over a pan of simmering water and mix together (do not let the bottom of the bowl touch the water). Add the vanilla and milk and stir well. Continue stirring over the hot water for about 15 minutes, or until the mixture has thickened. Stir in the beaten egg yolks and continue to cook for about 10 minutes, until mixture is creamy. Add the chopped nuts and mix together. Leave to cool. Whip the cream to soft peaks and fold into the cooled hazelnut mixture.  For the raspberry coulis, blend the raspberries with enough sugar to sweeten and the cherry brandy (optional). Sieve to remove the pips, if you like. To cook the pancakes, heat a small non-stick frying pan over a medium heat. Add a little melted butter then add a ladleful of the batter mixture. Cook for 1-2 minutes until golden, then flip over and cook the other side for about one minute. Place on a warm plate and repeat with the remaining batter. To serve, place a generous spoonful of the hazelnut cream filling on each pancake and roll up. Pour over the raspberry coulis and dust with icing sugar. ","ingredients":" 350g\/12oz plain flour ,  pinch salt,  2 tbsp caster sugar,  ½ tsp baking powder,  2 free-range eggs,  375ml\/13fl oz milk,  2 tbsp melted butter, plus extra for frying,  3 tbsp butter,  4 tbsp cocoa powder ,  3 tbsp caster sugar,  285ml\/½pint milk,  ½ tsp vanilla extract,  4 free-range egg yolks, lightly beaten,  225g\/8oz chopped hazelnuts,  250ml\/9fl oz whipping cream,  raspberries,  caster sugar, to taste,  2 tsp cherry brandy (optional),  icing sugar, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/langosipancakes_80201"}