{"recipe_name":"Langoustines with orange-saffron butter and swede tahini mash","author":"Silvena Rowe","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the butter, pour the vermouth into a large bowl and add the saffron strands. Set aside for 2-3 minutes, then stir in the orange zest, orange juice and lemon zest.  Add the butter, garlic, chives, sumac and cumin and beat until combined. Season, to taste, with salt and freshly ground black pepper and beat again. Spread out a sheet of cling film onto a flat work surface. Spoon the flavoured butter mixture onto the cling film, then use the cling film to shape and roll the butter into a sausage shape. Roll the cling film around the butter and seal the ends tightly. Chill in the fridge for two hours, or until firm.  When the flavoured butter has been chilling for 1½ hours, prepare the mash. Bring the chopped swede to the boil in a pan of salted water, then reduce the heat and simmer for 15–20 minutes, or until the swede is tender. Drain well. Blend the drained swede in a food processor until smooth, then transfer the puréed swede to a large mixing bowl. Stir in the tahini, garlic, cumin, lemon juice and olive oil, then season, to taste, with salt and freshly ground black pepper. For the langoustines, heat the olive oil in a heavy-based frying pan over a medium to high heat. Add the langoustines, in batches if necessary, and fry for 1-2 minutes, stirring all the time, until pink and cooked through. Remove from the pan and set aside.  Add 75g\/3oz of the chilled orange-saffron butter to the pan, then take the pan off the heat and set aside until the butter has melted.  To serve, pile the langoustines onto a serving platter. Drizzle over the melted orange-saffron butter. Slice the remaining chilled butter and place the slices on top of the langoustines. Spoon the swede mash into a large bowl and pile the salad leaves onto a large plate. Allow guests to help themselves. ","ingredients":" 50ml\/2fl oz dry vermouth ,  pinch saffron strands,  ½ orange, zest and juice,  ½ lemon, zest only,  100g\/4oz butter, softened,  4 garlic cloves, crushed,  50g\/2oz fresh chives, finely chopped,  ½ tsp crushed or ground sumac,  1 tsp cumin seeds, finely ground,  salt and freshly ground black pepper,  300g\/11oz swede, peeled and chopped,  2 tbsp tahini paste,  3 garlic cloves, crushed,  3 tbsp cumin seeds, finely ground,  1 lemon, juice only,  4–6 tbsp olive oil,  salt and freshly ground black pepper,  1 tbsp olive oil ,  20 large langoustines, heads and shells removed, de-veined,  green salad leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/langoustines_with_21304"}