{"recipe_name":"Langoustines with charred aubergine and red Thai curry","author":"Wolfgang Puck","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the red Thai curry sauce, put the ginger, lemongrass, galangal, shallots, garlic, chillies, red curry paste, lime leaves and coriander leaves and stems into a food processor. Pulse into a rough paste. Cook the paste in a saucepan over a medium heat with rapeseed oil for 2-3 minutes, taking care not to burn it. When fragrant, add the toasted and ground spices and cook until they release their aroma. Add the coconut milk, lime juice, fish sauce and half the sugar. Simmer for a few minutes, then taste. Add more sugar if necessary. Add Thai basil and kaffir lime leaves. Take off the heat and leave to stand for 20 minutes then strain the sauce and reserve.  For the aubergine, preheat the oven to 220C\/200C Fan\/Gas 7. With a fork, prick the aubergine several times. Rub with rapeseed oil and roast in the oven until completely tender (about 15-20 minutes).  Remove the pulp from the charred skin and roughly chop. In a medium pan over a low heat, add the butter and a little rapeseed oil. Once warm add the jalapeno, garlic, ginger and onion. Simmer gently until aromatic. Stir in the aubergine pulp. Add the cumin, coriander, salt, pepper and sugar. Adjust the seasonings to taste. Simmer for 5 minutes and add the tomatoes. Continue to cook on a very low heat, for 25 minutes, stirring occasionally. Remove from heat and set aside. When cool, add the coriander.  For the langoustine, heat a little oil in a frying pan and cook for 1-2 minutes until done. To serve, spoon the aubergine onto the plate and top with the langoustine. Spoon over the red curry sauce and garnish with peas shoots, spring onions and coriander leaves. ","ingredients":" 16 cleaned tail-on langoustines (or large prawns)   ,  20g\/¾oz ginger, cut into pieces, not peeled,  45g\/1½oz lemon grass, cut into pieces ,  20g\/¾oz galangal, cut into pieces,  20g\/¾oz shallots, sliced,  20g\/¾oz garlic, whole cloves,  2 red bird's eye chillies,  1 tbsp red curry paste,  20g\/¾oz lime leaves,  20g\/¾oz coriander leaves and stems,  1 tbsp rapeseed oil,  2 tsp black pepper, toasted and ground,  2 tsp cumin seeds, toasted and ground,  2 tsp coriander seeds, toasted and ground,  2 tsp sweet paprika, toasted and ground,  600ml\/21fl oz coconut milk ,  140ml\/5fl oz lime juice,  55ml\/2fl oz fish sauce,  50g\/1¾oz sugar (to taste),  35g\/1oz Thai basil leaves ,  20g\/¾oz kaffir lime leaves,  4 large aubergines ,  2 tbsp rapeseed oil,  30g butter,  1 jalapeno chilli, seeds removed and very finely chopped ,  45g\/1¾oz garlic, minced,  45g\/1¾oz ginger, minced,  45g\/1¾oz onion, minced very fine,  100g\/3½oz tomatoes, peeled, deseeded and diced   ,  10g cumin, toasted and ground,  10g coriander seed, toasted and ground,  salt and freshly ground black pepper,  sugar, to taste,  45g\/1¾oz fresh coriander, cut into thin strips (chiffonade),  spring onions, sliced,  coriander Leaves ,  pea shoots","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/langoustines_with_56864"}