{"recipe_name":"Langoustines flamed in whisky sauce with dill and lemon potato cakes and salad with citrus dressing","author":"The Hairy Bikers","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to high. Place the split whole langoustines, cut-side up, onto a grill pan.   Mix together the crushed garlic and 50g\/2oz of the softened butter. Spread the mixture evenly over the langoustine flesh and season, to taste, with salt flakes and freshly ground black pepper. Place under the preheated grill and cook until the langoustines are just cooked (the flesh will be opaque).   Heat the remaining 25g\/1oz unsalted butter and the olive oil in a large frying pan. Add the de-shelled langoustines and cook for 4-5 minutes. Add the whisky to the pan, then carefully light with a match. (NB: Keep hands and clothing well away from the flame.) Flame for a minute or so, then let the flames die away.   Add the crème fraîche and parsley to the pan and stir well. Taste and season with salt or freshly ground black pepper, if needed. Keep warm until ready to serve.   For the potato cakes, peel and grate the parboiled potatoes. Place the grated potatoes into a large bowl.  Add the egg, salt and freshly ground black pepper, to taste, dill, lemon zest and lemon juice and a tablespoon of the olive oil. Divide the mixture into four equal portions and form into cakes. Heat the remaining olive oil and a small knob of butter in a frying pan over a medium heat. Add the potato cakes to the pan and cook for 4-5 minutes, or until the bases are golden-brown. Carefully turn over and cook on the other side until golden-brown. Keep warm until ready to serve. For the salad dressing, shake together the orange juice, lemon juice, vinegar, garlic, mustard powder and sugar in a screw-top jar until well combined. Taste and season with salt and freshly ground black pepper as required.  Place the salad leaves into a large bowl and dress the leaves first with the rapeseed oil, then add the dressing and mix to coat the leaves (you may not need to add all of the dressing).  To serve, place a dill potato cake into the centre of each of four warmed serving plates. Place a spoonful of the sautéed langoustine on top and spoon over the whisky sauce. Place two grilled langoustine to the side, pile the salad alongside and drizzle additional rapeseed oil around the plate. ","ingredients":" 8 whole langoustines, shells on, split in half down the middle ,  2 garlic cloves, crushed,  75g\/3oz unsalted butter, softened ,  salt flakes and freshly ground black pepper, to taste ,  1 tbsp olive oil ,  1kg \/2lb 3oz langoustines, heads and shells removed, de-veined ,  2tbsp crème fraîche ,  2 tsp malt whisky ,  1 tbsp chopped fresh parsley,  500g\/1lb 2oz waxy potatoes, such as Charlotte or Maris Peer, boiled in their skins for five minutes ,  1 free-range egg, beaten,  salt and freshly ground black pepper,  1 tbsp finely chopped dill ,  ½ lemon, zest only, plus 1 tsp fresh lemon juice ,  3 tbsp olive oil ,  butter, for frying,  1 orange, juice only,  2 tbsp lemon juice,  2 tbsp white wine vinegar,  1 garlic clove, crushed ,  pinch English mustard powder,  1 tsp soft brown sugar, or more to taste,  salt and freshly ground black pepper,  3-4 punnets of micro salad leaves,  3-4 tbsp rapeseed oil, plus extra for serving","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/langoustinesflamedin_92112"}