{"recipe_name":"Languages of love wedding cake","author":"Kimberley Wilson","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Makes 1 three-tiered wedding cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the raspberry cake, preheat the oven to 160C\/325F\/Gas 3 and grease 12 cake pop moulds. In a bowl, combine the oil, egg yolks, sugar, and 100ml\/3½fl oz water. Stir in the liqueur and the red gel food colouring. Sift in the flour and bicarbonate of soda.  Whisk the egg whites until stiff peaks form when the whisk is removed. Fold the egg whites and freeze-dried raspberries into the cake mixture.  Fill the cake pop moulds and bake for about 10 minutes, or until a skewer inserted into a cake pop comes out clean. Set aside to cool. To make the orange and pistachio cakes, grease and line two 18cm\/7in springform cake tins and preheat the oven to 160C\/325F\/Gas 3.  For the orange cake, break the eggs into a large mixing bowl, then add the sugar, flour, baking powder and butter. Mix to combine, then add the remaining ingredients and mix again until well combined (the easiest way to do this is with an electric hand mixer, but a wooden spoon is sufficient). Pour the batter into one of the prepared cake tins and set aside while you make the pistachio cake. For the pistachio cake, break the eggs into a large mixing bowl, then add the sugar, flour, baking powder and butter. Mix to combine, then the rest of the ingredients and mix again until well combined. Pour the batter into the remaining 18cm\/7in cake tin. Bake both cakes for 30 minutes, or until light and springy to the touch. When cooked, removed the cakes from the oven and place on a wire rack to cool completely. When the orange and pistachio cakes are completely cool, flatten the tops (don’t worry about taking off too much as the cakes will be sandwiched together to make a single tier of the final cake). Using the 12cm\/5in cutter, cut out a round from the centre of each 18cm\/7in cake. Then, using the 6cm\/2½in cutter, cut out 6cm\/2½in rounds from the centre of the 12cm\/5in cakes. Swap the circles around and reassemble the cakes so that you end up with two 18cm\/7in cakes that look like targets. For the orange syrup, heat the orange juice and icing sugar in a small pan to make a syrup. Brush the orange and pistachio cakes with the orange syrup. Warm the marmalade and brush over the cakes to glaze.  Stack cakes on top of each other.  For the lemon, poppy and elderflower cake, preheat the oven to 180C\/350F\/Gas 4 and grease and line two Swiss roll tins.  Whisk the eggs and sugar in large bowl with an electric whisk until the mixture is a very pale yellow, foamy and mousse-like. Add the melted butter. Fold in the flour, salt, lemon zest and juice. Divide the mixture between the prepared Swiss roll tins and bake for approximately 12 minutes. Set aside to cool, then use a 15cm\/6in mousse ring cut out three circles of cake.  For the chocolate cake, preheat the oven to 160C\/325F\/Gas 3 and grease and line a 23cm\/9in springform cake tin.  Melt the butter and chocolate in a microwave or a heatproof bowl suspended over a pan of simmering water. Once melted pour into a large mixing bowl and add the sugar, salt, eggs, coffee and 250ml\/9fl oz water. Sift in the flour and cocoa powder. Mix to combine. Pour a layer of the cake batter into the bottom of the prepared cake tin, then add the cooked cake pops and fresh raspberries. Fill with the remaining chocolate cake batter. Bake for 90 minutes then set aside to cool completely.  Meanwhile, make the buttercream. Beat the butter in a large bowl until soft. Add half the icing sugar and beat until smooth. Add the remaining icing sugar and one tablespoon of the milk and beat the mixture until creamy and smooth. Beat in the remaining milk, if necessary, to loosen the mixture. To decorate the cakes, make a marshmallow fondant icing by melting the mini marshmallows for approximately 30 seconds in a microwave. Mix in the icing sugar and knead until you have a smooth paste (take care – the marshmallows will be hot). Set aside to cool completely. Place the cooled chocolate cake on the 23cm\/9in cake board. Cover the cake with a crumb coat of buttercream. Lightly dust a work surface with icing sugar and roll out half the ready-to-roll fondant icing to the thickness of a pound coin. Make a pattern on the fondant by pressing one of the imprint mats into the icing. Drape the fondant over the cake, with the mat still attached so the pattern doesn’t stretch. Remove the mat and gently press the icing into the edges of the cake. Brush the smooth icing with silver food paint for an embossed effect.  Add a little teal gel colour to the sugarpaste and knead until the colour is evenly distributed. Lightly dust a work surface with icing sugar and roll out the sugarpaste to the thickness of a pound coin. Cut out letters to spell “LOVE” (these will sit on the top of the 15cm\/6in cake) and set aside.  For the orange and pistachio cake, place the cake on the 18cm\/7in cake board. On a work surface lightly dusted with icing sugar, roll out half the marzipan to the thickness of a pound coin. Drape over the cake and smooth down the sides. Roll out the remaining fondant icing in the same way then place the second imprint mat on top and press into the fondant. With the mat still attached drape the fondant over the cake. Carefully remove the mat and press the fondant into the sides of the cake. Brush with silver food paint and set aside.  To finish the lemon, poppy and elderflower cake, brush the cakes with elderflower cordial. Make a poppy seed buttercream by mixing the poppy seeds, lemon extract and the remaining buttercream together. Sandwich the three cake layers with the buttercream and place on the 15cm\/6in cake board. To decorate, roll out the remaining marzipan and cover the cake. Roll out the cooled marshmallow fondant and cover the lemon, poppy and elderflower cake. Carefully score the icing to create a quilting effect. Make up a little royal icing according to packet instructions. Where ever the lines of the quilting cross, attach an edible silver ball using a little royal icing to help them stick.   Stack the orange and pistachio cake on top of the chocolate cake, using straws or dowels to support the layers.   Top the lemon cake with the letters, using a little royal icing to help them stick. Stack on top of the other cakes, again using straws or dowels to support the layers.  If you have time, make a book using any leftover sugarpaste in the shape of a notebook with a love story written on the inside.  ","ingredients":" 4 tbsp grapeseed oil, plus extra for greasing,  3 large free-range eggs, separated,  180g\/6¼oz sugar,  1 tbsp raspberry liqueur ,  red gel food colouring ,  175g\/6oz plain flour,  ½ tsp bicarbonate of soda,  50g\/1¾oz freeze dried raspberries, crushed,  3 large free-range eggs,  225g\/8oz golden caster sugar,  225g\/8oz self-raising flour ,  1 tsp baking powder,  225g\/8oz unsalted butter, softened,  pinch salt,  1 orange, zest only,  few drops orange extract,  85g\/3oz ground almonds,  orange gel food colour,  3 large free-range eggs,  225g\/8oz golden caster sugar,  225g\/8oz self-raising flour,  1 tsp baking powder,  225g\/8oz unsalted butter, softened,  pinch salt,  85g\/3oz pistachios, shells removed, ground,  20g\/1oz nibbed pistachios,  few drops almond extract,  1 orange, juice only,  1 tbsp icing sugar,  5 tbsp smooth marmalade ,  175g\/6oz unsalted butter, melted, plus extra for greasing,  2 large free-range eggs ,  175g\/6oz sugar ,  175g\/6oz self-raising flour,  pinch salt,  1 unwaxed lemon, zest and juice,  185g\/6½oz unsalted butter,  250g\/9oz dark chocolate,  375g\/13oz golden caster sugar,  pinch salt,  3 large free-range eggs,  1 tsp instant coffee granules,  220g\/8oz self-raising flour,  40g\/1½oz cocoa powder,  50g\/1¾oz fresh raspberries,  400g\/14oz unsalted butter,  800g\/1lb 12oz icing sugar,  1-2 tbsp milk,  300g\/10½oz mini marshmallows,  600g\/1lb 5oz icing sugar, plus extra for dusting,  1kg\/2lb 4oz ready-to-roll white fondant icing,  silver food paint,  teal gel food colour,  300g\/10½oz white sugarpaste, for modelling,  400g\/14oz marzipan,  50ml\/2fl oz elderflower cordial,  50g\/1¾oz poppy seeds,  few drops lemon extract,  125g\/4½oz royal icing sugar ,  edible silver balls","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/languages_of_love_35067"}