{"recipe_name":"Lapsang souchong cupcakes","author":"Jonathan Ross","programme":"The Great Comic Relief Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 24 cupcakes","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/170C Fan\/Gas 4 and line two 12-hole cupcake trays with cupcake cases.   For the cupcakes, heat the milk in a saucepan until it begins to boil then remove the pan from the heat and add the teabags.  Cover and set aside for about 30 minutes. In a freestanding or handheld electric mixer, beat the butter and sugar together until light and fluffy. Add the eggs one at a time, mixing well after each addition. Sift the flours together into a separate bowl.  Add a third of the flours and a third of the tea-infused milk to the butter and sugar mixture. Mix well until combined, then add the remaining flour and milk in batches, mixing between each addition, until all the flour and milk has been combined. Divide the mixture equally between the 24 cupcake cases (use an ice-cream scoop to make this easier). Bake for about 22-25 minutes, or until springy to the touch. Cool the cupcakes in their tins for about 5 minutes, then place on a wire rack to cool completely. To make the whisky buttercream, beat the butter, milk, vanilla and half the icing sugar until smooth using an electric mixer. Add the rest of the icing sugar and beat until you have a smooth icing.  Mix in the whisky, adding more to taste if desired!  Transfer the buttercream to a piping bag fitted with a large star nozzle. When the cupcakes are completely cool, ice them with the whisky buttercream and grate a little dark chocolate over each one to decorate. ","ingredients":" 250ml\/9fl oz semi-skimmed or skimmed milk,  8 Lapsang Souchong tea bags ,  220g\/8oz unsalted butter,  450g\/1lb granulated sugar,  2 large free-range eggs,  250g\/9oz self-raising flour,  240g\/8½oz plain flour,  230g\/8¼oz unsalted butter, at room temperature,  120ml\/4fl oz semi-skimmed milk,  2 tsp good quality vanilla extract,  500g\/1lb 2oz icing sugar,  3 tbsp whisky, plus extra to taste,  100g\/3½oz dark chocolate, finely grated, to decorate","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lapsang_souchong_50355"}