{"recipe_name":"Lasagne","author":"Theo Randall","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the béchamel pour the milk into a saucepan and bring to a simmer, turn off the heat and set aside. In a heavy saucepan, melt the butter, then whisk in the flour and hot milk. Whisk rigorously until smooth. Add the bay leaf, cover with a circle of greaseproof paper and cook slowly for 30-40 minutes. Remove the paper and bay leaf and season with salt and freshly ground black pepper. Stir in the parmesan and egg yolks and set aside to cool.  For the ragu, melt the butter in a large casserole dish until foaming. Add the celery, carrots, onion, pancetta and rosemary and fry for five minutes. Stir in the veal and prosciutto and cook for a further five minutes. Add the tomatoes, white wine and milk and bring to the boil. Reduce the heat and cook slowly for 1½ hours - the meat should be broken down into small pieces and the sauce should have a rich thick consistency. Preheat the oven to 170C\/325F\/Gas 3 Blanch the pasta sheets in boiling salted water for one minute, then refresh in cold water. Rub olive oil into the sides of a baking dish. Place a layer of pasta onto the base of the dish and then add an even layer of beef ragu, followed by a layer of béchamel sauce. Repeat this process until you have used all the pasta and finish with a thick layer of béchamel on top. Sprinkle the top with a generous layer of parmesan cheese.  Bake in the oven for 40-45 minutes, or until bubbling and pale golden-brown on top. Cut the lasagne into squares and serve. ","ingredients":" 1 litre\/1¾ pints full-fat milk ,  75g\/3oz unsalted butter,  125g\/4½oz 00 flour,  1 bay leaf,  125g\/4½oz grated parmesan cheese,  2 free-range eggs yolks,  110g\/4oz unsalted butter,  2 tbsp chopped celery,  2 tbsp chopped carrots,  2 tbsp chopped red onion,  110g\/4oz smoked pancetta,  1 sprig fresh rosemary, leaves picked, chopped,  1 kg\/2lb 2oz trimmed veal or beef flank, finely chopped,  50g\/2oz prosciutto, roughly chopped,  1 x 400g\/14oz good-quality chopped tomatoes,  125ml\/4½fl oz white wine,  110ml\/4fl oz full-fat milk,  1 x 250g\/9oz pack fresh lasagne sheets,  olive oil, for greasing,  large handful grated parmesan","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lasagne_99783"}