{"recipe_name":"Lavender, garlic and honey roast loin of lamb with mint sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 5. For the lamb, use a sharp knife to make about 20 small incisions, about 2cm (1in) deep, in each loin of lamb. Peel the garlic cloves and cut into thin strips. Insert a slither of garlic, half an anchovy fillet and a sprig of lavender into each incision until they are all filled. Place the lamb in a roasting tray, season with salt and freshly ground black pepper and drizzle with the lavender honey. Roast in the oven for 20-30 minutes, or until cooked to your liking, basting with the juices every few minutes to keep the meat moist and prevent the honey from burning. Remove for the oven and leave to rest for ten minutes before serving. For the lavender honey glaze, warm the honey in a small pan. Add the olive oil and whisk to combine. For the roasted vegetables, place all the vegetables into an oven tray with the lemon halves and drizzle with the olive oil and honey. Add the sprigs of fresh rosemary and season well. Place in the oven and cook for about 20-40 minutes, or until the vegetables are cooked. Stir well to coat in the honey glaze. For the mint sauce, mix all the ingredients together. To serve, slice the lamb on the diagonal and serve on warm plates with a spoonful of roasted vegetables, a drizzle of honey glaze and a spoon of mint sauce. ","ingredients":" 2 lamb boneless loin fillets,  2 cloves garlic,  2 x 75g\/3oz cans of anchovy fillets in olive oil,  bunch lavender, freshly picked,  salt and freshly ground black pepper,  2 tsp lavender honey (or other runny honey if unavailable),  50ml\/2fl oz\/3½tbsp lavender honey (or other runny honey if unavailable),  50ml\/2fl oz\/3½tbsp olive oil ,  450g\/1lb new potatoes, washed, skins left on, cut into chunky slices,  453g\/1lb parsnips, washed, skins left on, cut into chunky slices,  453g\/1lb carrots, washed, skins left on, cut into chunky slices,  225g\/8oz red onions, quartered,  225g\/8oz fennel, thickly sliced,  1 lemon, cut in half,  2 sprigs rosemary,  3 tbsp olive oil,  75ml\/3fl oz clear honey,  10 tbsp fresh mint, finely chopped ,  pinch salt ,  pinch sugar ,  90ml\/3¼fl oz malt vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lavendergarlicandhon_81883"}