{"recipe_name":"Layered fajitas with mixed salsa","author":"Ed Baines","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Pour the flour and salt into a mixing bowl, make a well in the centre and add 300ml\/½ pint water.   Mix together, adding a little more water, if necessary, until you have a firm dough.   Knead the dough until nice and smooth, then cut into 6 pieces and shape into balls.   Roll each ball out to a 17.5cm\/7in round. Heat a teaspoon of corn oil in a frying pan and cook each fajita on both sides until it puffs up and immediately remove from the heat. Alternatively use shop bought fajitas. If using soaked dried beans, drain them, add to a pot of boiling water and cook gently for two hours; if using tinned beans, drain and add to a pot with 300ml\/½ pint water and cook gently for 30 minutes. Add four tbsp of the corn oil to a saucepan and cook the onion, chilli and garlic until softened.   Add the drained beans and cook for a further ten minutes, stirring, then start to mash the beans roughly with the back of a fork, adding a little more corn oil, the chopped coriander, a dash of Tabasco and the lime juice.   Stir well and pull from heat. Make the salsa by mixing together all the ingredients. Lay each fajita on a plate, spoon over a quarter of the bean filling, add a dollop of sour cream, drizzle with a little salsa and repeat layering five fajitas until you come to the final fajita which you use as a lid, pressing down firmly.   Top with the remaining salsa, place in the fridge and allow to set.  Cut into pie wedges and eat outdoors. ","ingredients":" 175g\/6oz plain flour,  a good pinch of salt,  corn oil, for frying,  Or use shop bought fajitas,  2 large 400g\/14oz tins of red beans, or 200g\/7oz dried beans soaked for 24,  hours,  6 tbsp corn oil,  1 onion chopped,  1 red chilli, de-seeded and chopped,  1 garlic clove, chopped,  ½ bunch of fresh coriander, chopped,  a dash of Tabasco sauce,  1 lime, juice only,  250ml\/9fl oz sour cream,  4 tomatoes, de-seeded and chopped,  ½ bunch of fresh coriander (stalks and all), chopped,  ½ red onion, chopped,  3 tbsp corn oil","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/layeredfajitaswithmi_70898"}