{"recipe_name":"Lebanese-spiced lamb flatbread","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lebanese-spiced_lamb_56436_16x9.jpg","method":"For the dough, the day before you want to eat the flatbreads, mix the flours, salt and sugar in a large bowl.  In a jug, mix the yeast to a paste with a little of the water, then stir in the remaining water until the yeast has completely dissolved. Make a well in the centre of the flour mixture and pour in the yeasted water, gradually bringing more and more of the flour into the wet mixture, until all of the flour has been incorporated and the mixture has come together as a soft dough. Turn out the dough onto a lightly floured work surface and knead well until smooth and elastic. Divide the dough into four equally sized pieces and roll each into a ball. Place the dough balls onto a lightly greased baking tray, cover with a loose sheet of cling film or a clean tea towel, and leave to prove in the fridge for 24 hours. When the dough has proved (doubled in size), make the topping.  For the topping, heat the oil in a frying pan over a medium heat. Add the shallot, garlic and spices and fry for 1-2 minutes, or until softened. Add the lamb mince and increase the heat to high. Fry for 4-5 minutes, breaking up the mince with a spoon and stirring frequently, until browned all over. Add the sultanas and chicken stock to the pan and bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 18-20 minutes, or until the lamb is tender and the liquid has almost all evaporated. Season, to taste, with salt and freshly ground black pepper, then remove the pan from the heat and set aside to cool completely. Preheat the oven to its highest setting. Place a heavy baking tray or pizza stone in the oven and allow to heat up. Roll each piece of dough out onto a lightly floured work surface into an oval roughly 20x15cm\/8x6in, and about 0.5cm\/¼in thick. Spread the lamb mixture onto the dough bases, then top with dollops of the yoghurt. Sprinkle over the chopped chillies and season, to taste, with salt and freshly ground black pepper. Transfer the flatbreads, in batches if necessary, to the baking tray or pizza stone and cook for 5-10 minutes, or until the bases are golden-brown and crisp. Remove from the ove and sprinkle over the herbs. Serve immediately. ","ingredients":" 400g\/14oz type ‘00’ flour, plus extra for dusting,  100g\/3½oz semolina flour,  ½ tsp salt,  1½ tsp caster sugar,  7g sachet fast-action yeast,  325ml\/11fl oz warm water,  1 tbsp vegetable oil,  1 shallot, finely chopped,  1 garlic clove, finely chopped,  1 tsp ground coriander,  1 tsp ground cumin,  1 tbsp ground baharat spice mix,  500g\/1lb 2oz lamb mince,  75g\/2½oz sultanas,  300ml\/10½fl oz chicken stock,  250ml\/9fl oz plain yoghurt,  2 green chillies, finely chopped,  salt and freshly ground black pepper,  4 fresh mint sprigs, leaves only,  16 coriander sprigs, leaves only","vegetarian":false,"calories":424.0,"protein":21.0,"carbs":57.0,"sugars":10.0,"total_fat":12.0,"saturated_fat":5.0,"fiber":3.0,"salt":0.8,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lebanese-spiced_lamb_56436"}