{"recipe_name":"Leek risotto with parmesan crisps","author":"Nigel Slater","programme":"Nigel Slater's Simple Suppers","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/leekrisottowithparme_92285_16x9.jpg","method":"Scatter the chopped leeks into a large shallow pan, add the butter and some tarragon leaves and cook over a gentle heat, stirring from time to time, until the leeks soften and become translucent but not coloured, about 12-15 minutes. Stir in the rice to coat in the butter, then add the wine and let it bubble until the liquid has pretty much disappeared. Little by little add the hot stock, a couple of ladlefuls at a time at the most. When the rice absorbs the liquid and starts to diminish in the pan, you can add another ladle or so, stirring the rice often. Continue cooking until the rice has become plump and creamy but still has a little bite left in it, about 20 minutes. Season, to taste, with salt and freshly ground black pepper.  The parmesan crisps can be made about ten minutes before the serving the risotto. Place each spoonful of finely grated parmesan into a non-stick pan over a low heat and flatten slightly with the back of a spoon so it looks like a biscuit. Leave it to cook gently, so that the parmesan melts and forms a little crust. Once it is crisp on the bottom, very carefully flip it over using a palette knife. Cook for a minute or two on the other side and then remove from the pan. Serve the risotto in two bowls, both topped with a parmesan crisp. ","ingredients":" 2 medium leeks, sliced,  thick slice of butter,  3-4 tarragon stalks, leaves only ,  2 good spilling handfuls of arborio rice (about 200g\/7oz),  175ml\/6fl oz wineglass dry white wine,  1 litre\/1 pint 15fl oz hot homemade chicken stock (the stock can be made from leftover roast chicken),  salt and freshly ground black pepper,  2 heaped tablespoons finely grated parmesan cheese","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/leekrisottowithparme_92285"}