{"recipe_name":"Lee's brown-bag fried chicken","author":"Valentine Warner","programme":"What to Eat Now","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/leesbrownbagfriedchi_91744_16x9.jpg","method":"Rinse the chicken pieces in cold water, then pat dry with kitchen paper.  For the coating, tip the flour, dried herbs, cayenne pepper, white pepper and a pinch of salt into a large, strong polythene bag. Shake until well combined.  In a bowl, beat together the evaporated milk and eggs until well combined. Set aside.  Half-fill a large, heavy-based pan with the oil and heat to 180C\/350F (use a kitchen thermometer to check the temperature).  Dip a chicken piece into the milk and egg mixture until completely coated, then place it into the polythene bag containing the flour and herb mixture. Twist the bag closed, trapping in air so that it resembles a balloon, and shake vigorously until the chicken piece is completely coated. Remove the chicken piece from the bag and set aside on a plate. Repeat the process with the remaining chicken pieces. Carefully lower the coated chicken pieces into the hot oil, one at a time, using tongs. When all of the chicken pieces have been added, the oil should be just bubbling. Cook the chicken in the oil for 18-20 minutes, turning regularly, until crisp and deep golden-brown and completely cooked through. Remove the cooked chicken from the pan using a slotted spoon and set aside to drain on kitchen paper.  To serve, divide the chicken pieces equally among four serving plates. Serve with French fries and dollops of tomato ketchup, mayonnaise or barbecue sauce, if using. ","ingredients":" 2 chicken breasts (wing bone attached), skin on, cut in two diagonally,  2 chicken legs, skin on,  2 chicken thighs, skin on,  1 litre\/1¾ pints sunflower oil, for deep frying,  7 tbsp plain white flour,  1 tbsp dried oregano, crumbled,  1 tbsp dried thyme leaves,  1 tbsp dried rosemary leaves, crumbled,  2 tsp cayenne pepper,  2 tsp ground white pepper,  1 tbsp sea salt flakes,  100ml\/3½fl oz evaporated milk,  2 free-range eggs, beaten ,  French fries,  ready-made tomato ketchup, mayonnaise or barbecue sauce (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/leesbrownbagfriedchi_91744"}