{"recipe_name":"Lemon and blueberry nougat","author":"Kitty Hope and Mark Greenwood","programme":"Sweets Made Simple","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Makes 25 pieces of nougat","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lemon_and_blueberry_82699_16x9.jpg","method":"Line a 17cm\/7in square tin with baking parchment and line the base with rice paper. Put the sugar, honey and liquid glucose in a large, deep heavy-bottomed pan with 125ml\/4½fl oz of cold water. Heat gently to dissolve the sugar (about 15 minutes). Put a sugar thermometer in the pan and bring the mixture to the boil. Allow it to bubble until the temperature reaches 125C\/257F. (CAUTION: boiling sugar is extremely hot. Handle very carefully and do not leave unattended.) At this point, put the egg whites in the bowl of a freestanding mixer and whisk until stiff peaks form, taking care not to overbeat. Fill your sink with 10cm\/4in of cold water. Continue to cook the syrup until the thermometer reaches 149C\/300F – it should be a dark caramel colour. Dip the base of the pan in the cold water to stop the caramel cooking.  Slowly pour the caramel mixture into the food mixer taking care not to let it touch the beaters as it might splash you. It will froth up to the top of the mixing bowl. Add a pinch of salt and mix on a moderate speed for 5-8 minutes to incorporate all the syrup. The nougat is ready when it is light, fluffy and an off-white colour.  Working quickly, fold in the candied peel, most of the almonds and the dried blueberries, then pour the mixture into the prepared tin and spread it evenly in the tin using a wet knife. Sprinkle over the white chocolate chips with the remaining almonds and the fresh blueberries and leave to cool. Leave to set for a few hours before cutting into squares. ","ingredients":" 400g\/14oz granulated sugar,  100ml\/3½fl oz clear honey ,  50ml\/2fl oz liquid glucose ,  2 large egg whites, at room temperature,  pinch of salt,  50g\/1¾oz candied lemon peel, chopped,  75g\/2½oz flaked almonds, toasted,  75g\/2½oz dried blueberries ,  40g\/1½oz white chocolate chips ,  handful of fresh blueberries, to scatter over the top","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_and_blueberry_82699"}