{"recipe_name":"Lemon and rhubarb tartlets","author":"James Morton","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, rub the butter into the flour using your hands until it resembles breadcrumbs. Mix in the icing sugar, then add the two egg yolks and bring the mixture together into a dough. Wrap the pastry in cling film and chill in the fridge for 10 minutes.  Preheat the oven to 180C\/350F\/Gas 4. Remove the pastry from the fridge, and roll out to 2-3mm\/1\/8in thick. Line the tart tins and crimp the edges. Scrunch up pieces of parchment paper just larger than the tart tins, and lay them on top of the pastry. Fill with baking beans. Bake the tart cases for five minutes, then remove from the oven, and remove the parchment and baking beans. Lightly beat an egg in a bowl for the egg wash. Brush the tarts with egg wash. Bake again for another few minutes until cooked and golden-brown. Remove from the oven and set aside to cool completely.  Turn the oven down to 120C\/250F\/½ Gas.  For the filling, blend the 50g\/1¾oz rhubarb in a food processor and squeeze the juice out. Combine this juice with all other filling ingredients and place in a heatproof bowl set over a pan of simmering water, and heat to 60C\/140F (use a thermometer to measure this).  Remove from the heat and pour the filling into the cooled tart cases and then bake until the filling reaches 70C\/158F on the thermometer (roughly 10 minutes). Remove the tarts from the oven and set aside to cool.  Make the rhubarb jam by combining the rhubarb, sugar and pectin in pan and bringing up to the boil. Heat to 107C\/225F and then remove from the heat. Strain the jam through a sieve, and set aside to cool slightly.  Spoon a small amount of the jam on top of each tartlet, and serve.  ","ingredients":" 100g\/3½oz salted butter, cold, chopped roughly,  200g\/7oz plain flour,  80g\/2¾oz icing sugar,  3 free-range eggs, 2 yolks only, 1 whole for egg wash,  50g\/1¾oz rhubarb ,  4 lemons, zest and juice,  320g\/11¼oz double cream,  350g\/12oz caster sugar,  10 free-range eggs, 9 whole, 1 yolk only,  200g\/7oz rhubarb, roughly chopped,  100g\/3½oz caster sugar,  1 x 8g sachet pectin","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_and_rhubarb_94455"}