{"recipe_name":"Lemon and sage stuffed loin of pork with wilted spring greens and mashed potato","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the stuffed loin of pork, preheat the oven to 150C\/300F\/Gas 2. Heat a frying pan and add 25g\/10z of the butter. Once hot, add the onion and cook for a couple of minutes. Allow the onion to cool. In large bowl, mix the cooled onion, pork mince, sage, breadcrumbs, suet and lemon zest. Lay the pork loin, flesh-side up, on a chopping board. With a sharp knife, make an incision in the eye of the loin half way down running parallel to the board, cutting almost all the way through. Open the loin up and repeat a few times, cutting so that the loin opens up and it is as flat as the belly part of the pork. Season with salt and black pepper, then spoon the stuffing onto the loin and spread out along the loin, then roll up into a large sausage. Secure with cook's string at 5-6 points along the loin and then transfer to a roasting tin. Rub the rest of the butter over the top of the pork and season with plenty of sea salt. Roast in the oven for five hours. The crackling should be crisp and the pork very tender. For the mash potato, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until tender. Drain. Press the potato through a potato ricer into a saucepan. Return to the heat, then add the butter and cream and beat to a smooth purée. Season, to taste, with salt and freshly ground black pepper. For the spring greens, heat the butter in a clean pan and add the spring greens with a little water and cook until wilted. To serve, carve the pork loin and place on a serving plate. Place the mash potato next to the loin and the wilted greens next to that. Pour over some of the pork jus or gravy. ","ingredients":" 75g\/2½oz unsalted butter,  2 onions, finely diced,  200g\/7oz pork mince,  1 bunch fresh sage, finely chopped,  175g\/6oz fresh white breadcrumbs,  100g\/3½oz suet,  1 lemon, zest,  1.5kg\/3lb 5oz boneless loin of pork, butterflied,  salt and freshly ground black pepper,  500g\/1lb 2oz Maris Piper potatoes,  125ml\/4fl oz double cream,  125g\/4½oz unsalted butter,  50g\/1¾oz unsalted butter,  1 head spring greens, core removed and sliced,  200ml\/7fl oz pork jus or gravy","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_and_sage_stuffed_91825"}