{"recipe_name":"Lemon and strawberry roulade","author":"Selasi","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lemon_and_strawberry_26775_16x9.jpg","method":"Preheat the oven to 190C\/170C Fan\/Gas 5. Grease and line a 30x24cm\/12x9½in Swiss roll tin with baking paper. For the roulade, place a large heatproof bowl over a pan of gently simmering water. Add the eggs and sugar to the bowl and, using an electric mixer, beat for 3–4 minutes, or until doubled in size. Take off the heat and continue to beat for another 4–5 minutes on a medium to high speed. Using a large metal spoon, fold in the flour in three batches making sure it is all incorporated. Fold in the melted butter in the same way. Gently pour the mixture into the prepared tin and spread evenly using a spatula. Bake for 10 minutes or until just firm and lightly golden-brown. Dust a large baking sheet with icing sugar and carefully turn the roulade out. Carefully peel away the baking paper used to line the tin. Starting at a short end, fold the edge of the paper over the cake. Roll the cake up into the paper. Allow the roulade to cool completely while rolled. For the filling, first make a curd. In a saucepan, heat the sugar, lemon juice, lemon zest and butter over a medium heat. Stir as the butter melts and when combined stir in the cornflour. Keep stirring, using a hand whisk, for another 2–3 minutes. Take off the heat and stir in the beaten eggs. Return to a low heat and keep stirring until the curd is thickened and leaves a trail on the surface when the whisk is removed (about 15–20 minutes). Leave to cool and set.  For the cream, beat the cream and icing sugar together until soft peaks form when the whisk is removed. Transfer to the fridge to chill. Once the roulade is cool, unroll it and spread with a generous layer of whipped cream (keep any remaining cream for the decoration). Top with a layer of curd and sliced strawberries. Tightly re-roll the roulade and place on a serving plate. Spread the remaining cream over the roulade and score with a fork. Scatter with grated white chocolate and pistachio crumbs and top with the strawberries.  ","ingredients":" 4 medium free-range eggs,  120g\/4¼oz caster sugar,  100g\/3½oz plain flour, sifted,  20g\/¾oz unsalted butter, melted, plus extra for greasing,  190g\/6½oz caster sugar,  4 unwaxed lemons, finely grated zest and juice ,  130g\/4⅔oz unsalted butter,  1-2 tbsp cornflour,  3 large free-range eggs and 1 large free-range yolk, beaten,  600ml\/20fl oz double cream,  30g\/1oz icing sugar, plus extra for dusting,  150g\/5½oz strawberries, 3 reserved for decoration, rest sliced,  50g\/1¾oz white chocolate, chilled and grated ,  50g\/1¾oz shelled pistachios, pulsed in a food processor to fine crumbs ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_and_strawberry_26775"}