{"recipe_name":"Lemon drizzle cake","author":"Raymond Blanc","programme":"Raymond Blanc's Kitchen Secrets","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lemon_cake_29430_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. Lightly butter a 26cm x 9cm x 8cm\/10in x 3½in x 3in loaf tin and line it with greaseproof paper. In a large mixing bowl, whisk together the eggs, sugar, cream, lemon zest, rum, salt and butter. Sift the flour and baking powder into a separate bowl then whisk it into the egg mixture until you have a smooth batter. Pour the batter into the prepared tin and bake in the oven for 50-60 minutes, turning halfway through cooking. The cake is cooked when a knife blade inserted into the middle comes out clean. Remove the cake from the tin, turn onto a cooling rack and leave to cool for 10 minutes. This will allow the steam to escape before you glaze the cake. Leave the oven turned on. Brush the cake with the warmed apricot glaze and leave for five minutes while you make the lemon glaze. For the lemon glaze, mix together the lemon juice, zest and icing sugar. Heat the mixture in a small pan, or in the microwave, until the sugar has dissolved and you have a syrup. Brush the lemon glaze all over the cake and leave for a few minutes to set. Place the glazed cake in the oven on a baking tray, turn off the heat and leave for 3-5 minutes to dry the glaze and turn it translucent. Remove the cake from the oven and leave to cool to room temperature before serving. ","ingredients":" 5 free-range eggs,  300g\/11oz caster sugar,  140ml\/5fl oz double cream,  3 lemons, zest only,  1½ tbsp dark rum,  1 pinch salt,  80g\/3oz unsalted butter, melted,  240g\/8½oz plain flour,  ½ tsp baking powder,  3 tbsp apricot jam, warmed in a small saucepan,  1 lemon, zest and juice,  150g\/5oz icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_cake_29430"}