{"recipe_name":"Lemon cake with lemon curd, meringue and lemon cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the meringues, preheat the oven to 65C\/150F\/Gas ¼ (or to the lowest setting on your oven) and line a baking tray with a silicone mat. Place the egg whites in a large food processor with a whisk attachment and whisk until stiff peaks form when the whisk is removed. With the motor running, gradually add the sugar until you have a glossy meringue.  Spread the meringue very thinly over the silicone lined baking tray using a palette knife.  Bake in the oven for 3-4 hours, or until completely dried out (this will take less time if your oven temperature is higher than recommended). Remove shards of the cooked meringue from the silicone mat using a palette knife and set aside. For the lemon slices, preheat the oven to 65C\/150F\/Gas ¼ (or to the lowest setting on your oven) and line a baking tray with a silicone mat or baking parchment. Put the lemon slices onto the trays and place in the oven for about three hours or until dried out. For the lemon cake, preheat the oven to 180C\/350F\/Gas 4. Grease and line a square 20cm\/8in cake tin. Cream the butter and sugar together in a bowl until pale and fluffy. Add the lemon zest and juice.  Slowly beat in the eggs, one at a time, until the mixture is well combined.  Sift the baking powder and self-raising flour together in a bowl then fold into the cake mixture. Pour the cake batter into the tin and bake for 25-30 minutes or until risen and golden-brown. Remove from the oven and set aside to cool for 10 minutes. Run a round-bladed knife around the inside edge of the tin to loosen the cake. Remove the cake from the tin and set aside to cool completely on a rack. For the lemon curd, place the lemon zest, juice, butter and sugar into a bowl set over a pan of simmering water. (Don’t let the bowl touch the water). Whisk occasionally until the sugar is completely dissolved then beat in the eggs and whisk until thickened and cooked through. Remove from the heat and allow to cool completely.  For the lemon cream, place the mascarpone into a bowl and beat to soften. Pour in the double cream, icing sugar and lemon juice. Whisk until the mixture forms soft peaks when the whisk is removed. Fold the lemon curd into the lemon cream. Serve slices of the cake with a spoonful of the lemon cream and decorate with shards of meringue and a couple of lemon slices. ","ingredients":" 4 egg whites,  250g\/9oz caster sugar,  2 lemons, thinly sliced and slices cut into quarters,  350g\/12oz butter, softened, plus extra for greasing,  350g\/12oz caster sugar,  4 lemons, zested, plus juice of 2 lemons,  6 free-range eggs,  3 tsp baking powder,  300g\/10½oz self-raising flour,  4 lemons, zest and juice,  110g\/4oz butter,  175g\/6oz caster sugar,  4 free-range eggs, beaten,  150g\/5½oz mascarpone,  200ml\/7fl oz double cream,  30g\/1oz icing sugar,  ½ lemon, juice only","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_cake_with_lemon_56875"}