{"recipe_name":"Lemon chicken and blackbean squid with stir-fried rice","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03dn15j.jpg","method":"Put the chicken in a bowl. Mix the soy sauce, honey and cornflour together in a separate bowl then pour over the chicken. Toss to coat, then set aside. Mix the lemon zest, juice and chicken stock together. Heat a wok or frying pan until hot then add the groundnut oil. Add the sherry to the chicken and stir through, then add to the hot wok and stir fry for 2 minutes until just sealed. Add the chilli, garlic and ginger and the lemon and chicken stock. Bring to the boil, stirring well. Reduce the heat to a simmer and cook for 4-5 minutes until the chicken is cooked through and the sauce thickened.  For the squid, mix the squid, sesame oil, soy and mirin together in a bowl and set aside for 5 minutes. Heat a frying pan or wok until hot, add the groundnut oil and when it’s shimmering, add the ginger, garlic and chilli. Stir fry for 2 minutes or until just softened. Add the squid and black beans and stir fry for 2-3 minutes over a high heat. Add the chicken stock, sherry, spring onion and coriander. Stir well then simmer for another couple of minutes until the squid is cooked through. Spoon into a serving bowl. For the rice, heat a frying pan or wok until hot. Add the groundnut oil and when it’s shimmering, add the rice and stir fry for 1 minute before adding the spring onions, coriander, soy and sesame oil. Stir fry for 2-3 minutes, or until piping hot through then tip into a serving bowl.  To serve, add the spring onions to the lemon chicken and mix through. Serve with the squid and rice. ","ingredients":" 400g\/14oz boneless skinless chicken breast, cut into strips,  2 tbsp light soy sauce,  1 tbsp honey,  2 tbsp cornflour,  2 lemons, zest and juice only,  75ml\/2½fl oz chicken stock,  1 tsp groundnut oil,  1 tbsp dry sherry,  1 red chilli, finely chopped,  3 garlic cloves, thinly sliced,  2cm\/¾in piece fresh root ginger, peeled and finely grated,  3 spring onions, thinly sliced,  300g\/10½oz squid, cleaned and cut into strips,  1 tsp sesame oil,  1 tbsp soy sauce,  1 tbsp mirin ,  2 tbsp groundnut oil,  3cm\/1½in piece fresh root ginger, peeled and finely chopped,  2 garlic cloves, finely chopped,  2 red chillies, finely chopped ,  40g\/1½oz black beans, rinsed, drained and roughly chopped,  50-75ml\/2-2½fl oz chicken stock,  2 tbsp dry sherry or Shaoxing rice wine,  3 spring onions, thinly sliced,  2-3 tbsp fresh coriander, roughly chopped,  1 tbsp groundnut oil,  300g\/10½oz cooked and cooled basmati rice ,  2 spring onions, sliced,  2 tbsp coriander leaves, roughly chopped,  2 tbsp soy sauce,  1 tsp sesame oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_chicken_and_81996"}