{"recipe_name":"Lemon curd and passion fruit pavlova","author":"Michael Sheen","programme":"Series 2","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Makes 1 large pavlova","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/140C Fan\/Gas 2. Draw a 20cm\/8in circle on three pieces of baking parchment and put each piece on a separate baking tray. In a very clean bowl beat the egg whites with a pinch of salt using a hand-held mixer at medium speed until soft peaks form when the whisk is removed. Increase the speed to medium-high and add the sugar a tablespoon at a time. When all the sugar is incorporated continue to whisk for a further minute.  Add the vinegar and cornflour and then beat at a high speed until the meringue is glossy and holds stiff peaks when the whisk is removed (this will take about 5 minutes).  Divide the mixture equally between the circles on the three baking trays. One of the discs will be used to top the tier, so should look especially nice! Bake until the meringues have a crisp crust and feel dry to the touch, about 1-1¼ hour (the insides will still be marshmallow-like). Switch off the oven and leave the meringues to cool down in the oven, leaving the oven door slightly open.  Leave the meringues to cool very slowly in the oven. For the filling, whip the cream and icing sugar until soft peaks form when the whisk is removed. Gently stir through the passion fruit flesh.   For the lemon curd, put the lemon zest, lemon juice, sugar and butter in a heatproof bowl.  Sit the bowl over a pan of gently simmering water, making sure the water is not touching the bottom of the bowl.  Stir the mixture every now and again until the butter has melted.  Remove the bowl from the heat. In a separate bowl, lightly whisk the eggs and egg yolk. Gently stir them into the lemon mixture, then whisk until all the ingredients are well combined. Put the bowl back over the simmering water. Heat the lemon curd for 10-13 minutes, stirring every now and again, until the mixture is creamy and thick enough to coat the back of a spoon. Remove the lemon curd from the heat and set aside to cool, stirring occasionally. It will thicken as it cools. To assemble, top a disc of meringue with a third of the passion fruit cream and a drizzle of the lemon curd.  Repeat with the other two meringue discs to make a three-tiered stack.  Decorate the top with more lemon curd and the grated lemon zest.  Serve with a shot of limoncello, if using. ","ingredients":" 8 medium free-range egg whites,  pinch salt ,  400g\/14oz caster sugar,  2 tsp white wine vinegar,  4 tsp cornflour,  900ml\/1½ pint double cream,  2 heaped tbsp icing sugar ,  10-15 ripe passion fruits, halved and seeds scooped out ,  4 unwaxed lemons, zest and juice only ,  200g\/7oz caster sugar,  100g\/3½oz unsalted butter, cubed,  3 medium free-range eggs, plus 1 medium free-range egg yolk,  1 lemon, zest only ,  limoncello liqueur, to serve (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_curd_and_passion_24599"}