{"recipe_name":"Lemon curd and pistachio meringue roulade","author":"Mary Berry","programme":"Mary Berry's Easter Feast","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lemon_curd_and_pistachio_20948_16x9.jpg","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Line a 23x33cm\/9x13in Swiss roll tin with greased non-stick baking paper. Whisk the egg whites in a clean large bowl using an electric mixer on full speed until very stiff. Gradually add the sugar, a teaspoon at a time, and still on high speed, whisking well between each addition. Whisk until very, very stiff and glossy and all the sugar has been added. Spread the meringue mixture into the prepared tin, sprinkle with the chopped nuts. Bake for about 8 minutes until very golden-brown. Lower the oven to 160C\/140C Fan\/Gas 3 and bake for 15 minutes more until firm to the touch. Remove and turn upside down on a piece of non-stick baking paper. Carefully peel the paper from the base of the meringue and leave it to cool for about 10 minutes.  To make the lemon curd, put the butter into a heatproof bowl, add the sugar and whisk by hand until combined. Stir in the egg yolks. Add the lemon zest and juice and whisk until smooth. Sit the bowl over a pan of just simmering water and whisk until the mixture has thickened. This will take about 8-10 minutes. Be careful the water does not boil as this will curdle the curd. Reserve 100g\/3½oz (about 6 tablespoons) of the lemon curd and set aside. Spoon the remaining lemon curd into a sterilised jar. Seal and label it. It will keep in the fridge for 2 weeks.  To fill the roulade, mix the reserved lemon curd with the whipped cream, swirling to give a marbled effect. Spread over the cooled meringue. Lightly score the meringue along one long side, slightly in from edge. Use this to help you fold and start to roll the base. Roll up the meringue tightly, using the paper to help you. Sit it on a plate with the join underneath. To serve, dust with icing sugar and decorate with Easter chicks. ","ingredients":" 5 free-range egg whites,  280g\/10oz caster sugar,  50g\/1¾ oz shelled pistachio nuts, finely chopped,  icing sugar, for dusting,  100g\/3½oz butter, softened,  225g\/8oz caster sugar,  5 free-range egg yolks,  3 large lemons, juice and finely grated zest,  300ml\/10fl oz double cream, lightly whipped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_curd_and_pistachio_20948"}