{"recipe_name":"Lemon Madeira cake with candied peel","author":"Mary Berry","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Makes 1 x 18cm\/7in cake","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lemon_madeira_cake_with_15109_16x9.jpg","method":"For the candied peel, cut the lemon into 8 wedges, then cut out the flesh, leaving a 5mm thickness of peel and pith. Cut each wedge into 4 strips. Pour 300ml\/10fl oz water into a small pan, add the granulated sugar and heat, stirring until the sugar has dissolved.  Add the lemon zest and simmer uncovered for 30-45 minutes, until the lemon peel is soft and translucent.  Drain in a wire sieve and leave to cool. Spread the peel out on a baking sheet lined with parchment and sprinkle with caster sugar. Place in the oven on the lowest setting (approximately 110C\/90C Fan\/Gas ¼) for 1 hour until dry.  For the cake, preheat the oven to 180C\/160C Fan\/Gas 4. Grease a 18cm\/7in deep round cake tin and line the base and sides with baking parchment. Put the butter, sugar, flour, ground almonds, eggs and lemon zest into a large bowl. Using an electric mixer, beat for 1 minute to mix thoroughly. Turn into the prepared tin and level the surface. Bake for 35 minutes. Decorate with 3 pieces of candied peel and bake for a further 20-25 minutes, until a skewer inserted into the centre, comes out clean. Leave in the tin for 15 minutes to cool before turning out onto a wire rack to cool completely.   ","ingredients":" 1 unwaxed lemon,  200g\/7oz granulated sugar,  100g\/3½oz caster sugar,  175g\/6oz softened butter,  175g\/6oz caster sugar,  225g\/8oz self-raising flour,  50g\/1¾oz ground almonds,  4 large free-range eggs,  1 large unwaxed lemon, finely grated zest only","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_madeira_cake_with_15109"}