{"recipe_name":"Lemon meringue tower ","author":"Ruth Clemens","programme":"The Great British Wedding Cake","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 30","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lemon curd, mix the cornflour and a little bit of lemon juice to make a smooth paste.  Whisk the eggs in a saucepan over a medium heat. Add the butter, sugar, lemon juice and zest and the cornflour paste. Continue to cook, stirring constantly, until the mixture thickens to a custard consistency. Remove the pan from the heat and set aside to cool.   Preheat the oven to 160C\/325F\/Gas 3. Grease and flour the base of the cupcake tin. For the pastry, blend the flour, butter and sugar together in a food processor. With the motor running, add the egg yolks and enough water to make the pastry come together in a ball. Tip the pastry out onto a lightly floured work surface, knead briefly until smooth, wrap in clingfilm and chill in the fridge for 30 minutes.  Tear off one quarter of the pastry and use it to line the cupcake tin, leaving excess pastry around the edge. Chill in the fridge for 20 minutes, then line with greaseproof paper and baking beans. Bake in the oven for 15 minutes, then remove the beans and greaseproof paper and bake for a further 15 minutes.  Meanwhile, roll out the remaining pastry and use it to line two x 12-hole muffin tins. Chill in the fridge for 20 minutes, then line with greaseproof paper and baking beans. Bake in the oven for 12 minutes, then remove the beans and greaseproof paper and bake for a further three minutes.  For the lemon cake, grease and line two 15cm\/6in sandwich tins. Cream the butter and sugar together in a bowl, then beat in the eggs, one a time, until well combined. Stir in the flour, lemon zest and juice. Spoon the mixture into the cake tins and bake in the oven for 12-13 minutes, or until the cakes are golden-brown and springy to the touch. Remove the cakes from the oven and set aside to cool completely. For the meringue topping, whisk the egg whites in a bowl until stiff peaks form when the whisk is removed.  Heat the sugar and water in a saucepan until the mixture boils. Continue to cook until the mixture reaches 121C\/250F. (Check this with a sugar thermometer.)  Slowly whisk the sugar syrup into the whisked egg whites and continue to whisk until stiff peaks form again. To assemble the cakes, trim any excess pastry from the pastry case in the cupcake tin and carefully remove it from the tin. Remove the lemon cakes from the tin and trim so that they fit inside the pastry cupcake base.  Place a layer of sponge in the bottom of the pastry case, then spoon in some lemon curd. Repeat with the other cake and more lemon curd, then either pipe or spoon on the meringue mixture. Fill each of the small pastry cases with lemon curd and either pipe or spoon the meringue on top. Arrange the lemon meringue tarts on a cake stand, placing the large cupcake at the top. ","ingredients":" 2 tbsp cornflour,  12 lemons, zest and juice,  8 free-range eggs,  240g\/8½oz butter, cut into cubes,  900g\/2lb caster sugar,  675g\/1lb 8oz plain flour,  300g\/10½oz butter, chilled,  75g\/3oz caster sugar,  3 free-range egg yolks,  125ml\/4fl oz water,  175g\/6oz butter,  175g\/6oz caster sugar,  3 free-range eggs,  150g\/5½oz self-raising flour,  2 lemons, 2 zested and 1 juiced,  15 free-range egg whites,  850g\/1lb 14oz caster sugar,  300ml\/10fl oz water","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_meringue_tower_92536"}