{"recipe_name":"Lemon pavlova","author":"Nigella Lawson","programme":"Simply Nigella","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 8-12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lemon_pavlova_50340_16x9.jpg","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. Line a baking tray with baking parchment. Beat the egg whites using an electric mixer until satiny peaks form, then beat in the sugar a spoonful at a time until the meringue is stiff and shiny. Sprinkle the cornflour over the meringue, then grate in the zest – a fine microplane is best for this – of 1 lemon and add 2 teaspoons of lemon juice. Gently fold until everything is thoroughly mixed in. Mound onto the lined baking tray in a fat circle approximately 23cm\/9in in diameter, smoothing the sides and the top with a knife or spatula. Place in the oven, then immediately reduce the temperature to 150C\/130C Fan\/Gas 2, and cook for 1 hour. Remove from the oven and leave to cool, but don’t leave it anywhere cold as this will make it crack too quickly. If you think your kitchen is too cool, then leave the pavlova inside the oven with the door completely open. When you’re ready to eat, turn the pavlova onto a large flat plate or board with the underside uppermost – I do this before I sit down to the meal in question and let it stand till pudding time. This is so the tender marshmallow belly of the pav melds with the soft topping. Whip the cream until thick and airy but still with a soft voluptuousness about it, and set it aside for a moment. Put the lemon curd into a bowl and beat it with a wooden spoon or spatula to loosen it a little. Taste the lemon curd (if it’s shop-bought) and add some lemon zest and a spritz of juice if it’s too sweet. With a light hand, a glad heart and a spatula, spread the lemon curd on top of the meringue base. Now top with the whipped cream, peaking it rather as if it were a meringue topping. Sprinkle with the zest of the remaining lemon – you can grate this finely or coarsely as you wish – followed by the flaked almonds, and serve triumphantly. ","ingredients":" 6 free-range egg whites (feel free to use egg whites from a carton if wished),  375g\/13oz caster sugar,  2½ tsp cornflour,  2 unwaxed lemons,  300ml\/10½fl oz double cream,  325g\/11½oz jar lemon curd ,  50g\/1¾oz flaked almonds, toasted","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_pavlova_50340"}