{"recipe_name":"Lemon sole, cockles and samphire with garlic parsley dumplings and lemon sauce","author":"Nathan Outlaw","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to medium-hot and place the fish onto a baking tray and season. Place the fish under the grill and cook for approximately 10 minutes, or until the flesh comes away from the bone.  Meanwhile, place a pan with a lid onto the stove and when the pan is hot add the cockles. Add 110ml\/4fl oz water and immediately cover with the lid. Steam the cockles for a minute then drain. Discard any cockles that have not opened. When cool enough to handle, pick the cockles from their shells. For the dumplings, bring a large pan of water to a simmer. Add one teaspoon of the olive oil and a pinch of salt.  Place the potato, garlic, parmesan and egg yolk into a bowl and fold together (don’t overwork). Fold in the flour, lemon oil and parsley. Season and place on a clean work surface.  Divide the dough up into small balls and blanch in the simmering water until the dumplings rise to the surface. Plunge into ice-cold water and, when cold, transfer to a tea towel to dry.  Heat a non-stick pan until hot. Add the remaining oil and the dumplings and fry until they are golden-brown. Drain on kitchen paper. For the lemon sauce, place the egg yolk, lemon juice and zest into a bowl and whisk together. Slowly add the oil in a thin stream, whisking all the time, to make a mayonnaise. Whisk the cream into the mayonnaise and add enough fish stock to thin the mayonnaise to a sauce consistency (you will not need all the stock). Place the sauce into a pan and gently warm through. Bring a pan of salted water to the boil. Just before serving, plunge the samphire into the water and cook for two minutes.  To serve, add the cooked cockles, samphire, broad beans and parsley to the sauce and bring to just below a simmer. Place the cooked fish onto serving plates and pile the dumplings alongside. Use a slotted spoon to remove the cockles, samphire and broad beans from the sauce and serve alongside the fish. Pass the sauce through a sieve and spoon over the fish. ","ingredients":" 4 small lemon sole fillets, trimmed and washed ,  500g\/1lb 2oz live cockles ,  300g\/10½oz samphire,  200g\/7oz broad beans, blanched, refreshed and podded,  1 tbsp chopped flatleaf parsley ,  2 tbsp olive oil,  salt and pepper,  300g\/10½oz baked potatoes, cooked and cooled, flesh pushed through a ricer or sieve ,  1 garlic bulb, roasted whole, soft cloves peeled and pushed through a sieve ,  1½ tbsp grated parmesan ,  1 egg yolk ,  75g\/2⅔oz 00 flour ,  2 tsp lemon oil ,  3 tbsp chopped flatleaf parsley ,  1 egg yolk ,  1 lemon, zest and juice,  200ml\/7fl oz light olive oil ,  50ml\/2fl oz double cream ,  110ml\/4fl oz fish stock ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_sole_cockles_and_99774"}