{"recipe_name":"Lemon sole goujons, marie-rose sauce and crushed minted peas ","author":"Tom Kerridge","programme":"Spring Kitchen with Tom Kerridge","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lemon sole goujons, slice the fish into thick strips with a sharp knife. Prepare a plate of the seasoned flour, a plate of breadcrumbs and a shallow dish of eggs. Dip the fish into the seasoned flour, pat off any excess, then coat with the egg wash, let the excess drip off, then add the fish to the breadcrumbs, making sure all the fish is coated. Heat the oil in a deep-fat fryer to 180C\/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Add the sole goujons to the fryer and deep fry until golden-brown, remove using a slotted spoon, transfer to a plate lined with kitchen paper and season with sea salt. For the crushed minted peas, heat the butter in a pan and fry the shallots until softened. Add 30ml\/1fl oz of water and bring to a rapid boil with the mint stalks and sugar. Add the peas and boil for 20 seconds and then drain. Remove the stalks and put the peas into a food processor with the mint leaves. Pulse for 10 seconds to make a crushed pea texture and check for seasoning, adding salt and pepper to taste. Add the malt vinegar. For the marie-rose sauce, mix together the ketchup, mayonnaise, Tabasco, lemon juice, Worcestershire sauce, brandy (if using) and cayenne pepper. Serve the goujons with the crushed minted peas and Marie-rose sauce. ","ingredients":" 1 large lemon sole, filleted and skinned ,  50g\/1¾oz plain flour, seasoned with salt and pepper,  50g\/1¾oz Japanese panko breadcrumbs,  3 whole free-range eggs, whisked,  vegetable oil, for deep-fat frying,  sea salt, to taste,  20g\/¾oz butter,  1 large banana shallot, diced,  30g\/1oz mint, separated into leaves and stalks, stalks tied together with cook's string,  200g\/7oz fresh peas, blanched in a pan of boiling water and refreshed in a bowl of cold water,  10g sugar,  5g malt vinegar,  40g\/1½oz tomato ketchup,  60g\/2¼oz mayonnaise ,  2 splashes Tabasco,  ½ lemon juice ,  2 splashes Worcestershire sauce,  splash brandy (optional),  pinch cayenne pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_sole_goujons_mary_00757"}