{"recipe_name":"Lemon sole goujons with watercress and tartare sauce","author":"Angela Hartnett","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the batter, sift the plain flour and cornflour together into a bowl.  Whisk in the ale and the soda water until the mixture is smooth and well combined. Set aside to rest for 10 minutes, then whisk again for 30 seconds. Meanwhile, for the tartare sauce, mix together all of the tartare sauce ingredients until well combined. Chill in the fridge until needed. To cook the fish, pour enough vegetable oil into a deep-sided, heavy-based pan to fill it by about two-thirds. Heat the oil until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Sprinkle a little flour onto a plate and press both sides of each of the lemon sole strips into the flour until completely covered.  Dip the floured lemon sole strips into the batter, then gently lower them into the hot oil and fry until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. To serve, place a few lemon sole goujons onto each of four serving plates. Spoon a dollop of tartare sauce alongside each portion. Garnish with a handful of watercress leaves. ","ingredients":" 250g\/9oz plain flour,  60g\/2¾oz cornflour,  300ml\/10½fl oz sparkling ale,  300ml\/10½fl oz soda water,  100g\/3½oz ready-made mayonnaise,  2 tbsp drained capers, chopped,  4 gherkins, drained, chopped,  1 tbsp chopped flatleaf parsley,  salt and freshly ground black pepper, to taste,  vegetable oil, for deep-fat frying,  6 medium fillets of lemon sole, cut into strips,  plain flour, for dusting fish,  large bunch fresh watercress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_sole_goujons_with_95881"}