{"recipe_name":"Lemon thyme custard with raspberries and sweet scraps","author":"Tom Kerridge","programme":"Spring Kitchen with Tom Kerridge","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2-3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lemon thyme custard, place the milk and cream in a large saucepan and add the lemon thyme. Heat for a couple of minutes. Meanwhile place the egg yolks and sugar in a large bowl and whisk.  Sieve the milk and cream to get rid of the thyme. Gradually pour the liquid over the egg and sugar and keep whisking to stop the eggs from scrambling. Pour the mixture back into the saucepan and cook until it coats the back of the spoon. Allow the custard to cool. Once cool, add the whipped cream and mix it in. For the sweet scraps, heat the oil in a deep fat fryer to 170C\/340F, or heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and goes brown when dropped in. (Caution: Hot oil can be dangerous. Do not leave unattended.) Place the egg white, flour and bicarbonate of soda in a large bowl and whisk. Gradually add the sparkling water, whisking all the time. Drizzle the batter into the deep fat fryer and cook for 1-2 minutes to make scraps. Remove with a slotted spoon, drain on a plate lined with kitchen paper and dust with icing sugar. To serve, layer the lemon thyme custard and fresh raspberries in a serving glass. Garnish with the sweet scraps and a few more raspberries. ","ingredients":" 300ml\/10½fl oz full-fat milk,  300ml\/10½fl oz double cream,  4 sprigs lemon thyme,  6 free-range egg yolks,  50g\/1¾oz sugar,  200ml\/7fl oz double cream, whipped,  vegetable oil for deep frying,  1 free-range egg white ,  175g\/6oz self-raising flour,  pinch bicarbonate of soda,  160ml\/5½fl oz sparkling water ,  50g\/1¾oz icing sugar,  200g\/7oz fresh raspberries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemon_thyme_custard_with_16395"}