{"recipe_name":"Lemon and thyme chicken with chilli beans","author":"Gennaro Contaldo","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a small bowl, mix together the wine and lemon juice, then set aside.  Season the chicken breasts with salt and pepper and rub well in. Lightly dust them with some flour, shaking off any excess. With the palm of your hand, flatten the breasts slightly. Heat the olive oil in a large pan. Add the chicken and seal on both sides (some chicken breasts contain water and may spit while cooking. To prevent this, cover with a lid). Once they are well-sealed and golden brown, remove the chicken breasts from the pan and set aside.  Lower the heat, add the onions, season with salt and pepper and sweat until the onions are soft.  Add the lemon slices, thyme and sage leaves and mix well. Return the chicken to the pan, cover and cook over a gentle heat for three minutes. Raise the heat (but be careful not to burn the onions and lemon). Add the wine and lemon juice mixture, then cover and cook for 10-15 seconds, until the mixture is bubbling.  Remove the lid and simmer until the liquid has evaporated slightly. You will see the sauce thickening. Taste and adjust the seasoning if necessary.  Arrange the chicken breasts on a large plate or on individual serving plates and pour the sauce over. Garnish with lemon slices and sprigs of thyme.     To prepare the chilli beans, cook until tender, then drain and toss in the garlic, lemon juice and chopped chilli. ","ingredients":" 150ml\/5fl oz white wine ,  1 lemon, juice only,  4 boneless chicken breasts ,  plain flour, for dusting ,  120ml\/4fl oz olive oil ,  2 small onions, finely sliced ,  1 lemon, zest and pith removed, thinly sliced, plus a few lemon slices to garnish ,  16 branches of fresh thyme, plus a few sprigs to garnish,  10 fresh sage leaves ,  salt ,  freshly ground black pepper,  1 clove of garlic,  1 red chilli, de-seeded and finely chopped,  200g\/7oz green beans,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemonandthymechicken_70823"}