{"recipe_name":"Baltic crab salad","author":"Silvena Rowe","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"no cooking required","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dressing, crack the egg into a bowl and whisk until light and foamy. Gradually add the olive oil, whisking constantly (the dressing should have a creamy frothy consistency). Season, to taste, with salt and freshly ground black pepper, then add the lemon juice. Place the brown crabmeat into a sieve and push through any liquid into the dressing. Stir well to combine. For the salad, place the white crabmeat into a clean bowl. Add the chervil, dill, dill cucumber, capers and celery and mix gently. Spoon in a little of the dressing, just enough to coat, and stir carefully to combine. Place a chefs' ring into the middle of each of four plates. Spoon equal quantities of the crabmeat mixture into the ring and gently press down. Continue to fill each ring by about two thirds. Arrange a layer of crayfish tails on top of each ring of crabmeat, then spoon over a little more dressing. Garnish each layer of crayfish tails with a chervil sprig, then lift away each chefs' ring. To serve, cut the duck eggs in half and place a half alongside each stack. Spoon the remaining dressing around and over the top of the stacks. ","ingredients":" 1 free-range egg,  125ml\/4½oz extra virgin olive oil,  1 lemon, juice only,  75g\/3oz fresh brown crabmeat,  400g\/14oz fresh white crabmeat ,  1 tbsp finely chopped fresh chervil,  1 tbsp finely chopped fresh dill,  1 dill cucumber, finely chopped,  1 tsp baby capers, rinsed and drained ,  2 tbsp celery, finely sliced,  200g\/7oz cooked crayfish tails, peeled ,  4 fresh chervil sprigs,  2 duck eggs, soft boiled","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/balticcrabsalad_88827"}