{"recipe_name":"Lemon layer cake","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8-12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lemondrizzlecake_91004_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease a 20cm\/8in springform cake tin with butter, then add a small amount of flour, turn the cake tin to coat the sides and bottom and shake out any excess. For the lemon drizzle, in a bowl, mix together the lemon juice and sugar until the mixture is well combined and the sugar has melted. Set aside. For the sponge, beat the sugar, butter and lemon zest in a mixing bowl until pale and fluffy, using an electric whisk.  Gradually add the eggs, whisking after each addition until the egg is completely incorporated into the mixture before adding the next. Carefully fold in the flour using a metal spoon. Pour the cake batter into the prepared cake tin and bake in the oven for 30-40 minutes, or until the sponge has risen and is cooked through. (The sponge is cooked through when a skewer inserted into the centre of the cake comes out clean.)  As soon as the cake is cooked, remove it from the springform cake tin and prick the top all over with a cocktail stick. Pour over the lemon drizzle mixture to soak the sponge, then set aside to cool on a wire rack. For the filling, whisk the egg yolks and sugar together in a pan over a low to medium heat until the sugar has melted.  Add the butter, lemon juice and zest, and continue to cook, whisking continuously, for 4-5 minutes, or until the mixture has thickened and is smooth and well combined. Set aside to cool completely.  Using a metal spoon, carefully fold the mascarpone into the cooled lemon curd mixture to create a marbled effect.  When the sponge has cooled, cut the cake in half horizontally to create two thinner cakes. Spread the lemon filling all over the lower half of the cake, then place the top half (the half that was pricked and soaked in the lemon drizzle) on top. ","ingredients":" 4 lemons, juice only,  75g\/2¾oz caster sugar,  200g\/7oz caster sugar,  200g\/7oz unsalted butter, plus extra for greasing,  2 lemons, zest only,  3 free-range eggs, beaten,  200g\/7oz self-raising flour, plus extra for dusting,  2 free-range egg yolks,  75g\/2¾oz caster sugar,  50g\/1¾oz unsalted butter,  2 lemons, juice and zest ,  100g\/3½oz mascarpone","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemondrizzlecake_91004"}