{"recipe_name":"Lemon meringue pie","author":"Sue Johnston","programme":"A Taste of My Life","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sieve the flour and the baking powder into a bowl and add the sugar and salt. Cut the butter into small pieces and rub into the flour until the mixture resembles fine breadcrumbs. Add the egg and mix until a ball of pastry forms. Wrap in cling film and place into the fridge to chill for half an hour. Preheat the oven to 200C\/400F\/Gas 6. Remove the pastry from the fridge and unwrap it. Roll out the pastry on a floured work surface to fit a 20cm\/8in tart tin. Line the tin with the pastry, pushing it well up the sides. Prick the base with a fork, then place a circle of baking parchment over the base of the pastry and cover with ceramic baking beans (or uncooked rice). Transfer to the oven and bake blind for 18-20 minutes. Remove from the oven, remove the baking beans or rice and the baking parchment. Reduce the temperature of the oven to 150C\/300F\/Gas 2. Meanwhile, for the filling, place the sugar and the zest and juice of the lemons into a small pan. Mix the beaten egg yolk with the cornflour mixture in a clean bowl, then add to the pan of lemon and sugar. Add boiling water, then simmer over a low heat, stirring constantly, until thickened. Remove from the heat and allow to cool. Once the filling mixture has cooled, pour it into the pastry base in its tin. For the meringue topping, whisk the egg whites until stiff peaks form when the whisk is removed. Whisk in one tablespoon of caster sugar, then add the remaining caster sugar, one tablespoon at a time, whisking constantly. Spread the meringue topping over the pie filling and place into the oven to bake for 45-50 minutes, or until the meringue is light golden-brown and crisp on the outside, but soft underneath. Remove from the oven and allow to cool. Serve either warm or cold. ","ingredients":" 225g\/8oz plain flour, plus extra for dusting,  ½ tsp baking powder,  1 tsp caster sugar,  175g\/6oz unsalted butter,  pinch salt,  1 free-range egg,  190g\/6¾oz caster sugar,  2 lemons, zest and juice only,  1 free-range egg, yolk only, beaten,  1 tbsp cornflour, dissolved in a little milk,  175ml\/6fl oz boiling water,  2 free-range eggs, whites only,  pinch salt,  80g\/3oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemonmeringuepie_89144"}