{"recipe_name":"Lemon, pancetta and rosemary chicken","author":"Emma Lewis","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Wash the chicken and pat dry.   Strip the leaves from half the rosemary and thyme stalks and finely chop. In a bowl, combine the lemon zest, chopped rosemary and thyme, pancetta and mascarpone.  Season to taste with salt and freshly ground black pepper. Halve the zested lemons and stuff into the chicken's cavity, along with the remaining herb sprigs.   Use your hand to loosen the skin lying over the breast of the chicken, to create a pocket.  Push the mascarpone mixture under the breast skin to create a thick, even layer. Put the onion slices into a large, flameproof roasting tin. Place the chicken on top and cover loosely with foil. Cook for 1½-2 hours, basting every 30 minutes, until the juices of the bird run clear when the thigh is pierced with a skewer. If necessary, uncover for the last 30 minutes to brown the bird. When cooked, take the chicken from the oven, remove from the roasting tin and leave to rest on a platter, covered loosely with foil, for 30 minutes. To make the gravy, pour away any excess fat from the roasting tin and discard the onion slices.  Set in the roasting tin over a medium heat, then sprinkle over the flour.  Stir through and cook for two minutes.   Slowly whisk in the wine and stock.  Bring to the boil, scraping the bits from the bottom of the roasting tin, then simmer over a low heat for 15 minutes. Serve the gravy with the chicken and stuffing balls wrapped in bacon. ","ingredients":" 2kg\/4lb 6oz oven-ready chicken, thawed if frozen, giblets removed,  1 small bunch fresh rosemary,  1 small bunch fresh thyme ,  2 lemons, finely zested ,  80g\/3oz pancetta, chopped,  150g\/5¼oz mascarpone,  salt and freshly ground black pepper,  2 onions, thickly sliced,  1 tbsp flour ,  100ml\/3½fl oz white wine ,  600ml\/1pt chicken stock ,  stuffing balls wrapped in bacon","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemonpancettarosemar_78339"}