{"recipe_name":"Lemon sole goujons with mushy peas and sweet potato chips","author":"Gizzi Erskine","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lemonsolegoujonswith_92441_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. For the sweet potato wedges, place the sweet potato wedges into a large roasting tin, then drizzle over the oil, turning the sweet potato wedges to coat them all over. Roast in the oven for 25-30 minutes, turning halfway through cooking, until the sweet potato wedges are crisp and golden-brown and cooked through. Meanwhile, for the lemon sole goujons, sprinkle the flour onto a plate. Beat the eggs in a bowl. Mix together the breadcrumbs, cayenne pepper and lemon zest until well combined, then sprinkle the mixture onto a separate plate. Season the fish pieces, to taste, with salt and freshly ground black pepper. Dredge each piece of fish first in the flour, then dip it into the beaten egg, then roll it in the breadcrumbs until completely coated. Heat the oil in a frying pan over a medium heat until a breadcrumb sizzles and turns golden-brown when dipped into it. Add the coated fish pieces to the pan, in batches, and fry for 2-3 minutes each side until crisp, golden and cooked through. Remove the fried fish pieces from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining fish pieces.  Meanwhile, for the mushy peas, cook the peas in a pan of boiling, salted water for 3-4 minutes, or until just tender. Drain well and crush using a fork or potato masher. Stir the crème fraîche and mint sauce (or fresh mint) into the crushed peas and season, to taste, with salt and freshly ground black pepper.  For the lemon mayonnaise, stir the lemon juice into the mayonnaise until well combined. Season, to taste, with salt and freshly ground black pepper.  To serve, divide the fried fish goujons equally among four serving plates. Spoon a dollop of lemon mayonnaise on top of each portion. Spoon the sweet potato wedges and mushy peas alongside. ","ingredients":" 2 sweet potatoes, skin on, cut into wedges,  2 tbsp olive oil,  50g\/1¾oz plain flour,  2 free-range eggs,  100g\/3½oz fresh breadcrumbs,  ½ tsp cayenne pepper,  ½ lemon, zest only,  4 fillets lemon sole, skin removed, cut into 1cm\/½in strips,  salt and freshly ground black pepper,  4 tbsp olive oil,  200g\/7¼oz peas,  1 tbsp crème fraîche,  ½ tsp ready-made mint sauce (or 1 tsp chopped fresh mint leaves),  salt and freshly ground black pepper,  squeeze lemon juice, to taste,  3 tbsp ready-made mayonnaise,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lemonsolegoujonswith_92441"}