{"recipe_name":"Lettuce, anchovy and egg salad with a creamy vinaigrette","author":"Rick Stein","programme":"Rick Stein's Spain","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lettuce_anchovy_and_egg_91029_16x9.jpg","method":"For the croutons, preheat the oven to 180C\/350F\/Gas 4.  Cut the crusts off the bread and tear the remainder into small pieces. Toss them in a bowl with the olive oil. Spread onto a baking tray and bake for 5-7 minutes or until crisp and golden-brown. Remove and leave to cool, then season lightly with salt. Meanwhile, put the eggs into a pan of boiling water and boil for eight minutes. Drain and cover with cold water.  For the dressing, put the garlic, egg yolk, mustard, lemon juice, sugar and some seasoning into a small bowl. Mix together briefly with a hand-held electric whisk, then slowly whisk in the oil to make a smooth dressing.  Discard the outside leaves of the lettuce if necessary and tear the rest into small pieces. Wash and dry well, then spread over the base of six medium serving plates. Peel the hard-boiled eggs and cut them into quarters. Arrange four pieces over each plate of lettuce leaves with the four strips of anchovy fillet and a few croutons. Drizzle one tablespoon of dressing over each plate and serve straight away. ","ingredients":" 3 slices white crusty bread,  1 tbsp olive oil,  6 medium free-range eggs,  3 Little Gem lettuce ,  50g\/2oz (about 12) large anchovy fillets in olive oil, drained and cut on the diagonal into 2.5cm\/1in pieces,  1 small garlic clove, crushed,  1 large free-range egg yolk,  1 tsp Dijon mustard,  2 tbsp lemon juice,  ½ tsp caster sugar,  150ml\/5fl oz extra virgin olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lettuce_anchovy_and_egg_91029"}