{"recipe_name":"Lettuce risotto","author":"Hugh Fearnley-Whittingstall","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 5-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Pick over, wash and roughly shred the lettuces.  Bring the stock to the boil then turn the heat down to simmering point.  Heat the olive oil in a large, heavy-based pan and add the onion or shallots. When it has started to soften, add the garlic and cook for 1-2 minutes (do not allow the onion or garlic to brown).  Add the arborio rice to the pan and stir well until each grain of rice is coated with oil. Pour in the first ladleful of hot stock. Stir the risotto until the stock has been absorbed, then continue to add the stock at intervals in this way.  About 15 minutes into the cooking time, when the rice is almost done, but still just a little bit chalky in the middle, add the shredded lettuce, peas and sliced spring onions. Stir gently to mix the vegetables through the rice. At first it will seem like you have added far too much lettuce, but it will soon wilt and give up its juices to the rice.  The risotto is ready when all the liquid has been absorbed, the peas are just tender and the rice is cooked (ideally about 3 minutes after you ve added the lettuce). It should be creamy, not dry. Stir in the knob of butter and serve immediately offering parmesan and a grater to your guests at the table. ","ingredients":" 2-4 mixed lettuces, depending on size ,  1L\/1¾pt vegetable or chicken stock ,  350g\/12oz arborio rice ,  30-45ml\/2-3 tbsp olive oil ,  1 clove garlic, chopped ,  1 onion or 2-3 shallots,  finely chopped,  salt and freshly ground black pepper ,  100g\/3oz fresh garden peas, shelled ,  12 spring onions, cut diagonally into 1cm\/½in pieces ,  knob of butter ,  piece of fresh parmesan","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lettucerisotto_14301"}