{"recipe_name":"Levi's homecoming lamb with rice and peas","author":"Levi Roots","programme":"Caribbean Food Made Easy","prep_time":"1-2 hours","cooking_time":"over 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spice paste, grind all of the spice paste ingredients in a mortar and pestle to a smooth paste. Transfer the spice paste to a large bowl. For the lamb, wash the pieces of lamb rump in cold water and pat dry with kitchen paper.  Add the pieces of lamb to the bowl of spice paste and mix until they are completely coated in the spice mixture. Cover and chill in the fridge for at least an hour, or ideally overnight, to marinate. When the lamb rump pieces have marinated, heat the oil in a heavy-based, lidded pan over a high heat. When the oil is smoking, add the lamb rump pieces and fry for 2-3 minutes, turning regularly, or until browned on all sides (reserve the bowl containing the leftover marinade). Cover the pan with a lid and reduce the heat to medium. Continue to cook for a further 4-5 minutes.  Add the 75ml\/2½fl oz of cold water to the bowl containing the reserved leftover marinade. Swirl the water around the bowl, then pour the watered-down marinade into the pan with the lamb, cover again and continue to cook over a medium heat for a further 4-5 minutes.  Remove the lid and add the stout, then bring the mixture to the boil. Once the mixture is boiling, reduce the heat to low and continue to simmer for a further 6-8 minutes, or until the meat is completely cooked through and the majority of the cooking liquid has evaporated to leave a thick, glossy sauce. Meanwhile, for the rice and peas, place the freshly grated coconut into a bowl.  Bring the water to the boil, then pour over the grated coconut. Set aside to steep for 15-20 minutes.   When the coconut has steeped and the water has cooled, squeeze all of the liquid out of the coconut flesh using your hands. Discard the flesh and reserve the liquid.  Transfer the coconut water to a pan and add all of the remaining rice and peas ingredients apart from the basmati rice. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Continue to simmer for 12-15 minutes, or until the volume of liquid has reduced and the vegetables are tender.  Add the rinsed rice to the coconut liquid. The water should cover the rice by 1.25cm\/½in, so add more water as necessary. Season, to taste, with salt and freshly ground black pepper, then bring the mixture back to the boil. When the water is boiling, cover the pan with the lid. Reduce the heat to its lowest setting and cook gently for 15-20 minutes, or until the rice is tender and has absorbed the coconut liquid. Discard the Scotch bonnet chilli.  To serve, divide the rice and peas between two serving plates. Place two pieces of lamb rump on top of each serving of rice and peas. Spoon over the sauce. Garnish with a mint sprig. ","ingredients":" 3 sprigs fresh thyme, leaves only,  3 tbsp finely chopped fresh mint leaves,  2 spring onions, green part only, chopped ,  ½ Scotch bonnet chilli, seeds removed, finely chopped,  6 allspice berries,  2 limes, juice only,  salt and freshly ground black pepper,  1 tbsp olive oil,  4 equal-sized pieces lamb rump (about 500g\/1lb 2oz in total),  3 tbsp sunflower or groundnut oil,  75ml\/2½fl oz cold water,  125ml\/4fl oz Jamaican stout (can substitute with Irish stout), mixed with 1½ tbsp soft dark brown sugar,  ½ fresh coconut, cut open, flesh cut from shell using a sharp knife, coarsely grated (the liquid can be drunk or reserved for another recipe),  325ml\/11½fl oz cold water ,  200g\/7oz canned black beans, drained and rinsed,  ½ spring onion, trimmed, chopped ,  ½ Scotch bonnet chilli,  ½ garlic clove, peeled,  1 sprig fresh thyme ,  3-4 allspice berries,  1 tbsp butter ,  ¼ onion, roughly chopped ,  225g\/8oz basmati rice, rinsed under cold running water,  salt and freshly ground black pepper ,  fresh mint sprigs, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/levishomecominglambw_91689"}