{"recipe_name":"Lightly cured hake on black kale with clam, caper and butter sauce","author":"Brian Turner","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Mix the sugar, salt and curry powder in a small bowl. Rub it over the flesh side of the fish and set aside for 5 minutes, then rinse off the rub and dry the fish. Wash the clams. Discard any open clams that do not close when given a sharp tap. Put the clams into a large, lidded pan with the white wine. Cook with the lid on for 2-3 minutes or until the clams open. Discard any clams that do not open. Strain the liquor through a muslin cloth into a clean pan and reserve the clams.  Add the double cream to the pan and heat to reduce in volume by two-thirds. Beat in the butter. Season with lemon juice. Add the capers and chopped chives. For the kale, bring a large pan of boiling salted water to the boil. Take the small inside leaves off the black kale. Plunge into the boiling water then take out and drain. Melt the butter in a frying pan, add the kale and season with salt and nutmeg. To cook the hake, heat the rapeseed oil in a pan then add the butter. When the butter is melted, add the fish skin-side down. Cook until golden-brown, then turn over and cook until the flesh is sealed and no longer translucent. Return to skin-side down and continune to fry until cooked through. Remove the fish from the pan and drain on kitchen paper.  Divide the black kale between serving plates and put the fish on top. Remove the clams from their shells. Add them to the sauce and pour it around the plates. ","ingredients":" 1 tbsp sugar,  1 tbsp salt,  1 tsp curry powder,  4 x 150-200g\/5½-7oz hake steaks,  1 tbsp rapeseed oil,  25g\/1oz butter,  48 clams,  175ml\/6fl oz dry white wine,  2 tbsp double cream,  200g\/7oz butter,  1 lemon, juice only,  2 tbsp baby capers,  1 tbsp chopped chives,  1 head black kale (cavolo nero),  25g\/1oz butter,  pinch grated nutmeg,  pinch salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lightly_cured_hake_on_62672"}