{"recipe_name":"Lime-cured mackerel, Japanese radish and green tea","author":"Jason Atherton","programme":"2007-16","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the garnish, peel all the baby cucumbers and dry the skin out in a dehydrator (alternatively place in an oven set at the lowest temperature for a few hours or leave overnight in a warm airing cupboard).  When the cucumber skins have fully dried, blend to a fine powder in a food processor. Mix equal quantities of the cucumber powder with the green tea powder and set aside. For the beetroot, add the oil, vinegar, salt, sugar and honey to a blender (or a thermo mixer) and mix until emulsified. Add the thyme and garlic and set aside. Use a mandoline to slice the beetroot, then place in a bowl. Add the oil mixture, cover and leave to marinade for two hours.  For the baby cucumbers, use a chef's blow-torch to scorch the peeled baby cucumbers until evenly coloured. Place in a sous vide bag along with the remaining ingredients.  Seal the bag and transfer to a water bath (according to manufacturer's instructions) to cook for 20 minutes. For the mackerel, in a bowl combine all the ingredients, except the mackerel, lime zest and lime juice, and mix thoroughly.  Place the mackerel fillets flesh-side up onto a tray, then evenly pack the salt mixture onto the flesh and set aside for 25 minutes. For the cucumber oil, peel the cucumber and blanch the skin. Drain well, then add to a food processor with the pomace oil and blend to a deep green oil. For the mackerel, brush the salt off the mackerel and discard.  Use a chef's blow torch to cook the mackerel (alternatively cook them under a very hot grill for a few minutes). Season with sea salt, lime juice and zest.  For the garnish, using a mandoline, cut the radish into slices. Then cut into strips and dip into the beetroot juice very briefly just before serving. To serve, place two pieces of mackerel onto the centre of each plate and top with a few slices of marinated beetroot. Remove the marinated cucumber from the bag and cut into 2cm\/1in thick slices, then place the slices around the mackerel. Pile the Japanese radish at the end of the mackerel. Dot a little cucumber oil around the plate then dust with the green tea powder. ","ingredients":" 4 baby cucumbers, skin only,  1 tbsp green tea powder,  1 Japanese radish, washed and peeled,  75ml\/2½fl oz beetroot juice,  250ml\/9fl oz pomace oil (or a light olive oil),  25ml\/1fl oz white wine vinegar,  ½ tsp salt ,  7.5g\/⅓oz caster sugar ,  25ml\/1fl oz honey,  4 sprigs thyme, leaves picked and finely chopped ,  1 garlic clove, finely chopped or grated,  4 red beetroot,  4 baby cucumbers, peel used for garnish (from above),  5g salt ,  5g sugar,  1 tbsp lemon juice ,  200g\/7oz Cornish sea salt,  125g\/4½oz sugar,  7.5g\/⅓oz coriander seeds, crushed,  7.5g\/⅓oz white peppercorns, crushed,  4 very fresh good-quality mackerel fillets, pin-boned and cut lengthways into two,  4 limes, zest and juice only,  1 large cucumber, peel only,  50ml\/2fl oz pomace oil (or a light olive oil)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lime-cured_mackerel_46354"}