{"recipe_name":"Lime and chipotle black bean tacos","author":"Anna Jones","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lime_and_chipotle_black_35645_16x9.jpg","method":"For the beans, heat a frying pan over a medium heat. Add the garlic and a splash of olive oil and cook for a minute or so, until the edges of the garlic begin to just brown.   Add the cinnamon, cumin and chipotle paste or chilli and stir for another minute to gently toast the spices. Add the beans and their liquid, bring to a simmer, then turn the heat down and cook for 10-15 minutes, until the liquid has thickened but the beans are still holding their shape. If you need to, add a little hot water to loosen. Season with salt and pepper and keep warm.  For the salsa, chop the tomatoes roughly on a big board. Pile the chilli and coriander on top, season with salt and pepper and chop all this together. Scrape into a big bowl, add the lime juice and a splash of olive oil and mix well. Set aside.  For the guacamole, mash the avocado in a bowl with a little salt and pepper, the chilli and lime juice. You can use a potato masher or a fork if you like. Once everything is ready, heat your tortillas. I do this by holding them with tongs over the flame of my gas hob – its super quick and gives a delicious charred taste – but the oven will do just fine.  Fill the tortillas with the beans, salsa, guacamole, egg, cheese and radishes. Don’t forget the chilli sauce, coriander and a little yoghurt, if using.  ","ingredients":" 2 garlic cloves, finely chopped,  olive oil, for frying,  1 tsp ground cinnamon ,  1 tsp ground cumin ,  1 tsp chipotle paste or 1 red chilli, finely chopped,  2 x 400g tins black beans,  sea salt and freshly ground black pepper,  20 cherry tomatoes,  ½ red chilli, deseeded and finely chopped ,  few sprigs fresh coriander, leaves picked,  ½ lime, juice only ,  extra virgin olive oil, to taste ,  1 ripe avocado, stone removed and peeled ,  1 green chilli,  ½ lime, juice only ,  8 wheat or corn tortillas ,  4 free-range eggs, fried,  handful of grated cheese, such as manchego or queso fresco,  bunch breakfast radishes, cleaned and chopped,  natural, sheep or coconut milk yoghurt (optional),  a few coriander sprigs,  sweet chilli sauce","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lime_and_chipotle_black_35645"}