{"recipe_name":"Lincolnshire Poacher cheese and potato croquettes with tomato salad","author":"James Martin","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 2-4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. For the croquettes, prick the baking potatoes all over with a fork and place in the oven for an hour, or until tender. Scoop the potato flesh into a bowl, discarding the skins. Mash with a potato masher until smooth and season, to taste, with salt and freshly ground black pepper. Set aside to cool. Take a piece of cheese and mould a little of the potato around it, pressing firmly into a sausage shape. Repeat with the remaining cheese and potato. Dredge the potato 'sausages' in the flour, then dip into the beaten egg and then the breadcrumbs to coat. Place in the fridge to set for 30 minutes. Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Remove the croquettes from the fridge and carefully place into the hot oil. Deep fry for 2-3 minutes, or until golden-brown and crisp on the outside and melting inside. Remove from the oil with a slotted spoon and drain on kitchen paper. For the salad, place the tomatoes, red onion, capers and flatleaf parsley into a bowl and stir. In a small bowl, whisk the vinegar and oil together and season, to taste, with salt and freshly ground black pepper. Pour two thirds of the dressing over the tomato salad and mix well. In another bowl, toss the salad leaves with the remaining dressing. To serve, place the croquettes onto serving plates with the tomato and leaf salads. ","ingredients":" 2 large baking potatoes,  salt and freshly ground black pepper ,  110g\/4oz Lincolnshire Poacher cheese, cut into small cubes,  50g\/2oz plain flour,  2 free-range eggs, beaten,  50g\/2oz fresh breadcrumbs,  vegetable oil, for deep-frying,  4 plum tomatoes, roughly chopped,  1 red onion, finely chopped,  1 tbsp capers,  handful flatleaf parsley, roughly chopped,  2 tbsp red wine vinegar,  4 tbsp rapeseed oil,  salt and freshly ground black pepper ,  75g\/3oz mixed salad leaves","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lincolnshirepoacherc_86700"}