{"recipe_name":"Banana soufflé with banana ice cream and toffee bananas","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the banana ice cream, spread the banana chunks out on a tray and transfer to the freezer. Leave the banana in the freezer until frozen all the way through (about 1 hour). For the toffee bananas, heat the oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.) Meanwhile, prepare a bowl of iced water. In a bowl, whisk together the cornflour and sparkling water until smooth and well combined. Add the banana halves and gently mix until coated.  Carefully lower the battered bananas into the hot oil and fry for 2-3 minutes, or until very light golden-brown. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Meanwhile, heat the sugar, without stirring, in a heavy-based frying pan over a high heat. Swirl the pan until the sugar melts to a light golden-brown caramel. Then dip the base of the pan into a sinkful of cold water to stop the caramel from cooking any further. Using a spoon, carefully roll the battered banana halves in the hot caramel, one at a time, until completely coated. Transfer to the bowl of iced water until completely cold, then set aside to drain.  For the banana soufflé, preheat the oven to 200C\/180C Fan\/Gas 6 and grease 4 ramekins using half of the butter and 1 tablespoon of caster sugar. Mix the remaining sugar with the custard in a large bowl. In a separate bowl whisk the egg whites until stiff peaks form when the whisk is removed. Carefully fold the egg whites into the custard mix, stir in the banana liqueur and spoon into the prepared ramekins. Put on a baking tray and place in the oven for 6-8 minutes. To finish the banana ice cream, place the frozen banana chunks into a food processor. Add the vanilla, sugar and half of the buttermilk. Turn on the processor and blend for a few moments. Then, while the processor is still running, pour in the remaining buttermilk in a thin, steady stream (if you are using yoghurt, just tip it all in and blend).  To serve, place the soufflés on serving plates and serve the ice cream and bananas alongside. Garnish with the mint. ","ingredients":" 4 very ripe bananas, peeled, cut into chunks ,  ¼ tsp vanilla extract,  3 tbsp sugar, honey or sweetener, to taste,  150ml\/5fl oz buttermilk (or yoghurt),  vegetable oil, for deep-frying,  75g\/2½oz cornflour,  125ml\/4fl oz sparkling water,  1 ripe banana, peeled and cut in half lengthways,  150g\/5½oz caster sugar ,  50g\/1¾oz butter,  3 tbsp caster sugar,  4 tbsp ready-made custard,  4 egg whites,  1 tsp banana liqueur,  4 tbsp freshly chopped mint","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/banana_souffl_with_45338"}