{"recipe_name":"Alternative fish and chips","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chips, peel the spuds, then slice on a mandoline at its thinnest setting, or hand cut very finely. Place the potato slices into cold water and leave for 30 minutes (this will break down the starch and help them to crisp up during cooking). Heat the oil in a deep, heavy-bottomed frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Pat the potato slices dry with kitchen paper and add to the hot oil in batches to deep-fry for 2-3 minutes, or until crisp and golden. Carefully remove the cooked chips from the oil with a slotted spoon, drain on kitchen paper and sprinkle with a little salt.  For the fish, make a batter by whisking the egg whites in a bowl until stiff peaks form when the whisk is removed. Beat the egg yolks and the flour together to combine, then add the water, coconut and chopped herbs. Add the beaten egg whites and gently fold into the batter. Season the whiting fillets with salt and freshly ground black pepper and add a squeeze of lemon juice to each. Dredge the whiting in flour, shaking off any excess, then dip the floured fillets into in batter to coat completely.  Carefully place the battered whiting fillets into the hot oil and deep-fry for eight minutes, or until crisp, golden and cooked through. For the tartare sauce, mix the mayonnaise, capers, gherkins, horseradish sauce and parsley together in a clean bowl, then season, to taste, with salt and freshly ground black pepper. To serve, place a piece of battered fish onto each of four plates. Place a large spoonful of chips alongside and a dollop of tartare sauce beside. ","ingredients":" 225g\/8oz floury potatoes, for example, Maris Piper,  vegetable oil, for deep frying,  salt,  2 free-range eggs, separated,  200g\/7oz plain flour, plus extra for dredging,  1 tbsp desiccated coconut,  200ml\/7fl oz ice cold water (more or less if required),  1 tbsp chopped fresh tarragon ,  1 tbsp chopped fresh mint,  4 x 150g\/5oz whiting fillets,  salt and freshly ground black pepper,  1 lemon, juice only ,  150g\/5oz mayonnaise,  1 tbsp capers, rinsed and drained,  1 tbsp small gherkins, rinsed and drained,  1 tbsp horseradish sauce from a jar,  1 tbsp chopped fresh parsley,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/alternativefishandch_86394"}