{"recipe_name":"Lobster and fillet steak with straw fries and green salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lobster and fillet steak, preheat the grill high. Cut the lobster in half and remove the tail and claw meat, chop it up and place back into the tail shells. Heat a griddle pan until hot and lightly oil the steak. Cook on each side for 3 minutes, or until cooked to your liking. Set aside to rest in a warm place. In the meantime place the butter and dulse (or watercress) in a bowl and mix. Place the lobster tails on a grill tray, dot some of the butter on top and place under the grill for 1-2 minutes or until the butter is melted and the lobster meat is hot. For the straw fries and salad, heat a deep-fat fryer to 180C, or half fill a large deep pan with vegetable oil and heat until a piece of bread turns golden-brown when dropped in the oil. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) Lower the chips into the fryer and cook for 5 minutes, or until golden-brown and crisp. Drain on kitchen paper. Place the Little Gem lettuce in a large bowl. Mix the remaining salad ingredients together then pour over the lettuce. To serve, place the lobster tails on serving plates with the steak alongside. Place the chips in bowls along with the salad. Put a knob of butter on each steak just before serving. ","ingredients":" 1 lobster, cooked and cooled,  2 tbsp olive oil,  2 x 175g\/6oz fillet steaks,  100g\/3½oz unsalted butter,  25g\/1oz dulse or fresh watercress,  1 lemon, zest only,  vegetable oil, for frying,  2 large chipping potatoes, peeled and cut into straw fries,  2 Little Gem lettuces, leaves separated,  3 tbsp flavourless oil,  1 tbsp tarragon vinegar,  1 tsp Dijon mustard,  1 tsp freshly chopped tarragon,  pinch pink peppercorns, crushed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobster_and_fillet_steak_43951"}