{"recipe_name":"Banana tarte tatin","author":"Sarah Jane Willis","programme":"The Great British Bake Off","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rough puff pastry, sift the flour and salt into a large bowl and add the butter. Move the butter around until coated in the flour. Mix 125ml\/4fl oz of water and the lemon juice together in a jug and pour into the flour and butter. Using a butter knife, mix in the liquid and chop the butter slightly as you go, turning the bowl round, until the ingredients have combined into a dough. On a floured work surface, tip the dough out and quickly shape it into a block. Roll out the dough into a rectangle roughly 35cmx20cm\/14inx8in in size. With the short side of the pastry rectangle in front of you, fold the bottom third of the pastry to the middle, then fold the top half down to cover it.  Roll the pastry out into a rectangle again and repeat the folding process. Turn the pastry a quarter turn and roll out and fold again.  Repeat this 4-5 times. After the last folding, wrap the pastry in cling film and leave to chill in the fridge for a few hours, or preferably overnight. When the pastry has chilled, preheat the oven to 180C\/350F\/Gas 4.  To make the caramel, heat the sugar with a tablespoon of water in an ovenproof frying pan over a low heat and slowly bring to the boil. Keep boiling until the syrup turns a light golden colour - this will take between 5-7 minutes.  Add the butter in and swirl the pan (don’t stir) until it has all melted. Remove from the heat and leave to cool for a few minutes. Slice the bananas into rounds and arrange in a pattern on the caramel.  Roll out the pastry and cut out a circle slightly bigger than your pan.  Place the pastry on top of the bananas and tuck it in around the edges.  Pierce the top of the pastry with a fork and place in the pre heated oven for 40-45 minutes, or until the pastry is golden and puffed up.  Immediately turn the tart out onto a plate (take care as the caramel will still be very hot and may splash) and serve.  ","ingredients":" 225g\/8oz plain flour, plus extra for dusting,  pinch sea salt ,  190g\/6¾oz unsalted butter, cold, cut into 2cm\/¾in cubes,  ½ tbsp lemon juice,  100g\/3½oz granulated white sugar,  60g\/2¼oz salted butter ,  3 firm bananas ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/banana_tarte_tatin_69729"}