{"recipe_name":"Lobster ravioli with sautéed courgettes and leeks","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sauce, heat a frying pan, add the butter and reserved lobster shell and fry for 5-6 minutes. Add the vegetables and fry for 3-4 minutes. Add the brandy, allow to heat briefly, then slowly tilt the pan towards the flame, or light with a match. Let the flames flare up then die down. Cook for 2-3 minutes longer, then add the stock. Bring the mixture to the boil and cook for a further 20 minutes.  Strain the sauce into a clean saucepan, add the cream and cook for a further minute. Season, to taste, with salt and freshly ground black pepper. Keep warm. For the lobster ravioli, place the flour and three of the eggs into a food processor and pulse until it forms small crumbs.  Tip the mixture out onto a lightly floured work surface and bring together to form a dough. Knead lightly for 2-3 minutes, or until the dough is smooth and elastic.  Wrap the dough in cling film and chill in the fridge for 20 minutes. Meanwhile, blend the salmon fillet and cream in a small food processor to a purée. Season with the lemon juice, salt and freshly ground black pepper. Place the pasta dough onto a clean, flat work surface dusted with flour. Roll the dough out to a rough rectangle, then sprinkle with flour. Divide the pasta into two pieces, then pass each piece through a pasta machine several times, gradually reducing the thickness until you reach the thinnest setting and the pasta feels elastic. (Cover any pasta dough that you are not using with cling film so that is doesn’t dry out.) Lay a sheet of pasta onto the work surface and place spoonfuls of the salmon mixture at intervals along the sheet, leaving a gap of 6cm\/2½in between each pile. Spoon out eight piles of salmon and top each pile with the sliced lobster meat. Beat the remaining egg in a bowl. Lightly brush the beaten egg around the piles of lobster. Top with a second sheet of pasta and press down lightly around the edges of the lobster. Using a pastry cutter, stamp out eight ravioli in 6cm\/2½in rounds. Bring a large pan of salted water to the boil and cook the ravioli for 1-2 minutes, or until they float to the top of the pan. Drain, then mix with the chervil, olive oil and season with salt, and freshly ground black pepper. For the sautéed courgettes and leeks, heat a frying pan until hot, add the butter and the vegetables and fry for 2-3 minutes, or until just softened. Season, to taste, with salt and freshly ground black pepper. Meanwhile, blanch the asparagus in a saucepan of boiling salted water for 2-3 minutes, or until tender.  To serve, spoon the sautéed courgettes and leeks into the centre of serving plates. Top with the lobster ravioli and asparagus spears. Drizzle over the sauce and finish with a scattering of cress. ","ingredients":" 40g\/1½oz butter,  1 onion, roughly chopped,  2 large carrots, roughly chopped,  4 sprigs fresh thyme,  50ml\/2fl oz brandy,  750ml\/1pint 6fl oz chicken stock,  110ml\/4fl oz double cream,  300g\/11oz '00' pasta flour, plus extra for dusting,  4 free-range eggs,  125g\/4½oz salmon fillet, skinned,  50ml\/2fl oz double cream,  ¼ lemon, juice only,  salt and freshly ground black pepper,  1 x 750g\/1lb 11oz cooked lobster, meat removed and sliced, shell reserved,  1 tbsp olive oil,  2 tbsp roughly chopped fresh chervil,  50g\/2oz butter,  2 leeks, sliced into 7.5cmx1cm\/3inx1in ribbons,  2 courgettes, sliced into 7.5cmx1cm\/3inx1in ribbons,  12 fine asparagus,  1 punnet micro cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobster_ravioli_with_90812"}