{"recipe_name":"Lobster Thai red curry with pad Thai","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Thai red curry paste, place all the ingredients, including the soaking water, into a pestle and mortar, or food processor, and blend to a fine paste. For the lobster curry, heat a wok or frying pan until hot, add three tablespoons of the curry paste and cook until just starting to change colour then add the coconut milk. Bring to a simmer and cook for five minutes then add the fish sauce, tamarind, lime and sugar. Check the seasoning and add salt and freshly ground black pepper as necessary.  Carefully remove the meat from the cooked lobsters, reserving the shells, and place the meat into the curry sauce and cook over a low heat until hot through. Add the coriander and stir through, then spoon the lobster meat back into the shells. For the pad Thai, heat a wok until hot, add the oil, shallot, chilli, garlic and ginger and stir fry for a minute. Add the prawns and cook for another minute. Add the noodles and bean sprouts and stir fry to heat through. Then add the tamarind paste, fish sauce, soy sauce and lime juice and stir to coat everything evenly. Cook for 1-2 minutes, until hot, then add the chopped coriander.  To serve, pile pad Thai onto each serving plate and sprinkle with crushed peanuts. Place the lobster alongside the pad Thai and spoon over the curry sauce to finish. ","ingredients":" 5 dried, hot red chillies, soaked in 75ml\/3fl oz warm water,  2 large shallots, chopped,  2 garlic cloves, chopped ,  2 cm\/1 in piece fresh root ginger, chopped,  1 stem lemongrass, finely chopped,  4 pieces coriander root, roughly chopped,  2 kaffir lime leaves, roughly chopped,  ¼ tsp shrimp paste,  ½ tsp ground cumin,  ½ tsp ground coriander,  200ml\/7fl oz coconut milk,  1 tbsp fish sauce,  1 tbsp tamarind paste,  1 lime, juice only,  1 tsp palm sugar,  4 cooked lobster, split in half lengthways,  2 tbsp coriander leaves, roughly chopped ,  1 tbsp vegetable oil,  1 large banana shallot, finely sliced,  1 red chilli, sliced,  2 garlic cloves, finely chopped,  1 tbsp grated fresh root ginger,  150g\/5oz cooked peeled prawns,  400g\/14oz cooked rice noodles,  125g\/4½oz beansprouts,  2 tbsp tamarind paste,  2 tbsp fish sauce,  1 tbsp soy sauce,  1 lime, juice only,  3 tbsp roughly chopped fresh coriander,  2 tbsp roasted salted peanuts, crushed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobster_red_thai_curry_84326"}