{"recipe_name":"Lobster salad with Thai crab and lobster cakes and sweet chilli sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crab and lobster cakes, heat a deep fat fryer to 190C\/375F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place the crab, lobster, potato, chilli, ginger and lime juice and zest into a bowl and mix thoroughly. Add the coriander and season with salt and black pepper. Using two small spoons, form quenelles from the mix, then carefully coat each quenelle in the flour, then the beaten egg and then coat in the breadcrumbs. Place gently into the fat fryer and fry until golden-brown and hot through – about two minutes. Remove with a slotted spoon and drain onto kitchen paper. For the sweet chilli sauce, place the chillies, sugar, vinegar and 25ml\/1floz water into a saucepan and bring to a boil. Reduce the heat and simmer for five minutes, or until thickened. Place into a food blender and blend to a purée, then pass through a fine sieve and allow to cool. For the salad, place half of the mango, the vanilla seeds and lime juice into a small food processor and blend to a purée, and then pass through a fine sieve into a bowl. Check for seasoning, adding more lime, salt and black pepper, if needed. Heat a frying pan until medium hot, add the butter and heat until melted then add the lobster and warm through, flipping over half way through. Remove from the heat. Toss the rest of the mango with all the leaves in a bowl, dressing with a little olive oil, salt and black pepper. To serve, place a dollop of mango dressing onto each of four plates, then quickly spread it across the plate. Top with a little pile of salad and a lobster claw. Place a few crab and lobster cakes around the plate and then finish with several drops of sweet chilli sauce. ","ingredients":" 150g\/5oz fresh white crab meat,  75g\/3oz cooked lobster meat,  75g\/3oz cooked cold mashed potato,  1 red chilli, finely diced,  1cm \/½in fresh ginger, finely grated,  1 lime, juice and zest only,  1 small bunch coriander, finely chopped,  salt and freshly ground black pepper,  75g\/3oz plain flour,  2 free-range eggs, lightly beaten,  50g\/2oz panko breadcrumbs,  2 red chillies, finely diced,  75g\/3oz caster sugar,  75ml\/3fl oz rice wine vinegar,  1 mango, peeled and finely diced,  ½ vanilla pod, split and seeded,  1 lime, juice only,  salt and freshly ground black pepper,  75g\/3oz butter,  4 large cooked lobster claws,  1 small handful frisée lettuce,  1 small handful lambs lettuce,  1 small handful watercress leaves,  2 tbsp coriander cress,  olive oil, for dressing","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobster_salad_with_thai_64088"}