{"recipe_name":"Lobster Thai curry with butter basmati rice and coriander cress ","author":"James Martin","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the paste, place all the ingredients into a small food processor and blend until smooth. For the lobster Thai curry, heat a wok, then add the paste and cook for 2-3 minutes. Add the lime leaves, shrimp paste , cumin, coriander and paprika. Cook for one minute. Add the coconut milk, fish sauce, tamarind, lime juice and palm sugar. Meanwhile remove the meat from the lobster and chop the meat, leaving the claw intact. Add the lobster to the wok and cook until the lobster is hot. Reduce the heat and let the curry simmer gently until ready to serve. Meanwhile for the butter basmati rice, heat a medium saucepan and add one tablespoon of butter. Once the butter has melted, add the cloves and cinnamon and cook for one minute. Add the rice and enough water to cover. Cover with a lid and turn the heat down to the lowest setting and cook for 20 minutes. Turn off the heat and leave the lid on until ready to serve. Just before serving stir the remaining butter though the rice. To serve, serve the rice in a serving bowl along with the lobster curry, topped with coriander cress. ","ingredients":" 10 long red chillies, seeds removed, finely chopped,  2 shallots, finely chopped,  2 garlic cloves, finely chopped,  2cm\/¾in piece galangal, chopped (alternatively use root ginger),  1 lemongrass stalk, finely chopped,  2 tbsp coriander roots,  2 kaffir lime leaves,  ¼ tsp shrimp paste,  ½ tsp ground cumin,  ½ tsp ground coriander,  ½ tsp paprika,  200ml\/7fl oz coconut milk,  1 tbsp fish sauce,  1 tbsp tamarind paste,  1 lime, juice only,  1 tsp palm sugar,  2 cooked lobsters, meat removed,  2 tbsp coriander cress,  2 tbsp unsalted butter,  2 cloves,  1 cinnamon stick, broken in two,  250g\/9oz basmati rice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobster_thai_curry_with_47060"}