{"recipe_name":"Lobster with garlic butter, new potatoes and watercress salad","author":"Brian Turner","programme":"A Taste of Britain","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the lobsters in the freezer for two hours to put it into a torpid state. Bring a large pot of water to the boil. Add the salt, thyme, white peppercorns and bay leaf. Cut the lemon in half, squeeze the juice into the pan then add the halves of lemon too.  Push the tip of a large, sharp, heavy knife or skewer into the lobsters at the point where a cross forms in the shell on its back, then lower into the boiling water and bring back to the boil. Boil for five minutes, then remove the pan from the heat. Leave the lobsters in the water for another five minutes, then remove from the pan and set aside to cool. Gently cook the potatoes in boiling water for 10-15 minutes until tender. Drain and season with salt and pepper. Cut the lobsters in half lengthways. Take out the tail meat, cut in half lengthways again and remove the intestinal tract. Take off the claws, removing the meat, leaving the carcass whole and clean.  In a frying pan, melt the butter and gently warm through the lobster meat. For the garlic butter, melt the butter in a pan over a low heat. Gently fry the shallot and garlic without browning them, then add the whelk meat. When warmed through, add the parsley. To finish the salad, mix the mustard and vinegar together in a bowl, then whisk in the oils and season. Dress half of the little gems in the serving bowl. Shred the remaining lettuces, mix with the watercress and add to the serving bowl (do not dress until serving). When you are ready to serve, put the meat from the claws in the head space of the shells and the tail meat back in the shells. Put the lobsters onto plates. Put the potatoes in the middle of the plates, pour the garlic butter over the lobsters and serve with the dressed salad. ","ingredients":" 3 tbsp sea salt,  1 sprig thyme,  6 white peppercorns,  1 bay leaf,  1 lemon ,  4 x 450g\/1lb live lobsters,  50g\/1¾oz butter,  450g\/1lb new potatoes,  salt and freshly ground black pepper,  1 tsp English mustard,  2 tbsp white wine vinegar,  4 tbsp olive oil,  4 tbsp vegetable oil,  4 little gem lettuce, washed and halved,  1 large bunch watercress, washed,  225g\/8oz butter,  1 shallot, finely chopped,  4 garlic cloves, crushed,  12 cooked whelks, chopped into small dice,  6 tbsp parsley, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobster_with_garlic_36735"}