{"recipe_name":"Lobster Thermidor","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Kill the lobsters by first placing them in the freezer for half an hour, then piercing each one between the eyes with a sharp knife.  Bring a large pan of salted water to the boil. Place the lobster into the pan. Bring back to the boil and cook for 6-8 minutes. Remove the lobster from the water and allow to cool. When cool enough to handle use a large sharp knife to cut it in half lengthways. Use a spoon to scoop out all of the body meat out carefully. Crack the claws with your knife and carefully remove the flesh. Cut the lobster flesh into large chunks and set aside. For the sauce, melt the 25g butter in a pan, then stir in the flour and cook for one minute. Add the milk and stir over a low heat to bring slowly to the boil. Reduce the heat and simmer for ten minutes. Add the sherry, crème fraîche and mustard and stir well. Add the chilli and half of the gruyère and stir well, until the cheese has melted. Season, to taste, with salt and freshly ground black pepper. Meanwhile, to finish the lobster, heat the 45g of butter in a frying pan. Once the butter is foaming add the reserved lobster meat and fry to heat through for 1-2 minutes. Heat the grill to its highest setting. Place the halved lobster shells onto a baking tray. Spoon a little of the sauce into each shell, then add the lobster flesh. Pour over the rest of the sauce and top with the remaining gruyère. Place the lobster halves under the grill and cook until the topping is bubbling and golden-brown. To serve, place a lobster half onto each plate and sprinkle with chopped parsley. ","ingredients":" 1 large live lobster (approximately 1kg\/2lb 2oz),  45g\/1½oz butter,  25g\/1oz unsalted butter ,  25g\/1oz plain flour,  300ml whole milk,  splash dry sherry,  75g\/2½oz crème fraîche,  1 tbsp Dijon mustard,  1 red chilli, finely chopped ,  75g\/2½oz gruyère cheese,  salt and freshly ground black pepper,  1 tbsp chopped fresh parsley, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobsterthermidor_87671"}