{"recipe_name":"Lobster Thermidor","author":"The Ivy","programme":"A Taste of My Life","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring a very large pan of water to the boil and add the salt and the white wine vinegar. Plunge the lobsters into the boiling wate. Return to the boil and cook for five minutes for lobsters of this size. (You will probably need to cook the lobsters in two or three batches, according to the size of your pan.) Remove the lobsters from the water and leave to cool. Meanwhile, in a clean pan, boil the white wine with the shallots until the wine has reduced to about two teaspoons. Add the fish stock and boil again until the liquid has reduced to almost nothing. Add 200ml\/7fl oz of the cream and the mustard, bring to the boil and reduce until the sauce is thickened. Add the cheddar and whisk until the cheese has melted and the sauce is smooth. Season, to taste, with salt and freshly ground black pepper, then leave to cool. Preheat the oven to 230C\/445F\/Gas 8 (or heat the grill to its highest setting). Add the egg yolks to the cooled cheese sauce and mix well. Whip the remaining 100ml\/3½fl oz of cream in a clean bowl, until soft peaks form when the whisk is removed. Fold the cream into the thermidor sauce. Remove the claws from each cooled lobster, crack them with a sharp, heavy knife and take out the claw meat, preferably in one piece. Cut each body in half lengthways by inserting the point of a knife in the head and pushing it with the palm of your hand down the length of each lobster. Remove the meat from the tails and cut it into four pieces. Place the tail meat into a bowl and add a little of the thermidor sauce. Mix well, then spoon the tail meat and thermidor sauce mixture into the empty tails of the lobster halves. Place the meat from the claws into the head section of each lobster half. Spoon equal amounts of the remaining thermidor sauce over the lobster meat, then place the lobster halves onto baking sheets. Transfer to the oven to roast for 10-15 minutes, until the sauce topping is golden-brown and bubbling. (Alternatively you can place the sauce-coated lobsters under the grill to cook for 4-5 minutes, or until bubbling and golden-brown.) Serve immediately. ","ingredients":" 3 tbsp salt,  4 tsp white wine vinegar,  8 x 450g\/1lb live lobsters,  200ml\/7fl oz white wine,  8 shallots, peeled and finely chopped,  400ml\/14fl oz fish stock,  300ml\/10½fl oz double cream,  4 tsp English mustard,  80g\/3oz cheddar, grated,  2 medium free-range egg yolks, lightly beaten,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobsterthermidor_89079"}