{"recipe_name":"Lobster with crème fraîche mashed potato and vierge","author":"Patrick Williams","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the court bouillion, place the vegetables in a large pan (big enough to fit your lobster in) and fill with water. Bring to the boil and gently simmer for 5-10 minutes. Add the wine, parsley and chervil stalks and the crushed peppercorns and pimento seeds. Simmer for a further 10 minutes and then leave to cool. Pass the bouillion through a fine sieve and return to the cleaned pan. Bring the prepared bouillion to a rolling boil (about 80C) and cook the lobster for 4 minutes. Remove to a plate and cover with cling film until cool. Split the cooled lobster in half lengthways and carefully remove the main body meat in whole pieces. Use lobster crackers and pickers to remove the meat from the claws. Meanwhile, cook the potatoes until tender, drain and mash with the butter and seasoning. Pass the mash through a sieve or ricer and beat in a large bowl with a spatula until completely smooth. Stir the crème fraiche through and check for seasoning. Spoon the mash into a piping bag with a 2.5cm\/1in plain nozzle and pipe into the main body of the lobster shells. Sit the filled lobster shells side by side on a large serving platter. Arrange the body meat on top of the piped mash and the claw meat where it would naturally be. Pile salad leaves between the claws. To make the vierge, simply stir the tomatoes, basil, chives and olive oil together to combine. Spoon the vierge over the lobster and dress with chives. Serve at once. ","ingredients":" 2 carrots, diced,  1 bulb fennel, diced,  2 cloves garlic, roughly chopped,  3-4 parsley and chervil stalks,  3 white peppercorns, crushed,  3 allspice berries, crushed,  290ml\/½pt white wine,  681g\/1.5lb fresh lobster,  2 medium potatoes, peeled and cut into chunks,  25g\/1oz unsalted butter,  2 tbsp crème fraiche,  50g\/2oz fresh mixed salad leaves,  2 tomatoes, blanched, peeled, deseeded and diced,  2 tbsp each of snipped chives and torn basil,  60ml\/2fl oz olive oil,  salt and pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lobsterwithcregravem_9378"}