{"recipe_name":"Chicken breast with asparagus, broad beans, wild mushrooms and a Somerset cider brandy sauce","author":"Michael Caines","programme":"Great British Menu","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the sauce. Sweat the shallots and garlic in 25g\/1oz of the butter, without colouring. Add the thyme and bay leaf and sweat for a further 2 minutes, then add the brandy and reduce until the liquid has almost disappeared.  Add the chicken stock and cook to reduce by half, then add the cream. Whisk in the remaining butter. Season with salt and freshly ground black pepper and set aside. For the chicken, season the chicken breasts with salt and freshly ground black pepper, then wrap them individually in cling film to help retain their shape.  Heat a saucepan of water until just boiling and poach the wrapped chicken breasts for 12-15 minutes or until cooked. Remove and leave to rest for 10 minutes. Cook the asparagus and broad beans separately in boiling salted water until tender; drain and refresh in iced water. Cut all the asparagus tips to the same length and peel the broad beans to remove their tough skins. Unwrap the chicken breasts. Heat a knob of butter in a frying pan, add the chicken and slowly colour the skin until golden and crisp.  Meanwhile, fry the mushrooms in a little butter with salt and freshly ground black pepper. Add the mushrooms to the sauce together with the asparagus and broad beans and reheat. Quickly fry the spinach with a little butter, salt and freshly ground black pepper, then drain on a tray lined with kitchen paper.  To serve, slice each chicken breast into five rounds and arrange around warm plates. Place the spinach in the middle. Add three asparagus tips to each plate, then spoon around the mushrooms and broad beans with some sauce. ","ingredients":" 25g\/1oz shallots, sliced ,  2 cloves garlic, peeled ,  200g\/7oz unsalted butter,  5 sprigs thyme ,  1 bay leaf,  50ml\/2fl oz Somerset cider brandy, or other similar cider brandy ,  500ml\/17fl oz chicken stock,  50ml\/2fl oz double cream ,  salt and freshly ground black pepper,  4 free-range chicken breasts, each 200g\/7oz ,  salt and freshly ground black pepper,  12 asparagus tips,  100g\/3½oz shelled broad beans ,  unsalted butter,  200g\/7oz mixed wild mushrooms ,  200g\/7oz baby spinach leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/localarkchickenbreas_81704"}