{"recipe_name":"Lomo saltado with chips","author":"Martin Morales","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the marinade, mix all the ingredients together in a bowl with two tablespoons of water until well combined.  Add the meat to the bowl and mix so that it is well covered in the marinade.  Cover with cling film and leave to marinate in the fridge for about four hours. Rinse the chips in a colander under plenty of cold water to remove excess starch. Pat dry with kitchen paper.  Heat a deep, heavy-bottomed saucepan or deep-fat fryer half-full of sunflower oil to 130C\/275F. Add the potatoes to the deep-fat fryer and fry for 10 minutes, or until softened. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper.  When ready to serve, reheat the oil to 190C\/375F. With a slotted spoon, lower all the par-cooked chips gently into the pan and cook for 4-5 minutes, or until crisp and golden-brown. Remove from the pan with a slotted spoon and drain on kitchen paper. Season with a little salt and keep warm while you cook the steak. Drain the meat, reserving the marinade. Heat the vegetable oil in a wok over high heat until just smoking and add the meat to the wok- be careful, it might splutter at you. Cook as quickly as possible, tossing it until the meat is browned on all sides. Add the red onion wedges and cook for one minute. Add the tomato and chilli and immediately pour in the pisco. Pour over the reserved marinade and bring to a simmer. Turn off the heat and leave the meat to rest in the sauce for a couple of minutes. Place the steak on one side and the chips on another and garnish with chopped coriander and parsley. ","ingredients":" 4 garlic cloves, chopped,  150ml\/5fl oz soy sauce,  2 tbsp red wine vinegar ,  2 tsp worcestershire sauce,  ½ tsp dried oregano ,  ½ tsp ground cumin,  sea salt and freshly ground black pepper,  600g\/1lb 5oz fillet steak, cut into 3cm\/1¼in cubes,  vegetable oil, for frying,  1 large red onion, cut into thick wedges,  2 tomatoes, halves, seeds removed and cut into eighths,  1 amarillo chilli, seeds removed and sliced lengthways,  2 tsp pisco,  25g\/1oz fresh coriander, finely chopped,  10g\/¼oz fresh flat-leaf parsley, finely chopped,  600g\/1lb 5oz chipping potatoes, peeled, cut into chips,  sunflower oil, for deep frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lomo_saltado_with_chips_31800"}