{"recipe_name":"London Underground novelty cake","author":"Bob Mortimer","programme":"The Great Comic Relief Bake Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 16-20","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease and line two 20cm\/8in round cake tins and one 8x21cm\/3¼x8¼in loaf tin. In a large mixing bowl, cream together the butter and sugar with an electric handheld mixer until pale and fluffy.  Combine the beaten eggs and the buttermilk in another bowl.  Beat this into the creamed butter a third at a time, beating well after each addition. Stir in the grated lemon zest. Fold in the sifted self-raising flour with a large metal spoon until it is all incorporated. If the mixture is too stiff, loosen it with a little milk until the mixture just drops slowly off the spoon. Spoon one-third of the cake batter into each tin (you may need to weigh the round cakes to get them even in size).  Bake for 35-40 minutes, checking the cakes after 30 minutes. The cakes are ready when they are golden-brown and risen, and a skewer inserted into the cake should come out clean. Meanwhile, for the syrup, combine all the ingredients in a saucepan and gently bring to the boil, stirring frequently until the sugar dissolves. Set aside to cool, then strain before using. Remove the cakes from the oven and cool the cakes in the tins for ten minutes before turning out onto a wire rack. With a cocktail stick or skewer, poke little holes all over the cakes and brush over the syrup. This will keep the cakes moist and add more flavour. Let the cakes cool completely before icing. For the buttercream, cream the softened butter in  a bowl using a handheld electric mixer. Add the icing sugar a third at a time, beating well between additions. Set aside. To assemble the cake, prepare the round cakes by slicing off any roundness on the tops to give a flat finish.  Spread one of the round layers with strawberry conserve. Spread half of the buttercream on top of the jam and top with the other round cake layer.  Find a picture of the London Underground logo to follow for the design. On a surface dusted heavily with icing sugar, roll out the red fondant icing to a thickness of 3mm. Use rolling pin to roll up the icing and lift and drape over the round cake. Use a smoother (or clean, very dry hands) to ease the icing down the sides of the cake. Trim off the excess. Sprinkle more icing sugar on the work surface, if needed, and roll out the white icing to a thickness of 3mm. Using a template, cut out a 18cm\/7in circle. Brush the top of the red icing covered cake with a very little water, then place the white circle on the top. Cut the round cake into three pieces across, creating a 7cm\/2¾in wide slice from the middle of the cake. Lift this slice out and remove the icing. Trim the rounded end so that it is straight and squared off.  Prepare the loaf cake by trimming down to a rectangle 7cm\/2¾in wide and 13cm\/5in long. Slice this piece in half horizontally and fill the middle with jam and buttercream as before, reserving one large spoonful of the buttercream. You may need to trim the top and bottom so it is the same height as the slice you have just lifted from the round cake. Stick the two rectangles together with remaining buttercream. Trim the ends so that the piece is 30cm\/12in long.  Roll out the blue icing on the sugar dusted surface to a thickness of 3mm in a long rectangle shape. Use the rolling pin to roll up the blue icing and drape it over the rectangle. Use a smoother to ease the icing down the sides and smooth out any wrinkles. Trim off any excess. Arrange the three cakes onto a presentation board, with the blue rectangle in the centre to create the shape of the London Underground logo.  Roll out the remaining white fondant icing and cut the letters out with small alphabet cutters (or by hand) to spell out your favourite tube station. Brush the blue icing very lightly with water to stick the letters on. ","ingredients":" 525g\/1lb 3oz unsalted butter, softened,  525g\/1lb 3oz caster sugar,  9 free-range eggs, lightly beaten,  2½ tbsp buttermilk,  3 lemons, finely grated zest ,  550g\/1lb 4oz self-raising flour, sifted,  1-2 tbsp milk,  2 lemons, zest and juice,  100g\/3½oz caster sugar,  100g\/3½oz unsalted butter, softened,  100g\/3½oz icing sugar, sifted,  100g\/3½oz strawberry conserve,  icing sugar, for dusting ,  675g\/1lb 8oz red ready-to-roll fondant icing,  250g\/9oz white ready-to-roll fondant icing,  675g\/1lb 8oz blue ready-to-roll fondant icing","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/london_underground_52779"}