{"recipe_name":"Edamame falafel with roasted veg","author":"Sophie Wright","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/low-carb_falafel_with_19951_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Pat the soy beans dry with kitchen paper to remove as much excess moisture as possible. Put the beans into a food processor and blend to a rough paste. Tip into a bowl, combine with the remaining falafel ingredients (except the olive oil) and season, to taste.  Shape the mixture into golf ball-sized balls and place on a baking tray. Spray with a little oil and then bake for 15-20 minutes, or until golden-brown. For the vegetables, put the vegetables onto a baking tray. Spray with a little olive oil, and sprinkle over the smoked paprika. Season with salt and pepper and cook alongside the falafel in the preheated oven for 20 minutes. Meanwhile make the dip. Combine the cucumber with the garlic, yoghurt, lemon and mint and season to taste. Once the vegetables are tender and the falafel golden-brown and crisp on the outside, remove from the oven. Season the roasted vegetables with a drizzle of sherry vinegar and mix in the coriander. Serve with the yoghurt dip and a wedge of lemon on the side. ","ingredients":" 500g\/1lb 2oz frozen soya beans, defrosted,  1 small red onion, finely chopped,  2 garlic cloves, crushed,  ½ small bunch coriander, leaves and stalks finely chopped,  1-2 tsp ras-el-hanout, to taste,  1 free-range egg, beaten,  2 tbsp toasted sesame seeds,  2 tbsp dry breadcrumbs,  sea salt and freshly ground black pepper, to taste,  olive oil cooking spray,  1 red pepper, seeds removed, quartered,  1 yellow pepper, seeds removed, quartered,  2 courgettes, cut into long batons,  1 aubergine, halved lengthways then sliced into half moons,  1 tsp sweet smoked paprika,  1-2 tsp sherry vinegar, to taste,  ½ small bunch coriander, torn,  ⅓ cucumber, roughly peeled, seeds removed, finely chopped,  1 small garlic clove, crushed,  100g\/3½oz fat-free Greek yoghurt,  1 lemon, juice of ½, remainder cut into wedges for serving,  small handful mint, leaves shredded","vegetarian":true,"calories":363.0,"protein":25.5,"carbs":30.0,"sugars":10.0,"total_fat":15.5,"saturated_fat":1.5,"fiber":11.0,"salt":0.3,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/low-carb_falafel_with_19951"}