{"recipe_name":"Low-fat bacon and lentil soup","author":"Tim Maddams","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/low_fat_bacon_and_lentil_02962_16x9.jpg","method":"First, make your vegetable stock. Grate the vegetables and place (along with any ends you can’t grate) into a large heatproof bowl. Add the thyme, bay leaves and the stalks from the parsley. Season with a small pinch of salt and pepper. Cover the vegetables with 1 litre\/1¾ pints boiling water. Leave to steep for 10 minutes, or until cool. Once cool, strain the stock through a sieve and discard the vegetables. For the main soup, heat the oil in a large saucepan or casserole over a medium heat. Add the onions and a pinch of salt. Fry gently for two minutes, then add the garlic and chilli and cook over a low heat for five minutes or until the onions are completely soft but not coloured. Add the bacon and fry for 2-3 minutes, or until cooked through. Add the lentils and tomatoes, breaking up the tomatoes with your spoon. Cook for 2-3 minutes, then add enough of the vegetable stock to cover (you may need all of it). Bring to the boil then reduce to a simmer. Cook for 15-20 minutes, or until the lentils are completely soft. Turn off the heat. Pour half of the soup into a blender and pulse until smooth. Return to the pan with the remaining soup and heat through, taste and adjust the seasoning if necessary. Divide the soup between serving bowls, sprinkle with chopped parsley and serve. ","ingredients":" 4 carrots,  1 onion,  3 sticks celery, trimmed and washed,  1 garlic clove, peeled,  2 sprigs thyme,  1-2 bay leaves,  5-6 parsley stalks, leaves reserved for garnish,  pinch salt and freshly ground black pepper,  1 tbsp olive oil,  2 medium onions, chopped,  sea salt and black pepper,  2 garlic cloves, chopped,  1 red chilli, deseeded and finely chopped,  4 rashers smoked back bacon, fat removed, sliced into small pieces,  200g\/7oz red lentils, washed thoroughly,  1 x 400g\/14oz tin plum tomatoes,  1 litre homemade vegetable stock (see above),  parsley leaves (from above), finely chopped","vegetarian":false,"calories":267.0,"protein":null,"carbs":null,"sugars":null,"total_fat":5.7,"saturated_fat":1.2,"fiber":null,"salt":1.5,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/low_fat_bacon_and_lentil_02962"}