{"recipe_name":"Lush lemon pepper chicken  ","author":"Tom Kerridge","programme":"Tom Kerridge's Best Ever Dishes","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/lush_lemon_pepper_19156_16x9.jpg","method":"For the marinade, mix together all the marinade ingredients in a bowl until well combined.  For the lemon pepper chicken, rub some of the marinade into the scored chicken, then place the chicken breasts in a bowl and pour over the remaining marinade. Cover the bowl with cling film and chill in the fridge for at least 10 minutes and up to two hours.  When the chicken has marinated, preheat the oven to 200C\/400F\/Gas 6.  Arrange the rosemary sprigs and lemon slices in the bottom of a roasting tray. Tip the potatoes into the roasting tray, then place the marinated chicken breasts on top of the potatoes. Give the chicken a final coating of marinade and season, to taste, with salt and freshly ground black pepper. Roast for 30-35 minutes, or until the potatoes and the chicken are cooked (the chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer).   Cover the roasting tray with aluminium foil and set the chicken aside to rest for 10-15 minutes. Just before serving, scatter over the chopped parsley. ","ingredients":" 4 tbsp clear honey,  2 tbsp Dijon mustard,  3 garlic cloves, peeled, grated,  3-4 tsp cracked black pepper, to taste   ,  2 lemons, zest and juice,  4 bone-in chicken breasts, skin removed, each breast scored three or four times using a sharp knife,  4-5 sprigs fresh rosemary,  1 lemon, thinly sliced,  700g\/1½lb baby new potatoes,  salt and freshly ground black pepper ,  handful chopped fresh flatleaf parsley leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/lush_lemon_pepper_19156"}