{"recipe_name":"Mackerel en croûte with gooseberry chutney","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02gbqdm.jpg","method":"For the chutney, heat the sugar in a large, heavy-based pan over a low heat, stirring well until it has melted and turned golden-brown (CAUTION: boiling sugar is extremely hot. Handle very carefully. Use a deep pan to avoid bubbling over.). Stir in the sultanas, thyme, ginger and shallot. Add the cider vinegar and gooseberries to the pan, stir well and bring the mixture to the boil. Reduce the heat and simmer gently for 8-10 minutes, stirring occasionally, until the gooseberries have softened and broken down. Season, to taste, with salt and freshly ground black pepper, then set aside to cool slightly. For the mackerel, preheat the oven to 220C\/200C Fan\/Gas 7. Blend the salmon and lemon juice to a fine paste in a food processor. With the motor still running, gradually add the cream in a thin stream until all of the cream has been incorporated into the mixture and the paste has thickened to a fluffy mousse. Season, to taste, with salt and freshly ground black pepper. One by one, carefully stuff the cavities of the mackerel first with the tarragon leaves, then with the salmon mousse. Roll the pastry out onto a lightly floured work surface to a thickness of 0.5cm\/¼in. Cut the pastry into four rectangles - these should be long enough to wrap around the stuffed fish and half as wide as the fish (about 15cm x 18cm\/6in x 7in).  Brush each pastry rectangle with a little of the beaten egg, then wrap one rectangle around the middle of each fish, pressing the ends of the pastry together underneath the fish to seal (use a little more beaten egg for this if necessary).  Place the wrapped, stuffed fish onto a baking tray.  Wrap the tail of each fish in greased aluminium foil to stop them from burning. Sprinkle a little sea salt over each fish. Bake the stuffed mackerel in the oven for 18-20 minutes, or until the pastry is risen and golden-brown and the fish are cooked through. Remove from the oven and set aside to cool for about five minutes. To serve, cut each mackerel in half and serve with a dollop of gooseberry chutney.  ","ingredients":" 125g\/4½oz caster sugar,  50g\/2oz sultanas,  2 fresh thyme sprigs, leaves only,  40g\/1¾oz piece fresh root ginger, peeled and finely chopped,  ½ shallot, finely chopped,  100ml\/3½fl oz cider vinegar,  300g\/10½oz fresh gooseberries, topped and tailed,  sea salt and freshly ground black pepper,  250g\/9oz salmon fillet, skin and pin bones removed, flesh roughly chopped,  1 lemon, juice only,  110ml\/4fl oz double cream,  4 whole mackerel, heads and guts removed, de-boned (you can ask your fishmonger to do this for you),  4 sprigs fresh tarragon, leaves only,  600g\/1lb 5oz ready-made all-butter puff pastry,  2 free-range egg yolks, lightly beaten,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mackerel_en_crote_with_62948"}