{"recipe_name":"Mackerel, tomato and samphire salad","author":"Nathan Outlaw","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato stock, place the tomatoes, vinegar, garlic, sugar and chilli into a bowl. Season with a bit of salt and stir until well combined. Spoon the tomatoes into a large piece of muslin and hang it over a bowl in the fridge overnight or for at least six hours.  Reserve the liquid collected from the tomatoes (the tomatoes can be used in another recipe). For the sauce, mix the egg yolks, mustard and vinegar together in a bowl until well combined. Slowly whisk in the oil until the mixture thickens into mayonnaise. Whisk in the cream.  Add a ladleful of the reserved tomato stock, then heat the sauce in a saucepan over a low heat, whisking continuously, until warmed through. Heat a frying pan until hot and fry the mackerel, skin-side down, with the bacon for one minute. Add the cherry tomatoes, drizzle with a little oil and a sprinkling of salt and cook for a further 3-4 minutes.  Remove the mackerel and tomatoes from the pan and set aside.  Add the lettuce and samphire to the pan used to cook the fish and cook for one minute. To serve, spoon the tomatoes and lettuce mixture onto serving plates. Top with the mackerel and spoon over the sauce. Sprinkle over the basil leaves. ","ingredients":" 8 ripe vine tomatoes, chopped,  2 tbsp white wine vinegar,  2 garlic cloves, chopped,  1 tbsp sugar,  1 red chilli, de-seeded, chopped,  3 free-range egg yolks,  1 tsp English mustard,  1 tsp white wine vinegar,  300ml\/10½fl oz light olive oil,  50ml\/2fl oz double cream,  2 mackerel, gutted, filleted, pin-bones removed,  4 rashers smoked streaky bacon, grilled until crisp and cut into small pieces,  8 cherry tomatoes,  2 Little Gem lettuces, leaves separated,  110g\/4oz samphire,  10 basil leaves, ripped up","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mackerel_tomato_and_49040"}