{"recipe_name":"Mackerel with asparagus and grapefruit","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mayonnaise, put the egg yolks in a food processor and blend. Add the vinegar and mustard and blend again. Slowly add the oil, until you have a thick mayonnaise. Stir in the half of the grapefruit zest and the crab, reserve the remaining grapefruit zest for the dressing. For the grapefruit dressing, mix the oil with reserved juices from the grapefruit and the reserved grapefuit zest. Add the mustard and whisk.  Preheat the grill to high. Put the mackerel skin side-up on a baking tray and grill for 2-4 minutes. Bring a large pot of water to the boil and blanch the asparagus for 1-2 minutes. Put the iced water into a bowl, then plunge the asparagus into the water. Heat a griddle pan or frying pan and add the butter. Cook the asparagus in the pan for 1-2 minutes, until coloured. Put the asparagus and mackerel on serving plates and top with a spoonful of the mayonnaise. Dot the grapefruit and pomelo segments around the plate and drizzle with the dressing. Garnish with the watercress and serve.  ","ingredients":" 2 egg yolks,  1 tbsp white wine vinegar,  1 tsp Dijon mustard,  200ml\/7fl oz grapeseed oil,  1 pink grapefruit, zest finely grated and fruit segmented, juice reserved,  150g\/5½oz white crab meat,  3 tbsp olive oil,  1 white grapefruit, segmented, juice reserved ,  1 tsp Dijon mustard,  2 whole mackerel, filleted and pin-boned,  1 bunch English asparagus, peeled and trimmed,  iced water, for refreshing,  50g\/1¾oz unsalted butter,  1 pomelo, segmented,  a few watercress leaves, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mackerel_with_asparagus_07149"}