{"recipe_name":"Maldivian prawn curry with flatbreads","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the spice paste. Put the ingredients and a little water in a blender. Blend, adding more water if needed, until a smooth paste is formed. For the tamarind stock, place all of the ingredients in a large pan and simmer for 20-30 minutes.Seive to remove any tamarind pieces. Heat a wok and add the spice paste. Once hot, add 200ml\/7fl oz tamarind stock, the dates and coconut milk and cook for 4-6 minutes. Heat the butter in a frying pan and cook the prawns on each side for 1-2 minutes. Stir the cooked prawns into the curry sauce and cook for a further 1-2 minutes. For the flatbread, place the flour in a medium bowl, add the salt and stir. Add enough water until the flour mix comes to a dough. Knead until smooth and divide into 4 pieces. Roll out each piece into a circle and place on a hot griddle pan one at a time. Turn the bread over once charred marks have appeared and brush with the melted ghee. Place the curry in a shallow serving bowl and garnish with the red amaranth and coriander cress. Place the bread in a separate bowl and serve. ","ingredients":" 3 small onions, finely chopped,  20g\/¾oz grated fresh root ginger,  12 curry leaves,  3 tbsp grated fresh coconut,  5 tbsp coriander seeds,  2 tbsp cumin seeds,  1 tsp black peppercorns,  8 tbsp tamarind pulp,  1litre\/1¾ pints vegetable stock,  1 tbsp garam masala,  1 tbsp chilli powder,  1 tbsp curry powder,  3 dates, chopped,  200ml\/7fl oz coconut milk,  75g\/2¾oz unsalted butter,  600g\/1lb 5oz tiger prawns, heads and shell removed, tails on and cleaned,  200g\/7oz plain flour,  ½ tsp salt,  2 tbsp melted ghee,  2 tbsp red amaranth cress (available online), optional,  2 tbsp coriander cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/maldivian_prawn_curry_80612"}