{"recipe_name":"Malt, chocolate and orange iced ‘beer’ biscuits","author":"Michael","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Makes 24 large beer-mug shaped biscuits","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/malt_chocolate_and_09403_16x9.jpg","method":"Preheat the oven to 175C\/155C Fan\/Gas 4. Line two large baking trays with baking paper. Break the chocolate into small pieces using a food processor or a sharp knife.  Cream the butter and sugar together in a large bowl. Beat in the eggs and the malt extract until smooth. Mix in the flour (reserving 2 teaspoons for dusting), malted drink powder, orange zest and chocolate. Using your hands bring the mixture together to form a dough. If it’s a bit dry add the juice from the orange.  Lightly flour the work surface with some of the remaining flour and roll out the dough to about 5mm thick. Use the beer cutter or template to cut out 24 beer mug biscuits or 48 x 7cm\/2¾in round biscuits. Bake for between 15—20 minutes, or until pale golden-brown. You can bake them in batches if you don’t have enough baking trays. Cool on wire racks while you make the royal icing mixture Put 200ml\/7fl oz water in a bowl and gradually add the royal icing sugar, beating until smooth. It should be fairly thick and hold its shape, but loose enough to pipe.  Divide the icing between three bowls and colour one bowl black, one bright yellow and leave the third white. Transfer the icing to piping bags fitted with small plain nozzles (the nozzle for the black icing should be very fine, but the others can be a little bigger).  When the biscuits are completely cool, draw the outline of the beer mug on each one using the black icing, set aside to dry. Then flood the bottom part of the mug with yellow. Top the beer mug with white and add black details when dried. Place on wire racks to allow the icing to set.  ","ingredients":" 150g\/5½oz dark chocolate (72% cocoa solids),  250g\/9oz unsalted butter,  250g\/9oz golden caster sugar,  2 free-range eggs,  5 tbsp malt extract,  750g\/1lb 10oz self-raising flour,  6 heaped tbsp malted drink powder,  2 oranges, juice and zest only,  1½ tsp vanilla extract,  1kg\/2lb 4oz royal icing sugar,  yellow food colouring,  black food colouring ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/malt_chocolate_and_09403"}