{"recipe_name":"Manchester tart","author":"The Hairy Bikers","programme":"Hairy Bikers' Meals on Wheels","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 48","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Grease three 25cm\/10in tart tins with butter. Heat a medium frying pan and add half the desiccated coconut and toast in a dry pan until golden-brown. Roll out the shortcrust pastry onto a lightly floured work surface to a 5mm\/¼in thickness. Line the prepared tart tins with the pastry. Prick the pastry several times with a fork, then chill in the fridge for 30 minutes. When the pastry cases have rested, place a sheet of greaseproof paper into each one and half-fill with baking beans. Transfer the pastry cases to the oven and bake for 15 minutes.  Remove the greaseproof paper and baking beans and return the pastry cases to the oven for a further 4-5 minutes or until pale golden-brown. Spread the raspberry jam onto the pastry bases in an even layer. Sprinkle over the non-toasted desiccated coconut and half of the fresh raspberries. Set the pastry bases aside. Bring the milk and vanilla essence to the boil in a large pan, then reduce the heat to a simmer and simmer for 1-2 minutes.  In a bowl, beat together the egg yolks and sugar until well combined. Pour the hot milk and vanilla over the egg and sugar mixture, whisking continuously, until the mixture is smooth and well combined. Return the mixture to the pan over a medium heat. Whisk in the cornflour, a tablespoon at a time, until well combined.  Stir continuously until the mixture is thick enough to coat the back of the spoon.  Transfer the custard mixture to a clean bowl and dust with the icing sugar (this prevents a skin from forming on the surface of the custard). Set aside to cool, then chill in the fridge for 30 minutes. Whip the double cream into soft peaks and mix into the chilled custard mixture until well combined. Spoon the custard and cream mixture into the pastry case in an even layer. Sprinkle over the remaining fresh raspberries. Sprinkle with the toasted desiccated coconut and serve immediately. ","ingredients":" butter, for greasing,  18 tbsp desiccated coconut,  1.5kg\/3lb 5oz ready-made shortcrust pastry,  plain flour, for dusting,  600g\/1lb 5oz raspberry jam ,  900g\/2lb fresh raspberries,  1.7 litres\/3 pints full-fat milk,  1½ tsp vanilla essence,  15 free-range eggs yolks,  375g\/13oz caster sugar ,  4 tbsp cornflour,  90g\/3¼oz icing sugar, for dusting,  1.2 litres\/2 pints double cream ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/manchester_tart_97027"}