{"recipe_name":"Banana millionaire's shortbread with banana 'ice cream'","author":"James Martin","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the caramel, place the butter and sugar into a non-stick pan over a low heat, stirring until the butter melts and the sugar dissolves. Add the condensed milk and slowly bring to the boil, stirring continuously, to make the caramel. As soon as the mixture thickens and begins to smell of caramel, remove from the heat. For the shortbread, preheat the oven to 200C\/400F\/Gas 6. Place the butter and sugar into a bowl and whisk together until light and fluffy. Add the cornflour and plain flour and mix to form a smooth dough. Gently knead the dough until it comes together as a ball. Line a 20cm x 30cm\/8in x 12in baking tin with baking parchment. Flatten the dough lightly with a rolling pin, then place the dough into the bottom of the tin, evening it out and into all of the corners. Transfer to the oven and bake for 25 minutes. Remove from the oven and spread the caramelised condensed milk evenly over the top of the shortbread. Return to the oven for 5-6 minutes. Meanwhile, place the chocolate into a bowl and place over a pan of barely simmering water (do not let the water touch the bowl). Cook for 5-8 minutes, or until the chocolate has melted. Remove the shortbread from the oven and place the bananas on top of the caramel. Pour the chocolate over the bananas until they are just covered. Set aside to cool until the chocolate is firm. For the banana 'ice cream', place the bananas onto a baking sheet and place in the freezer. Freeze for at least one hour - until firm. When ready to serve the shortbread, place the frozen banana into a food processor. Add the vanilla essence, caster sugar and buttermilk and blend to a purée. The mixture should be frozen but slightly soft. To serve, cut the shortbread into even squares in the tin. Remove a square and place onto a serving plate. Top with a ball of the banana 'ice cream' and a slice of banana. ","ingredients":" 200g\/7oz unsalted butter,  200g\/7oz caster sugar,  2 x 400g\/14oz cans condensed milk,  250g\/8oz unsalted butter, softened,  150g\/5oz caster sugar,  150g\/5oz cornflour,  300g\/10oz plain flour,  500g\/1lb 2oz milk chocolate, chopped,  6-8 large bananas, peeled and sliced lengthways,  4 bananas, peeled and chopped,  ¼ tsp vanilla essence,  3-4 tbsp caster sugar,  150ml\/5fl oz buttermilk,  1 banana, sliced diagonally","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bananamillionairessh_87979"}