{"recipe_name":"Mango and coconut iles flottante","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the meringue, preheat the oven to 200C\/400F\/Gas 6. Whisk the egg whites in a bowl until soft peaks form when the whisk is removed. Whisk in 100g\/3½oz of the caster sugar, a little at a time, until well combined. Continue to whisk until the egg whites are stiff and glossy. Heat the milk, cream and vanilla seeds in a lidded saucepan until simmering. Lightly oil 2 tablespoons with the vegetable oil and use them to shape quenelles of the meringue mixture.  Carefully place them into the simmering milk. Cover with a lid and poach for 4-5 minutes, or until just cooked through. Remove the meringues form the milk mixture with a slotted spoon and set aside on kitchen paper. Heat the remaining 100g\/3½oz sugar in a frying pan until the sugar become pale golden-brown. Place the base of the frying pan into a larger pan of cold water to stop the caramel cooking, then set aside to cool slightly. Using a potato peeler, peel shavings of coconut flesh and place them onto a baking tray. Toast them in the oven for 3-4 minutes, or until pale golden-brown. For the custard, strain the milk mixture used to cook the meringues into a clean saucepan, return to the heat and add the coconut liqueur. Whisk the egg yolks and sugar in a bowl until well combined. Whisk in the milk mixture until well combined. Return the mixture to the saucepan, add the chopped mango and cook over a low heat, stirring continuously, until the custard has thickened enough to coat the back of a spoon. To serve, spoon the mango custard into serving bowls and place the meringue on top. Scatter over the toasted coconut. Use the back of a spoon to pull strands of the caramel mixture and drizzle over the top of the meringue. ","ingredients":" 4 free-range egg whites,  200g\/7oz caster sugar,  150ml\/5fl oz milk,  150ml \/5fl oz double cream,  ½ vanilla pod, split, seeds scraped,  1 tbsp vegetable oil,  ½ coconut,  2 tsp coconut liqueur,  4 free-range egg yolks,  40g\/1½oz caster sugar,  1 mango, peeled, finely chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mango_and_coconut_iles_39437"}