{"recipe_name":"Mango, hazelnut and rosemary trio of cheesecakes","author":"Tamal Ray","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Makes one 3 tiered cheesecake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. For the granola biscuit base, blend together the sugar, butter and flour in a food processor. Add the oats and pulse to mix. Line the sides and base of the 3 cake tins with baking paper. Press the biscuit mix into the bases of the cake tins and bake for 10 minutes until browned. Brush the surface of the biscuits with egg wash, then bake for another 5 minutes. Set aside to cool.  Reduce the oven temperature to 160C\/140C Fan\/Gas 3. Wrap the outside of all the cake tins in a double layer of aluminium foil. Fill a kettle with water and set to boil. For the mango cheesecake, beat all of the ingredients together in a large bowl until smooth. Pour the mixture into the 20cm\/8in cake tin and place it in a deep roasting dish big enough to accommodate the tin. Add enough boiling water to the roasting dish to come halfway up the side of the cake tin. Bake for approximately 1 hour, or until it is set with a slight wobble. For the hazelnut praline cheesecake, heat the sugar in a pan with just enough water to dissolve the sugar (a few tablespoonsful). Cook until it turns a dark-brown caramel, then remove from the heat and tip in the hazelnuts. Turn out onto a metal baking tray lined with baking parchment. Transfer to a freezer to cool the praline quickly. When set, break the praline into large pieces, transfer to a food processor and break into crumbs.   Heat the crème fraîche and mascarpone in a saucepan over a low-medium heat. Add the praline crumbs and heat gently until the praline has dissolved into the mixture. Stir in the remaining ingredients for the hazelnut praline cheesecake and warm gently. Pour the mixture into the 15cm\/6in cake tin and place the cake tin in a deep roasting dish. Fill the dish with enough boiling water to reach halfway up the sides of the cake tin. Bake for approximately 45 minutes, or until the filling is set with a slight wobble. For the honey and rosemary cheesecake, add the rosemary, crème fraîche and half the mascarpone to a saucepan. Bring to the boil, then reduce the heat to allow the rosemary to infuse for a few minutes. Pass the mixture through a fine mesh sieve to remove the rosemary. Mix the strained mixture with the remaining cheesecake ingredients and warm gently. Transfer to the 10cm\/4in cake tin and place it in a roasting dish. Fill the dish with enough boiling water to reach halfway up the sides of the cake tin. Bake for approximately 30 minutes, or until the filling is set with a slight wobble. Once all the cheesecakes are baked, set them aside in their tins to cool completely (you can do this is the freezer if you’re short of time).  For the decoration, push cocktail sticks into the hazelnuts. In a pan, dissolve the caster sugar with a few tablespoons of water until it forms a caramel. Place a few layers of old newspaper on the floor near the edge of a worktop or table (the caramel coated hazelnuts will hang over the edge so the caramel stretches).  Taking care not to burn yourself, dip the hazelnuts into the caramel. Place on the edge of a table with the hazelnuts hanging over the edge and the cocktail sticks weighed down by something heavy. Leave until the caramel has set. When the cakes are completely cool, remove them from their tins and place on cake boards. Insert 5 dowels into the 20cm\/8in cheesecake and trim to the height of the cheesecake. Do the same with the 15cm\/6in cheesecake but using 4 dowels. Stack the cheesecakes on a serving plate. Place the hazelnut shards on the top of the mango cake surrounding the hazelnut cake. Place edible flowers around the bottom of the mango cheesecake. Insert a few sprigs of rosemary into the top cheesecake. ","ingredients":" 125g\/4½oz light muscovado sugar,  125g\/4½oz unsalted butter,  125g\/4½oz plain flour,  90g\/3¼oz rolled oats,  1 free-range egg, beaten for egg wash,  175g\/6oz mango purée ,  1 tbsp lime juice ,  100g\/3½oz caster sugar,  500g\/1lb 2oz mascarpone,  160g\/5¾oz crème fraîche,  4 medium free-range eggs,  60g\/2¼oz free-range egg yolks (from about 3 medium eggs),  150g\/5½oz granulated sugar,  150g\/5½oz blanched hazelnuts, toasted,  200g\/7oz crème fraîche,  300g\/10½oz mascarpone,  2 medium free-range eggs,  1 medium free-range egg yolk,  1 tbsp lemon juice,  3 tsp chopped rosemary leaves ,  75g\/2½oz crème fraîche,  210g\/7½oz mascarpone,  2 medium free-range eggs,  75g\/2½oz clear honey ,  40g\/1½oz hazelnuts, toasted,  150g\/5½oz caster sugar,  edible flowers, such as violets and pansies ,  bunch rosemary (ideally in flower)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mango_hazelnut_and_82943"}