{"recipe_name":"Maple-glazed turkey with a sweetcorn stuffing","author":"Brian Turner","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the stuffing, heat a little oil in a large frying pan. Add the onion, garlic and green pepper. Gently fry for two minutes without colouring. Pour in the sherry and white wine. Bring to the boil and cook until the volume of liquid has reduced by two-thirds. Remove from the heat and set aside to cool. Season to taste with salt and pepper. When the onion mixture is cool, mix in the sausage meat, sweetcorn and parsley. Set aside. For the glazed turkey, remove the wishbone from the turkey. Turn the turkey on its side and crush to break the back bone.  Push the stuffing into the neck cavity and reshape the turkey into its original shape. Secure the open cavity with string or a skewer. Preheat the oven to 220C\/425F\/Gas 7. Place the turkey on one side in a roasting tray and baste with melted butter. Roast in the oven for 30 minutes. Turn the turkey onto the other side and baste with the juices in the roasting tray. Reduce the oven temperature to 180C\/350F\/Gas 4 and cook for a further 30 minutes.  Turn the turkey on to its back, so the breasts are pointing upwards.  For the glaze, slowly heat the maple syrup and lemon juice. Brush the turkey breasts with the glaze and the juices from the roasting tin. Return to the oven for about four hours. Check the turkey is cooked by piercing a leg – if the juices run clear it’s ready. Remove from the roasting tray and set aside, covered in a warm place, to rest for 15 minutes before carving. For the gravy, place the roasting tray over a medium heat and add the chopped onion. Cook for 3-4 minutes, or until soft and golden-brown. Strain off any excess fat, return the onions to the roasting tin (if removed during straining) and add the white wine and chicken stock. Bring to the boil, season with salt and pepper, and add a little potato flour to thicken (if desired). Strain and pour into a jug. Serve the turkey in slices with the gravy. ","ingredients":" vegetable oil, for frying,  1 red onion, finely chopped,  2 garlic cloves, crushed,  1 green pepper, finely chopped,  2 tbsp dry sherry,  ½ glass dry white wine,  salt and pepper,  225g\/8oz sausage meat,  1 x 280g\/10oz tin sweetcorn,  2 tbsp chopped parsley,  1 x 5.4kg\/12lb turkey,  175g\/6oz melted butter,  2 tbsp maple syrup,  1 tbsp lemon juice,  salt and pepper,  ½ onion, chopped,  1 glass dry white wine,  300ml\/½ pint chicken stock,  potato flour, to thicken (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/maple_glazed_turkey_with_15074"}