{"recipe_name":"Maple pulled pork with BBQ-style beans, chilli cornbread and an apple and pecan slaw","author":"Allegra McEvedy","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. Meanwhile heat a large frying pan and add the oil. Once hot, fry the onion for 3-4 minutes.  Add the garlic, cumin, coriander, cinnamon, smoked paprika and tomato purée and cook for three minutes. Add the vinegar, sugar, tomatoes, maple syrup and 250ml\/9fl oz water, and cook for 20-30 minutes. Score the pork with a sharp knife and rub with salt and pepper. Heat a griddle pan and fry on the skin side for 4-5 minutes. Place the scored pork in a deep roasting tin and add the maple syrup mixture.  Set aside while you make the cornbread To make the chilli cornbread, place the butter in a small saucepan and melt. Pour it in a 20cm\/8in square cake tin. Pour the cornmeal, flour, baking powder and salt in a large mixing bowl and add the sugar, chilli and spring onions and stir. In a separate bowl, whisk together the eggs and milk.  Gradually add the wet ingredients to the dry and mix with a wooden spoon. Pour the mixture into the prepared cake tin and bake for 20 minutes. When the cornbread is golden brown and springy to the touch, remove and leave to cool.  At the same time, place the glazed pork belly in the hot oven for 30 minutes, then reduce the oven temperature to 150C\/300F\/Gas 3 and cook for 3½ hours. For the beans, place a saucepan on on a medium heat and add the oil. Once hot, add the onion and fry for three minutes. Add the garlic and red chilli and cook for a further three minutes, stirring frequently so the garlic does not burn. Add the chopped tomatoes, ketchup, barbecue sauce, mustard and drained beans. Bring to the boil, reduce the heat and cook for 40 minutes. For the sweet potatoes, heat a griddle pan, add the sliced sweet potatoes to the pan and cook either side for 4-5 minutes to get char-marks. Place in the oven for 20-30 minutes, or until tender. For the apple and pecan slaw, place the apples, chicory and pecans into a large bowl. Whisk the crème fraîche, lemon juice and oil in a separate bowl. Set aside. Remove the pork from the oven and leave until cool enough to handle. Pour off the sauce into a saucepan, place on the heat and cook until the volume of liquid has reduced by half.  Remove all the fat from the pork and pull it into pieces. Just before serving, add the dressing to the apple and pecan slaw and mix well. Serve the pork with the cornbread, beans, slaw and sauce. Top each serving of pork with a sprig of coriander. ","ingredients":" 1 tbsp olive oil,  1 onion, finely chopped,  2 garlic cloves, finely chopped,  1 tbsp ground cumin,  1 tbsp ground coriander,  1 tsp ground cinnamon,  1 tsp smoked paprika,  1 tbsp tomato purée,  50ml\/2fl oz cider vinegar,  50g\/1¾oz soft brown sugar,  400g\/14oz tinned chopped tomatoes,  150ml\/5fl oz maple syrup,  1kg\/2lb 4oz belly pork,  1 tbsp salt,  1 tbsp freshly ground black pepper,  4 tbsp butter,  200g\/7oz cornmeal,  65g\/2¼oz plain flour,  1½ tsp baking powder,  1 tsp salt,  35g\/1oz caster sugar,  1 red chilli, finely chopped,  1 bunch spring onions, finely chopped,  3 medium free-range eggs, beaten,  160g\/5½oz whole milk,  1 tbsp vegetable oil,  1 onion, finely chopped,  1 garlic clove, finely chopped,  1 red chilli, finely chopped,  400g\/14oz tinned chopped tomatoes,  2 tbsp tomato ketchup,  2 tbsp barbecue sauce,  1 tsp English mustard powder,  300g\/10½oz tinned kidney beans, drained,  300g\/10½oz tinned black beans, drained,  300g\/10½oz tinned haricot beans, drained,  450g\/1lb sweet potatoes, skin on, cut into 2cm\/¾in slices,  2 tbsp olive oil,  4 Granny Smith apples, cored and thinly sliced,  4 white chicory, leaves separated,  120g\/4¼oz pecan nuts,  200ml\/7fl oz crème fraîche,  1 lemon, juice only,  50ml\/2fl oz olive oil,  4 sprigs fresh coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/maple_pulled_pork_with_23642"}