{"recipe_name":"Fideuà ","author":"Maria Grimwood","programme":"Nigel Slater: Eating Together","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/marias_fideu_61565_16x9.jpg","method":"For the stock, place the grated tomato skins in a large saucepan, reserving the flesh for later, with the rest of the stock ingredients and bring to the boil. Reduce the heat until the mixture is simmering, then continue to simmer for 30 minutes. Strain the stock and reserve the liquid. For the fideuà, heat half of the oil in a paella pan or large, heavy-based, shallow frying pan over a medium heat. Add the monkfish and prawns and fry for 1-2 minutes on each side, until browned on both sides, adding more oil if necessary. Remove from the pan and set aside. Heat the remaining oil in the frying pan, add the onions and fry for 3-4 minutes, or until softened. Add the garlic, tomato flesh and squid and continue cook over a low heat for 6-7 minutes, or until the squid is opaque. Add the ñora peppers and the noodles, mix well, and continue to cook for a further 2-3 minutes, or until the noodles are covered in the oil. Sprinkle over the smoked paprika. Pour in the stock and bring the mixture to a simmer. Simmer for 10 minutes. Return the monkfish and the prawns to the pan, then arrange the mussels over the top of the fideuà. Season, to taste, with salt and freshly ground black pepper, then cover the pan tightly with aluminium foil or greaseproof paper and continue to simmer for a further 4-5 minutes, or until the mussels have opened (discard any mussels whose shells do not open during cooking). Meanwhile, for the picada, grind the almonds and the chopped parsley in a mortar and pestle as finely as possible. To serve, sprinkle the picada over the fideuà, garnish with lemon wedges and spoon onto serving plates. ","ingredients":" 6 tomatoes, grated,  3 garlic cloves, skins left on, crushed,  2 onions, roughly chopped,  2 dried ñora peppers,  monkfish head and bones (or other white fish bones),  1.5 litres\/3¼ pints boiling water,  1 lemon, juice only,  pinch salt ,  4 tbsp olive oil ,  1 whole monkfish tail, cut into large chunks,  12 king prawns,  2 onions, finely chopped,  4 garlic cloves, finely chopped,  2 squid, cleaned, spines removed, flesh roughly chopped,  2 dried ñora peppers, finely chopped (available from Spanish delicatessens and online specialists),  500g\/1lb 2oz short vermicelli noodles (called 'fideo' in Spain),  2 tbsp smoked paprika,  400g\/14oz mussels, scrubbed and de-bearded (discard any mussels that do not shut tightly when tapped firmly),  salt and freshly ground black pepper,  100g\/3½oz almonds,  4 tbsp chopped fresh parsley,  2 lemons, cut into wedges, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/marias_fideu_61565"}