{"recipe_name":"Beef tartar, tomato jelly and sourdough crisps","author":"Kenny Atkinson","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato jelly, put all of the ingredients, except the gelatine, in a bowl and mix until well combined. Transfer the mixture to a blender and blitz to a pulp. Pour the pulp into a muslin cloth. Tie the cloth and hang it over a bowl overnight. Measure 250ml\/8½  of the water collected in the bowl and lightly warm through in a saucepan. Add in the geletine and stir.  Line a flat tray with cling film and pour in the water mixture. Place in the fridge to set.  For the spiced tomatoes, whisk together the ketchup, mustard, Worcestershire sauce, Tabasco and rapeseed oil until emulsified.  Put the plum tomatoes and chives in a bowl and bind with a little of the ketchup mixture, the remaining mixture can be used to make a sauce. For the beef tartar, put the beef fillet in a bowl. Add the shallot, gherkin, capers and parsley. Add a little of the tomato sauce and season with salt and pepper. For the sourdough crisps, preheat the oven to 150C\/130C Fan\/Gas 2. Place the sourdough slices on a baking tray and drizzle with the oil. Season with salt and pepper. Bake until crisp, then remove and leave to cool. Meanwhile cut 6 circles from the set jelly. To serve, place 3 circles of jelly on a plate and top with the beef tartare and spiced tomatoes. Place the remaining jelly circles on top and spoon over the caviar. Dress the plate with the sourdough crisps, leaves and a drizzle of olive oil.  ","ingredients":" 55g\/2oz tomato ketchup,  7gm Dijon mustard (about 1 teaspoon),  few drops Worcestershire sauce,  6 drops Tabasco,  50ml\/2fl oz rapeseed oil ,  2 plum tomatoes, skinned, seeds removed and diced,  large pinch finally chopped chives,  175g\/6oz aged beef fillet, finely chopped,  1 small banana shallot, peeled and finely chopped,  1 small gherkin, finely chopped,  1 tsp mini capers, washed,  pinch finely chopped flat leaf parsley,  1 tsp of spiced tomatoes (see above),  1kg\/2lb 4oz plum tomatoes ,  20g\/¾oz celery, roughly chopped,  5g\/⅛ garlic (about 1 clove), roughly chopped,  10g\/¼oz shallots, roughly chopped,  sprig thyme,  sprig tarragon,  2 sprigs basil,  pinch of salt,  pinch of sugar,  pinch of cayenne pepper ,  splash of Worcestershire sauce,  4 drops Tabasco,  10g gelatine,  ¼ loaf sourdough, finely sliced,  olive oil, for drizzling,  Oscietra caviar,  micro-rocket cress,  baby rocket,  baby lemon balm","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/marinated_beef_tartare_10869"}