{"recipe_name":"Marinated Ibérico pork fillet with sautéed potatoes and pimentón","author":"José Pizarro","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pork, preheat the oven to 200C\/180C Fan\/Gas 6. Mix together all of the pork ingredients, except for the pork, in a large bowl until well combined. Add the pork fillets and coat them in the mixture. Chill in the fridge for at least 12 hours, to marinate. When the meat has marinated, remove it from the fridge and set aside until is has returned to room temperature.  Heat an ovenproof frying pan over a medium heat. When the pan is hot, remove the pork fillets from the marinade, shaking off any excess, and fry for 1-2 minutes on each side, or until browned on all sides.  Transfer the pan to the oven and cook the pork fillets for a further 5 minutes (if you are using ibérico pork, the fillets will only need cooking in the oven for 2 minutes). Remove the meat from the pan and set aside on a warm plate for 5 minutes, to rest. Reserve the pan juices. Meanwhile, for the potatoes, boil the potato slices in a pan of salted water for 1-2 minutes, or until just tender. Drain well. Heat the oil in a frying pan over a medium heat, then add the drained potatoes and fry for 2-3 minutes, or until just coloured.  Add the onion and garlic and continue to fry for 1-2 minutes, or until golden-brown. Season, to taste, with salt and freshly ground black pepper. To serve, divide the potato mixture equally among 4 serving plates. Carve each pork fillet into slices and arrange the slices on top of the potatoes. Drizzle the pan juices and a splash of olive oil around the edge of each plate. Garnish with the thyme leaves. ","ingredients":" 3 tbsp extra virgin olive oil,  1 tsp bittersweet smoked paprika, plus extra to serve,  2 sprigs fresh oregano, leaves only, chopped,  1 garlic clove, finely chopped,  ½ tsp ground cumin,  4 x 250g\/9oz pork fillets (preferably Ibérico pork),  1kg\/2lb 4oz waxy potatoes, such as Desirée potatoes, peeled, cut into 7-8mm-thick slices,  2 tbsp olive oil, plus extra to serve,  1 small onion finely sliced,  3 garlic cloves, finely sliced ,  4 sprigs fresh thyme, leaves only, to serve ,  salt and freshly ground black pepper ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/marinated_iberico_pork_50937"}