{"recipe_name":"Marinated ribs with tomatillo salsa, guacamole and tortilla chips","author":"Matt Tebbutt","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the ribs into a large tray and add the remaining ingredients, reserving half the chilli for the salsa, and stir to combine. Leave to marinade at room temperature for at least 1 hour. For the tortilla chips, preheat the oven to 200C\/180C Fan\/Gas 6. Cut the tortillas into triangles, place on a baking tray and drizzle with the oil. Bake for 6–8 minutes. For the salsa, place the corn onto a large griddle pan and cook until browned all over. Remove the kernels and place into a large bowl. Add the remaining ingredients and the reserved chilli and mix. For the guacamole, put all the ingredients into a pestle and mortar and pound to combine. To cook the ribs, heat a large griddle pan over a high heat add the ribs and cook on each side of 1–2 minutes. Warm through the left over marinade in a small saucepan. Place the cooked ribs, salsa, guacamole and tortilla chips onto a large serving plate. Drizzle the warm marinade over the ribs and serve. ","ingredients":" 4 beef ribs, cut widthways to 1cm\/½in thickness,  1 bunch of coriander, stalks and leaves finely chopped,  4 limes, juice only,  2 banana shallots, chopped,  4 tbsp olive or avocado oil,  1-2 tsp ground cumin,  ½ tsp ground coriander,  3 garlic cloves, chopped,  1 jalapeño chilli, chopped ,  6 corn tortillas,  2 tbsp vegetable oil,  2 corn on the cobs, left whole but husks removed,  4 tomatillos, finely chopped,  1 garlic clove, finely chopped,  2 tbsp finely chopped coriander,  2 tbsp white wine vinegar,  pinch sugar,  pinch salt,  1 ripe avocado, flesh chopped,  ½ green chilli, finely chopped,  ½ red onion, very finely chopped,  lime juice, to taste,  2 tbsp chopped coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/marinated_ribs_with_55287"}