{"recipe_name":"Marinated griddled swordfish with roasted baby sweetcorn and chilli, orange and coriander salsa","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the marinated swordfish, place all the ingredients for the marinade, except the swordfish, into a shallow dish and mix well. Add the swordfish, turning to coat, and leave to marinate for ten minutes. For the roasted baby sweetcorn, place the sweetcorn into a small ovenproof dish and drizzle with olive oil. Season well with salt and freshly ground black pepper, then roast in the oven for 6-8 minutes, or until tender and lightly charred. For the salsa, place the orange segments and coriander into a bowl with the olive oil and green chilli. Season, to taste, with salt and freshly ground black pepper and stir well. When the baby sweetcorn is cooked, fold into the salsa and set aside to allow the flavours to develop. Heat a griddle pan until smoking hot. Drain the swordfish of any excess marinade and place onto the griddle pan, along with the lime wedges. Griddle the swordfish for 2-3 minutes on each side, or until cooked through but still very moist - this will depend on the thickness of the fillet. Remove the lime wedges once they're lightly charred. To serve, spoon the baby sweetcorn with the chilli, orange and coriander salsa onto a serving plate and place the griddled swordfish on top. Garnish with the griddled lime wedges. ","ingredients":" 2 tbsp olive oil,  2 garlic cloves, finely chopped,  1 lime, juice and finely grated zest,  1 tbsp dark soy sauce,  ½ green chilli, deseeded and finely chopped,  freshly ground black pepper ,  1 swordfish steak,  70g\/2½oz baby sweetcorn,  1 tbsp olive oil,  salt and freshly ground black pepper,  1 orange, segmented,  large handful fresh coriander leaves, roughly chopped,  1 tbsp olive oil,  ½ green chilli, deseeded and finely chopped ,  salt and freshly ground black pepper,  lime wedges, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/marinatedgriddledswo_87814"}