{"recipe_name":"Marmitako (Basque fish stew)","author":"Nieves Barragán","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fish stock, clean the gills of the fish, ensure that there is no blood whatsoever. Heat the olive oil in a large pan. Gently cook the vegetables, add the fish head and bones, 3 litres\/5¼ pints of water and a bay leaf. Heat the stock so it is steaming, but do not boil, for 20 minutes. Pass through a sieve and set aside. For the marmitako, in a large saucepan heat the olive oil. Gently fry the onion and garlic. When half softened, add the red pepper and cook for 2 minutes, then add the padron pepper. When everything is soft add the chilli and tomato sauce.  Cook out the acidity and water of the tomato so that it is almost like a paste. Add the choriceros paste and the wine. Cook off the alcohol for a few seconds and then add the potato chunks and season with salt and pepper. Pour in 200ml\/7fl oz of the fish stock and add a bay leaf. It should take around 20 minutes for the potatoes to cook.  Meanwhile in a separate pan, heat until very hot, add 75ml\/2½fl oz of olive oil and quickly flash fry the bonito (or tuna) to caramelise it on the outside but keep it raw in the middle. Once the potatoes are cooked, add the fish to the stew, gently mix it in and take the pan off the heat. Put the lid on and leave it to stand for 10 minutes. After ten minutes give it a gentle shake. Mix the chopped parsley into the stew, drizzle with olive oil and serve. For the baby gem salad, in a small bowl, mix the olive oil and vinegar until they emulsify, add the shallot and chives and season. Add the piquillo peppers and mix gently so that they don’t break up.  To serve, place a few leaves on a plate and drizzle with the dressing. Place some more leaves on top and drizzle again and so on, so that the leaves remain crisp. Season with salt and pepper. Serve the marmitako in bowls with the salad alongside. ","ingredients":" head and bones of the bonito (see below), or you can use hake or cod head and bones (you can get these from the fishmonger),  2 tbsp olive oil,  1 leek, roughly chopped,  1 carrot, roughly chopped,  1 clove garlic, very finely chopped,  1 onion, roughly chopped,  1 bay leaf,  1 tbsp olive oil,  2 garlic cloves, crushed,  1 onion, very finely chopped,  1 large Italian red pepper (around 200g\/7oz) very finely chopped,  200g\/7oz padron pepper, very finely chopped,  1 red chilli, finely chopped with seeds removed,  5-6 ripe plum tomatoes, grated, to make a sauce,  2 dried choriceros peppers, soaked in water.  Butterfly the peppers and scrape the paste from the inside with a spoon, leaving the skin (if you can’t get the peppers you can buy the paste),  200ml\/7fl oz Txakoli (a Basque wine), or other dry, slightly sparkling white wine,  1kg\/2lb 4oz potatoes, peeled, cut into chunks the same size as the fish,  1 bay leaf,  75ml\/2½fl oz extra virgin olive oil,  2kg\/4lb 8oz bonito (if you can’t get hold of one, use 1kg\/2lb 4oz of fresh tuna) cut into large chunks ,  bunch of parsley, roughly chopped,  150ml\/5fl oz extra virgin olive oil,  50ml\/2fl oz Moscatel vinegar,  1 shallot, very finely chopped,  small bunch of chives, finely chopped,  3 sweet Basque piquillo peppers (from a jar), cut into strips ,  2 heads of Little Gem, leaves only,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/marmitako_46210"}