{"recipe_name":"Bangladeshi venison curry","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the garam masala paste, blend or pound the ingredients for the garam masala with 50ml\/2fl oz water to make a paste. For the Bangladeshi venison curry, heat the oil in a large saucepan and fry the onions gently until lightly coloured. Add the ginger-garlic paste and cook for 2-3 minutes to cook out the raw flavours, then add the garam masala paste and salt to taste. Cook, stirring, for a further 3-4 minutes or until fragrant. Add the ground spices, tomatoes and stir to mix. Pour in about 750ml\/1¼ pints of water. Bring to the boil, then cook on a low heat until the sauce has thickened. Add the chopped coriander a few minutes from the end of the cooking time. For the venison, preheat the oven to 240C\/450F\/Gas8. Heat a medium frying pan and add the oil, place the venison fillet in the pan and cook for a couple of minutes on each side then place in oven for eight minutes. Remove from the oven and leave to rest for 10 minutes before serving. Serve the sauce on plates, and cut the venison into batons and arrange the venison pieces on top of the sauce and garnish with coriander cress. Serve with steamed basmati rice. ","ingredients":" 1 bay leaf,  10 black peppercorns,  5cm\/2in piece of cinnamon stick,  6 green cardamom pods,  4 cloves,  ¼ tsp grated nutmeg,  1 blade of mace,  2 garlic cloves, peeled,  1 tbsp vegetable oil,  2 tbsp vegetable oil,  3 onions, finely sliced,  1 tbsp ginger-garlic paste (pound equal quantities of garlic and ginger with a little water),  salt, to taste,  1 tsp red chilli powder,  1 tsp ground cumin,  1 tsp ground coriander,  1 tsp medium curry powder,  3 plum tomatoes, roughly chopped,  2 tbsp finely chopped fresh coriander,  2 tbsp vegetable oil,  500g\/1lb 2oz venison fillet,  4 tbsp coriander cress, to garnish,  steamed basmati rice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bangladeshi_venison_74580"}