{"recipe_name":"Mary Berry's hot cross buns","author":"Mary Berry","programme":"Mary Berry's Easter Feast","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Makes 12 buns","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mary_berrys_hot_cross_65003_16x9.jpg","method":"Put the flour, sugar, spices and lemon zest into a large bowl and mix together. Then add the salt and yeast, placing them on opposite sides of the bowl. Melt the butter in a pan and warm the milk in a separate pan. Add the butter and half the tepid milk to the dry ingredients. Add the egg and use your hands to bring the mixture together, incorporating the flour from the edges of the bowl as you go. Gradually add the remaining milk, to form a soft pliable dough (you may not need all of the milk). Tip the dough out on to a lightly floured work surface. Knead by hand incorporating the sultanas and mixed peel into the dough. Lightly knead for 10 minutes until silky and elastic and forming a smooth ball. The kneading can also be done in a food mixer with a dough hook. Oil a bowl and place the dough in a bowl, cover with cling film and leave to rest in a warm place for about 1½ hours or until doubled in size. Turn the dough out on to a floured surface and divide into 12 balls. Line 1-2 baking trays with paper and place the balls on the tray, placing them fairly close together and flattening them slightly. Slip each baking tray into a large clean polythene bag, making sure the bag doesn’t touch the buns. Leave for 40-60 minutes until the buns have doubled in size. Preheat the oven to 220C\/200C Fan\/Gas 7. For the topping, add the flour to a bowl with 100ml\/3½fl oz water. Mix together to make a paste and spoon into the icing bag.  When the buns have risen remove the polythene bags and pipe a cross on each bun. Bake for 15-20 minutes until pale golden-brown, turning the baking trays round halfway through if necessary.  Melt the golden syrup in a pan and while the buns are still warm, brush the buns with a little syrup to give a nice shine, before setting aside to cool on a wire rack.  ","ingredients":" 500g\/1lb 2oz strong white flour, plus extra for dusting,  75g\/2¾oz caster sugar,  2 tsp mixed spice powder,  1 tsp ground cinnamon,  1 lemon, finely grated zest only,  10g\/¼oz salt,  10g\/¼oz fast-action dried yeast,  40g\/1½oz butter,  300ml\/10fl oz milk,  1 free-range egg, beaten,  200g\/7oz sultanas,  50g\/1¾oz finely chopped mixed peel,  oil, for greasing,  75g\/2¾oz plain flour,  2 tbsp golden syrup, for glazing","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mary_berrys_hot_cross_65003"}