{"recipe_name":"Mary Berry's perfect Victoria sandwich","author":"Mary Berry","programme":"The Mary Berry Story","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 12 slices","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mary_berrys_perfect_34317_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4.  Grease and line 2 x 20cm\/8in sandwich tins: use a piece of baking or silicone paper to rub a little baking spread or butter around the inside of the tins until the sides and base are lightly coated. Line the bottom of the tins with a circle of baking or silicone paper (to do this, draw around the base of the tin onto the paper and cut out). Break the eggs into a large mixing bowl, then add the sugar, flour, baking powder and baking spread.  Mix everything together until well combined. The easiest way to do this is with an electric hand mixer, but you can use a wooden spoon. Put a damp cloth under your bowl when you’re mixing to stop it moving around. Be careful not to over-mix – as soon as everything is blended you should stop. The finished mixture should be of a soft ‘dropping’ consistency – it should fall off a spoon easily. Divide the mixture evenly between the tins: this doesn’t need to be exact, but you can weigh the filled tins if you want to check. Use a spatula to remove all of the mixture from the bowl and gently smooth the surface of the cakes. Place the tins on the middle shelf of the oven and bake for 25 minutes. Don't be tempted to open the door while they're cooking, but after 20 minutes do look through the door to check them. The cakes are done when they’re golden-brown and coming away from the edge of the tins. Press them gently to check – they should be springy to the touch. Remove them from the oven and set aside to cool in their tins for five minutes. Then run a palette or rounded butter knife around the inside edge of the tin and carefully turn the cakes out onto a cooling rack.  To take your cakes out of the tins without leaving a wire rack mark on the top, put the clean tea towel over the tin, put your hand onto the tea towel and turn the tin upside-down. The cake should come out onto your hand and the tea towel – then you can turn it from your hand onto the wire rack. Set aside to cool completely. To assemble the cake, place one cake upside down onto a plate and spread it with plenty of jam. If you want to, you can spread over whipped cream too. Top with the second cake, top-side up. Sprinkle over the caster sugar. ","ingredients":" 4 free-range eggs,  225g\/8oz caster sugar, plus a little extra for dusting the finished cake,  225g\/8oz self-raising flour,  2 tsp baking powder ,  225g\/8oz baking spread, margarine or soft butter at room temperature, plus a little extra to grease the tins,  good-quality strawberry or raspberry jam,  whipped double cream (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mary_berrys_perfect_34317"}