{"recipe_name":"Banh xeo (crispy pancake)","author":"Tony Singh","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dipping sauce, pour 120ml\/4fl oz water into a bowl. Add the sugar and whisk until dissolved.  Stir in the fish sauce and lime juice. Using a pestle and mortar, bash the garlic and chilli together until well combined.  Mix into the fish sauce and add the julienned carrot. Set aside. For the banh xeo, mix the rice flour, cornflour and turmeric together. Season with a pinch of salt and pepper. Stir in the coconut milk and 310ml\/10½fl oz water to make a thin batter. Set aside. Heat a little peanut oil in a lidded non-stick frying pan set over a high heat. When hot, add shallot and garlic, and cook until fragrant, but not coloured. Add the sliced pork and fry for a few minutes, until cooked through. Add the prawns and fry until cooked through. Transfer to a bowl. Add a ladleful of the batter and about an eighth of the filling mixture. Cover the pan with the lid. Cook until golden-brown and crisp on the under-side. Put some beansprouts on one half of the pancake. Replace the lid and cook for another minute. Remove from the heat and fold the pancake in half. Repeat with the remaining batter and filling to make eight pancakes. To serve, divide the lettuce leaves between serving plates. Top each leaf with some cucumber, mint and coriander. Finely slice the pancakes and divide between the lettuce leaves. Serve with the dipping sauce in a bowl. ","ingredients":" 2 tbsp caster sugar,  4 tbsp fish sauce,  1 lime, juice only,  3 garlic cloves,  1 bird’s-eye chilli ,  1 carrot, julienned,  220g\/8oz rice flour,  2 tbsp cornflour,  1 tsp turmeric,  1 x 400ml tin coconut milk,  2 tbsp peanut oil,  4 banana shallots, halved and cut into thin wedges,  4 garlic cloves, finely chopped,  300g\/10½oz pork loin, thinly sliced,  12 king prawns, peeled, halved,  130g\/4½oz beansprouts,  1 Cos lettuce, washed and leaves separated,  1 cucumber, cut into thin batons,  bunch fresh mint,  bunch fresh coriander,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/banh_xeo_crispy_pancake_58695"}