{"recipe_name":"Mary’s tarte tatin","author":"Mary Berry","programme":"The Great Sport Relief Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the pastry. Freeze the butter and lard until very cold.   Measure the flour into a bowl and grate the butter and lard into the flour.  Use a knife to coat the butter and lard in the flour.  Add  4-5 tbsp cold water and mix to a firm dough until it comes together. Roll out the pastry on a floured work surface to a rectangle.  Fold one third down and then fold the bottom third up and over the top fold.  Turn it 90 degrees (a quarter turn) and repeat the rolling and folding.  Set aside, covered, in the fridge for 20 minutes.  Repeat the rolling, folding and chilling twice more so you have a total of four folds and turns. Preheat the oven to 220C\/425F\/Gas 7. For the caramel, place the granulated sugar and 6 tbsp water into a stainless steel pan.  Stir over a low heat until the sugar has dissolved and there are no granules.  Remove the spoon and increase the heat.  Boil until a golden straw colour and immediately pour into a 23cm\/9in fixed-base deep sponge sandwich tin.  Don’t get it too dark or it will be bitter – this is very important! For the topping, core the apples then thinly slice.  Arrange a layer over the caramel in the tin in a circular pattern – start from the outside of the tin and work inwards.  Toss the remaining apples in the lemon zest and juice, scatter in the tin and press down. Roll out the pastry to a round, slightly bigger than the tin.  Cover the apples and tuck the edges of the pastry down around the apples.  Make a small cross in the top of the pastry to let the steam out. Bake for about 40 minutes until the pastry is crisp and golden-brown and the apples are soft.   To finish, before turning the tarte out, tip the juices from the tin into a saucepan.  Add the caster sugar and boil until syrupy. Turn the tarte tatin out onto a plate and spoon the syrup over the apples. Serve with cream or crème fraîche.   ","ingredients":" 100g\/4oz plain flour,  50g\/2oz butter (in a block),  25g\/1oz lard (in a block),  175g\/6oz granulated sugar,  900g\/2lb red dessert apples,  finely grated zest and juice of 1 lemon,  75g\/3oz caster sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/marys_tarte_tatin_89344"}