{"recipe_name":"Banoffee cheesecake with ginger crumb, caramelised bananas and banana tarte tatin","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the banoffee cheesecake, put the ginger cake in a food processor and whizz to crumbs. Set aside. Put the cream cheese, crème fraîche, double cream, icing sugar and maple syrup in a large bowl and mix. Gently stir in the tinned caramel to create a ripple effect. Refrigerate until ready to serve. For the caramelised bananas, cook the 200g\/7oz caster sugar in a large frying pan over a low-medium heat without stirring until it has melted. Increase the heat until the caramel turns a light golden-brown. Remove from the heat, add the bananas and, using two spoons, carefully coat them in the caramel. (CAUTION: boiling sugar is extremely hot. Handle very carefully.) Put the bananas in the bowl of iced water to set. For the banana tarte tatin, put the flour in a mound on a clean work surface and make a well in the centre. Add the salt and 250g\/9oz of the butter to the well. Work the flour into the butter using the fingertips of one hand, gradually drawing the flour into the centre with the other hand. When the cubes of butter have become small pieces and the dough is grainy, gradually work in the water until it is all incorporated. Don’t overwork the dough – you should have a marbled effect with the butter. Roll the mixture into a ball, wrap in cling film and refrigerate for 20 minutes.  Lightly flour a clean work surface and roll out the pastry to a 40x20cm\/16x8in rectangle. Fold the top third down to the centre, then the bottom third up and over that. Give it a quarter-turn. Roll the pastry into a 40x20cm\/16x8in rectangle as before, and fold it into three again. These are the first two turns. Wrap the block in cling film and refrigerate it for 30 minutes. Give the pastry another two turns, rolling and folding as before. This makes a total of four turns. Wrap it in cling film and refrigerate for at least 30 minutes.  Preheat the oven to 200C\/180C Fan\/Gas 6. Divide the 115g\/4oz caster sugar evenly between two very small ovenproof frying pans (alternatively use one large frying pan). Cook over a low heat without stirring until the sugar has melted. Increase the heat until the caramel turns a light golden-brown. Remove from the heat, put half the remaining butter in each pan and stir gently. Carefully arrange the sliced bananas in each pan. On a lightly floured work surface, roll out the pastry to the thickness of a pound coin. Cut out two circles slightly larger than the circumference of the small frying pans (or one circle if using a single larger pan). Any leftover pastry can be frozen and used in other dishes. Cover each pan with a pastry round, pushing the edges down around the bananas. Bake for 10-12 minutes, or until the pastry is golden-brown and cooked through. Remove from the oven and set aside to cool slightly. To serve, invert a plate over the frying pans and turn out the tarts. Put a pile of ginger cake crumbs on each plate and a quenelle of the cream cheese mixture on top. Place a few chunks of caramelised banana next to it. Garnish with fresh mint. ","ingredients":" 125g\/4½oz ginger cake,  300g\/10½oz cream cheese,  50g\/1¾oz crème fraîche,  50ml\/2fl oz double cream,  4 tbsp icing sugar,  1 tbsp maple syrup,  225g\/8oz tinned caramel or dulce de leche,  4 sprigs fresh mint, to decorate,  200g\/7oz caster sugar,  2 large bananas, peeled and cut into chunks,  iced water, in a bowl,  250g\/9oz plain flour, plus extra for dusting,  ½ tsp salt,  275g\/9¾oz cold butter, cut into small cubes,  125ml\/4fl oz iced water,  115g\/4oz caster sugar,  2-3 small bananas, peeled and sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/banoffee_cheesecake_with_11022"}