{"recipe_name":"Masala chops with fried rice","author":"Daksha Mistry","programme":"MasterChef","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chops, in a large bowl, combine the ground coriander, ground cumin, garam masala, turmeric, garlic, ginger, chilli powder, chopped chilli and salt. Rub the mixture into the lamb chops and leave to marinate for at least half an hour. Preheat the oven to 180C\/350F\/Gas 4. For the fried rice, wash the rice several times until the water runs clear. Heat the oil and ghee in a lidded pan, then add the cumin seeds, mustard seeds and curry leaves. When they start to pop, add the chopped onion and fry for several minutes until golden brown. Stir in the spices and garlic and cook for a minute or so. Add the peas, then stir in the washed rice and the water together with a pinch of salt. Cover and cook for 15 minutes. Sear the marinated lamb in a frying pan for a few minutes, then place in the oven for 10 minutes or until thoroughly cooked through. For the coriander and mint mixture, place the fresh coriander, mint, garlic, lemon juice, chilli, sugar and oil in a food processor and blend until well combined. Serve the lamb chops with the coriander and mint mixture and the fried rice. ","ingredients":" 2 tsp ground coriander ,  2 tsp ground cumin ,  ½ tsp garam masala ,  ½ tsp turmeric ,  1 clove garlic, crushed,  1 thumb-sized piece root ginger, finely chopped,  ¼ tsp red chilli powder,  1 green chilli, finely chopped,  salt,  2 lamb chops ,  350g\/12oz basmati rice,  5 tbsp sunflower oil,  2 tbsp ghee,  ½ tsp cumin seeds,  ½ tsp mustard seeds,  5 curry leaves,  1 medium onion, chopped,  1 tbsp ground coriander ,  1 tsp ground cumin ,  ¼ tsp garam masala ,  ¼ tsp turmeric ,  1 clove garlic, crushed,  handful frozen peas,  100ml\/3½fl oz water,  salt,  bunch fresh coriander,  sprig fresh mint, leaves only,  1 clove garlic,  ½ lemon, juice only,  1 green chilli,  ¼ tsp caster sugar,  3 tbsp sunflower oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/masalachopswithfried_81241"}