{"recipe_name":"Ma's macadamia salad","author":"Thomasina Miers","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/masmacadamiasalad_85171_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Toss the onion and red pepper in the olive oil and roast in the oven for 30 minutes.  Toast the macadamia nuts in a small roasting tin for 5-7 minutes in the same oven, until they are a lovely caramel colour. Remove the macadamias from the oven and chop coarsely, then set aside to cool while the onion and pepper finish cooking. Slice the cucumber into quarters lengthways. Now slice down each length, cutting out the seeds (which are watery and would make your salad wishy-washy). Chop the remaining flesh. For the French dressing, mix all the dressing ingredients except the olive oil in a glass jar with a screw-top lid.  Shake well to dissolve the sugar and leave to stand for ten minutes (this takes the onion punch out of the shallot and softens its flavour).  Add the oil and shake again. To serve, mix all the salad ingredients in a bowl, season with salt and freshly ground black pepper, then toss in the French dressing. ","ingredients":" 2 red onions, halved, cut into wedges ,  2 red peppers, seeded, cut into chunks ,  1-2 tbsp extra virgin olive oil ,  120g\/4½oz macadamia nuts ,  ½ cucumber, peeled ,  3 spring onions, finely chopped,  2 shallots, finely chopped ,  2 chicory heads, hearts removed, coarsely chopped ,  ½ fennel bulb, chopped,  1 tart green apple (such as Braeburn or Granny Smith) peeled, chopped,  3 Baby Gem lettuces, chopped ,  sea salt and freshly ground black pepper,  3 shallots, very finely sliced,  1 tsp wholegrain mustard,  1 tbsp brown sugar,  2 tbsp white wine vinegar,  large pinch Maldon sea salt,  freshly ground black pepper,  75ml\/3fl oz extra virgin olive oil","vegetarian":true,"calories":321.0,"protein":4.0,"carbs":16.0,"sugars":14.0,"total_fat":27.0,"saturated_fat":4.0,"fiber":5.0,"salt":0.3,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/masmacadamiasalad_85171"}