{"recipe_name":"Meatballs in tomato sauce with cinnamon and cumin (Soutzoukakia)","author":"Rick Stein","programme":"Rick Stein's Long Weekends","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/meatballs_in_tomato_95724_16x9.jpg","method":"To make the meatballs, put all the ingredients, except the olive oil, in a large bowl and mix. With wet hands, shape the mixture into 20 to 24 rugby-ball shapes.  Heat the oil in a frying pan over a high heat and fry the meatballs until golden-brown on all sides, or grill on a griddle pan if you like grill lines on the patties. To make the tomato sauce, heat the oil in a lidded saucepan over medium heat. Sweat the onion and garlic with the cinnamon stick, cumin and sugar until soft, about 10 minutes. Add the red wine and bring to the boil, then reduce the heat to medium. Add the tomato purée, passata, salt and pepper and cook until slightly thickened, about 20 minutes. Add the meatballs and simmer for 20–30 minutes covered until cooked through, adding a little water if the sauce is too thick. Serve with rice and green olives.  ","ingredients":" 500g\/1lb 2oz beef mince,  2 garlic cloves, finely chopped or grated,  1 free-range egg, beaten,  ½ tsp ground cumin,  ½ tsp dried oregano,  2 slices stale white bread (about 100g\/3½oz), soaked in red wine, squeezed dry and torn into small pieces,  ½ tsp salt,  12 turns black peppermill,  3 tbsp olive oil,  3 tbsp olive oil,  1 onion, finely chopped,  1 garlic clove, finely chopped,  5cm\/2in cinnamon stick,  1 tsp ground cumin,  1 tsp sugar,  150ml\/5fl oz red wine,  1 tbsp tomato purée,  500ml\/18fl oz passata,  ½ tsp salt,  12 turns black peppermill,  cooked rice,  12 green olives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/meatballs_in_tomato_95724"}