{"recipe_name":"Swedish meatballs with cream sauce","author":"Niklas Ekstedt","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cream sauce, heat the oil in a large pan and fry the onions until soft and translucent. Add the anchovy and stock. Bring to the boil and cook until the volume of liquid has reduced by a third. Add the cream and cook over a low heat for another 6-8 minutes.  Mix the cornflour with a little water to form a paste then stir it into the sauce. Season with salt and pepper. Keep warm until ready to serve. Preheat the oven to 220C\/200C Fan\/Gas 6.  For the meatballs, fry the onion in a little butter until soft then transfer to a large bowl.  Mix in the cream, milk, salt, spices and breadcrumbs. Add the beef and pork mince and mix thoroughly by hand. Roll the mixture into small balls and place them on a lightly oiled baking tray.  Add some water to another baking tin and place it in the bottom of the oven to create steam. Roast the meatballs for 10 minutes, or until firm.  For the salad, put the cabbage and the fennel in a large sieve. Sprinkle with salt and set aside for 5-10 minutes. Then squeeze the liquid out of the cabbage using your hands. Place in a bowl and mix in the remaining salad ingredients. Season with salt and pepper.  To finish the meatballs, heat the oil and remaining butter in a large frying pan and fry until browned (do this in batches if necessary; do not crowd the pan).  To serve, put the meatballs in a serving bowl and pour over the cream sauce. Serve the salad alongside in separate serving bowls. A little lingonberry jam would be traditional, too. ","ingredients":" 2 tbsp oil,  1 onion, chopped,  1 anchovy fillet, chopped ,  200ml\/7fl oz reduced veal stock (or chicken stock),  200ml\/7fl oz double cream ,  1 tsp cornflour ,  salt and freshly ground black pepper,  ½ onion, finely chopped,  150ml\/5fl oz double cream,  100ml\/3½fl oz milk,  1 tbsp salt,  1 tsp ground allspice,  100g\/3½oz fresh breadcrumbs ,  250g\/9oz beef mince ,  250g\/9oz pork mince,  4 tbsp vegetable oil, for frying, plus extra for greasing,  75g\/2½oz unsalted butter,  ¼ white cabbage, shaved thinly on a mandoline,  1 head fennel, shaved thinly on a mandoline,  salt,  2 apples, shaved thinly on a mandoline,  2 tbsp olive oil,  3 tbsp soured cream,  salt and pepper,  1 tbsp white wine vinegar,  500g\/1lb 2oz new potatoes, cooked","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/meatballs_with_cream_52301"}