{"recipe_name":"Meatballs with pea and mint mash and red onion gravy","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the meatballs, place the sausagemeat, onions, breadcrumbs and egg into a large bowl. Season with salt and freshly ground black pepper and mix together with your hands until well combined.  With floured hands, roll the mixture into small balls. Heat the oil in a frying pan and fry for 8-10 minutes, or until golden-brown on all sides and completely cooked through. For the pea and mint mash, place the potato pieces into a saucepan of boiling salted water and cook for eight minutes. Add the peas and cook for a further 2-3 minutes, or until the vegetables are tender.  Drain the potatoes and peas, return to the pan and add the mint and butter. Season well with salt and freshly ground black pepper and mash together using a potato masher. For the onion gravy, heat the oil in a small saucepan, add the onion and cook gently for 3-4 minutes. Add the sugar and cook for a further 1-2 minutes.  Turn up the heat, add the wine and balsamic vinegar and simmer for five minutes.  Reduce the heat and whisk in the flour and caster sugar. Season well with salt and freshly ground black pepper and cook for 8-10 minutes, or until reduced. To serve, place the mash onto a serving plate, top with the meatballs and pour over the gravy. ","ingredients":" 4 sausages, skinned,  ¼ onion, chopped,  50g\/1¾oz fresh breadcrumbs,  1 free-range egg,  salt and freshly ground black pepper,  flour, for dusting,  1-2 tbsp olive oil,  1 small potato, peeled, chopped,  100g\/3½oz fresh peas, or frozen (defrosted) peas,  large handful fresh mint, chopped,  30g\/1oz butter,  salt and freshly ground black pepper,  1 tbsp olive oil,  ½ red onion, sliced,  1 tbsp soft brown sugar,  2 tbsp red wine,  1 tbsp balsamic vinegar,  1 tsp plain flour,  pinch caster sugar,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/meatballswithpeaandm_85071"}