{"recipe_name":"Meat feast calzone","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/meatfeastcalzone_86391_16x9.jpg","method":"For the dough, sift the flour into a bowl. Mix the milk, water and yeast together in a separate bowl. Add the yeast mixture to the flour and mix together to form a dough. Knead the dough for five minutes on a floured and even service. Add the olive oil and knead again to combine. Cover the bowl with cling film and leave somewhere warm for two hours. Preheat the oven to 230C\/450F\/Gas 8. Place a baking tray into the oven to preheat. Add the salt to the dough and knead again, then divide the dough into four equal portions and roll into balls. Place each ball onto a floured work surface and roll out into 20cm\/8in circles. For the filling, place all of the filling ingredients into a bowl and mix together well. Place one quarter of the filling mixture onto one half of each dough circle, leaving a 2cm\/1in gap around the edge. Brush the clean edges with water then fold the other sides over to cover the filling and pinch the edges to seal the four parcels. Place the calzones onto the preheated baking sheet and transfer to the oven to bake for eight minutes, or until the dough is cooked through and the filling hot. ","ingredients":" 225g\/8oz plain strong flour, plus extra for dusting,  90ml\/3fl oz milk, warmed to body temperature,  50ml\/2fl oz water, warmed to body temperature,  1 tsp dried yeast,  25ml\/1fl oz olive oil,  pinch salt,  150g\/5oz cherry tomatoes, halved,  200g\/7oz buffalo mozzarella, roughly chopped,  200g\/7oz assorted Italian cold meats (for example: salami, prosciutto, speck),  1 tbsp capers, rinsed and drained,  30g\/1oz grated parmesan","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/meatfeastcalzone_86391"}