{"recipe_name":"Meatloaf and mashed potato","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the meatloaf, place the egg and milk into a large bowl and mix together. Add the cubes of bread and leave to stand for 15 minutes. Mash the milk and egg-soaked bread with a fork. Add the mustard, thyme, nutmeg, basil, onion, celery and bacon lardons, season with salt and freshly ground black pepper and mix well. Add the beef and pork mince and the Worcestershire sauce. Mix well to combine thoroughly. Cover with cling film and place into the fridge to chill (overnight if possible, but for at least two hours). Preheat the oven to 180C\/360F\/Gas 4. Transfer the meatloaf mixture into a 30cm x 11cm\/12in x 4in loaf tin. Top with the streaky bacon slices to cover. Transfer to the oven and bake for 55 minutes, or until completely cooked through. Remove from the oven and leave the meatloaf to stand for 5-6 minutes before slicing. For the mashed potato, mash the freshly cooked potatoes. Place into a pan over a low heat and mix in the butter. Season, to taste, with salt and freshly ground black pepper. To serve, slice the meat loaf. Place a slice onto each plate with a dollop of mashed potato alongside. Pour over some gravy and enjoy. ","ingredients":" 1 free-range egg, beaten,  150ml\/5fl oz milk,  300g\/10½oz soft white bread, cut into cubes,  1 tbsp Dijon mustard,  pinch dried thyme,  pinch freshly grated nutmeg,  pinch dried basil,  handful fresh parsley, finely chopped,  1 onion, finely chopped,  100g\/3½oz celery, finely chopped,  225g\/8oz bacon lardons, fried until golden-brown all over,  salt and freshly ground black pepper,  700g\/1lb 5oz minced beef,  200g\/7oz minced pork,  1 tbsp Worcestershire sauce,  3 slices streaky bacon,  450g\/1lb potatoes, peeled and boiled,  75g\/2½oz butter,  salt and freshly ground black pepper,  gravy","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/meatloafandmashedpot_88604"}