{"recipe_name":"Bara brith sheep biscuits","author":"Louise","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 24 large biscuits","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/bara_brith_sheep_54510_16x9.jpg","method":"Preheat the oven to 190C\/170C Fan\/Gas 5. Line a large baking tray with baking parchment. Put the teabags in a bowl, cover with boiling water and brew for 5 minutes, until very strong. Remove the teabags and add a splash of orange liqueur. Soak the mixed fruit in the tea for 10-15 minutes, then drain well and set aside.  When cool, chop the dried fruit very finely, add both citrus zests and transfer to a pestle and mortar. Grind the mixture to a paste.  Put the flour, sugar, spices and salt in a large bowl. Rub in the butter using your fingertips. Add 3 teaspoons of the ingredients from the pestle and mortar. Mix and combine with your fingertips until the mixture resembles fine breadcrumbs. Add just enough buttermilk to bring the mixture together as a dough. Roll out on lightly floured work surface until the dough is about ½cm\/¼ in thick. Cut out shapes using a sheep shaped biscuit cutter and transfer to the prepared tray. Prick all over with a fork and bake for 10-12 minutes or until pale golden-brown. Leave to cool slightly, then transfer to a wire rack to cool completely. For the icing, sift two-thirds of the icing sugar into a bowl and mix in enough water to make a thick but pourable icing. Stir in a little pearlescent food colour. Spoon into a squeezy bottle and cover the bodies of the sheep evenly to make the fleeces. Set aside in a cool place to allow the icing to set. Sift remaining icing sugar and mix with the almond extract and enough water to make a thick icing. Transfer half the icing to a separate bowl. Add the black food colour to one and the silver to the other. Put into two disposable piping bags with small plain nozzles attached. Use the black icing to decorate the heads and legs of the sheep and the silver to pipe swirls on their fleeces. Allow the icing to set, then serve. ","ingredients":" 10 tea bags,  splash orange liqueur,  6 tbsp mixed dried fruit ,  1 orange, finely grated zest only,  ½ lemon, finely grated zest only,  500g\/1lb 2oz self-raising flour, plus extra for dusting,  125g\/4½ oz caster sugar,  ½ tsp mixed spice,  ½ tsp dried ginger,  ½ tsp cinnamon,  ½ tsp salt,  350g\/12oz unsalted butter, cubed,  1-2 tbsp buttermilk, to loosen,  700g\/1lb 9oz icing sugar,  pearlescent white food colour ,  1½ tsp almond extract,  black food colour paste,  metallic light silver food colour paste","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bara_brith_sheep_54510"}