{"recipe_name":"Mexican tortilla bake","author":"Mary Berry","programme":"Mary Berry's Foolproof Cooking","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mexican_tortilla_bake_28158_16x9.jpg","method":"Preheat the oven to 160C\/140C Fan\/Gas 3. Pour the oil into a large ovenproof frying pan over a medium heat, add the onions and fry for 3 minutes. Turn up the heat, add the mince and fry until brown, breaking the meat up with a wooden spoon and stirring occasionally. Add the chilli, red pepper, garlic and spices and fry for 5 minutes, or until all the moisture has evaporated and the mixture is quite dry. Stir in the tomato purée, mango chutney, tinned tomatoes and salt and black pepper. Cover with a lid, bring to the boil and transfer to the oven to simmer for an hour. Remove from the oven and stir in half the coriander. Increase the oven temperature to 200C\/180C Fan\/Gas 6. Spread a third of the cooked mince beef mixture over the bottom of the ovenproof dish and lay one tortilla wrap on top. Spread a third of the mascarpone (see tip) over the tortilla and sprinkle with a third of each of the mozzarella and Cheddar cheeses. Repeat twice more so you have 3 layers. Bake in the oven for about 25 minutes until golden-brown and bubbling. Set aside for 5 minutes before serving and garnish with the remaining coriander. ","ingredients":" 1 tbsp olive oil,  2 large onions, chopped,  500g\/1lb 2oz beef mince,  1 mild red chilli, deseeded and finely chopped,  1 red pepper, deseeded and diced,  2 garlic cloves, crushed,  1 tbsp ground cumin,  1 tbsp ground coriander,  2 tbsp tomato purée,  1–2 tbsp mango chutney,  2 x 400g tins chopped tomatoes,  1 small bunch fresh coriander, chopped,  salt and freshly ground black pepper,  3 large tortilla wraps ,  250g\/9oz full-fat mascarpone,  100g\/3½oz mozzarella, grated,  100g\/3½oz cheddar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mexican_tortilla_bake_28158"}