{"recipe_name":"Mexican fish tortillas","author":"Sophie Grigson","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Divide the haddock into four portions.  To make the marinade, dry fry the peppercorns, cumin and coriander seeds over a moderate heat until they turn a shade darker and give off an aroma.   Tip into a bowl and cool slightly.  Grind with the oregano, turmeric, paprika and cayenne.   In a mortar, mash the garlic to a paste with the salt, and gradually work in the spices and the citrus juices.  Smear this mixture over the haddock, then tip over any left in the mortar.  Leave to marinate for at least one hour and up to four hours.   To make the salsa, mix all the ingredients together, then taste and adjust seasonings.  Chill in the fridge until needed.   Pre-heat a grill or barbecue.   Wrap the tortillas in foil and warm through in the oven, or on the edge of the barbecue.   Grill the fish, turning carefully once, until just cooked through.  You can either lay each piece of fish on a warm tortilla, top with a good dollop of salsa, and a spoonful of sour cream, then hand out to your guests. Alternatively (and your friends or family may well prefer the DIY approach) pass the fish, tortillas, salsa, cream and lime wedges around so that everyone can put together their own Yucatan fish tortilla. ","ingredients":" 700g\/1½lb haddock fillet,  ¼ tsp black peppercorns,  ½ tsp cumin seeds,  ½ tsp coriander seeds,  ½ tsp dried oregano,  ½ tsp turmeric,  ½ tsp paprika,  ¼ tsp cayenne pepper,  3 cloves garlic, chopped,  1 Seville orange, juice only and 1 lime,  or,  1 lime, juice only and ½ grapefruit,  or,  1 lime, juice only and 1 Seville orange,  ½ tsp salt,  450g\/1lb ripe tomatoes, deseeded and finely diced,  ½ red onion, finely chopped,  1 clove garlic, very finely chopped,  2 green chillis, deseeded and finely chopped,  ½ Seville orange, juice only or ½ grapefruit,  1 tsp sugar,  4 tbsp chopped fresh coriander,  salt,  freshly ground black pepper,  soft flour tortillas,  150ml\/¼ pint soured cream (optional),  lime wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mexicanfishtortillas_73223"}