{"recipe_name":"Mexican steak burrito","author":"Angela Hartnett","programme":"Take on the Takeaway","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mexicansteakburrito_86980_16x9.jpg","method":"For the guacamole, place the avocados in a bowl with the garlic, onion and chilli and mash together roughly with a fork. Stir in the lime juice and season to taste with salt and freshly ground black pepper. Set aside. For the tomato salsa, mix the tomatoes, onion and coriander in a bowl. Set aside. For the steak filling, heat the oil or lard in a pan and fry the onion for 1-2 minutes until softened but not browned. Add the steak pieces to the pan with the garlic and chilli and stir fry for one minute. Add a pinch of cayenne pepper and a dash of Worcestershire sauce and Tabasco sauce and cook for another minute, or until cooked to your liking, then remove from the heat. To assemble the burrito, place the warmed tortillas on serving plates and divide the steak between them. Top with salsa and lettuce and fold to enclose the filling.  Serve the burrito with rice, grated cheese, soured cream and a spoonful of the guacamole. ","ingredients":" 2 small ripe avocados, peeled, stones removed,  1 garlic clove, peeled and finely chopped,  ½ small onion, peeled and finely chopped,  1 small red chilli, seeds removed, finely chopped,  1 lime, juice only,  salt and freshly ground black pepper,  2 medium ripe tomatoes, chopped,  ½ onion, peeled and finely chopped,  small handful fresh coriander, chopped,  2 tbsp vegetable oil (or 40g\/1½oz lard),  1 small onion, peeled and finely chopped,  350g\/12oz rump steak, chopped ,  1 garlic clove, peeled and finely chopped,  ½ red or green chilli, seeds removed, finely chopped,  dash Worcestershire sauce,  dash Tabasco sauce,  pinch cayenne pepper,  small handful fresh coriander, chopped,  2 ready-made soft flour tortillas, warmed briefly in a hot dry pan,  1 Little Gem lettuce, finely sliced,  100g\/3½oz rice, cooked according to packet instructions and drained,  75g\/2½oz cheddar cheese, grated,  100ml\/3½fl oz soured cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mexicansteakburrito_86980"}