{"recipe_name":"Mezze platter with flatbread","author":"Angela Hartnett","programme":"Saturday Kitchen Best Bites","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the aubergine and feta, preheat the oven to 200C\/400F\/Gas 6. Drizzle the oil over the aubergine and heat a grill pan. Place the aubergines on the grill pan and cook each side for two minutes, then transfer to the oven for four minutes. Heat a dry frying pan and dry fry the pine nuts. Heat a clean pan, add the olive oil and gently fry the garlic, parsley and breadcrumbs. Add the pine nuts and golden raisins and cook for a further two minutes. Pour the breadcrumb mixture over the aubergines and top with the crumbled feta and mint leaves. For the three bean salad with soft-boiled egg. Add the green beans to a pan of boiling water. A minute later, add the yellow and runner beans. Boil them until cooked to your liking, then drain and refresh them in cold water, then drain again and set aside. In another pan of boiling water, cook the eggs for five minutes so that they are soft-boiled. Leave until cool enough to handle then peel them and leave to one side. Heat a small frying pan and add a tablespoon of olive oil. Once hot, add the garlic and chilli and cook for one minute. Place the beans in a large glass bowl and finish with the rest of the olive oil, and the vinegar, mustard and lemon zest. Add the herbs and spring onions. Serve with the soft-boiled eggs halved on top. For the chickpea salad, drain the soaked chickpeas. In pan of clean water, boil them for 10-15 minutes, or until cooked. Drain well. Heat the oil in a frying pan and gently fry the chilli, cumin and sumac. Add the spices and cook until aromatic, then add the chickpeas. Fry for a few minutes, then combine with the other chopped ingredients and the lemon juice. For the flatbread, place the flour and salt in a free-standing mixer with a dough hook attachment and dissolve the yeast in a little water. Add the oil to the flour, along with the salt and yeast and mix with the dough hook, kneading for five minutes. Tip the dough into a bowl, cover loosely and leave to prove until doubled in size (about 30-60 minutes). To cook the flatbread, heat a cast iron pan. Divide the dough into balls and roll out to about the thickness of a pound coin. Lay them on the hot pan in batches and cook for a couple of minutes on each side, or until all the raw dough has cooked and the bread has bubbled up and is crisp and coloured. To serve, place the mezze in separate bowls or a large platter and serve with the flatbread and thick yoghurt. ","ingredients":" 2 aubergines, sliced lengthways ,  2 tbsp olive oil,  1 tbsp pine nuts ,  1 garlic clove, finely diced,  1 tbsp finely chopped flatleaf parsley,  2 tbsp toasted Japenese panko breadcrumbs,  1 tbsp golden raisins ,  200g\/7oz feta cheese, crumbled,  1 tsp whole mint leaves, to garnish,  400g\/14oz green beans,  400g\/14oz yellow runner beans,  400g\/14oz runner beans,  3 free-range eggs,  3 tbsp olive oil,  1 garlic clove, crushed,  1 tsp red chilli, sliced,  1 tbsp red wine vinegar,  1 tsp Dijon mustard,  1 lemon, zest only,  1 tbsp torn mint leaves,  1 tbsp torn parsley leaves,  4 spring onions, chopped,  250g\/9oz dried chickpeas, soaked overnight,  2 tbsp olive oil,  pinch chilli,  pinch cumin,  1 tsp sumac,  18 ripe cherry tomatoes, halved,  2 spring onions, sliced ,  1 bunch parsley, finely chopped,  1 bunch mint, finely chopped,  1 lemon, juice only,  250g\/9oz strong bread flour,  ½ tsp salt,  150ml\/5fl oz warm water,  5g instant yeast,  1 tsp olive oil,  200g\/7oz thick yoghurt","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mezze_platter_with_12562"}