{"recipe_name":"Khao soi noodles ","author":"Mickey Pierce","programme":"Nigel Slater: Eating Together","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 3-4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mickeys_khao_soi_noodles_24933_16x9.jpg","method":"Heat the curry paste in a large saucepan over a medium heat. Add the chicken drumsticks and cook for 3-4 minutes on all sides, or until covered in the curry paste and browned all over. Add the curry powder, coconut milk and chicken stock to the pan and bring the mixture to the boil. Add the palm sugar and fish sauce, reduce the heat until the mixture is simmering, then simmer for 20 minutes, or until the chicken drumsticks are cooked through. (The chicken is cooked through if the juices run clear when pierced in the thickest part with a skewer and no trace of pink remains.) Boil 200g\/7oz of the noodles in a large pan of boiling water for no more than 1 minute. Drain well and set aside. Heat the groundnut oil in a wok over a high heat. Add the remaining noodles and fry for a few seconds, until crisp. Divide the blanched noodles among 3 or 4 serving bowls and splash a little soy sauce over each. Pour over the chicken and sauce, then sprinkle the spring onions, red onion and coriander on top.  Break the fried noodles into small pieces and sprinkle them over each bowl of khao soi. Serve with lime wedges alongside. ","ingredients":" 4 tbsp ready-made Thai red curry paste,  9 chicken drumsticks,  1 tbsp mild curry powder,  400ml\/14fl oz coconut milk,  400ml\/14fl oz chicken stock,  2 tbsp palm sugar (or light brown sugar),  1 tbsp fish sauce,  300g\/10½oz fresh egg noodles,  3 tbsp groundnut oil,  splash dark soy sauce,  2 spring onions, trimmed, thinly sliced,  1 red onion, finely chopped,  50g\/2oz chopped fresh coriander,  2 limes, cut into wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mickeys_khao_soi_noodles_24933"}