{"recipe_name":"Barbecue baby back ribs with celeriac slaw","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 2-4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/barbecue_baby_back_ribs_42228_16x9.jpg","method":"For the ribs, place the rib racks into a large, wide, heavy-based saucepan with the celery, onion, chillies, garlic and apple juice. Pour over just enough water to cover the pan contents. Bring the mixture to the boil, then reduce the heat until the mixture is just simmering. Simmer very gently for 1-1½ hours, or until the meat is tender. From time to time, skim off any scum that rises to the surface during cooking. Meanwhile, for the barbecue sauce, heat the ketchup and muscovado sugar in a frying pan over a medium heat for 2-3 minutes, or until the sugar has dissolved into the ketchup.  Add the Worcestershire sauce, smoked paprikas and vinegar and bring the mixture to the boil. Reduce the heat until the mixture is simmering and cook for 4-5 minutes, or until thickened. Stir in the bourbon, then remove from the heat and set aside. Refrigerate when cool. For the slaw, whisk together the egg yolks, mustard and vinegar in a large bowl until well combined. Gradually add the oil in a very thin stream, whisking continuously, until the mixture has thickened to a light mayonnaise and all of the oil has been fully incorporated into it. Drain the celeriac thoroughly and remove any excess moisture using kitchen paper. Stir the celeriac and parsley into the mayonnaise and season, to taste, with salt and freshly ground black pepper. Chill in the fridge until needed. When the ribs are poached, preheat the oven to 240C\/220C Fan\/Gas 9, or as hot as it will go. Remove the ribs from the poaching liquor using a slotted spoon and transfer to a large roasting tray. Brush the ribs all over with the barbecue sauce, then roast in the oven for 10-15 minutes, turning every five minutes, until the ribs are sticky and charred around the edges. To serve, pile the ribs on a serving platter and serve the celeriac slaw and the remaining barbecue sauce alongside. ","ingredients":" 2kg\/2lb 4oz baby back pork ribs, in racks,  2 celery stalks, trimmed, halved,  1 onion, thickly sliced,  2 red chillies, cut in half lengthways,  1 garlic bulb, cut in half horizontally,  250ml\/9fl oz apple juice,  125ml\/4½fl oz tomato ketchup,  150g\/5oz dark muscovado sugar,  2 tbsp Worcestershire sauce,  1 tsp smoked hot paprika,  1 tsp smoked sweet paprika,  75ml\/2½fl oz white wine vinegar,  50ml\/2fl oz bourbon whiskey,  3 free-range egg yolks,  1 tbsp Dijon mustard,  2 tbsp cider vinegar,  300ml\/10½fl oz rapeseed oil,  1 celeriac, julienned and placed in acidulated water,  2 tbsp roughly chopped fresh flatleaf parsley,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/barbecue_baby_back_ribs_42228"}