{"recipe_name":"Microwave jacket potatoes with various toppings","author":"Let's Get Cooking","programme":null,"prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Wash the potato and prick with a sharp knife several times on all sides. Dry the potato well with kitchen paper and place on a microwave-safe plate. Place in the microwave and cook on full power for four minutes. Remove the plate using oven gloves and turn the potato over. Dry the potato and the plate and put back into the microwave. Heat on full power for a further four minutes. Remove the plate and leave the potato to stand for a minute, as it will continue to cook. Check that the potato is soft by pushing a sharp knife into the centre. Return to the microwave for another 30 seconds if it is still hard in any part. For the leek, apple, cheese and bacon filling, wash and slice the leek. Place in a small bowl and grind over some black pepper, if using. Cover the bowl with cling film, leaving a small area open, and microwave on full power for two minutes. Grate the cheese, chop the bacon and grate the apple into the leeks. Cut the potato in half, scoop out the fluffy middle and add to the cheese and vegetables. Mix well and spoon back into the ‘jackets’. Put the filled ‘jackets’ on a microwave-safe plate and heat for one minute, or until the cheese has melted. For the tuna and sweetcorn, open the cans of tuna and sweetcorn and drain, then tip into the bowl with the mayonnaise and mix with black pepper, if using. Split the jacket potato in half, roughly mash the middle with a fork, and spoon over the topping. For the salmon and peas, put the peas into a mixing bowl and pour over boiling water from the kettle. Leave for five minutes, then drain and return the peas to the bowl. Open the can and drain the salmon, then add to the peas in the mixing bowl. Measure in the salad cream and mix well. Split the jacket potato in half, roughly mash the middle with a fork, and spoon over the topping. For the mushroom and tomato filling, wipe the mushrooms clean with a piece of damp kitchen paper. Slice them and place into a microwave-safe bowl and grind over some black pepper, if using. Microwave on full power for one minute, stir, and then heat for a further minute. Allow to cool, then mix in the other ingredients. Split the jacket potato in half, roughly mash the middle with a fork, and spoon over the topping. ","ingredients":" 1 medium baking potato (about 180g\/6oz),  ½ leek,  black pepper (optional),  15g\/½oz reduced-fat cheddar cheese,  15g\/½oz cooked bacon or ham,  1 eating apple,  1 x 80g\/2¾oz can tuna (in spring water),  ½ x 198g\/7oz can sweetcorn,  1 tbsp reduced-fat mayonnaise,  black pepper (optional),  50g\/1¾oz frozen peas,  1 x 80g\/2¾oz can skinless and boneless salmon,  1 tbsp salad cream,  5 button mushrooms,  black pepper (optional),  140g\/5oz reduced-fat cream cheese (1 mini tub),  1 tsp tomato purée,  1 tsp lemon juice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/microwave_jacket_34010"}