{"recipe_name":"Midsummer dream wedding cake","author":"Frances Quinn","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"over 2 hours","serves":"Makes 1 three-tiered wedding cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. To make the ginger cakes, grease and line two 28cm\/11in cake tins.  Melt the butter, sugar, syrup and treacle in a large pan. Once everything has dissolved and combined, remove from the heat and set aside to cool slightly.  Meanwhile, sift the dry ingredients into a large bowl. In a separate bowl, beat the eggs with the milk. Pour the melted sugar mixture into the dry ingredients and mix thoroughly. Add the milk and egg mixture and combine everything together. Pour into the prepared tins and scatter the rhubarb pieces over the top. Bake in the oven for 40 minutes, or until golden-brown and cooked through. When cooked, set aside to cool on a wire rack. To make the sunshine cake, grease and line a 13cm\/5in tin. Whisk the sugar, oil and eggs together, then sift and fold in the dry ingredients. Fold through the remaining ingredients. Pour into the prepared tin and bake for 25-30 minutes, or until golden-brown and cooked through. When cooked, set aside to cool on a wire rack. To make the lemon cakes, grease and line three 18cm\/7in tins. Cream the sugar and butter together in a freestanding mixer. Beat the eggs in a jug then gradually add to the creamed butter with the motor running. Once combined, fold in the flour and ground almonds. Gently stir in the hot water to loosen the mix and make the cakes even fluffier. Pour the batter into the prepared tins and bake for 15-20 minutes. Turn the oven down to 100C\/225F and cook for a further 15 minutes, or until springy to the touch. When cooked, set aside to cool on a wire rack. For the pineapple flowers and confetti, preheat the oven to 100C\/225F. Place the pineapple slices on kitchen paper to drain any excess liquid, then place directly on the oven shelf.  Using mini pastry cutters, cut a mix of shapes out of the beetroot, sweet potato, mango and rhubarb slithers. Sift the shapes in icing sugar and place on a baking tray lined with silicone paper. Transfer to the oven until dried out.  When the pineapple has dried out, gently push the slices into mini cupcake and muffin tins to mould into flower shapes. For the limoncello Italian buttercream, place the egg whites in the bowl of a freestanding mixer. Add 50g\/1¾oz caster sugar and whisk until stiff peaks form when the whisk is removed. Meanwhile, gently heat the remaining sugar and lemon juice in a pan. Do not stir. When the sugar has dissolved, increase the heat to medium and bring the syrup to 121C\/250F on a sugar thermometer (this will take approximately five minutes). Use a wet pastry brush to wash down the sides of the pan to help prevent sugar crystals from forming around the sides.  With the mixer on a slow speed, carefully pour the hot syrup into the egg whites in a thin, steady stream. Once the syrup is combined, whisk for a further 5-8 minutes on a medium-high speed until the mixture has cooled. Slowly add small pieces of butter with the mixer running. When all the butter is combined, add the limoncello, lemon extract and lemon zest. Set aside until ready to use. For the French lemon buttercream, place the egg yolks in a freestanding mixer with a whisk attachment. Add the lemon zest and whisk until thick and doubled in volume Place the lemon juice and caster sugar in a pan. Gently heat until the sugar has dissolved. Do not stir. When the sugar has dissolved, increase the heat to medium and bring the syrup to 121C\/250F on a sugar thermometer (this will take approximately five minutes). Use a wet pastry brush to wash down the sides of the pan to help prevent sugar crystals from forming around the sides.  With the mixer on a slow speed, carefully pour the hot sugar syrup into egg yolks in a thin steady stream.  Once the syrup is fully combined, whisk for a further 5-8 minutes on medium- high speed until the mixture has cooled. Slowly add small pieces of butter with the mixer running. Once all the butter is combined add the limoncello and lemon extract. Set aside until ready to use. For the cream cheese filling, fold the sifted icing sugar into the cream cheese and place in the fridge to chill. For the orange marzipan, place the egg, honey, orange zest, orange blossom water, vanilla extract and almond extract in a large bowl. Whisk to combine.  Stir in the caster sugar, icing sugar and ground almonds and mix to form a paste.  Shape the marzipan into 10 bees (each weighing 10g\/¼oz) and place in the fridge to firm. For the pistachio marzipan, combine the ground pistachios and icing sugar in a bowl, then mix in the egg white. Press the mixture into a ball and transfer to the fridge for at least 10 minutes to firm up slightly.  When firm, lightly dust a work surface with icing sugar and roll out the marzipan to the thickness of a two-pence coin. Use leaf cutters to create an assortment of pistachio marzipan leaves. For the pistachio and raspberry marzipan, combine the ground pistachios, freeze-dried raspberries and icing sugar in a bowl and mix in the egg white. Use your hands to press the mixture into a ball then transfer to the fridge to firm for at least 10 minutes.  When firm, roll the marzipan into berry shapes and use a cocktail stick to make incisions in the top of each berry where the wings will sit. To decorate the marzipan bees, apply gold leaf to four of the flaked almonds (to make the bride and groom bees).  Melt the dark chocolate chips in a microwave or a heatproof bowl set over a pan of simmering water. When melted, transfer to a piping bag fitted with a small plain nozzle. Pipe three chocolate stripes on each bee and use the flaked almonds to make wings, reserving the almond flakes covered in gold leaf for the bride and groom bees which will sit on the top layer of cake. Using a cocktail stick and any leftover melted chocolate, paint dots onto the front of the bees to resemble eyes. Leave to set.  For the ginger and lemon cakes, sandwich the cakes with the cream cheese filling. Stud the lemon cake with raspberries.  Cover all the cakes with a crumb coat of the French lemon buttercream. Finish the cakes with a layer of limoncello Italian buttercream to give a more polished but rustic finish.  Place each cake on the same sized cake board and assemble the cake tiers asymmetrically using the dowelling rods for support. Arrange the pineapple flowers around the cake and scatter over the confetti, cherries, apricots, dried mango, dried raspberries, ground pistachios, pistachio slices and crystallised stem ginger. Place the two gold leaf bees on top of the cake. ","ingredients":" 345g\/12oz slightly-salted butter,  345g\/12oz dark muscovado sugar,  345g\/12oz golden syrup,  345g\/12oz black treacle,  675g\/1lb 8oz self-raising flour,  3 tsp bicarbonate of soda,  3 tsp mixed spice,  4 tbsp ground ginger,  3 x 65g free-range eggs,  750ml\/1lb 10oz milk,  400g\/14oz rhubarb, chopped into slithers approximately 3mm thick,  180g\/6oz light muscovado sugar,  150ml\/5½oz sunflower oil,  2 x 65g free-range eggs,  200g\/7oz self-raising flour,  1 tbsp cinnamon,  1 tsp bicarbonate of soda,  200g\/7oz carrots, peeled and grated,  2 oranges, zest only,  50g\/1¾oz pistachios, chopped,  50g\/1¾oz desiccated coconut,  100g\/3½oz soft apricots, chopped,  325g\/11½oz slightly-salted butter,  325g\/11½oz caster sugar,  5 x 65g free-range eggs ,  260g\/9½oz self-raising flour, sifted,  65g\/2¼oz ground almonds,  2 tbsp hot water,  5 lemons, zest only,  1 pineapple (preferably unripe), peeled and thinly sliced into rounds on a mandolin ,  1 sweet potato, thinly sliced on a mandolin,  2 beetroots, thinly sliced on a mandolin,  1 mango (preferably unripe), thinly sliced on a mandolin,  250g\/9oz rhubarb, thinly sliced on a mandolin,  icing sugar,  5 large free-range eggs, whites only,  300g\/10½oz caster sugar,  100ml\/3½oz lemon juice,  500g\/1lb 2oz butter, softened, cubed,  3 tbsp limoncello,  2 tsp lemon extract,  5 lemons, zest only,  5 large free-range eggs, yolks only,  5 lemons, zest and 150ml\/5½fl oz juice,  300g\/10½oz caster sugar,  500g\/1lb 2oz butter, softened, cubed,  3 tbsp limoncello,  2 tsp lemon extract,  100g\/3½oz icing sugar, sifted ,  400g\/14oz cream cheese,  1 free-range egg, separated,  1 tbsp orange blossom honey,  1 orange, zest only,  1 tsp orange blossom water,  1 tsp vanilla extract,  1 tsp almond extract,  100g\/3½oz caster sugar ,  150g\/5½oz icing sugar, sifted,  250g\/9oz ground almonds, sifted,  50g\/1¾oz ground pistachios, sifted,  50g\/1¾oz icing sugar, sifted, plus extra for dusting,  ½ tbsp pasteurised egg white,  30g\/1oz ground pistachios, sifted ,  20g\/¾oz freeze-dried raspberries, ground,  50g\/1¾oz icing sugar, sifted,  ½ tbsp pasteurised egg white,  1 sheet gold leaf,  50g\/1¾oz toasted flaked almonds,  50g\/1¾oz dark chocolate chips,  600g\/1lb 5oz fresh raspberries,  handful of fresh cherries and apricots,  5g freeze-dried mango,  5g freeze-dried raspberries,  10g\/¼oz pistachios, roughly ground,  a few pistachios, sliced very thinly,  30g\/1oz crystallised stem ginger, for sprinkling ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/midsummer_dream_wedding_07048"}