{"recipe_name":"Miles’ fish tea ","author":"Miles Chambers","programme":"Nigel Slater: Eating Together","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2-3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Cut the red-snapper fillets into thirds to create six pieces in total.  In a large bowl, mix the fish seasoning with the lemon juice until smooth and dissolved. Add the fish pieces and mix well to coat them in the marinade. Set aside to marinate for 30 minutes. Bring 1.5 litres\/2¾ pints water to the boil in a large saucepan. Add the reserved fish bones and head, the thyme and the garlic. Reduce the heat until the stock is simmering and continue to simmer for 30 minutes. Strain through a fine sieve, returning the strained liquid to the pan. Add the carrot, green bananas, cho cho and yam and simmer for 10 minutes, or until tender. Add the marinated fish fillets and the marinade. Carefully balance the chilli on top of the fish, only allowing it to become partially submerged in the stock. (Submerge the chilli fully to release its seeds if you want a hotter dish - be warned that Scotch bonnet chillies are very hot.) Continue to simmer for a further 8 minutes, or until the fish is almost cooked through. Add the spring onions and simmer for a final 2-3 minutes, or until the fish flakes easily and is just cooked through. Serve in bowls. ","ingredients":" 1 red snapper (approximately 1kg\/2lb 4oz), filleted, bones and head reserved,  3 tbsp Jamaican fish seasoning powder,  2 lemons, juice only,  small bunch fresh thyme,  4 garlic cloves, crushed,  1 large carrot, sliced into 1cm\/½in rounds,  2 green bananas or plantains, peeled, sliced to 2cm\/1in rounds,  2 cho cho (available from West Indian markets or delicatessens), sliced into 1cm\/½in discs ,  1 yam, peeled, sliced into 1cm\/½in discs,  1 green Scotch bonnet chilli, top sliced off,  6 spring onions, trimmed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/miles_fish_tea_93869"}