{"recipe_name":"Millefeuille of English strawberries and raspberries","author":"Galton Blackiston","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Line a baking tray with greaseproof paper and set aside. Flour a work surface and roll the pastry into a rough square of 1cm\/½in thickness.  Using a 6cm\/2½in round cutter cut out eight circles. Place the pastry circles on the baking tray and dust with half of the icing sugar. Bake for eight minutes, or until risen and golden-brown. Remove from the oven and leave to cool. Once cool, cut in half horizontally and set aside. Place the milk and cream into a large saucepan with the mint and warm through.  Leave to infuse. Strain the milk mixture and discard the mint Place the egg yolks in a large heatproof bowl and whisk. Heat the milk again to hot (not boiling) and gradually add the milk and cream to the egg yolks, whisking all the time.  Pour the mixture back in the saucepan and continually whisk over a low heat until it is thickened. Once thickened, remove from the heat and leave to cool. If you are not assembling the dish straightaway, cover with cling film touching the surface of the custard to prevent it forming a skin.  Place half the raspberries into a food processor with the rest of the icing sugar and blend until smooth. Pass through a fine sieve. Place the reserved raspberries and the strawberries in a bowl and stir in the raspberry sauce.  Place one circle of pastry in the centre of each serving plate. Add a couple of spoonfuls of the berries and sauce to the top of the pastry bases and pour over a little custard. Top with a scoop of vanilla ice cream and place the other side of the pastry on top. Pour a little fruit sauce and custard around the plate. ","ingredients":" 50g\/1¾oz plain flour, for dusting,  500g\/1lb 2oz all-butter puff pastry,  100g\/3½oz icing sugar,  200ml\/7fl oz whole milk,  400ml\/14fl oz double cream,  1 bunch fresh mint,  4 free-range egg yolks,  500g\/1lb 2oz fresh raspberries,  250g\/9oz fresh strawberries, hulled and cut in half,  400g\/14oz vanilla ice cream ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/millefeuille_of_english_21630"}