{"recipe_name":"Mince pie rolls","author":"Glynn Purnell","programme":"Christmas Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. In a large bowl, mix together the mincemeat, cherries, apricots, lime zest and lime juice until well combined. Stir in the basil leaves and allspice. Roll out the pastry onto a lightly floured work surface to a rectangle measuring approximately 38x10cm\/15x4in. With the long edge of the rectangle facing you, spoon the mincemeat mixture in a thick line across the middle of the puff pastry rectangle. Brush the pastry not covered by the mincemeat mixture with some of the beaten egg and cream mixture, then roll the pastry around the mincemeat, pressing to seal along the join and at each end. Trim off any excess pastry using a sharp knife. Brush the top of the mince pie roll with the remaining egg and cream mixture, then crimp the edges or snip with scissors. Sprinkle over the sugar. Transfer the mince pie roll to a baking tray lightly greased with butter. Bake the mince pie roll in the oven for 20-30 minutes, or until the pastry has risen and is light golden-brown, and the filling is piping hot. Remove from the oven and set aside to cool slightly for 10 minutes. To serve, cut the mince pie roll into slices, or tear and share. ","ingredients":" 1 x 410g\/14½oz jar ready-made mincemeat,  150g\/5oz morello cherries in kirsch (available from Continental delicatessens), drained,  150g\/5oz dried, ready-to-eat apricots, diced,  1 lime, zest only, plus ½ lime, juice only,  4 fresh basil leaves, shredded,  pinch allspice,  plain flour, for dusting,  1 x 320g\/12oz sheet ready-to-roll all-butter puff pastry,  1 free-range egg, beaten with a splash of double cream,  1 tbsp granulated sugar, to decorate,  butter, for greasing","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mince_pie_rolls_61196"}