{"recipe_name":"Mince pies","author":"Thane Prince","programme":null,"prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Makes 12 mince pies (plus leftover mincemeat)","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mince_pies_16839_16x9.jpg","method":"Combine all of the ingredients for the mincemeat in a large bowl and mix thoroughly. Cover with cling film and leave for 24 hours. For the pastry, sift the flour into a bowl, add the softened butter, icing sugar and orange zest and gently incorporate with your hands until the mixture resembles rough breadcrumbs.  Mix in the egg yolks and then add 2-3 tablespoons of water to help bring it together. Squeeze the pastry together gently until you have a soft ball of pastry. Flatten to a disc, wrap in cling film and refrigerate for 30 minutes. Preheat the oven to 180C\/350F\/Gas 4.  Grease a bun tin or muffin tin, depending on how deep you like your mince pies. Unwrap the pastry and roll out on a lightly floured work surface to the thickness of a one pound coin. Cut out 12 discs of pastry with a pastry cutter slightly bigger than the size of the bun tin holes. Press a round of pastry into the bottom of each hole. Fill each pastry case with mincemeat and then cut a further 12 rounds of pastry (this time one size smaller). Brush the rims of the pastry cases with a little beaten egg and press the lids on, pressing the edges with the ends of a fork to seal shut. Brush the lids with beaten egg and then use a small knife or skewer to make a slit in the top of each pie. Sprinkle with demerara sugar and then transfer the tray to the fridge for 30 minutes. Bake the mince pies for 20-25 minutes, or until golden-brown and crisp. Transfer to a wire rack to cool and then turn the mince pies out and serve. Any leftover mincemeat should be spooned into sterilised jars and sealed. ","ingredients":" 150g\/5½oz raisins,  150g\/5½oz currants,  75g\/2½oz chopped mixed peel,  3 tbsp brandy,  150g\/5½oz cold butter, grated ,  125g\/4½oz dark brown soft sugar or muscovado sugar,  1 vanilla pod, seeds scraped,  1 tsp ground mixed spice,  1 Bramley apple, peeled, grated, core discarded ,  1 orange, juice and zest,  1 lemon, juice and zest,  350g\/12oz plain flour, plus extra for dusting,  150g\/5½oz unsalted butter, softened, cut into cubes,  50g\/1¾oz icing sugar, sifted,  1 orange, zest only,  2 free-range egg yolks,  2 free-range eggs, beaten,  50g\/1¾oz demerara sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mince_pies_16839"}