{"recipe_name":"Minced beef chappli kebabs","author":"Madhur Jaffrey","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 6 patties","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mincedbeefchapplikeb_90228_16x9.jpg","method":"Place the beef in a bowl. Put the chickpea flour in a small, cast-iron frying pan and set over a medium-high heat. Stir the flour around until it turns a very light golden-brown and emits a faintly roasted smell. Remove the pan from the heat. Allow to cool for a few seconds, then add to the bowl with the beef. Crush or grind the coriander seeds in a mortar and pestle or in a clean coffee grinder. Add to the bowl with the beef. Finely chop the chillies and add to the bowl. Add the salt, cumin, chopped coriander, onion and tomatoes. Mix well and form mixture into six patties about 1cm\/½in thick. Put the oil, enough to come to a depth of 3mm\/¼in, in a large frying pan set over a medium-high heat. When hot, put in as many patties as will fit easily in a single layer and cook for about two minutes on each side or until browned then turn the heat down and cook for another two minutes or until they're cooked through. Repeat, as necessary, until all the kebabs are cooked. Serve the kebabs hot, with naan bread, sliced onion rings, fresh coriander leaves and a selection of chutneys. ","ingredients":" 450g\/1lb minced beef,  4 tsp chickpea flour (also called gram flour or besan flour),  1 tbsp whole coriander seeds,  2-3 bird's eye chillies,  ¾ tsp salt, or to taste,  ¾ tsp whole cumin seeds,  6 tbsp finely chopped onion,  4 tbsp fresh coriander, coarsely chopped,  6 cherry tomatoes, cut into quarters,  vegetable or peanut oil,  naan bread,  sliced onion rings,  a selection of chutneys,  fresh coriander leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mincedbeefchapplikeb_90228"}