{"recipe_name":"Mincemeat and orange feathered tarts","author":"Mary Berry","programme":"Mary Berry's Absolute Christmas Favourites","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mincemeat_and_orange_21941_16x9.jpg","method":"Preheat the oven to 200C\/180C Fan\/Gas 6 and place a baking sheet inside to heat up.  For the pastry, either pulse the flour and butter in a food processor until the mixture resembles breadcrumbs, or rub the flour and butter together in a large bowl using your fingertips.  Stir in the icing sugar and orange zest, then stir in the beaten egg and mix until the ingredients just come together as a dough. Wrap the dough in greaseproof paper and chill in the fridge for 10-15 minutes, or until firm.  When the pastry has rested, unwrap it. Place the greaseproof paper on a work surface and lightly dust with icing sugar. Place the dough on top, dust with icing sugar, then cover with another sheet of greaseproof paper. Roll the pastry between the sheets of greaseproof paper to a thickness of 1-2mm. (If you are confident rolling out pastry you do not need to use the greaseproof paper, but it does help prevent the pastry tearing if the dough is a little sticky). Stamp 12 rounds from the pastry using a 8cm\/3in fluted pastry cutter. (Any leftover pastry can be frozen and used to make jam tarts.) Line each hole of the muffin tin with one of the pastry rounds and prick the base of each with a fork. For the filling, mix the mincemeat with the chopped apricots until well combined. Divide the mixture equally among the pastry cases. Top each tart with some of the grated marzipan. Slide the muffin tin onto the hot baking sheet and bake in the oven for 12-15 minutes, or until golden-brown and crisp. Dust with icing sugar and serve warm. ","ingredients":" 175g\/6oz plain flour,  75g\/2½oz cold butter, cubed,  25g\/1oz icing sugar, plus extra for dusting,  1 large orange, grated zest only,  1 free-range egg, beaten,  250g\/9oz good-quality ready-made mincemeat,  100g\/3½oz ready-to-eat dried apricots, finely chopped (do this in a food processor if you're short on time),  125g\/4oz uncoloured marzipan, grated","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mincemeat_and_orange_21941"}