{"recipe_name":"Mincemeat flan with orange Chantilly ","author":"The Hairy Bikers","programme":"The Hairy Bikers' Cook Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5. Make the pastry in a food processor: blend the flour with a pinch of salt and the sugar. Add the butter and lard to the processor and pulse briefly. Add the egg yolk and enough cold water to make a stiff dough (set aside the egg white). Use the pulse button on the processor to bring the mixture together. Roll out three-quarters of the pastry and line a 23cm\/9in flan tin or pie plate with it. Fill the tin or pie plate with the mincemeat.   Roll out the remaining portion of pastry to cover the top, cutting out a 7½\/3in hole in the middle with a plain cutter. Place the pastry ring on top of the flan, crimp round the edge to decorate and seal. Cover the hole with a piece of foil cut to the same size as the hole and bake the flan in the oven for 35-40 minutes. About five minutes before the flan is cooked, lightly beat the egg white and brush the top of the flan with it. Sprinkle with caster sugar (or icing sugar) and return to the oven. To serve, whip the cream with the liqueur, caster sugar and orange zest in a bowl. Pile the cream into the middle of the warm flan and serve hot. ","ingredients":" 250g\/8oz plain flour ,  pinch salt,  1 tbsp caster or icing sugar, plus extra for sprinkling,  125g\/4oz butter, in cubes,  55g\/2oz lard, in cubes ,  1 free-range egg, separated ,  2-3 tbsp water,  1 x 400g\/14oz jar luxury mincemeat ,  150ml\/¼ pint double cream,  2 tbsp orange liqueur, such as Cointreau or Grand Marnier,  2 tsp caster sugar,  1 small orange, finely grated zest only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mincemeat_flan_with_96385"}