{"recipe_name":"Mincemeat, apple and apricot crumble tart","author":"The Vegetarian Society","programme":null,"prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the filling, place the dried apricots and the brandy into a bowl and set aside to marinate for at least one hour. Once marinated, chop the apricots and set aside along with any remaining brandy. Grease a 22cm\/9in loose-bottomed cake tin with the vegetable oil. Roll out the shortcrust pastry until it is 2.5cm\/1in bigger in diameter than the cake tin.  Line the cake tin with the pastry and trim off any excess. Prick the base of the pastry with a fork, then chill the pastry case in the fridge for 30 minutes. Line the pastry case with greaseproof paper and fill it with dried beans or rice. Bake in the oven for 10-15 minutes, then remove from the oven, remove the beans and greaseproof paper and set the pastry case aside to cool slightly. In a bowl, mix together the mincemeat, marinated apricots and any remaining brandy until well combined. Spoon the mixture into the pastry case and spread evenly over the base. Dip the apple slices into the lemon juice and arrange them on top of the mincemeat layer. For the topping, in a bowl, mix together the flour and ground almonds until well combined.  Add the butter (or vegan margarine) and the sugar and rub the mixture together using your fingertips until the mixture resembles breadcrumbs. Sprinkle the crumble topping evenly over the apples and mincemeat. Bake in the oven for 30-40 minutes, or until the crumble is crisp and golden-brown. To serve, decorate the crumble with the toasted almonds. Divide the crumble evenly between six serving plates. Pour over the cream or spoon some crème fraîche alongside each portion. ","ingredients":" 225g\/8oz dried apricots,  8 tbsp brandy,  1 tbsp vegetable oil, for greasing,  225g\/8oz ready-made vegan shortcrust pastry,  450g\/1lb vegan mincemeat ,  225g\/8oz Bramley apples, peeled, cores removed, flesh sliced,  1 lemon, juice only,  50g\/2oz plain flour,  50g\/2oz ground almonds,  50g\/2oz butter or vegan margarine,  50g\/2oz soft brown sugar,  handful toasted flaked almonds,  2 tbsp double cream, crème fraîche, or soya cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mincemeatappleandapr_8828"}