{"recipe_name":"Barbecued lamb with baked squashes, anchovy, capers and brown butter","author":"Ben Tish","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4 as a main, 6-8 as a tapa","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Place the lamb portions in a bowl and drizzle over some olive and season with salt and pepper. Leave to marinade while the squash is cooking. Place the squash pieces on a baking tray. Drizzle over a little olive oil and add the chilli, garlic, 50g\/1¾oz of the butter and a good amount of seasoning. Mix the squash with your hands ensuring it’s fully coated.  Place the tray in the oven and cook until the squash starts to caramelise, then turn the heat down to 160C\/325F\/Gas 3 and continue to cook until the squash becomes tender and soft. You should turn the squash twice during this process to ensure even colouring, and so that the squash doesn’t stick.  When the squash is ready, drizzle it with the honey and set aside. Heat a barbecue or grill pan to maximum heat. Place the lamb on the grill or barbecue and cook for 3-4 minutes on each side, or until nicely charred and the meat still has a spring when pushed with a finger. The meat should be rosy pink inside. Leave the meat to rest for at least five minutes. Blanch the cavolo nero in a pan of salted boiling water, drain well and toss with some seasoning and extra virgin olive oil. Place a small saucepan on a high heat and add the remaining butter. Cook the butter until it turns a nut-brown colour and then immediately add the capers, lemon juice and zest and the anchovies. Season with salt and pepper and then turn off the heat. To serve, slice the lamb into 12 pieces, divide onto serving plates with the squash and cabbage and then spoon over the butter sauce.  ","ingredients":" 700g\/1lb 9oz of lamb neck fillet or lamb leg steaks, cut into 4 even portions,  olive oil, for cooking,  sea salt and pepper,  2 butternut squash, or about 1.2kg\/2lb 12oz mixed onion\/spaghetti squash, unpeeled and cut into thin wedges,  1 red chilli, seeds removed, roughly chopped,  2 garlic cloves, peeled and roughly chopped,  110g\/4oz unsalted butter, softened ,  1 tbsp blossom honey,  1 large head cavolo nero, leaves only,  extra virgin olive oil, for drizzling,  30g\/1¼oz pickled capers,  ½ lemon, zest and juice only,  4 tinned anchovies, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/barbecued_lamb_with_55922"}