{"recipe_name":"Gluten-free mince pies","author":"Michelle Berriedale-Johnson","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Mix all the dried fruits with the spices and suet if you are using it.  Put the apple, orange and lemon pieces in a food processor and purée.  Add this mixture to the dried fruit along with the brandy or whisky.  Mix well, cover and set aside for anywhere between two hours and 24 hours. Alternatively, you can place in sterilized jars and store for later use. To make the pastry, mix the flour and sieve into the bowl of a food processor. Cut in the butter or margarine and blend until it is forms crumbs.  Add 8-10 tablespoons cold water. Mix to a dough and blend until it forms a ball.  Remove from the processor and chill for 30 minutes. Pre-heat the oven to 180C\/350F\/Gas 4. Grease and flour your mince pie tins. Remove the pastry from the fridge, and roll out to a thickness of about 5mm. Cut the pastry in circles with a cutter slightly larger than the size of each pie, and line your mince pie tins with it, pushing the pastry up the edges. Spoon the mixture into each pie then rollout lids and top each pie, wetting the edges of the dough and pressing it together with your fingers. If you are using the egg, beat it in a bowl and brush the lid of each pie generously. Bake for around 20 minutes or until the pies are lightly browned and the pastry cooked. Remove from the oven and sprinkle with sugar if desired. Cool slightly before carefully lifting them out of the tins (running a sharp knife round the edges to loosen them helps) and cooling on a rack. When cold store in an airtight tin. Serve warm or cold. ","ingredients":" 100g\/3½oz raisins,  100g\/3½oz sultanas,  100g\/3½oz currants,  50g\/2oz cherries (if you use dried cherries they will not have any extra sugar, but glace ones will have sugar),  1 tsp ground ginger ,  1 tsp ground nutmeg,  ½ tsp ground mace ,  2 tsp ground cinnamon ,  50g\/2oz vegetable suet (optional),  ½ Bramley cooking apple, cored and chopped but not peeled,  1 lemon, cut into small pieces but not peeled,  1 orange, cut into small pieces but not peeled,  120ml\/4fl oz brandy or whisky,  375g\/13oz gluten-free and wheat-free flour with xanthan gum OR 200g\/7oz chickpea (gram) flour with 175g\/6oz rice flour,  150g\/5oz butter OR dairy-free margarine,  1 egg (optional),  caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mincepies_77293"}