{"recipe_name":"Minestrone with butternut squash ‘noodles’","author":"Hemsley + Hemsley","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/minestrone_with_35108_16x9.jpg","method":"Heat the ghee in a large, lidded saucepan over a low heat. Add the onion, celery and bay leaf and fry for 6-8 minutes, or until softened. Meanwhile, peel the butternut squash into spaghetti-like strands using a julienne peeler  Add the garlic, carrot, oregano, basil, chilli flakes and stock to the pan. Bring just to the boil, then reduce the heat immediately and simmer, covered, for 6-8 minutes. Add the tomatoes,chickpeas and squash strands and continue to simmer for 6-8 minutes, stirring occasionally. Stir in the cavolo nero and cook for 4-5 minutes, or until tender. Season with salt and pepper. Ladle the soup into serving bowls, then sprinkle with grated parmesan. Drizzle over a little extra virgin olive oil and serve. ","ingredients":" 1 tbsp ghee ,  2 large onions, diced                                                       ,  1 celery stick, trimmed, diced                                                         ,  1 bay leaf,  1 butternut squash, trimmed, peeled, deseeded,  3 garlic cloves, diced                                                       ,  1 large carrot, diced                                                        ,  ½  tsp dried oregano ,  ½  tsp dried basil ,  ¼  tsp chilli flakes or chopped fresh chilli ,  800ml\/1¾ pints vegetable stock ,  400g tin chopped tomatoes (or 6 large fresh tomatoes, deseeded and chopped),  2 x 400g tins cooked chickpeas, drained, rinsed,  200g\/7oz cavolo nero, tough stalks removed, leaves finely sliced ,  salt and freshly ground black pepper ,  large handful grated parmesan (or vegetarian alternative),  drizzle extra virgin olive oil","vegetarian":true,"calories":348.0,"protein":18.0,"carbs":45.0,"sugars":18.0,"total_fat":11.0,"saturated_fat":4.0,"fiber":16.0,"salt":2.5,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/minestrone_with_35108"}