{"recipe_name":"Mini beef Wellingtons with morel mushrooms, sherry and thyme","author":"Lorraine Pascale","programme":"Home Cooking Made Easy","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Roll the puff pastry out on a floured work surface to a 5mm\/¼in thickness. Trim the pastry into a 36cm\/14in square. Then cut into four smaller squares and place onto two baking trays. Chill in the fridge for five minutes. Rinse the dried mushrooms in cold water, then put them into a bowl and cover with hot water. Leave to soak for 20 minutes. Meanwhile, heat the oil in a frying pan until very hot. Season the beef well all over with salt and freshly ground black pepper. Fry for one minute on each side. Remove from the pan and set aside. Place the shallots into the pan and fry for 4-5 minutes or until softened. Add the butter and chestnut mushrooms and cook for a few minutes. Meanwhile, drain the dried mushrooms and finely chop, then add them to the pan with the glug of sherry, if using. Increase the heat and cook until most of the sherry has evaporated. Add the thyme, cook for one minute, then remove the pan from the heat and set aside. Season, to taste, with salt and freshly ground black pepper. Preheat the oven to 200C\/400F\/Gas 6.  Remove the pastry from the fridge and place a tablespoon of the mushroom mixture into the middle of each piece of pastry; spread it out to the same size as the beef steak. Top with the steak and brush the edges with the beaten egg. Draw up the corners and edges of the pastry so they meet and overlap slightly in the middle. Turn it right-side up and shape it round the sides a little with your hands. If the pastry is soft, chill it in the fridge for 5-10 minutes to firm up.  Slash the tops of the Wellingtons with a knife and brush them all over with the remaining beaten egg. Bake for 12-14 minutes (for medium-rare), or until cooked to your liking. Five minutes before the Wellingtons are ready, reheat the remaining mushroom mixture. When it is hot, add the double cream and cook on a high heat for 2-3 minutes. Remove the pan from the heat, season, with salt and freshly ground black pepper, then cover with a lid to keep warm. Serve the Wellingtons with a spoonful of the sauce. ","ingredients":" 500g\/1lb 2oz packet ready-made puff pastry,  plain flour, for dusting,  20g\/¾oz dried porcini mushrooms or large morels,  2 tbsp vegetable oil,  salt and freshly ground black pepper,  4 x 180g\/6oz slices beef fillet,  4 small shallots, peeled and very finely chopped,  knob of butter,  500g\/1lb 2oz chestnut mushrooms, finely chopped,  generous dash medium sweet sherry (optional),  large handful fresh thyme leaves,  1 free-range egg, lightly beaten,  300ml\/10fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mini_beef_wellingtons_12665"}