{"recipe_name":"Mini chocolate and cherry cakes","author":"Claire Goodwin","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 12 mini cakes","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cake, preheat the oven to 180C\/350F\/Gas 4. Grease the muffin tins with melted butter and line the bases with baking parchment. Melt the chocolate in a heatproof bowl set over a pan of barely simmering water and leave to cool slightly.  Cream the butter and two types of sugar together in a bowl. Beat the eggs in a separate bowl and add them gradually to the creamed butter.  Sieve the flour and add it to the mixture with the baking powder and cocoa. Stir to combine. Fold in the melted chocolate and cherries. Add the buttermilk and amarena syrup, and mix to combine.  Spoon the cake batter into the prepared tins until three-quarters full.  Bake for 15-20 minutes, or until a skewer inserted into the centre comes out clean. Meanwhile, make the syrup. Boil the amarena syrup, caster sugar and cherry brandy together in a pan until the sugar has dissolved and the alcohol has cooked off in part. Set aside to cool.  Once the cake is removed from the oven, syringe the syrup into the cakes, or prick the cakes with a skewer and drizzle the syrup over. Set aside to cool. For the filling, when the cakes are cool, use an apple corer to remove a cylinder from the middle of the cakes. Using a piping bag, fill the hole with whipped cream and place the cakes in the fridge. For the ganache, warm the cream to a simmer.  Break the chocolate into small pieces and add the chocolate to the cream. Whisk to a shiny dark mixture. Allow to cool and firm up a little.  Spread the chocolate ganache all over the mini cakes. Set aside to allow the ganache to firm up slightly. For the decoration, carefully roll the cakes in the sprinkles (if using) then place in the fridge to firm up.  Meanwhile, mould the yellow fondant into 32 small hearts and brush with gold dust. Roll out the fuchsia fondant and cut into 32 strips long enough to wrap around the base of the mini cakes. If the cakes need to be stored for more than a few hours, you may want to work tylose into the fondants, as this will prevent them cracking and drying out. When the ganache is firm, wrap a strip of fondant around the base of each cake, using a little water or food grade alcohol spirit to help the ends stick. Top each cake with a gold heart, securing it in place with a little leftover ganache, if required. ","ingredients":" 150g\/5½oz dark chocolate (at least 50% cocoa solids, no more than 70%),  150g\/5½oz unsalted butter, plus extra for greasing,  150g\/5½oz caster sugar,  35g\/1¼oz soft dark brown sugar,  3 large free-range eggs,  150g\/5½oz self-raising flour,  1 tsp baking powder,  50g\/1¾oz cocoa powder,  18 amarena cherries in syrup (approximately 1 jar), quartered, 5 tbsp syrup reserved ,  110ml\/3¾fl oz buttermilk ,  50ml\/1¾fl oz amarena cherry syrup (from the cherries) ,  40g\/1½oz caster sugar,  135ml\/4½fl oz cherry brandy ,  150g\/5½fl oz double cream, whipped,  100g\/3½oz double cream,  200g\/7oz dark chocolate,  120g\/4¼oz nonpareils sprinkles (optional) ,  250g\/9oz yellow fondant sugar paste,  10g\/¼oz gold lustre edible dust,  250g\/9oz fuchsia fondant sugar paste,  tylose (optional),  food grade alcohol spirit (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mini_chocolate_and_10774"}