{"recipe_name":"Mini coffee and walnut cakes","author":"Mary Berry","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 16 mini cakes","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mini_coffee_and_walnut_12591_16x9.jpg","method":"Preheat the oven to 190C\/170C(fan)\/375F\/Gas 5. Grease a 16-cup mini cake tin and line with baking parchment, or, alternatively, grease 16 chefs’ rings (5cm\/2in diameter) and place them on a baking tray lined with baking parchment.  For the cakes, place the butter, sugar, eggs, flour, baking powder and coffee essence into a bowl and beat with a wooden spoon until thoroughly blended and smooth. Fold in the walnuts.  Divide or pipe the mixture equally between the mini cake tins. Bake for about 12-15 minutes, or until well-risen and the top of the cake springs back when lightly pressed with a finger.  Leave to cool in the tins for a few minutes.  When cool enough to handle, turn the cakes out of the tins and remove the parchment. Leave to cool completely on a wire rack.  For the filling and decoration, beat together the butter, icing sugar, milk and coffee essence in a bowl until smooth.  When the cakes are completely cold, trim the tops if domed. Slice in half horizontally, then sandwich them together with about a quarter of the buttercream.  Spread a thin coating of buttercream around the sides of each cake and then roll the sides in chopped walnuts.  Spoon the remaining buttercream into a piping bag fitted with a small star (2D) nozzle and pipe a rose on the top of each cake. Place a chocolate-covered coffee bean over the joins. Arrange the cupcakes on the nicest cake stand you have and serve.   ","ingredients":" 150g\/5½oz butter, softened,  150g\/5½oz light muscovado sugar,  3 large free-range eggs,  150g\/5½oz self-raising flour,  1 level tsp baking powder,  1 tbsp coffee essence,  75g\/2½oz chopped walnuts,  150g\/5½oz butter, softened,  450g\/1lb icing sugar, sifted,  2 tbsp milk,  1 tbsp coffee essence,  200g\/7oz walnut halves, finely chopped,  16 chocolate-covered coffee beans","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mini_coffee_and_walnut_12591"}