{"recipe_name":"Mini fruit tarts","author":"Mary Berry","programme":"Series 2","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 12 small tartlets","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the pâte sucrée, measure the flour into a bowl.  Rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Stir in the sugar, then add the egg yolks and mix until the ingredients come together to form a dough. Knead the mixture gently until smooth.  Wrap the dough in cling film and leave to rest in the fridge for about 30 minutes.  Preheat the oven to 190C\/Fan 170C\/Gas 5.  Meanwhile, make the glaze to finish the tarts later. Warm the apricot jam in a saucepan, then pass through a sieve into a bowl.  Add a splash of water if needed to make the glaze runny.  Set aside. Roll out the chilled pastry onto a lightly floured work surface and cut out about 12 rounds using a 7.5cm\/3in round pastry cutter (preferably with smooth, rather than crimped edges). Any leftover pastry can be re-rolled once only.   Ease the pastry rounds into the bun tin and prick the bases lightly using a fork. Cut twelve 10cm\/4in square pieces of baking parchment and use them to line each pastry case (you will find the parchment sits better if you screw it up first). Fill each pastry case with uncooked lentils or rice (baking beans will be too large for the tins).  Bake the pastry cases for about 15 minutes, or until golden-brown. Allow to cool for a few minutes in the tin, then turn them out onto a wire rack. Remove the paper and lentils\/rice, and leave to cool completely.  To make the filling, whip the cream, sugar and vanilla until it forms soft peaks when the whisk is removed.  To serve, spoon a little filling into each tartlet case. Arrange the raspberries on top and brush the jam liberally over the fruits to glaze.   ","ingredients":" 100g\/3½oz plain flour,  75g\/2½oz softened butter, cubed,  75g\/2½oz caster sugar,  3 medium egg yolks,  400ml\/14fl oz double cream,  1 tsp vanilla bean paste,  1 tbsp icing sugar, sifted,  3 tbsp apricot jam ,  3 punnets raspberries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mini_fruit_tarts_30208"}