{"recipe_name":"Mini spiced apple tarte tatin with vanilla frozen yoghurt","author":"Lorraine Pascale","programme":"Lorraine Pascale: How to be a Better Cook","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mini_spiced_apple_tarte_77818_16x9.jpg","method":"For the frozen yoghurt, put the yoghurt, icing sugar and vanilla in a 15x22cm\/6x8½in rigid plastic container and mix together well. Level it with the back of a spoon. Cover and pop into the freezer for about eight hours or overnight – the yoghurt should be set firm. The ice cream will need to be given a good stir 2-3 times in this time to help avoid any ice crystals forming. This can obviously be prepared well in advance. For the tarts, peel the apples. With one of them sitting stem end up on a chopping board, slice off one of the ‘cheeks’ on one side (as close to the core as possible). Slice off the opposite cheek and discard the middle bit (or nibble around it for a chef’s perk!). Repeat with the remaining apples. Toss them in a small bowl with the cinnamon and ginger and set aside for now. Put the butter, sugar and four tablespoons of cold water in large non-stick frying pan over a low to medium heat. Stir until the butter melts and the sugar dissolves and then continue to cook for about eight minutes, swirling the pan occasionally. The sugar will caramelise turning from light brown to a medium brown.  Add the apple cheeks, cut-side down and allow to cook for two minutes. Baste with the caramel, turn the apples over and cook for a further three minutes, or until just beginning to soften. Take the pan off the heat and leave the apples to sit and cool down to body temperature while you prepare the tins and pastry.  Preheat the oven to 220C\/425F\/Gas 7 (fan 200C). Lightly grease 6 x 11cm\/4½in straight sided cake or tart tins and then line with baking parchment to stick. Arrange on a baking tray and set aside. On a lightly floured surface, roll out the puff pastry to a rectangle large enough to cut out six discs to fit the tart tins. Put a tart tin upside down near one corner of the pastry and cut around it. Repeat to give six pastry discs in total and then prick them all over with a fork. Once the apples have cooled down, remove them from the caramel onto a plate. Divide the caramel into the bottoms of each tart case. Put one apple cheek, cut side up on the sauce in each tin. Place a pastry disc on top, tucking it down the sides of the apple so that the pastry is nice and tight all the way around.  Cover with cling film and pop in the fridge for 10 minutes - or the freezer for five minutes - to firm up a bit. This is so that the pastry gets a nice rise when cooking and the flour in the pastry cooks before the butter in the pastry melts to a gooey mess. The tarts can be prepared to this stage up to a day ahead of time. After this time, bake the tarts in the oven for about 15-20 minutes, or until the pastry is firm where risen and golden-brown. Remove the frozen yoghurt from the freezer to allow to come to room temperature. Meanwhile, for the garnish, roughly chop the pecans and place them in a small frying pan (with no oil) over a medium heat. Cook for three minutes or so, tossing occasionally until aromatic. Tip the nuts onto a plate.  Once cooked, place a serving plate on top of one tarte tatin and then flip both over. Remove the tin to reveal the tart and allow the caramel to flow out. Repeat with the remaining tarts. Scatter over the pecans and a little sprinkling of ground ginger, and decorate each with a mint sprig if liked. Serve straightaway with a scoop of frozen yogurt on top.  ","ingredients":" 500g\/1lb 2oz low, no or full-fat Greek yogurt (get actual Greek yoghurt not ‘Greek-style yoghurt’),  50g\/1¾oz icing sugar, sifted ,  1 vanilla pod, seeds only, or 1 tsp vanilla extract,  3 big eating apples, such as Granny Smith ,  ½ tsp ground cinnamon ,  large pinch ground ginger ,  100g\/3½oz butter, plus extra for greasing,  150g\/5½oz caster sugar ,  plain flour, for dusting,  340g\/11¾oz pack puff pastry ,  1 large handful of pecan nuts (about 25g\/1oz),  pinch ground ginger,  6 mint sprigs (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mini_spiced_apple_tarte_77818"}