{"recipe_name":"Mini stollen ","author":null,"programme":null,"prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Makes 6 loaves","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mini_stollen_10408_16x9.jpg","method":"Mix the dried fruits, cherries, almonds, lemon zest, nutmeg, vanilla extract and brandy together in a bowl. Cover with clingfilm and set aside. Put the flour, yeast and sugar in a mixing bowl. Add the egg, 50g\/2oz of the melted butter and the milk.  Mix the ingredients together to form a dough, adding a further 1-2 tablespoons of milk if the dough is a little dry. Turn the mixture out onto a lightly floured surface and knead for 10 minutes, or until smooth and elastic.  Place in a lightly oiled bowl, cover with oiled clingfilm and leave to rise in a warm place for 1-1¼ hours, until the dough has doubled in size. Turn the dough out on to a lightly floured surface. Gradually knead in the fruit mixture until it is evenly distributed through the dough. Cover with a damp tea towel and leave to rest for 20 minutes. Preheat the oven to 180C\/350F\/Gas 4. Divide the marzipan into six pieces and roll each one into a 10cm\/4in log. Knead the dough lightly for one minute. Divide into six pieces and roll each piece out into a rectangle. Place a marzipan log just off centre of each piece of dough, brush the edges with a little milk, then fold the dough over the marzipan and press to seal. Arrange the stollen on baking trays, cover loosely with lightly oiled clingfilm and leave in a warm, draught-free place until doubled in size.  Bake the stollen, on the middle shelf of the oven for 20-25 minutes, or until risen and golden-brown. Cool on wire racks, then dust liberally with icing sugar. ","ingredients":" 175g\/6oz dried mixed fruits,  50g\/2oz glacé cherries, chopped,  50g\/2oz almonds, chopped,  2 unwaxed lemons, finely grated zest only,  ¼ tsp ground nutmeg,  1 tbsp vanilla extract,  2 tbsp brandy,  375g\/13oz strong white bread flour, plus extra for dusting,  1 x 7g\/⅛oz sachet fast-action dried yeast,  50g\/2oz caster sugar,  1 free-range egg, beaten,  70g\/2½oz unsalted butter, melted,  150ml\/5fl oz warm milk, plus extra for glazing,  200g\/7oz marzipan,  icing sugar, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mini_stollen_10408"}