{"recipe_name":"Mini venison Wellington","author":"Rachel Khoo","programme":"The Little Paris Kitchen: Cooking with Rachel Khoo","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place a large non-stick frying pan over the highest possible heat. Season the meat all over with salt and pepper. When the pan is smoking hot, put in the steaks and sear for 30 seconds on each side. Remove and set aside. In the same pan over a medium heat, gently cook the onions with the butter, sugar and salt for 20 minutes until caramelized and soft. Add the Armagnac and cook, stirring occasionally, for 10 minutes until the onions become drier.  Leave to cool for 10 minutes before blending to a smooth paste in a food processor. Refrigerate for about an hour until cold (or freeze for speed). Preheat the oven to 200C\/400F\/Gas 6 and line a baking tray with baking paper. Between two sheets of baking paper, roll out the pastry to ½ cm\/1\/5in thick. For each piece of steak cut two pastry rectangles slightly larger than the steak. Brush each piece of steak with mustard on both sides, then place in the middle of a piece of pastry. Top the steak with a heaped tablespoon of the onion mix. Brush eggwash around the pastry edges and cover with another piece of pastry. Press the edges to seal the parcel, then trim the excess pastry to leave a 1cm\/½in border and crimp with a fork. Repeat for the remaining three steaks. Cut a little cross in the top of each parcel and brush the pastry with eggwash. Place the parcels on the lined tray and bake for 12-15 minutes for medium-rare. Remove from the oven, cover with aluminium foil and leave to rest for five minutes before serving. ","ingredients":" 4 venison (or beef) steaks, each about 175g\/6oz and 2cm\/1in thick,  salt and freshly ground black pepper,  3 large red onions, finely sliced,  30g\/1oz butter ,  pinch sugar,  pinch salt,  2 tbsp Armagnac,  500g\/1lb 2oz puff pastry or croissant dough,  3 tbsp Dijon mustard,  1 free-range egg mixed with 2 tbsp water, for the eggwash","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mini_venison_wellington_44256"}