{"recipe_name":"Miniature coffee and walnut cakes","author":"Richard Burr","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 18 mini cakes","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sponge, preheat the oven to 170C\/325F\/Gas 3 and grease and line three 23x33cm\/9x13in baking trays with baking parchment. For the sponge, put the walnuts and sugar in a food processor and grind to a coarse powder consistency. Transfer to a large bowl or a freestanding mixer.  Add butter to the bowl and cream until smooth and light. Sift in the flour and continue to mix.  Add all the remaining ingredients and mix to a smooth consistency.  Divide the mixture equally between the prepared tins and smooth the surface. Bake for 10-12 minutes, or until golden-brown and springy to touch. Leave to cool for a few minutes before turning out of the tins onto wire racks.  When the cakes are completely cool, cut out 54 circles using a 5cm\/2in round cutter.  For the filling, sift 350g\/12oz icing sugar into a large bowl or a freestanding mixer. Add the butter, half the coffee mixture and the lustre dust and mix until you have a smooth buttercream icing with a soft golden shimmer. Transfer to a piping bag fitted with a plain nozzle.  For the topping, mix the remaining coffee paste with four tablespoons of water. Sift the remaining icing sugar into a bowl and stir in the coffee mixture to make glacé icing for the tops of the cakes. If the icing is very thick add more water until the icing runs off a spoon in thick ribbons. To assemble the cakes, take a third of the cake circles and pipe coffee buttercream icing on top. Top with another circle of cake and pipe more buttercream on top. Add a final layer of cake and drizzle the glacé icing over. Top with crushed walnut pieces and chocolate coffee beans, if using. ","ingredients":" unsalted butter, for greasing ,  75g\/2½oz walnut pieces ,  225g\/8oz caster sugar ,  225g\/8oz unsalted butter ,  175g\/6oz plain flour ,  3 tsp instant decaffeinated coffee granules, dissolved in 1 tbsp boiling water ,  2½ tsp baking powder ,  ½ tsp bicarbonate of soda ,  4 large free-range eggs ,  4 tsp whole milk ,  500g\/1lb 2oz icing sugar,  175g\/6oz unsalted butter,  2½ tsp instant decaffeinated coffee, dissolved in enough boiling water to make a smooth paste,  3-4 tsp lustre dust (optional),  100g\/3½oz walnut pieces, crushed  ,  chocolate coffee beans, to decorate (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/miniature_coffee_and_70008"}