{"recipe_name":"Barbecued lobster with mojo de ajo (garlic and chilli sauce)","author":"Valentine Warner","programme":"What to Eat Now","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Light the barbecue outdoors, about half an hour before you want to eat. For the mojo de ajo, heat the oil in a pan over a medium heat. Add the chopped garlic and simmer very gently in the oil for 10-15 minutes, or until softened but not coloured (it should still be off-white in colour).  Add the chopped chipotle chillies, lime juice and salt flakes, then stir well to combine. Continue to fry for 30 seconds, then remove the pan from the heat and set the mixture aside for at least three hours.  For the lobster, lay the lobster flat on a chopping board. Drive the point of a large, sharp knife or skewer into the middle of the lobster's head (at the point where a natural cross is formed at the top of the shell).  Split the body in half lengthways. Discard the green parts inside the lobster's head and snip away the elastic bands from the claws. Use a rolling pin to crack the claws, but do not peel away the shell. Brush the lobster tail meat generously with some of the garlic-infused oil from the mojo de ajo, then season with a little salt.  When the coals on the barbecue are white hot and the flames have died down, place the lobster halves, flesh-side down, onto the barbecue rack. Cook for 3-4 minutes, then turn the lobster halves over and continue to cook until the shell is a vibrant red colour. (Alternatively, cook the lobster halves for 4-5 minutes on each side under the grill.) To serve, place one barbecued lobster half onto each of two serving plates. Spoon over the mojo de ajo. Fill the empty head cavity with coriander leaves. Garnish the plates with lime wedges. Serve with cold beer. ","ingredients":" 125-150ml\/4-5fl oz light olive oil,  1 garlic bulb, cloves peeled and finely chopped  ,  2 chipotle chillies, seeds removed, finely chopped,  1 large lime, juice only,  ½ tsp sea salt flakes ,  1 x 900g\/2lb live lobster, claws bound with elastic bands,  handful fresh coriander leaves ,  1 lime, cut into wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/barbecuedlobsterwith_91631"}