{"recipe_name":"Mini filo fish pies","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 6. For the filling, heat the oil in frying pan over a medium heat. Add the onion and garlic and fry for 4-6 minutes, or until softened.  Add the mixed fish and shrimp or prawns, then pour in the wine and bring to mixture to the boil. Reduce the heat until the mixture is simmering, and continue to simmer for 2-3 minutes. Add the lime juice, lime zest, crème fraîche, parsley and mustard, then season, to taste, with salt and freshly ground black pepper. Stir well and simmer for a further 2-3 minutes. Divide the filling mixture equally among four small pie dishes or ramekins. Sprinkle over the chopped tomatoes. For the topping, scrunch up 1-2 sheets of filo pastry, using your hands, so that the scrunched pastry fits over the ramekin or pie dish. Repeat the process with the remaining sheets of filo pastry. Place one filo pastry 'lid' on top of each pie dish or ramekin. Brush the pastry lids generously all over with melted butter.  Place the pies onto a baking tray and cook in the oven for 10-12 minutes, or until the pastry is crisp and golden-brown and the filling is bubbling. Serve the individual pies on plate with a portion of baby salad leaves alongside. ","ingredients":" 2 tsp vegetable oil,  1 onion, peeled, sliced,  1 garlic clove, crushed to a paste with the edge of a knife,  500g\/1lb 2oz assorted fish fillets (such as salmon, whiting, pollack), skin removed, cut into pieces,  125g\/5¼oz cooked shrimp or prawns,  75ml\/3fl oz white wine,  ½ lime, juice and zest,  250g\/9oz crème fraîche,  1 tbsp chopped fresh parsley leaves,  1 tbsp wholegrain mustard,  salt and freshly ground black pepper,  2 ripe tomatoes, finely chopped,  4-6 sheets filo pastry,  125g\/4½oz butter, melted,  mixed baby salad leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/minifilofishpie_92714"}