{"recipe_name":"Mint-stuffed lamb shoulder with boulangère potatoes and mint sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mint-stuffed lamb shoulder, preheat the oven to 170C\/340F\/Gas 3½. Heat a frying pan and add the butter. Once hot, add the onion and garlic and cook for 3-4 minutes until soft. Put the onion and garlic in a bowl and allow to cool, then add the rest of the ingredients, apart from the lamb shoulder, and mix together to make stuffing. Place the lamb shoulder on a board and spread the mint stuffing inside the lamb. Roll up and tie with kitchen string. Place the lamb directly on the rack in the oven and cook for one hour while you prepare the potatoes. For the boulangère potatoes, mix the potatoes and onions in a bowl and season with salt and pepper. Use the butter to cover the bottom of a deep baking tin. Layer the potatoes and onions on top and pour over the stock.  Put the roasting tin on a low shelf in the oven and place the lamb directly on the shelf immediately above - so that the juices will drip onto the potatoes.  Cook the lamb and potatoes for another two hours. For the mint sauce, put the chopped mint into a small bowl. Heat the vinegar and sugar in a saucepan until simmering and pour the mixture onto the mint. Stir until well combined. To serve, carve the lamb shoulder and place on a plate. Serve the potatoes alongside and pour over the mint sauce and lamb jus or gravy. ","ingredients":" 25g\/1oz butter ,  75g\/2½oz onion, finely chopped,  2 garlic cloves, finely chopped,  10g finely chopped mint leaves,  25g\/1oz clarified butter,  100g\/3½oz lamb mince,  25g\/1oz  fresh white breadcrumbs,  100g\/3½oz toasted peeled hazelnuts, roughly chopped,  1 lemon, zest only,  1 x 2.5kg \/2lb 12oz shoulder of lamb, boned out,  6 potatoes, peeled and thinly sliced,  4 onions, thinly sliced,  salt and freshly ground black pepper,  100g\/3½oz unsalted butter,  350ml\/12fl oz chicken or lamb stock,  1 large bunch fresh mint, leaves picked, finely chopped,  75ml\/2½fl oz malt vinegar,  25g\/1oz caster sugar,  250ml\/9fl oz lamb jus or gravy","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mint_stuffed_lamb_33581"}