{"recipe_name":"Miso-glazed cod with avocado and radish salad, tofu dressing and pickled daikon","author":"Jason Atherton","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cod, mix together the lime juice and miso, then rub it onto the cod fillets. Mix the chopped herbs together in a bowl and dip the unskinned side of the cod into them, then place on a sheet of buttered greaseproof paper. Heat the oil in a non-stick frying pan. Add the cod fillets, herb-side down, and cook for about 3 minutes on each side. Remove from the frying pan and set aside. When cool enough to handle, remove the skin. For the pickled daikon, mix the sugar and vinegar in 180ml\/\/6fl oz water. Add the daikon and set aside. For the salad, heat a large saucepan of boiling water and blanch the pear, turnips, cucumber and radishes. Drain and place in iced water, then drain again. Mix all the ingredients in large bowl, along with the avocado. For the dressing, in a blender, blend the tofu until smooth. Add all the other ingredients apart from the vegetable oil, and pulse until everything binds together. Add the vegetable oil a little at a time, while blending, until the consistency resembles a loose pudding. To serve, pour the dressing over the salad and mix then garnish with the pickled daikon. Place some greaseproof paper onto a serving plate and top with the cooked cod and grate over some fresh lime zest. ","ingredients":" 4 cod fillets, skin on,  2 limes, juice only,  80g\/3oz white miso,  ¼ small bunch chervil, finely chopped,  ½ small bunch dill, finely chopped,  ½ small bunch parsley, finely chopped,  butter for greasing,  olive oil, for frying,  2 daikons, sliced on a mandolin, then cut into circles using a 4cm cutter.,  100g\/3½oz caster sugar,  180ml\/6fl oz rice vinegar,  1 nashi pear, peeled and cut into pieces,  2 baby turnips, cut in half,  ¼ cucumber, seeds removed and cut into pieces,  ¼ bunch pink radish, cut in half,  1 avocado, peeled and cut into pieces,  320g \/11oz silken tofu ,  50ml\/2fl oz soy sauce,  30g\/1oz caster sugar ,  7g siracha sauce ,  30ml\/1fl oz sherry vinegar,  40ml\/1½fl oz sesame oil ,  120ml\/4fl oz vegetable oil ,  1 lime, zest only,  2 tbsp chopped fresh coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/miso-glazed_cod_with_13934"}