{"recipe_name":"Miso chicken with walnuts and grapes","author":"Yotam Ottolenghi","programme":"Great British Food Revival","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/miso_chicken_with_63991_16x9.jpg","method":"Place the chicken in a large bowl. Stir together the miso paste, ginger, mirin and four tablespoons of the vinegar and pour the mixture over the chicken. Mix until well combined. Cover with clingfilm and leave in the fridge to marinate for at least three hours. Overnight would be ideal. Put the shallots in a small saucepan and cover with water. Bring to the boil and cook for five minutes. Strain and cut the shallots in half lengthways. Preheat the grill to a high setting. Place the chicken pieces on a baking tray, skin-side up, with all the marinade and grill for 10 minutes. As soon as the chicken goes under the grill, heat the sunflower oil in a pan large enough to fit all the chicken. Add the shallots and fry on a medium heat for four minutes, or until browned. Add the remaining vinegar, reduce for a few seconds then pour in the wine, water, ½ teaspoon of salt and some white pepper and continue to cook for about six minutes. Remove the chicken from the grill and add it to the pan along with the cooking juices. Stir gently and bring everything to a low simmer. Cover the pan and cook for 3-4 minutes, or until the chicken is just cooked through. Remove the chicken from the pan and set it aside in a warm place. Add the walnuts, butter, maple syrup and grapes to the pan and continue cooking, stirring until the butter emulsifies, for 2-3 minutes. Serve the chicken with the sauce spooned on top and scatter over the tarragon. ","ingredients":" 8-12 free-range chicken thighs, boned and skin left on,  80g\/2¾oz white miso paste,  40g\/1½oz root ginger, finely grated,  4 tbsp mirin,  6 tbsp cider vinegar,  12 small shallots, peeled,  1 tbsp sunflower oil,  200ml\/7fl oz white wine,  6 tbsp water,  sea salt and freshly ground white pepper,  125g\/4½oz walnuts, broken,  80g\/2¾oz unsalted butter,  1½ tbsp maple syrup,  250g\/9oz small seedless red grapes,  1 tbsp chopped tarragon","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/miso_chicken_with_63991"}