{"recipe_name":"Miso glazed salmon with pickled cucumber salad and sushi rice","author":"Paul Rankin","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salmon, combine the mirin, sake and sugar in a small pan. Bring to the boil over a medium heat, to dissolve the sugar.   Add the miso paste and bring to the boil and simmer for three minutes.   Pass the miso mixture through a fine sieve and set aside to cool.  Onced cooled, coat the salmon fillets with the miso marinade, (reserving some to finally coat the salmon before cooking), and lay on a tray to marinade for at least six hours.  Once the salmon has marinated, preheat the oven to its highest setting. To cook the salmon, wipe any excess marinade off the salmon fillets and heat a dry pan until very hot.  Sear the salmon fillets briefly in the very hot pan, then place them onto a baking tray.   Rub the top presentation side of the salmon with a little miso marinade and allow to dry for at least 10 minutes.  Finish the cooking the salmon in the oven, for about five minutes until just cooked and still slightly pink inside.  For the cucumber salad, mix the cucumber, chilli, trompette mushrooms and sprinkle with the salt.   Allow the vegetables to stand for 30 minutes then rinse in cold water and pat dry with kitchen paper.   In a small pan, bring the vinegar with caster sugar to the boil, then pour it over the cucumber mixture. Allow to stand for an hour, then add the pickled ginger.   Drain the pickling liquor off the vegetables when ready to serve. For the sushi rice, in a small pan, bring the rice wine vinegar, sugar and salt up to the boil, stirring to dissolve the sugar and salt. Once dissolved, remove the mixture from the heat and allow to cool. Wash the sushi rice three or four times in cold water, and set aside in the colander for 30 minutes. Place the rice into a saucepan then add 500ml\/18fl oz water. Cover the rice and bring to the boil over a low heat.  Boil the sushi rice for 12-15 minutes until the water has been absorbed, then remove the pan from the heat, keeping the lid on, and allow finish cooking, off the heat, for 10-15 minutes more. Tip the rice into a wide bowl and fold in four tablespoons of the cooled sushi vinegar.   When the rice is cool shape it into balls or triangles. To serve, warm the sushi rice in a steamer or microwave. To serve, sprinkle the miso salmon fillet with black and white sesame seeds and place onto serving plates. Serve the pickled cucumber salad alongside with the sushi rice, sprinkled with a few sesame seeds. Garnish with herb cress and a dusting of seven spice pepper. ","ingredients":" 50ml\/2fl oz mirin,  50ml\/2fl oz sake,  75g\/3oz caster sugar,  150g\/5oz white miso paste,  4 x 125g\/4½ oz salmon fillets, skinless and boneless, any brown flesh removed,  1 cucumber, peeled in stripes, halved length-wise, seeds removed and cut into 3mm\/1\/8in slices,  1 large red chilli, halved, de-seeded, finely sliced,  9 black trompettes mushrooms, soaked and torn into strips,  ½ tsp fine sea salt,  90ml\/6 tbsp rice wine vinegar,  45g\/1¾oz caster sugar,  1½ tbsp Japanese pickled ginger, roughly chopped,  60ml\/4 tbsp rice wine vinegar,  2½ tbsp caster sugar,  ¾ tbsp fine salt,  250g\/9oz sushi rice,  black and white sesame seeds, toasted,  herb cress, such as rocket or coriander cress,  Japanese seven spice pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/miso_glazed_organic_94154"}