{"recipe_name":"Miso ramen soup with buckwheat noodles","author":"Hemsley + Hemsley","programme":null,"prep_time":"over 2 hours","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/miso_ramen_soup_with_15548_16x9.jpg","method":"Put all of the ingredients for the bone broth in a large lidded pot and cover with cold water. The water level should cover the bones by 5cm\/2in while still leaving room at the top of the pan. Cover and bring to the boil. Reduce the heat and simmer for at least 6 hours for chicken and 12 for beef or lamb, skimming off any foam that rises to the top. Strain the liquid and return to the pot, set aside.  Cook the buckwheat noodles according to the packet instructions, using plenty of water. During the first minute of cooking, use two forks to stir and separate the noodles. Drain the cooked noodles and rinse under cold running water for 15-20 seconds to stop them cooking any further. Set aside to drain, then drizzle over a little sesame oil and mix through to prevent the noodles from sticking to each other.  Divide the pak choy, mushrooms, carrot and red cabbage equally among four serving bowls. Gently heat the bone broth and stir in the grated ginger, spring onions, lime juice, miso paste and tamari. Pour the hot broth over the vegetables, sprinkle the coriander on top and serve.  ","ingredients":" 1.5kg beef bones, chicken carcasses, lamb bones (usually free from the butchers) or use the saved bones from a roast,  splash of apple cider vinegar or fresh lemon juice (optional – this can help to extract the minerals from the meat bones),  1 handful of any onions, leeks, carrots or celery ends,  1 tbsp black peppercorns,  2 bay leaves,  350g\/12oz buckwheat noodles,  1 tbsp sesame oil or extra virgin olive oil,  4 heads pak choi, trimmed and thinly sliced,  200g\/7oz mixed mushrooms, sliced,  1 carrot, julienned,  ½ red cabbage, stalk removed, leaves shredded,  5cm\/2in piece fresh root ginger, peeled, grated,  6 spring onions, trimmed, finely sliced on the diagonal,  4 tbsp lime juice,  2 tbsp miso paste, preferably unpasteurised,  1-2 tsp tamari or salt, to taste,  large handful chopped fresh coriander, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/miso_ramen_soup_with_15548"}