{"recipe_name":"Miso cod with deep-fried cabbage and pink peppercorn dressed cabbage","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cod, place the saké and mirin into a saucepan and bring to the boil. Boil for 30 seconds to burn off the alcohol, then reduce the heat. Add the white miso and stir to dissolve. Turn the heat back up and add the sugar, stirring once more to dissolve. Remove from the heat, transfer to a large bowl and allow to cool. Place the cod fillets into the cold miso mixture, cover and place in the fridge for at least 24 hours, preferably 48 hours. When you're ready to cook the cod, preheat the grill to high and the oven to 200C\/400F\/Gas 6. Remove the cod from the miso mixture and wipe off any excess, then place onto a baking sheet. Place under the grill for 2-3 minutes until golden, then remove and place in the oven for ten minutes until cooked through. For the deep-fried cabbage, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Place the shredded savoy cabbage into the hot oil and fry for 30-45 seconds, or until crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. Sprinkle over the sugar and salt. Meanwhile, for the pink peppercorn dressed cabbage, place the shredded pointed cabbage and coriander into a bowl. Place all the remaining ingredients into a pestle and mortar and pound together to make a light dressing. Pour over the cabbage and stir to combine. To serve, divide the deep-fried cabbage equally among four serving plates. Top each pile of cabbage with a piece of cod and place a small pile of dressed cabbage on top of each cod fillet. ","ingredients":" 75ml\/3fl oz saké,  75ml\/3fl oz mirin (available from some supermarkets and Asian grocers),  225g\/8oz white miso paste (available from some supermarkets and Asian grocers),  110g\/4oz granulated sugar,  4 x 200g\/7oz cod fillets,  vegetable oil, for deep frying,  6 outer leaves savoy cabbage, finely sliced,  ½ tsp soft brown sugar,  ½ tsp sea salt,  ¼ pointed cabbage, finely sliced,  2 tbsp chopped fresh coriander leaves,  ½ tsp sugar,  ½ tsp sea salt,  1 tsp pink peppercorns,  2 tbsp mirin,  2 tbsp sesame oil,  ½ lime, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/misocodwithdeepfried_86296"}