{"recipe_name":"Mixed paella","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a paella pan or a wide, deep, heavy-bottomed frying pan. Add the chicken thighs and cook until browned on all sides. Add the pork cubes, squid and chorizo and fry until golden-brown all over, then remove from the pan and set aside. In the same pan, fry the onion and garlic for 3-4 minutes, until softened. Add the rice, rosemary, saffron and its milk, and about half of the stock. Bring to the boil, then reduce the heat to simmer for 18-20 minutes, adding more stock if the rice dries out. Return the chicken and pork to the pan, stir well and allow continue simmering for ten minutes, adding a little more stock if necessary, until the chicken is completely cooked through. Add the cooked squid and chorizo and stir well. Add the prawns, assorted fish and the tomatoes and cook for about 8-10 minutes, or until the fish and prawns are just cooked through. To serve, spoon the paella into warmed bowls with a lemon wedge alongside. ","ingredients":" vegetable oil, for frying,  4 boneless chicken thighs, skin on,  100g\/3½oz pork belly, cut into 1cm\/½in cubes,  100g\/3½oz baby squid, cut into rings,  75g\/3oz chorizo, chopped,  1 onion, chopped,  1 garlic clove ,  400g\/14oz short grain rice or paella rice (such as Calasparra),  1 tbsp dried rosemary,  pinch saffron strands, soaked in 3-4 tbsp milk,  1 litre\/1 pint 15fl oz chicken stock,  salt and freshly ground black pepper,  8 plum tomatoes, chopped,  8 king prawns, shell removed and de-veined,  125g\/4oz assorted fresh fish (such as salmon, haddock or cod), skinless, boneless, cut into chunks,  lemon wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mixedpaella_86766"}