{"recipe_name":"Monkfish blanquette with duchesse potatoes","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the potatoes, preheat the oven to 200C\/400F\/Gas 6. Bake the potatoes in the oven for about 1 hour 15 mins until tender when pierced by a knife. Remove and cool enough to handle then scoop out the flesh and pass through a fine sieve into a bowl. Beat to a smooth and fluffy purée then add the butter and egg yolks. Season to taste with salt and freshly ground black pepper. Spoon into a piping bag then pipe little pyramids onto a baking tray and place in the oven for 5-10 minutes until golden-brown. For the blanquette, put the fish stock into a large sauté pan and bring to a gentle simmer. Add the monkfish and return to a simmer, then poach for five minutes until just cooked through. Remove from the stock and set aside. Heat a heavy-based saucepan over a medium heat. Add the butter and melt, then add the flour and keep stirring until it is completely absorbed.  Gradually whisk in the fish stock, and keep stirring until all the stock has been added.  Heat a frying pan over a medium heat, add a little more of the butter and the onions and cook until coloured slightly then add the mushrooms and cook for a further two minutes then tip into the fish sauce. Return the monkfish to the sauce and bring to a simmer. Whisk the egg yolks and cream together in a bowl then gradually add to the fish sauce, whisking as you go.  Remove from the heat and continue to whisk for a couple of minutes. Stir in the tarragon and check the seasoning. To serve, place a couple duchess potatoes onto each plate. Spoon the blanquette alongside and finish with a little more tarragon. ","ingredients":" 4 large baking potatoes,  25g\/1oz butter,  3 free-range eggs, yolks only,  salt and freshly ground black pepper,  1litre\/1¾ pints fish stock ,  1kg\/2lb 2oz monkfish fillet, cut into large chunks,  25g\/1oz butter, plus extra for frying,  25g\/1oz plain flour ,  110g\/4oz baby onions peeled ,  110g\/4oz button mushrooms, quartered ,  4 free-range eggs, yolks only,  250ml\/9fl oz double cream ,  3 tbsp tarragon leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/monkfish_blanquette_with_02834"}