{"recipe_name":"Monkfish tail with blackened spices, purple sprouting broccoli and slightly spiced mussels","author":"Marcus Eaves","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fish, cover the monkfish in coarse sea salt for four minutes, then wash thoroughly in cold water, wrap the fish in a clean kitchen cloth or kitchen towel, place in the fridge and leave to dry (normally for around 4-6 hours). Once the fish is dry, coat it in the blackened curry powder until you can no longer see any of the fish’s natural colour.  Set aside until ready to cook. For the cracked wheat, heat a sauté pan until medium hot, add half the olive oil, the shallots, garlic, thyme, marjoram, bay and cumin until soft. Add the apricots and raisins and cook for two minutes. Add the ras el hanout cook for two minutes. Add the cracked wheat and turn the heat up to high until the wheat turns slightly golden-brown. Add the hot chicken stock, stir well then remove from the heat. Cover with a lid or cling film and leave to rest in a warm place for 20 minutes.  Break up using a fork then place back onto the heat to warm through with a splash more olive oil. Add the mint, coriander and chilli and check the seasoning. For the mussels, heat a sauté pan until medium hot, add the olive oil, shallots, fennel and curry powder. Cook until the vegetables are soft then add the ras el hanout, saffron and tomato paste and cook for two more minutes. Add the stock, reserving a few tablespoons for cooking the mussels later, and cook until reduced in volume by half. Add the cream and boil for 3-4 minutes. Add the Greek yoghurt and bring to boil. Add the lemon juice and season to taste with salt and freshly ground black pepper. Pass through a sieve then set aside.  To cook the mussels, heat the reserved stock in a lidded saucepan until simmering. Discard any mussels that are cracked, or any open ones that do not close when given a sharp tap.  Add the mussels and put the lid on the pan. Leave to steam until the mussels have opened. Discard any that do not open after steaming.  Remove the mussels from their shells and add to the sauce. Finish with the chopped coriander. For the broccoli, bring a pan of salted water to the boil, add the broccoli and boil for 2-3 minutes until just tender. Drain and season with a little salt and black pepper. To cook the monkfish, preheat the oven to 200C\/400F\/Gas 6. Heat the vegetable oil in a frying pan and then add the monkfish and fry one minute on each side. Then place in the oven for four minutes. Remove from oven and leave to rest for four minutes before serving.  To serve, spoon the cracked wheat into the centre of serving bowls. Carve the monkfish into two equally sized pieces and sit on top of the cracked wheat Spoon the sauce around the edge of the fish, then finish with the broccoli.  ","ingredients":" 2 x 200g\/7oz monkfish fillets, from a 1.5-2kg tail,  110g\/4oz coarse sea salt ,  110g\/4oz blackened curry powder (available from specialist suppliers),  6 stems purple sprouting broccoli,  salt and freshly ground black pepper,  2 tbsp vegetable oil,  1 tbsp olive oil ,  2 shallots, finely sliced,  1 garlic clove, sliced ,  2 sprigs thyme,  2 sprigs marjoram,  2 bay leaves,  2 tsp cumin seeds,  6 dried apricots,  6 tbsp golden raisins,  1 tsp ras el hanout,  110g\/4oz cracked wheat,  325ml\/12floz white chicken stock, hot,  1 tbsp mint leaves, shredded,  1 tbsp coriander leaves, shredded,  ½ red chilli, finely chopped,  olive oil, for fryiing,  1 shallot, finely sliced,  1 fennel bulb, finely sliced,  1 tsp curry powder,  1 tsp ras el hanout,  pinch saffron,  2 tsp tomato paste,  500ml\/18floz mussel stock or fish stock,  250ml\/9floz double cream,  250ml\/9floz Greek yoghurt,  1 lemon, juice only,  16 large fresh mussels,  chopped coriander, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/monkfish_tail_with_39134"}