{"recipe_name":"Monkfish in parma ham with crushed new potatoes and honey-glazed carrots","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6.  For the fish, place the sage on top of the monkfish fillet, then wrap the parma ham slices around the fish. Heat the oil in an ovenproof frying pan, place the monkfish into the pan, squeeze over the lemon juice and cook for a few minutes on each side, until the ham is beginning to brown. Transfer the pan to the oven and bake for 7-8 minutes, or until the parma ham is golden-brown and the fish is completely cooked-through. For the crushed new potatoes, place the cooked new potatoes into a large bowl along with the butter and season well with salt and freshly ground black pepper. Lightly crush the potatoes using the back of a fork. For the carrots, place the carrots onto a baking sheet, drizzle with oil and season well with salt and freshly ground black pepper. Transfer to the oven and cook for 5-6 minutes. Remove the carrots from the oven, drizzle with the honey and lemon juice and return to the oven for a further 3-4 minutes, or until tender and golden-brown. For the sauce, place the wine into a saucepan over a medium heat and simmer until reduced by half. Add the cream and tomato to the pan and season with salt and freshly ground black pepper.  To serve, cut the monkfish into slices and place onto a plate along with the potatoes, carrots and the sauce drizzled around. ","ingredients":" 1 monkfish fillet,  3 fresh sage leaves,  3 slices parma ham ,  1 tbsp olive oil,  ½ lemon, juice only,  250g\/9oz baby new potatoes, cooked,  25g\/1oz butter,  salt and freshly ground black pepper,  6 small carrots ,  1 tbsp olive oil,  salt and freshly ground black pepper ,  2 tbsp honey,  &facr12; lemon, juice only,  3 tbsp white wine,  3 tbsp double cream,  ½ tomato, seeds removed, chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/monkfishinparmahamwi_84884"}