{"recipe_name":"Morecambe Bay shrimp and tamarind spring rolls","author":"Dave Myers","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spring rolls, place the shrimps, beansprouts, lemongrass and galangal into a bowl and mix well. Place the tamarind paste, soy sauce and sake into a clean bowl and whisk to combine. Add to the shrimp mixture and stir to combine. Add the chilli, coriander and white pepper to the shrimp mixture and stir well. Check the balance of flavours, you have control over how sharp this dish tastes - if the mixture tastes too sharp add a bit of palm sugar. Brush a spring roll wrapper with the beaten egg. Place a quantity of the shrimp mixture into the middle of the wrap and roll up like a cigar, tucking the ends in, making sure that it is sealed totally. Repeat this process with the remaining spring roll wrappers and shrimp mixture. Fill a deep, heavy-bottomed pan half-full with groundnut oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.) Carefully add the spring rolls in batches of three or four and deep-fry until golden brown and hot inside. For the lime dipping sauce, place the garlic, ginger, chillies and palm sugar into a pestle and mortar and grind to a paste. Add the lime juice and fish sauce, then transfer to a clean bowl and mix well. For the peanut and lime vinaigrette, place all of the ingredients into a bowl and mix well. To serve, place a small handful of watercress onto plates. Place three or four spring rolls on top and serve the dipping sauces alongside. ","ingredients":" 250g\/9oz brown shrimps,  75g\/3oz beansprouts, chopped,  1 stick lemongrass, crushed and finely chopped,  2cm\/1in piece galangal, finely chopped (root ginger may be used if galangal is unavailable),  ½ tsp tamarind paste,  1 tbsp dark soy sauce ,  1 tbsp sake,  1 hot chilli, seeds removed, finely chopped,  1 tbsp finely chopped fresh coriander ,  ½ tsp freshly ground white pepper,  palm sugar (brown sugar may be used if palm sugar is unavailable), to taste,  1 packet spring roll wrappers,  1 free-range egg, beaten,  groundnut oil, for deep-frying,  2 garlic cloves, crushed,  1 x 2cm\/1in piece fresh ginger, peeled, finely chopped,  2 chillies, seeds removed, finely chopped,  1 tsp palm sugar (brown sugar may be used if palm sugar is unavailable),  5 tbsp lime juice,  3 tbsp fish sauce (nam pla),  125ml\/4½fl oz lime juice,  40g\/1½oz brown sugar,  1 tbsp fish sauce (nam pla),  ½ tsp chilli oil,  2 tbsp fresh mint, roughly chopped,  2 tbsp fresh coriander, roughly chopped,  40g\/1½oz crushed roasted peanuts, roughly chopped,  110g\/4oz watercress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/morecombebayshrimpan_85714"}