{"recipe_name":"Barnsley chops with Cumberland sauce","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/barnsley_chops_with_60141_16x9.jpg","method":"For the chops, mix all the herbs with the salt and plenty of freshly ground black pepper in a bowl. Place a quarter of the herb mixture onto a plate and rub into both sides of one of the chops. Repeat with the rest of the herb mixture and the remaining three chops until all are coated with the herbs.  For the Cumberland sauce, put the orange zest in a small saucepan, cover with 250ml\/10fl oz cold water and bring to the boil for 8-10 minutes, then drain in a sieve and set aside.  Bring the orange juice, port, redcurrant jelly and lemon juice to a simmer in a small saucepan. Cook for 8-10 minutes over a low heat, or until the jelly dissolves.  Stir in the orange and ginger strips and continue simmering gently for a further 2-3 minutes until the sauce is slightly darker in colour and syrupy. Remove from the heat and leave to stand at room temperature. The sauce will continue to thicken as it cools. Serve warm or cold. (If the sauce thickens too much, add a little water and reheat gently before serving.) Preheat the oven to 180C\/350F\/Gas 4.  Heat the oil in a large heavy-based frying pan and fry the chops over a high heat for three minutes on each side until browned but not cooked through.  Prop up the chops on the fat and cook for 2-3 minutes more until the fat is browned and rendered slightly. Transfer to the chops to a baking tray and cook in the centre of the oven for a further six minutes for medium and 8-10 minutes for well done. Remove from the oven and leave to rest for five minutes before serving.  Put the chops on warmed plates and spoon over a little of the warm Cumberland sauce. Garnish with fresh herbs. ","ingredients":" 2 tbsp chopped fresh thyme,  1 tbsp chopped fresh rosemary,  4 tbsp chopped fresh mint,  1 tsp sea salt,  freshly ground black pepper,  4 x 375g\/13oz Barnsley chops,  2 tbsp sunflower oil,  1 orange, zest cut into matchsticks, juiced,  1 piece stem ginger, drained and cut into very fine strips,  50ml\/2fl oz ruby port,  150g\/5fl oz redcurrant jelly,  ½ lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/barnsley_chops_with_60141"}