{"recipe_name":"Moroccan flatbread wraps with harissa","author":"Mike Robinson","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/moroccanflatbreadwra_72278_16x9.jpg","method":"To make the flatbread, mix the dry ingredients together and add water until a firm dough has formed.  Divide the dough into six and roll out the flatbreads thinly.  Cook in a very hot, dry, non-stick pan for one minute on each side or until brown spots appear on both sides. Now make the filling. Place the garlic, cumin, thyme, and a tablespoon of the olive oil in a bowl and coat the lamb steak well.  Leave this to marinate for one hour.   Meanwhile, brush the courgettes and aubergines with olive oil. Griddle on a hot griddle pan until the vegetables are softened and golden-brown. Set aside. Next, place the lamb steak on the hot griddle and cook for a few minutes either side.  Remove from the heat and allow to cool slightly, then slice thinly.  Mix the grilled vegetables, roasted pepper and sun-dried tomatoes in another bowl with the olives and pour the remaining olive oil and the lemon juice over them. Now make the harissa.  With a hand blender, whiz up the chillies, garlic and coriander with the lemon juice and enough olive oil to make a mayonnaise consistency. Season to taste. Lay two flatbreads on a plate and add a couple of spoons of the roasted vegetables to each. Add the sliced lamb, then some rocket, and then a spoon of harissa dressing. Repeat with the remaining flatbreads. Roll up the flatbreads and cut in half. Serve the halves around a pile of rocket drizzled with the harissa dressing. ","ingredients":" 200g\/7¼oz plain flour,  1 tsp ground cumin,  1 tsp ground coriander,  ½ tsp ground cinnamon ,  water, to bind,  pinch of salt,  1 clove garlic, finely chopped,  2 tsp ground cumin,  2 tsp thyme, chopped,  75ml\/2½fl oz olive oil,  1 lamb leg steak,  1 aubergine, sliced ,  1 courgette, sliced ,  1 roasted pepper from a jar,  50g\/1¾oz sun-dried tomatoes,  100g herby marinated olives, stoned,  1 lemon, juice only,  100g\/3½oz rocket,  4 large red chillies,  6 cloves garlic,  25g\/1oz fresh coriander,  1 lemon, juice and zest only,  olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/moroccanflatbreadwra_72278"}