{"recipe_name":"Moroccan lamb tagine with pickled lemons and herbed couscous","author":"James Martin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a large deep pan over a medium heat. Add the lamb and fry for 2-3 minutes, or until browned on all sides. Add the onion and pepper to the pan and cook over a medium heat for three minutes, making sure the vegetables don't brown. Turn up to a higher heat and add the remaining ingredients, except for the beans and coriander, and simmer gently for 10 minutes, or until the meat is cooked through. Add the beans and coriander, stir through, turn off the heat and season, to taste, with sea salt and freshly ground black pepper. Meanwhile, for the couscous, place all of the ingredients into a bowl and mic well, seasoning, to taste, with sea salt and freshly ground black pepper. For the lemons, heat the water until boiling. Add the salt and the pricked lemons and  simmer for 15 minutes, then drain and leave to cool before cutting each into quarters and serving with the tagine. ","ingredients":" 3 tbsp olive oil,  ½ onion, finely chopped,  ½ red pepper, chopped,  1 garlic clove, finely chopped,  1 lamb neck fillet, cut into bite-sized pieces,  pinch cinnamon,  1 tbsp tomato paste,  ½ tsp ground cumin,  pinch ground ginger,  ½ tbsp honey,  1 beef stock cube, crumbled,  110g\/4oz mixed beans from a can, drained and rinsed,  4 tbsp fresh coriander, roughly chopped,  salt and freshly ground black pepper,  250g\/9oz couscous, cooked according to packet instructions,  2 lemons, juice only,  small bunch fresh coriander, roughly chopped,  small bunch fresh mint, roughly chopped,  2 lemons, pricked all over with a fork,  6 tbsp rock salt,  250ml\/10 fl oz water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/moroccanlambtaginewi_84105"}