{"recipe_name":"Moroccan lamb tagine with polenta chips","author":"Lesley Waters","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Remove excess fat from the surface of the lamb and cut into 5cm\/2 inch chunks.   Heat a large non-stick frying pan or wok until hot.  Add half of the lamb chunks and sear on all sides, until brown all over. When nicely browned, remove the lamb and add approximately 100ml\/3½fl oz chicken stock.  Stir to remove any sediment from the bottom of the pan. Pour out and reserve.  Repeat this process for the remaining meat. Return the pan to the heat and add the olive oil. When hot add the onion and fry gently for approximately ten minutes, or until golden.  Add the garlic and fry for a further two minutes. Add the ground spices to the pan and fry for a further minute.  Add the reserved meat and the remaining tagine ingredients, including the stock. Bring to the boil, cover and simmer very gently for approximately two hours or until the meat is meltingly tender. Combine all the relish ingredients in a bowl. Sprinkle the pine nuts over the tagine and serve with the relish. ","ingredients":" 900g\/2lb shoulder lamb,  600ml\/1 pint chicken stock,  2 tbsp olive oil,  1 large onion, roughly chopped,  4 garlic cloves, chopped,  1 tbsp ground cumin,  1 tbsp ground coriander,  1 tbsp hot paprika,  1 x 400g\/14oz can chopped tomatoes,  1 cinnamon stick, broken in half,  175g\/6oz dried apricots,  ½ tsp ground black pepper,  3 large pieces orange peel,  2 oranges, segmented,  1 red onion, finely chopped,  1 red chilli, finely chopped,  handful fresh coriander leaves,  1 tbsp fresh mint leaves, shredded,  55g\/2oz pine nuts, lightly toasted, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/morrocanlambtaginewi_70560"}