{"recipe_name":"Easy spaghetti and meatballs","author":null,"programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/mos_magic_meatballs_53940_16x9.jpg","method":"Put the cream crackers in a plastic bag. Wrap the bag in a tea towel and bash with a rolling pin until crushed. Put the mince in a large bowl, add the mixed herbs and crushed cream crackers. Tap the egg gently on the side of the bowl and crack the egg into the bowl. Mix the mince mixture together with your hands, wet hands are best for this job. Really get squished in so all the ingredients are mixed together.  To shape the meatballs take a spoonful of the mince mixture and place in the palm of your hands. Cup your other hand over the mince and roll to make perfectly round meatballs. Make 16 meatballs, put the meatballs on a large plate and chill in the fridge for 20 minutes.   Wash your hands before the next step, it is very important to always wash your hands after handling raw meat and fish. To make the tomato sauce, heat a large pan and add the oil. Add the onion, carrots and garlic and fry for 6 minutes, or until soft but not browned. Add the tinned tomatoes and tomato purée. Season with salt and pepper and allow to simmer for 15 minutes on a low heat. Heat a tablespoon of oil in another shallow pan, add the meatballs and cook over a medium heat for a few minutes until browned on the outside. To keep your meatballs round when frying, hold the handle of the pan and shake the pan in a round action so that the meatballs never have a chance to settle and flatten and remain round.  When the meatballs are evenly browned and cooked through, add them to the tomato sauce and simmer for a further 5 minutes. Serve the meatball sauce with spaghetti. ","ingredients":" 4 cream crackers,  500g\/1lb 2oz lean beef mince ,  1 tsp dried mixed herbs,  1 free-range egg,  1 tbsp olive oil,  1 tbsp olive oil,  2 onions, finely chopped,  1 small carrot, grated,  1 garlic clove, crushed,  1 x 400g tin chopped tomatoes,  2 tbsp tomato purée,  500g\/1lb 2oz spaghetti, cooked according to packet instructions,  salt and pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mos_magic_meatballs_53940"}