{"recipe_name":"Moules marinière with garlic and parsley breadcrumbs and French fries","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a deep fat fryer to 190C\/375F. Rinse the mussels thoroughly under plenty of running water and pull off the beards, throwing away any broken ones and any which don't close tightly when you tap them.  Heat a large sauté pan or saucepan until medium hot, add the oil, shallots and thyme and cook for 4-5 minutes, or until softened. Add half the garlic, the mussels and the wine and bring to a boil. Cover with a lid and let the mussels steam; they are cooked when the shells have opened.  Add the double cream to the pan and cook for 1-2 minutes to thicken slightly. Meanwhile, heat a frying pan until hot, add the butter and heat until just foaming. Add the breadcrumbs and cook until golden brown, stirring constantly to cook evenly. Add the remaining garlic and cook through for one minute then add half the chopped parsley and stir through. Carefully drop the potato julienne into the fryer in batches and fry for 3-4 minutes, or until golden-brown and crisp. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Remove with a slotted spoon and drain onto kitchen paper then season with sea salt and a little freshly ground black pepper. To serve, pile the mussels into a large shallow bowl, spooning the juices over the top. Sprinkle the breadcrumbs over the top and serve the fries alongside. ","ingredients":" oil, for deep frying,  2kg\/4lb 8oz fresh live mussels ,  2 tbsp olive oil,  4 shallots, finely chopped ,  6 thyme sprigs, leaves picked,  4 garlic cloves, finely chopped ,  250ml\/9floz white wine,  250ml\/9floz double cream,  50g\/2oz butter,  12 tbsp fresh breadcrumbs,  6 tbsp flat leaf parsley, half finely chopped, half chopped,  4 large chipping potatoes, peeled and cut into fine julienne","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/moules_marinire_with_11252"}