{"recipe_name":"Moules marinière with lemongrass and chilli","author":"Daniel Galmiche","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lime risotto, heat 80g\/2¾oz of the butter in a medium frying pan over a low hear. Add the onion and cook gently for 3-4 minutes, stirring occasionally, until lightly golden-brown. Add the rice and turn the heat down to very low. Mix with a wooden spoon until the rice is well coated with the butter and onion. Add the stock, little by little, stirring continuously until the liquid is absorbed, then adding more stock. Carry on adding stock, stirring and then continue to add more stock until the rice has a lovely, creamy texture. Make sure the risotto does not stick to the bottom of the pan. At the last minute, stir in the chopped lime segments, the lime zest, parmesan and the rest of the butter. If the risotto is too thick, add a few more spoonfuls of stock to loosen it up, then season with salt and pepper. Serve immediately.   For the moules mariniers with lemongrass and chilli, remove and discard the beards from the mussels and wash them in a bowl under cold running water, scrubbing to remove all traces of grit. Discard any that float, any that are broken or any open ones that don’t close when tapped. Heat the oil and butter in a large saucepan over a low heat. When the butter begins to foam, add the ginger, chilli and lemongrass and cook for two minutes. Add the mussels and coconut milk and cover with a lid. Cook for four minutes or until the mussels open. Discard any that remain closed.  Remove from the heat and add the whipped cream and coriander and season with salt and pepper. Serve immediately, in a large bowl placed in the middle of the table for everyone to share with the lime risotto alongside. ","ingredients":" 135g\/4¾oz butter,  1 onion, finely chopped,  300g\/10½oz risotto rice,  900ml\/1½ pints vegetable stock,  1½ limes, finely grated zest of 1½ limes, fruit of ¾ of a lime peeled, cut into segments, chopped,  90g\/3¼oz parmesan cheese, grated,  sea salt and freshly ground black pepper,  2kg\/4lb 8oz fresh mussels,  1 tbsp olive oil,  30g\/1oz butter,  30g\/1oz ginger, peeled and thinly sliced,  1 red chilli, seeds removed, cut into thin slices,  2 lemongrass stalks, halved and bruised,  4 tbsp coconut milk,  4 tbsp whipped cream,  1 handful fresh coriander, leaves only, chopped,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/moules_marinire_with_96585"}