{"recipe_name":"Mouthwatering chicken","author":"Ching-He Huang","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a bowl, mix the grated ginger, mirin, ground Sichuan pepper, ground sea salt and crushed dried chillies together. Rub the mixture all over the chicken. Put the 2½cm\/1in pieces of spring onion in a shallow heatproof dish. Lay the chicken thighs (or drumsticks) on top.  Fill a wok or a large pan with 1 litre\/1¾ pints water and place a stainless steel steamer rack over the top. Bring the water to a simmer. Place the heatproof dish with the chicken on top of the rack, cover the pan with a lid and steam over a medium heat for 25 minutes, or until the chicken is cooked through. (The chicken is cooked when the juices run clear when the thickest part of the flesh is pierced.) Reserve the cooking juices from the dish. Take the chicken off the heat and carefully shred the chicken off the bone using a knife and fork (the chicken will be very hot). Slice and shred the skin into bite-sized pieces. Place on a serving plate.  Meanwhile, place the brown rice in a colander and wash until the water runs clear. Place the rice in a pan and add 500ml\/18fl oz water. Place over a high heat and bring to the boil, then turn the heat down to low and cover with lid. Cook for 15-20 minutes, or until the rice has absorbed all the water. Turn off the heat and fluff the rice with a fork. Keep in the warm pan until ready to serve.  For the dressing, heat a small wok or pan and add the vegetable oil. In a small heatproof bowl, add the ground Sichuan pepper and chilli flakes. Pour the hot oil over the spices, sizzling them, and then add the soy sauce, rice vinegar and toasted sesame oil. Stir in four tablespoons of the reserved cooking juices. Spoon this sauce over the chicken. For the stir-fried broccoli, heat a wok, once hot, add the oil. Add the shallot, garlic and shrimp and cook for 1-2 minutes. Add the broccoli and cook for a further 2-3 minutes. Add the remaining ingredients and cook for a further 1-2 minutes.   To serve, scatter the finely sliced spring onions over the chicken. Serve the rice in four bowls and garnish them with some toasted sesame seeds. Put the remaining reserved cooking juices from the chicken in a small bowl, serve them on the side, to use to moisten and flavour rice.  Serve the broccoli alongside the chicken. ","ingredients":" 2½cm\/1in piece fresh root ginger, peeled and grated ,  2 tbsp mirin ,  ½ tsp ground Sichuan pepper ,  ¼ tsp ground sea salt ,  ½ tsp crushed dried chilli flakes ,  400g\/14oz free-range chicken thighs or drumsticks,  110g\/4oz spring onions, two finely sliced and the remainder sliced into 2½cm\/1in pieces,  2 tbsp vegetable oil ,  ½ tsp ground Sichuan pepper,  ½ tsp crushed dried chilli flakes ,  1 tbsp light soy sauce ,  1 tbsp rice vinegar ,  1 tbsp toasted sesame oil,  2 tbsp flavourless oil, such as vegetable oil,  1 banana shallot, sliced,  1 garlic clove, sliced,  25g\/1oz dried baby shrimp ,  1 head Gai Lan (Chinese broccoli), cut into florets,  2 tbsp light soy sauce,  2 tbsp black rice vinegar,  2 tbsp toasted sesame oil,  400g\/14oz brown rice,  50g\/1¾oz sesame seeds, toasted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mouthwatering_chicken_34426"}