{"recipe_name":"Mozzarella skewers with roasted tomatoes","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/355F\/Gas 4. Thread two pieces of mozzarella onto each of four wooden skewers, that have been soaked in water for ten minutes, or until all the mozzarella has been used up. Dredge each mozzarella skewer in the seasoned flour, then dip into the beaten egg to coat. Dip and roll the mozzarella in the breadcrumbs to completely coat the cheese.  Heat the oil in a deep frying pan until it's almost smoking hot. Add the skewers and fry, turning regularly, until they are crisp and golden-brown all over. Carefully remove from the oil with a slotted spoon and drain on kitchen paper. For the tomato and anchovy sauce, place the tomatoes, cut-side up, into a shallow ovenproof dish. Place the anchovies on top of the tomatoes and season with salt and freshly ground pepper. Drizzle over the olive oil, then place into the oven to roast for 20 minutes, or until softened.  Once the tomatoes are cooked, add the lemon juice, thyme, garlic, pine nuts and red wine vinegar and mix gently with a spoon.  To serve, place a spoonful of the tomato and anchovy sauce onto each plate and serve with a mozzarella skewer on top. ","ingredients":" 450g\/16oz buffalo mozzarella, torn into large pieces, about 50g\/2oz each,  plain flour, seasoned with salt and freshly ground pepper,  2 free-range eggs, beaten,  fresh breadcrumbs, for rolling,  200ml\/7fl oz vegetable oil, for frying,  200g\/7oz cherry tomatoes, halved,  10 canned anchovies, rinsed and drained, finely chopped,  salt and freshly ground black pepper,  100ml\/3½fl oz olive oil,  ½ lemon, juice only,  1 tbsp fresh thyme leaves,  1 garlic clove, crushed,  1 tbsp pine nuts ,  2 tbsp red wine vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mozzarellaskewerswit_85482"}