{"recipe_name":"Mulled wine trifle ","author":"Tony Singh","programme":"Christmas Kitchen with James Martin","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cake, preheat the oven to 180C\/350F\/Gas 4.  Grease a 18cm\/7in cake tin and line the base with baking parchment. Cream the butter and sugar together in a bowl. Beat in the eggs, one at a time, beating all the time and adding a tablespoon of the flour with the last egg to prevent splitting. Sift the flour and gently fold it in, with enough milk to give a mixture that falls slowly from the spoon. Fold in the zest and nutmeg. Spoon the mixture into the prepared tin and lightly level the top. Bake on the middle shelf of the oven for 30-40 minutes, or until golden-brown. Remove the cake from the oven and set aside to cool. It is best to let the cake go stale for a day or two so that it soaks up more jelly. For the mulled jelly, place the red wine with the spices, sugar, orange zest and orange juice into a saucepan over a high heat. Bring to the boil and then reduce the heat to simmer for ten minutes. Strain and discard the spices; then measure the liquid. Top up with boiling water to the amount of liquid need for the instructions on the packet of strawberry jelly. Make the jelly as directed on the packet and set aside. To assemble, cut the cake into cubes and put in a large trifle bowl. Scatter over half of the fruit cocktail and pour half of the jelly on top of the sponge. Place in the fridge to set. Once set, pour on the rest of the jelly and the rest of the fruit and return to the fridge to set again. For the custard, put the egg yolks, caster sugar, cornflour and vanilla extract into a large bowl and whisk until blended.  Heat the milk and cream together in a pan until hot, but not boiling.  Gradually whisk this into the egg yolk mixture a little at a time, then return the mixture to the pan. Stir over a high heat until the mixture just comes to the boil and the custard thickens. Take off the heat and cover with cling film in contact with the surface to prevent a skin forming while it cools. Pour over the cooled custard, cover and leave until completely cold before transferring to the fridge to chill and set. To finally assemble, beat the whipping cream in a bowl until a ribbon of cream falls from the whisk when the whisk is removed. Gently spread the cream over the surface of the set custard and scatter with the almonds and top with glacé cherries.  ","ingredients":" 175g\/6oz butter, at room temperature,  175g\/6oz caster sugar,  3 free-range eggs,  250g\/9oz self-raising flour ,  2-3 tbsp milk,  2 lime zest, only,  2 pinches finely ground nutmeg,  240ml\/8¾fl oz red wine,  2 x 5cm\/2in cinnamon,  thumb-nail sized piece ginger, bashed ,  8 green cardamom pod, bashed ,  1 clove,  2 tbsp caster sugar,  1 orange, juice and zest,  1 packet strawberry jelly,  2 x 400g\/14oz tins fruit cocktail in light syrup, drained,  250ml\/9fl oz whipping cream,  25g\/1oz flaked almonds, toasted,  small handful glacé cherries,  3 large free-range eggs, yolks only,  50g\/1¾oz caster sugar,  50g\/1¾oz cornflour,  1 tsp vanilla extract,  600ml\/1 pint whole milk,  300ml\/10½fl oz single cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mulled_wine_trifle_96060"}