{"recipe_name":"Muscovado and hazelnut tart with yoghurt sorbet","author":"Sat Bains","programme":"Great British Menu","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the yoghurt sorbet, place the sugar and boiling water into a small pan and bring back to the boil, stirring to dissolve the sugar. Once dissolved, boil for a few seconds, then remove from the heat and leave to cool.  When the sugar syrup is cold, pour it into a bowl with the yoghurt and lemon juice. Taste and add a little more lemon juice if necessary. Churn in an ice cream machine according to the manufacturer's instructions for about 15 minutes, or until softly set, then transfer to a container and freeze.  Preheat the oven to 200C\/400F\/Gas 6.  For the tart, place the sugar (except the one tablespoon for sprinkling), flour, butter and nuts into a food processor and pulse until the mixture resembles coarse breadcrumbs. Remove half the mixture from the food processor and spread it over the bottom of a 20cm\/8in round non-stick tin that is 5cm\/2in deep (not loose-bottomed). Pat the mixture down gently with the back of a spoon as you would for a cheesecake base, without pressing too firmly.  Tip the other half of the mixture into a bowl. Crack in the egg, add the baking powder and soured cream and beat to make a smooth batter. Pour this mixture over the crumb base. Sprinkle over the reserved tablespoon of muscovado sugar. Transfer to the oven and bake for about 25 minutes, or until just firm. To check if it's done, insert a skewer into the centre - it should come out clean. Allow the tart to reach room temperature before serving. To serve, cut the tart into wedges and sprinkle over the chopped hazelnuts. Serve with a scoop of the yoghurt sorbet. ","ingredients":" 50g\/2oz caster sugar,  120ml\/4fl oz boiling water ,  500ml\/18fl oz good-quality plain yoghurt,  ½ lemon, juice only, strained,  150g\/5½oz dark muscovado sugar, plus 1 tbsp for sprinkling,  120g\/4½oz plain flour, sifted,  50g\/2oz salted butter, softened,  100g\/4oz hazelnuts, shells removed, toasted ,  1 large free-range egg ,  ½ tsp baking powder,  150g\/5½oz soured cream,  1 tbsp hazelnuts, shells removed, toasted, finely chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/muscovadoandhazelnut_86417"}