{"recipe_name":"Mushroom and parmesan torte","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Grease a 20cm\/8oz spring-form cake tin with butter and dust with a little of the parmesan. Heat the oil and the butter in a frying pan and fry the mushrooms and red onions for 3-4 minutes. Season, to taste, with salt and freshly ground black pepper. Remove from the heat and allow to cool, then transfer half of the mushroom mixture to a food processor and blend to a smooth paste. Transfer the mushroom paste to a large bowl. Add the remaining, unblended mushroom mixture, the cream, the eggs and the peas and mix well. Add half of the parmesan and stir to combine. Spoon the mixture into the prepared tin and sprinkle with the remaining parmesan. Transfer to the oven to bake for 40-50 minutes, or until set. Remove from the oven and leave to cool, then release the sides of the tin and place onto a serving plate. Meanwhile, for the chutney, heat the olive oil in a frying pan. Add the onions and fry until soft. Add the vinegar, garlic, chilli paste and sugar, stir well and cook over a low heat for 45 minutes, stirring occasionally, to prevent burning. To serve, place generous slices of the torte onto plates with a spoonful of the chutney alongside. Garnish with a handful of salad leaves drizzled with mustard vinaigrette. ","ingredients":" 75g\/3oz butter, plus extra for greasing,  175g\/6oz parmesan, or similar vegetarian hard cheese, finely grated, plus extra for dusting ,  oil, for frying,  small knob of butter,  175g\/6oz button and\/or field mushrooms, chopped,  2 red onions, finely chopped,  225ml\/7½fl oz double cream,  3 free-range eggs, beaten,  100g\/3½oz frozen peas,  2 tbsp olive oil ,  4 onions, finely chopped,  75ml\/3fl oz vinegar,  1 garlic clove, crushed,  1 tbsp chilli paste, from a jar,  75g\/3oz brown sugar,  salt and freshly ground black pepper,  mixed salad leaves,  mustard vinaigrette","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mushroomandparmesant_85571"}