{"recipe_name":"Mushroom, cheese and bacon burger with sautéed potatoes and onions","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the burger, place the mince, onion, garlic, rosemary and seasoning into a bowl and mix well. Using your hands, shape the mixture into a large patty. Heat a frying pan, rub the burger with olive oil and fry on both sides for 3-4 minutes, or until completely cooked through. Remove from the pan, set aside and keep warm. For the toppings, add the oil to the pan and fry the bacon until crisp. Remove from the pan and set aside. Place the onion wedges into the pan and fry for 4-5 minutes, stirring frequently, until softened. Remove from the pan and set aside. Place the mushrooms into the pan and sauté for 3-4 minutes. For the sautéed potatoes, heat the olive oil in a frying pan and sauté the potato cubes for five minutes, stirring occasionally. Add the rosemary and garlic and fry for a further minute. To serve, place one slice of toasted ciabatta onto a serving plate and top with the burger, the mushrooms and the cheese. Using a mini-blowtorch, heat the cheese until slightly melted. Top with the bacon, followed by the other slice of toasted ciabatta. Scatter the fried onions and sautéed potatoes around the plate. ","ingredients":" 125g\/4½oz minced beef ,  ¼ onion, finely chopped,  1 garlic clove, finely chopped,  1 tsp chopped fresh rosemary,  salt and freshly ground black pepper,  1 tbsp olive oil,  1 tbsp olive oil,  2 rashers bacon,  ½ onion, cut into wedges,  50g\/2oz mushrooms, sliced,  2 tbsp olive oil,  1 small potato, peeled and cut into small cubes, blanched and drained,  1 tsp chopped fresh rosemary ,  1 garlic clove, chopped,  2 slices ciabatta, toasted ,  50g\/2oz Port Salut cheese","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mushroomcheeseandbac_86237"}