{"recipe_name":"Mushroom pancake mamon","author":"Jean-Christophe Novelli","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pancakes, place the egg and egg yolk and flour into a bowl and mix together to form a paste. Gradually whisk in the milk, and the tablespoon of sunflower oil to form a smooth batter. Heat a non-stick frying pan. Add a small amount of sunflower oil, swill round to coat the base of the pan and tip out the excess. Pour some of the pancake mixture into centre of the pan and tip the pan in a circular motion to thinly coat the base. Cook the pancake until it sets, and turns a light golden colour. Turn the pancake over with a palette knife, and cook the other side for another minute, or until golden. Tip out onto a plate and cover with a damp tea towel to prevent the pancake from drying out while you cook the rest of the pancakes. For the mushroom filling, preheat the grill to its highest setting. Heat a frying pan until hot, then add the olive oil, onion, bacon and thyme and fry for 3-4 minutes. Add the mushrooms and cook for a further 1-2 minutes. For the blue cheese glaze, place all the ingredients in a food processor and blend to form a smooth paste. To finish, lay a pancake flat onto a clean flat surface. Spoon the mushroom mixture into the centre and top with a spoonful of cream. Roll the pancake up, like a cigar, then place into a serving dish, and repeat with the second pancake. Spoon the Stilton glaze over the pancakes, and place under the hot grill to cook until the blue cheese glaze is melted and golden brown. Serve in the dish at the table. ","ingredients":" 1 free-range egg,  1 free-range egg yolk,  110g\/4oz flour,  300ml\/10½fl oz milk,  1 tbsp sunflower oil (for pancake mix),  extra sunflower oil (for cooking),  olive oil,  ½ onion, finely sliced,  60g\/2oz smoked bacon, finely chopped,  sprig fresh thyme,  200g\/7oz field mushrooms, halved and sliced,  200g\/7oz Stilton,  25g\/1oz unsalted butter,  2 free-range egg yolks,  salt and freshly ground black pepper,  2 tbsp double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mushroompancakemamon_83638"}