{"recipe_name":"Mushroom stroganoff on garlic bruschetta with seared beef","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the mushroom stroganoff, heat the oil and butter in a pan and gently fry the onion until it starts to soften. Add the mushrooms and paprika and continue to fry for 4-5 minutes. Add the white wine and simmer until slightly reduced, then pour in the cream and bring to simmering point. Season with salt and freshly ground black pepper and add the lemon juice and chives. Meanwhile, for the bruschetta, heat an ovenproof griddle pan until smoking hot. Drizzle the bread with olive oil and sprinkle over the garlic. Place into the pan, weighing the bread down with a saucepan. Griddle until the bread is golden-brown on each side. Remove from the pan, but leave the pan on the heat. For the beef, rub the beef with olive oil and place into the hot griddle pan. Sear the beef quickly on each side and then transfer the pan to the oven to continue cooking for about five minutes, or until cooked to your liking. Remove from the oven and leave to rest in a warm place for a few minutes. To serve, cut both slices of grilled bread in half and arrange the four pieces on a plate. Pour over the mushroom stroganoff. Slice the beef and arrange in a fan over the top of the mushrooms. Serve with a dollop of natural yoghurt on top, sprinkle over the chives and paprika and garnish with lemon wedges. ","ingredients":" 1 tbsp olive oil,  25g\/1oz butter,  ½ onion, finely chopped,  125g\/4½oz chestnut mushrooms, quartered,  1 tsp paprika,  75ml\/2½fl oz white wine,  100ml\/3½fl oz double cream,  salt and freshly ground black pepper,  ½ lemon, juice only,  2 tbsp chopped fresh chives,  2 slices white bread,  4 tbsp olive oil,  1 garlic clove, finely chopped,  150g\/5½oz sirloin steak,  1 tbsp olive oil,  1 tbsp natural yoghurt,  1 tbsp chopped fresh chives,  pinch paprika,  lemon wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mushroomstroganoffon_88527"}