{"recipe_name":"Musical puff pastry selection","author":"Frances Quinn","programme":"The Great British Bake Off","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Makes 36 puff pastry canapés","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the puff pastry sift the flours and salt into a large bowl and place in the fridge to chill while you cut 100g\/3½oz of the cold butter into small pieces.  Remove the flour from the fridge and rub in the pieces of butter with your fingertips. Add the lemon juice and water mix and stir through the flour mixture with a round-bladed knife. Once the mixture is well combined, use your hands to form it into a ball. Wrap it in cling film and place in the fridge to chill for 15 minutes.  Place the remaining butter between two sheets of cling film and use a rolling pin to flatten it into a square. Unwrap the chilled dough and place on a very lightly floured surface. Roll out the pastry in one direction until it’s about 1cm\/½in thick and three times as long as it is wide. Straighten up the sides with your hands now and again, and try to keep the top and bottom edges as square as possible.  Remove the cling film from the flattened butter and place the butter in the centre of the pastry rectangle. Fold in the edges of the pastry and fold both ends into the centre, to completely enclose the butter and form a neat rectangle. Turn the dough so that its open edge is facing to the right, like a book. Press the edges of the pastry together with the rolling pin.  Roll out into a long rectangle and repeat the folding process again. Cover and chill in the fridge for 20 minutes. Repeat the rolling and folding process twice more. You should have a smooth dough, with buttery streaks here and there. If the pastry feels greasy at any point, or starts to spring back when as you roll, then cover and chill it for 10 minutes before continuing. Chill the finished pastry for an hour, or ideally overnight, before using. For the French framboise cream horns, preheat the oven to 190C\/375F\/Gas 5. Line a baking tray with non-stick baking parchment and lightly grease 12 cream horn moulds with butter.  Roll a third of the prepared puff pastry dough out onto a lightly floured work surface until its longest edge is 60cm\/24in long. Cut the pastry into long strips (1x60cm\/½x24in). Starting at the pointed end of a cream horn mould, wrap a pastry strip around the mould in a spiral, with each line overlapping slightly. Repeat to cover all the moulds. Brush the pastry all over with beaten egg and sprinkle with sugar. Lightly spray the prepared baking tray with water and arrange the prepared horns on top. Bake in the oven for 10–12 minutes, or until the horns are golden-brown, crisp and the pastry risen. Transfer to a wire rack to cool completely. Once cool, carefully remove the moulds using a clean tea towel to help you.  Melt the white chocolate and dip the wide end of the cream horns in it. Coat in the toasted almonds and put aside to set.  In a food processor, blend the raspberries with the icing sugar and rose extract. Lightly whip the double cream in a bowl, until soft peaks form when the whisk is removed then stir in the vanilla extract. Place a piping bag fitted with a large star nozzle in a tall glass. Place the cream on one side of the piping bag and the blended raspberries on the other. Pipe the mix into the cream horns and top with a sprig of mint, a fresh raspberry and a scattering of freeze-dried raspberries. For the millefeuille, preheat the oven to 190C\/375F\/Gas 5 and line two baking trays with non-stick baking paper. Take half the remaining puff pastry and divide it into two pieces. On a lightly floured work surface, roll out each piece into a square measuring 31x31cm\/12x12in and 5mm\/¼in thick.  Transfer the two squares of pastry to the prepared baking trays with the aid of the rolling pin. Dust with half the icing sugar and place a piece of non-stick baking parchment over the top of each square and then cover with another baking tray. Bake in the preheated oven for 10 minutes, then remove the baking tray and parchment paper and return to the oven for a further 5-10 minutes, or until crisp and lightly golden-brown. Set aside to cool.  To make the Marsala mascarpone, drain off any excess liquid from the mascarpone and place in a large bowl with the icing sugar, Marsala and vanilla extract. Beat together until smooth and creamy. Transfer to the fridge to chill and thicken slightly. To make the coffee ganache, place the cream, coffee granules and coffee liqueur in a small saucepan. Gently bring to the boil over a low heat. Place the chocolate and butter in a heatproof bowl and pour the heated cream over them. Sir together until the chocolate is melted and you have a smooth, shiny mixture. Transfer to the fridge to chill and thicken slightly. When ready to assemble the millefeuilles, gently lay the sheets of puff pastry on a chopping board. Using a sharp knife, cut each square of pastry into three equal strips (measuring approximately 10x30cm\/4x12in) and then slice each strip across into six pieces creating neat rectangles. You should have 36 rectangles.  Set aside the 12 best-looking rectangles for the top layers of the millefeuille. Dust half of these with cocoa powder and icing sugar to resemble the keys of a piano.  Dust the remaining six of the best-looking rectangles with icing sugar. Melt the dark chocolate. Fill a piping bag fitted with a small plain nozzle with the chocolate. Pipe musical notes onto the dusted puff pastry, using the chocolate covered coffee beans to represent the dots of the notes.    Lay out 12 of the remaining puff pastry rectangles for the bases of the millefeuille. Dust them lightly with cocoa powder. Fill a piping bag with the Marsala mascarpone and cover the pastry bases with neat blobs.  Lay out the remaining 12 puff pastry rectangles and dust lightly with icing sugar. Carefully place these pastry rectangles on top of each of the bases. Fill another piping bag with the coffee ganache mixture and again pipe neat blobs on to the pastry rectangles. Top each millefeuille with the decorated music pastry rectangles.  To make the palmiers, line a baking tray with non-stick baking paper and preheat the oven to 190C\/375F\/Gas 5. Stir together the ground hazelnuts and ground chocolate and set aside.  Place the remaining prepared puff pastry on a lightly sugared work surface. Roll out into a rectangle and cover both sides with caster sugar. Starting at a narrow end of the rectangle, sprinkle the ground chocolate and hazelnuts until approximately three-quarters of the pastry is covered. Starting from a narrow end of the rectangle tightly roll up the pastry till you reach the part that has no ground chocolate on it. Place on sheet of parchment paper and transfer to the fridge to chill for at least 10 minutes (to make the palmiers easier to cut).  Once chilled, carefully cut the pastry into 12 slices (each slice will resemble a bass clef). Lightly spray the prepared baking trays with water and arrange the palmiers on top. Brush with the beaten egg and bake in the oven for 10–12 minutes, or until the palmiers are golden-brown, crisp and the pastry is risen.  Melt the dark chocolate chips. Dip each of the whole hazelnuts into the melted chocolate and leave to set. Once ready to serve, arrange the palmiers and chocolate hazelnuts next to each other to resemble the bass clef and its dots.  Place the millefeuilles in two lines: one to represent the keys of a piano and another for the musical notes. Arrange the French horns in a circle. Decorate all the canapé serving plates with roses. ","ingredients":" 250g\/9oz plain flour, plus extra for dusting,  250g\/9oz strong white flour ,  1 tsp salt,  500g\/1lb 2oz unsalted butter, cold, plus extra for greasing,  ½ tsp lemon juice mixed with 250ml\/9fl oz cold water,  1 free-range egg, beaten ,  1 tbsp caster sugar, to dust,  200g\/7oz white chocolate,  100g\/3½oz flaked almonds, toasted, chopped,  300g\/10½oz fresh raspberries,  1 tbsp icing sugar, plus extra for dusting,  ½ tsp rose extract ,  300ml\/10fl oz double cream,  2 tsp vanilla extract ,  12 sprigs fresh mint, to decorate,  12 fresh raspberries, to decorate,  2 tsp freeze-dried raspberries, to decorate ,  6 tbsp icing sugar, for dusting,  6 tbsp cocoa powder, for dusting,  30g\/1oz dark chocolate, to decorate,  6-12 chocolate-covered coffee beans, to decorate,  500g\/1lb 2oz mascarpone,  100g\/3½oz icing sugar,  6 tbsp Marsala wine,  2 tsp vanilla extract,  300ml\/10fl oz double cream,  6 tsp instant coffee granules ,  3 tbsp coffee liqueur,  100g\/3½oz dark chocolate chips,  2 tsp unsalted butter,  30g\/1oz roasted hazelnuts, ground ,  30g\/1oz dark chocolate chips, ground in a coffee grinder or food processor,  50g\/1¾oz caster sugar, for dusting,  1 free-range egg, beaten,  70g\/2½oz dark chocolate chips,  24 whole blanched hazelnuts,  pink, red and white\/cream roses, for decoration","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/musical_puff_pastry_36650"}