{"recipe_name":"Mussakhan","author":"Roberta Sawalha \/ Julia Sawalha","programme":"A Taste of My Life","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. Cut the chicken in half. Rub the skin with the lemon juice and place chicken in a casserole with about 2-3cms\/1½-2 inches water, the allspice, the roughly chopped onion and the bay leaf. Cover the casserole with a tight-fitting lid, place on the hob and simmer the chicken on a medium heat for about 45 minutes, until just cooked. (You may need to add more water to stop the casserole from drying out.) Drain the chicken and reserve the stock. Brush the chicken pieces with olive oil, place in a roasting tin and place in the preheated oven until the skin is lightly browned (this should take about 20 minutes). While chicken is roasting, finely chop the 700g\/1½lbs onions. Heat the olive oil and sunflower oil in a large pan, add onions and fry gently for about 10-15 minutes until soft and golden. Add the sumac and sauté, stirring constantly, for three or four minutes, adding more olive oil if the mixture seems dry. Add the chicken stock, cover and simmer very slowly, uncovered for 20 minutes. Meanwhile, fry the pine nuts in a little oil. At the end of cooking time, remove the browned chicken from the roasting tin. Brush the tin with olive oil and cover the bottom of the roasting tin with a layer of the flatbread and spoon over most of the onion\/sumac mixture, reserving some to go on top of the chicken. Replace the chicken on top of the bread, spoon over reserved onion\/sumac mixture and return to the oven for a further 10-15 minutes.     Serve the chicken, sprinkled with the pine nuts, on top of the bread. ","ingredients":" 1 small chicken,  1 lemon, juice only,  scant ½ tsp ground allspice,  1 medium onion, roughly chopped,  1 fresh bay leaf,  olive oil, for brushing,  700g\/1½lbs onions,  3-4 tbsp olive and sunflower oil, mixed, plus extra for frying pine nuts,  2-3 tbsp sumac (a dried, sour berry, available from Middle Eastern shops; if unavailable, substitute more lemon juice),  475-700ml\/16-25fl oz\/3\/4-1¼ pints chicken stock,  2 large handfuls pine nuts,  Lebanese flatbread or similar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mussakhan_80246"}