{"recipe_name":"Mussel broth  ","author":"Paul Ainsworth","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Wash the mussels under plenty of cold, running water. Discard any open ones that won't close when lightly tapped. Pull out the tough, fibrous beards protruding from between the tightly closed shells and then knock off any barnacles with a large knife. Give the mussels another quick rinse to remove any little pieces of shell.  Set aside. Over a low to medium heat, fry the shallots in a large pan in a little olive oil until soft, but still colourless. Add the garlic, both the pickled and fresh ginger, sliced chillies, kaffir lime leaves, palm sugar and lemongrass. Cook this gently for another eight minutes, adding a little water if the mixture starts to colour.   Pour in the fish stock, bring to a simmer and cook until the volume of liquid has reduced (about five minutes). Add the coconut milk and simmer for a further 5-8 minutes. Taste the broth, check the seasoning and adjust with soy sauce and lime juice, to taste. Leave to cool.  Heat a wok or a medium-sized saucepan on a medium heat. Add the mussels, turn down the heat and cook gently with a lid on until all the mussels are open (discard any that do not open). Add the broth. Cut the sourdough bread into slices and rub it all over with olive oil. Heat a griddle pan and chargrill the bread on both sides. Sprinkle the broth with freshly chopped basil and coriander and lime zest and serve in bowls with the sourdough.  ","ingredients":" 1.5kg\/3lb 5oz mussels,  dash olive oil,  4 shallots, cut into 1cm\/½in dice ,  1 garlic clove, finely grated ,  10g pickled ginger, finely chopped ,  10g fresh root ginger ,  2 red chillies, seeds removed, cut into finely sliced rings,  3 kaffir lime leaves,  15g\/½oz palm sugar,  1 stick lemongrass, finely chopped ,  1 litre\/1¾ pints fish stock, cooked until reduced to 500ml\/18fl oz ,  ½ x 200ml\/7fl oz tin coconut milk ,  soy sauce, to taste  ,  1 lime, zest and juice,  1 loaf good-quality sourdough bread,  10g basil leaves torn ,  10g coriander leaves (knife run through gently)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mussel_broth_61515"}