{"recipe_name":"Mussel pie","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the bread dough, place the flour, salt and yeast into a large bowl and stir. Make a well in the centre of the flour and gradually pour in the oil and 350ml\/12fl oz water, mixing in the flour to form a soft dough. Tip out and knead on an oiled work surface for about 10 minutes or until the dough is smooth and elastic. Place it into a bowl, cover and leave to rise for 2 hours, or you can leave it in the fridge overnight. For the mussel pie, preheat the oven to 220C\/425F\/Gas 7. Clean the mussels and pull of any ‘beards’. If any mussels are open, tap them lightly on a hard surface. If they don't close, discard them. Heat a 23cm\/9in ovenproof frying pan or casserole dish and once hot add the oil and butter.  Fry the shallots, garlic and fennel in the oil and butter for 2-3 minutes until soft. Add the carrot and the tomatoes and cook for another minute. Turn the heat up and add the white wine, stirring well to scrape up any bits stuck on the bottom of the pan. Cook until the wine has reduced in volume by half then add the cream. Simmer to reduce by half. Add the fresh herbs and mussels and remove from the heat. Roll the dough out on a floured surface until you have a circle a little larger than the pan. Cover the casserole with the dough and tuck the edges in around the sides.  Brush the top of the dough with the beaten egg and place in the oven for 15-20 minutes until golden-brown. To serve, take the pan to the table and serve straight away. (Do not eat any mussels that have not opened during cooking.) ","ingredients":" 500g\/1lb 2oz white bread flour,  1 tsp salt,  1 x 7g sachet dried yeast ,  1 tbsp extra virgin olive oil,  1 tbsp olive oil,  1 tbsp butter,  2 shallots, sliced,  2 garlic cloves, sliced,  1 fennel bulb, finely sliced,  1 large carrot, peeled into strips,  2 plum tomatoes, peeled, seeds removed and chopped,  300ml\/10½fl oz white wine,  300ml\/10½fl oz double cream,  1 tsp fresh thyme leaves – not used?,  1 tbsp flat-leaf parsley, chopped,  1 tbsp chervil, chopped,  300g\/11oz mussels in their shells, cleaned,  2 egg yolks, beaten","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mussel_pie_14813"}