{"recipe_name":"Mussel, pumpkin and saffron soup","author":"James Martin","programme":"Home Comforts at Christmas","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03b2k7m.jpg","method":"Heat half of the butter in a lidded casserole over a medium to high heat. When the butter is foaming, add half of the onion and fry for 2-3 minutes, until softened.  Pour in half of the wine and bring to the boil. Add the mussels, cover the casserole with the lid, then simmer for 2-3 minutes, or until the mussels have opened. Strain the mussels through a colander suspended over a clean saucepan. Collect the cooking liquid in the pan. Set aside to cool.  Add the remaining butter to the casserole. Fry the remaining onion for 2-3 minutes, or until softened, then add the add the pumpkin and fry for a few more minutes.  Add the garlic, thyme, the remaining wine, the stock and the reserved cooking juices (except for any gritty residue at the bottom of the pan). Add two-thirds of the cream, the star anise and the saffron and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then simmer for 6-8 minutes, or until the pumpkin is tender. While the soup cooks, pick the meat from the mussels. Discard the shells and any mussels that haven’t opened. When the pumpkin is tender, remove the soup from the heat and discard the star anise. Add two-thirds of the mussel meat and allow the soup to cool slightly.  Blend the soup, in batches, in a food processor, to a fine purée. Warm through in a clean saucepan if necessary. Season, to taste, with the lime juice and salt and freshly ground black pepper.  Serve the soup in bowls, scattered with the remaining mussels and garnished with a swirl of the remaining cream and a little cress, if using. ","ingredients":" 50g\/1¾oz butter,  1 onion, roughly chopped,  250ml\/9fl oz white wine,  500g\/1lb 2oz mussels (rinsed, de-bearded, discard any mussels that do not close tightly when tapped),  500g\/1lb 2oz pumpkin, peeled, seeds removed, roughly chopped,  2 garlic cloves, roughly chopped,  2 sprigs fresh thyme, leaves only,  400ml\/14fl oz vegetable stock,  125ml\/4½fl oz double cream,  2 star anise,  small pinch saffron,  1 lime, juice only,  salt and freshly ground black pepper,  1 tbsp red-veined sorrel cress or chopped fresh herbs, to garnish (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mussel_pumpkin_and_73735"}