{"recipe_name":"Mussel broth in a teacup with pastry top","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. To make the pastry, place the flour and butter, egg and milk into a food processor and blend until the mixture is just coming together as a dough. Remove the dough from the food processor, bring together with floured hands and roll out onto a floured surface to ½cm\/¼in thickness. Using a teacup as a guide, cut a round out of the pastry. To make the mussel broth, heat the olive oil in a lidded saucepan over a medium heat. Add the garlic and shallot and fry for two minutes.  Add the mussels and white wine, stir well and place the lid on. Allow the mussels to steam for 3-4 minutes, then remove the lid and check that all the mussels are cooked and have opened. Discard any that do not open. Allow to cool slightly then remove the mussels from their shells. Discard the shells and return the mussels to the pan. Add the curry powder and fresh parsley and stir together. Season, to taste with salt and freshly ground black pepper, and heat the mixture to simmer for three minutes. To serve, pour the mixture into the teacup used as the pastry guide. Top with the pastry circle and transfer to the oven to bake for 8-10 minutes, until the pastry has risen and is golden. Remove from the oven and serve immediately. ","ingredients":" 150g\/5½oz plain flour,  50g\/1¾oz butter,  1 large free-range egg,  30ml\/1fl oz milk,  1 tbsp olive oil,  1 garlic clove, chopped,  1 shallot, finely sliced,  50ml\/2fl oz white wine,  200g\/7oz fresh mussels in shells, beards removed,  ½ tsp curry powder,  1 tbsp finely chopped fresh parsley ,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/musselbrothinateacup_81622"}