{"recipe_name":"Mustard-crusted pork with mustard cream sauce, cardamom carrots and pear and Stilton mash","author":"Garrey Dawson","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the mustard-crusted pork, rub the pork fillet with mustard, drizzle with olive oil and season with salt and freshly ground black pepper. Heat an ovenproof frying pan until hot and sear the pork on all sides. Transfer to the oven and roast for ten minutes, or until completely cooked through. Remove from the oven and leave to rest for five minutes. Slice thickly. For the mustard cream sauce, pour the cream into a small pan and simmer until reduced by half. Add the mustard, wine, salt and freshly ground black pepper, to taste, and simmer for 2-3 minutes. Set aside in a warm place. For the cardamom carrots, heat the butter and cardamom together in a small saucepan. Add the sliced carrots and a splash of boiling water, cover with a lid and cook for five minutes. Remove the lid, stir and season, to taste, with salt and freshly ground black pepper. Set aside. For the pear and Stilton mash, place the potato cubes into a small saucepan of boiling salted water and boil until the potato is tender. Drain well, then return to the pan. Add the crumbled Stilton, cream, salt and freshly ground black pepper and mash together until smooth. Stir in the chopped pear. To serve, pile the mustard-crusted pork slices onto a serving plate with the cardamom carrots and Stilton mash alongside. Pour over the sauce. ","ingredients":" 150g\/5½oz pork fillet,  1 tbsp wholegrain mustard,  dash olive oil,  salt and freshly ground black pepper,  150ml\/¼ pint double cream,  1 tbsp wholegrain mustard,  splash white wine,  salt and freshly ground black pepper,  55g\/2oz butter,  3 cardamom pods, crushed,  2 carrots, sliced,  splash boiling water,  salt and freshly ground black pepper,  ½ large potato, peeled and cut into cubes,  85g\/3oz Stilton, crumbled,  3 tbsp double cream,  salt and freshly ground black pepper,  ¼ pear, peeled and finely chopped (chopped at the last minute to prevent browning)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/mustardcrustedporkwi_87962"}