{"recipe_name":"Nasi goreng with lime and sugar barbecued chicken","author":"Rick Stein","programme":"2007-16","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/nasi_goreng_with_lime_87031_16x9.jpg","method":"For the barbecued chicken, mix the crushed garlic, crushed white peppercorns, sugar, fish sauce and lime juice together in a bowl. Add the chicken pieces and place in the fridge to marinate for at least 2 hours or overnight.  To cook the chicken, thread the marinated chicken pieces onto parallel pairs of the soaked bamboo skewers (this helps to stop the pieces from spinning around as you turn them).  Preheat the grill to its highest setting (or prepare the barbecue). Grill the chicken skewers for 6-7 minutes, turning regularly, until golden-brown and caramelised on the outside and cooked through (no trace of pink should remain).  Slide the barbecued chicken off the skewers, cut into chunks and set aside.  For the spice paste, blend all of the spice paste ingredients in a food processor to a smooth paste.  For the nasi goreng, cook the rice in boiling, salted water for 12-15 minutes, or according to packet instructions, until just tender. Drain, rinse well with boiling hot water from the kettle, and drain well again. Spread the rice out onto a large baking tray and set aside until cold (but do not refrigerate).  Heat 1cm\/½in of the sunflower oil in a large, deep-sided frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.) Add the sliced shallots and shallow fry, stirring now and then, until crisp and richly golden-brown. Remove the onions from the pan with a slotted spoon and set aside to drain on plenty of kitchen paper. Sprinkle lightly with salt and set aside until cold and crisp.  Beat the eggs in a bowl with some salt and freshly ground black pepper.  Heat a couple of tablespoons of the sunflower oil in a small frying pan over a medium-high heat, pour in one-third of the beaten egg and cook until it has has set on top.  Flip the egg over, fry it for a few more seconds then turn it out onto a chopping board or plate, roll it up tightly and set aside until cold. Repeat the process twice more with the remaining egg.  When the egg rolls are cold, slice them into thin strips.  Heat a wok over a high heat until smoking hot. Add two tablespoons of the oil left over from frying the shallots, then add the nasi goreng paste and stir-fry for 1-2 minutes, or until fragrant.  Add the tomato purée and ketjap manis and stir-fry for a few seconds, then add the cold cooked rice and stir-fry for a further 2-3 minutes, or until heated through.  Add the barbecued chicken pieces, fried shallots and strips of omelette and stir-fry for another minute.  Add the soy sauce, cucumber and most of the spring onions and mix together well.  To serve, spoon the nasi goreng onto a large warmed platter. Sprinkle over the remaining spring onions and allow people to help themselves. ","ingredients":" 3 garlic cloves, crushed,  1 tsp crushed white peppercorns,  1 tbsp granulated sugar,  1 tbsp Thai fish sauce,  1 lime, juice only,  500g\/1lb 2oz skinned boneless chicken thighs, each cut into 2.5cm\/1in strips,  2 tbsp vegetable oil,  4 fat garlic cloves, roughly chopped,  50g\/2oz shallots, roughly chopped,  25g\/1oz roasted salted peanuts,  6 medium-hot red chillies, roughly chopped,  1 tsp blachan (shrimp paste),  1 tsp salt,  300g\/10½oz long-grain rice,  sunflower oil, for frying,  6 large shallots, thinly sliced,  2 large free-range eggs,  salt and freshly ground black pepper,  1 tbsp tomato purée,  1 tbsp ketjap manis,  1 tbsp light soy sauce,  5cm\/2in piece cucumber, cut into quarters lengthways, sliced,  8 spring onions, trimmed, thinly sliced on the diagonal,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/nasi_goreng_with_lime_87031"}