{"recipe_name":"'Nduja sausage and sheeps’ cheese pizza","author":"James Martin","programme":null,"prep_time":"overnight","cooking_time":"less than 10 mins","serves":"Makes 4 large pizzas","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/nduja_sausage_and_sheeps_56588_16x9.jpg","method":"For the pizza dough, sift the flours, sugar and salt into a large bowl and mix well. Mix the yeast and a splash of the water to a paste in a small jug. Make a well in the centre of the dry ingredients and add the yeast paste. Gradually pour over the rest of the tepid water, bringing the dry ingredients into the centre a little at a time, until the mixture comes together as a soft dough. Turn the dough out onto a lightly floured work surface and knead for 5-10 minutes, until smooth and elastic. Place the dough into a large, clean bowl and cover with a damp, clean tea towel. Set aside in a warm room to prove for 1½ hours. When the dough has almost doubled in size, knock it back by punching and kneading it a little, then divide it into four equal balls.  Place the dough balls onto a lightly greased baking tray, spaced well apart, and cover with a lightly greased sheet of cling film. Set aside to prove again, for at least four hours (in a warm room) or overnight (in the fridge).  When the dough balls have doubled in size again, preheat the oven to its highest setting. Place a heavy baking tray or pizza stone into the oven to heat up with it.  Roll one of the dough balls out onto a lightly floured work surface to a 0.5cm\/¼in thickness. Sprinkle a little flour onto an upturned baking tray and transfer the pizza base onto it.   For the topping, blend the canned tomatoes to a purée in a food processor. Spoon some of the mixture into the centre of the pizza base, spreading it almost to the edges. Sprinkle some of the sheeps’ cheese, ’ndjua and basil leaves onto the pizza, then drizzle over the peanut oil.  Working as quickly as possible, scoot the pizza into the oven by pushing it from the upturned tray onto the pizza stone or hot baking tray. Cook for 5-8 minutes, or until the base is cooked through, the cheese has melted and the tomatoes are bubbling.  Meanwhile, repeat the process with the remaining three pizza bases and the remaining topping, serving each pizza immediately. ","ingredients":" 200g\/7oz semolina flour,  800g\/1lb 12oz type ‘00’ flour, plus extra for dusting,  1 tbsp caster sugar,  1 tsp salt,  650ml\/1 pint 3fl oz tepid water,  1 x 7g sachet fresh yeast ,  1 x 400g can plum tomatoes, preferably San Marzano,  400g\/14oz sheeps’ cheese, crumbled,  300g\/11oz ’nduja (soft spicy Italian sausage, available from delicatessens or online specialists),  1 large handful fresh basil leaves,  1 tbsp peanut oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/nduja_sausage_and_sheeps_56588"}