{"recipe_name":"Basque beef with koji, creamed corn, grilled lettuce, enoki hay and red wine sauce","author":"Elizabeth Allen","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the red wine sauce, cook the beef trim in a pan with the oil until browned all over. Put the beef into a 3 litre\/5¼ pints pressure cooker.  Using the same pan, cook the shallots with a little oil until caramelised. Add the garlic, bay leaf, thyme, peppercorns and fennel seeds. Cook out for 2-3 minutes to release the aromas. In the meantime heat up the stock in a pan to a simmer. Add the red wine to the shallot pan and bring to a boil. Cook until nearly all of the wine is reduced. Remove any scrum from the surface as you do so.  Add the stock and the wine mixture to the pressure cooker and set it up according to instructions. Cook under pressure for 2 hours.  Strain the liquid and add back to a pan. Cook to reduce the liquid until the sauce is silky and shiny. This should coat the back of a spoon. If you don’t have a pressure cooker, add the stock, red wine mixture and beef to the same pan. Heat and reduce in volume slowly. When the liquid starts to get thicker in consistency strain the herbs and shallots from the mixture and continue to reduce, removing any scrum as you go. This will make a red wine sauce but not as intensely flavoured as the pressure cooker version.  For the creamed corn, heat a small saucepan with the olive oil. Gently cook the garlic and shallot until translucent. Add the thyme and sweetcorn. Stir constantly for a couple of minutes until the sweetcorn is cooked, then add the koji. Cook for another couple of minutes to cook the koji. Stir occasionally to prevent the corn from catching on the bottom of the pan then add the cream.  Cook for 5 minutes or until thick and creamy, stirring occasionally. Season to taste.  Remove the thyme from the corn. Blend in a blender, in batches if necessary, keeping some corn aside to add back in after blending to give texture. For the enoki mushroom ‘hay’, discard the top and bottom of the mushrooms, and pull apart until separated into strands. Dehydrate in a dehydrator or dry oven (no fan), at 54C. This takes 30 minutes. Store in a dry space. To prepare the dish, preheat an oven to 120C\/100C Fan\/Gas ½. Marinate the beef in the shio koji for at least 10 minutes. Don’t wash off the koji, but place the meat onto a tray and gently bash it with your hand or a pan to flatten it (to make sure the meat is even, but don’t squash it entirely. Set up a griddle (flat side) to very hot. Start cooking the sirloin on the griddle. Keep moving the steak around on different spots of the griddle. The steak is finished when there is an even golden-brown colour on each side.  Place on a tray with the clarified butter and cook in the oven for 1-2 minutes (rare), 3-4 (medium rare). Cut the Little Gem lettuce in half, gently oil and season and place straight onto the very hot griddle. It will take 1-2 minutes to colour. Once the steak is cooked, rest for a couple of minutes on a board before carving. Check the seasoning - the meat shouldn’t need any salt but you could add some cracked black pepper, to taste. Cut lettuce by the base and break apart into leaves. Place the creamed corn, steak and lettuce on serving plates. Pour over some red wine sauce and finish with the dried mushroom hay on top and sliced carrots. ","ingredients":" 200g\/7oz beef trim from sirloin steak (see below),  1-2 tbsp vegetable oil,  4 large banana shallots, sliced,  ½ garlic clove,  1 bay leaf,  ½ bunch thyme,  12 black peppercorns, cracked (optional),  1 tbsp fennel seeds,  750ml\/26fl oz veal or beef stock,  750ml\/26fl oz red wine,  1½ tbsp extra virgin olive oil,  1 garlic clove, thinly sliced,  1 small banana shallot, thinly sliced,  3 thyme sprigs tied together with kitchen string,  200g\/7oz sweetcorn,  1 tbsp unsalted butter,  4 tbsp shio koji (available online),  250ml\/9fl oz double cream,  salt and white pepper, to taste,  1 clump white enoki mushroom ,  2 x 250g\/9oz Basque sirloin beef steaks,  100g\/3½oz shio koji,  1 tbsp clarified butter,  1 Little Gem lettuce,  olive oil,  salt,  4 baby carrots, thinly sliced on a mandoline","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/basque_beef_with_koji_75586"}