{"recipe_name":"Nectar cake with hidden beehive","author":"Danny Bryden","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Makes 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the génoise, heat the oven to 190C\/375F\/Gas 5 and bring a pan of water to the boil. Grease a 18cm\/7in cake tin, line the base with parchment paper and sprinkle caster sugar over the sides. Tip out any excess sugar. Break the eggs into a large heatproof bowl set over the pan of boiling water. Add the sugar and yellow food colouring then whisk until the mixture has doubled in volume and leaves a trail on the surface when the whisk is lifted. Remove the bowl from the heat and continue to whisk until cool.  Mix the almond extract and the melted butter, then fold into the whisked egg mixture. Sift in the flour and fold in gently using a metal spoon. Pour into the prepared tin and bake for 30-35 minutes or until a skewer comes out clean.  Allow to cool in the tin. When cold, cut off the darker-coloured top, base and sides of the cake and shred the remainder with a fork to produce fine cake crumbs. For the caramelised pears, in a blender add the tinned pears, ginger syrup and caramel sauce and blend to a smooth paste. For the nectar cake, lightly butter and line the bases of two 18cm\/7in deep, round cake tins. Wrap the outside of the tins with brown paper and hold in place with string. Reduce the oven temperature to 170C\/325F\/Gas 3. In a pan, heat he butter, honey, sugar and two tablespoons of water until the sugar has disolved. Set aside to cool slightly. Sift the flour, salt, cinnamon and ginger into a large bowl. Whisk in the eggs, blended pear mix and honey mix to the flour in small amounts until completely incorporated and smooth. Divide between the cake tins and bake for 50-60 minutes or until a skewer comes out clean.  For the moulding buttercream, beat the butter and icing sugar until very soft. Slowly mix in the honey. Take a quarter of the buttercream and add a small amount of the dark brown gel colouring (to make the lines of the beehive). Remove one tablespoon of buttercream and add the black food colouring (this forms the door of the hive). Take a third of the buttercream and colour a deep yellow to form the hive. Colour the remaining buttercream with a mix of brown and yellow food colouring so it matches the inside colour of the honey nectar cake (it will be used to sandwich the cake layers together). For the honey frosting, beat the butter until soft then add the icing sugar in stages. Add the cream cheese slowly and whisk until no lumps remain. Then add the honey and beat until light and fluffy.  To make the cake syrup, in a pan dissolve the sugar in four tablespoons of water. Remove from the heat, add the Poire Willam liqueur and set aside.  For the nectar cake, cool on a wire rack for 10 minutes before turning out to cool completely.  Prick small holes over the top of both cakes and brush with the Poire William sugar syrup (avoiding the centre as this bit of the cake will be removed). When the cakes are completely cold, level the top of one sponge and cut each cake horizontally into two layers (creating a total of four layers).  For the decorations, make a bee by rolling a small piece of marzipan into an egg shape (approximately 2.5cm x 1.5cm). Melt the white and dark chocolate separately and pipe alternate stripes across the bee. Insert two flaked almonds into the sides of the bee to represent wings. To make the rose decoration, take two small pieces of sugarpaste and roll one piece into a cone shape and another into a ball with a similar diameter to the bottom of the cone. Attach the ball to the bottom of the cone – this will form the centre of the rose. To form the petals of the rose, take three balls of paste and flatten each one (the diameter should be approximately  4-5cm\/2in) making one edge as thin as possible. Attach all three petals to the bottom of the cone shape with the thin edge of the petals at the top (use your fingers to ‘mould’ them together or, alternatively, use edible glue). They should cover the cone with their seams overlapping. Mould more petals and attach in the same way, making them slightly larger for each layer until you have a large rose. Brush the edges of the rose using pearlescent paint with a fine brush. Cut off the base of the rose so that it has a flat base. In a small bowl mix 1-2 tablespoons of the génoise crumbs, one teaspoon of the Poire William syrup and all the black buttercream to form the hive door (extra black food colouring may need to be added to get a deep, even colour). In a bowl, combine the remaining génoise crumbs with two tablespoons of the Poire William syrup and the minimum yellow buttercream needed to bind it together, so it holds its shape when squeezed (so it is mouldable). This will form the body of the hive. To assemble the cake, arrange the nectar cake layers in the order you want them in the final cake, ensuring that the top of the cake will be flat. Centre each slice of nectar cake and mark with a cocktail stick. To form the cavity that the beehive will sit in, take what will form the bottom layer of the cake, turn it upside down and, using the cocktail stick as a guide, mark a 7cm\/3in circle in the centre of the cake. Cut out the circle with a knife slanted slightly inwards. Take the next layer of cake and place under the bottom layer of cake with the narrower side of the inner ring facing the next layer (the aim is to create a gently sloping cavity in the centre of the layered cake). Trace the line of the first circle and cut out as before. Repeat with the third layer, the circle should now be around 3cm. Take the top layer of cake and - taking care not to cut through the layer - cut a small circular depression in the underside and use a teaspoon to smooth it out into a shallow dome.  Assemble the cake upside down (so the cavity is visible), check that cavity is the correct shape for the hive and trim with a knife if necessary. To create the door to the beehive, mould a tightly formed dome of the black-coloured génoise (it should be approximately ½ the height of the cavity) and set aside. Spread yelow-brown buttercream in between each cake layer and reassemble the cake upside down.  Pack the top of the cavity with an even layer of the yellow buttercream and génoise crumb mix, then spread a thin layer of the dark-brown butter cream over the top. Repeat until what will be the top two layers of cake have been filled. Now place the black dome of génoise in the cavity so that the flat base lines up with what will be the bottom of the cake. Continue to pack layers of crumb mix and buttercream around it until the cavity is completely filled (the aim is to create a 5 to 6 layered hive inside the 4 layered main cake). Carefully turn the cake over, place on a stand and chill in the fridge for 30 minutes before icing. For the external frosting, give the cake a light base coat of frosting on the top and sides. Chill again until a crust forms before adding the final layer of frosting. To decorate, place the sugarpaste rose on top of the cake and stick the bee to the edge of the cake.   ","ingredients":" butter, for greasing,  caster sugar, for lining cake tin,  4 medium free-range eggs,  125g\/4½oz caster sugar,  ¼ tsp gel food colouring in yellow,  1 tsp almond extract ,  55g\/2oz butter, melted ,  125g\/4½oz plain flour,  4 tinned pear halves, drained ,  1 tbsp ginger syrup ,  1 tbsp caramel sauce ,  280g\/10oz unsalted butter, diced,  250g\/12oz runny honey (preferably orange blossom) ,  220g\/8oz light muscovado sugar,  350g\/12oz self-raising flour, sifted,  1 tsp salt,  2 tsp cinnamon,  1 tsp ginger,  4 medium free-range eggs, lightly beaten ,  300g\/10½oz unsalted butter, softened,  200g\/7oz icing sugar, sifted,  3 tsp runny honey ,  gel food colour in dark brown, black and yellow,  500g\/1lb 2oz icing sugar,  100g\/3½oz unsalted butter, softened,  250g\/9oz full fat cream cheese ,  50g\/1¾oz runny honey ,  65g\/21\/3oz caster sugar,  90ml\/6tbsp Poire William liqueur,  2 tsp undyed marzipan ,  30g\/1oz plain chocolate,  30g\/1oz white chocolate,  2 almond flakes (for the wings of the bee),  50g\/1¾oz pink sugarpaste ,  cornflour, for rolling ,  edible food glue (optional),  pearlescent lustre in pink (for petal edges)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/nectar_cake_with_hidden_06597"}