{"recipe_name":"Nest of roasted balsamic vegetables with aromatic wild rice","author":"The Vegetarian Society","programme":null,"prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas4. Place a 10cm\/4in wide flan ring upside down on a baking sheet. Lightly grease the outside of the flan ring. Brush five sheets of pastry with sunflower oil and place over the flan ring in layers at different angles, resulting in a star shape. Place in the oven for about 10 minutes or until golden brown. Leave to cool for 5 minutes, then carefully lift the nests off the rings and place upturned on a dinner plate. This needs to be done three more times, until you have four baskets. At this stage, raise the temperature of the oven to 200C\/400F\/Gas6. Wash the rice thoroughly. Add to a large pan of water with the bouquet garni and bring to the boil. Simmer on a low heat for 40 to 45 minutes, until the grains have split and are tender. Meanwhile, place all the vegetables in a large bowl and mix. Blend together the balsamic vinegar, olive oil, seasoning and one sprig of rosemary. Pour over the vegetables and set aside for 30 minutes for the vegetables to marinate. Grease a large roasting tray and spread the vegetables evenly over the tray. Cover with foil and place in the oven for 15 minutes. Remove the foil and roast for a further 15 minutes. To serve, fill each filo nest with the roasted vegetables and marinating juices. Add the wild rice around the edge of the basket and garnish with the parsley and rosemary. ","ingredients":" 1 packet of filo pastry,  3 tbsp sunflower oil,  250g\/9oz wild rice,  1 bouquet garni sachet,  1 small pumpkin, finely sliced,  1 large courgette, diced,  50g\/2oz button mushrooms,  1 red pepper, diced,  100g\/4oz French beans, steamed,  1 small radicchio,  2 tbsp balsamic vinegar,  5 tbsp olive oil,  salt and freshly ground black pepper,  2 large sprigs of rosemary,  1 bunch parsley, chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/nestofroastedbalsami_6549"}