{"recipe_name":"English asparagus with a soft egg in crisp breadcrumbs, hollandaise and fine herbs","author":"Paul Rankin","programme":"Put Your Money Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the deep-fried eggs, sprinkle the flour onto one plate, beat the two raw eggs in a bowl and sprinkle the Japanese breadcrumbs, parsley, chervil and tarragon (mixed together) onto another plate. One at a time, dredge the soft-boiled eggs first in the flour, then dip them in the beaten eggs, then roll them in the herbs and breadcrumbs mixture until completely coated.  Place each coated egg onto a sheet of greaseproof paper and chill in the fridge for at least one hour. Meanwhile, for the asparagus, cook the asparagus in boiling, salted water for 2-3 minutes. Drain well and refresh in iced water. For the hollandaise sauce, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the lemon juice and egg yolks and whisk continuously for 4-5 minutes, or until the mixture is pale and has doubled in volume. Remove the egg and lemon mixture from the heat. Gradually add the clarified butter in a thin stream, whisking continuously, until all of the clarified butter is incorporated into the mixture.  Add two tablespoons of water to the hollandaise sauce if necessary, to loosen. Keep warm until ready to use. Heat the oil in a deep fat fryer to 190C\/375F. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Carefully lower the chilled, coated eggs into the hot oil and fry for 3-4 minutes, or until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. To serve, divide the asparagus spears equally among four serving plates. Place one crisp egg on top of each serving of asparagus. Drizzle the hollandaise sauce around the edge of the plate. ","ingredients":" 100g\/3½oz plain flour,  2 free-range eggs,  4 free-range eggs, soft-boiled and refreshed in cold water,  200g\/7¼oz Japanese panko breadcrumbs,  2 tbsp chopped fresh parsley,  2 tbsp chopped fresh chervil,  2 tbsp chopped fresh tarragon,  vegetable oil, for deep frying ,  1kg\/2lb 3¼oz asparagus spears,  iced water,  1 tbsp fresh lemon juice ,  2 free-range egg yolks,  750g\/1lb 10½oz clarified butter, melted,  water, as necessary","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/newseasonenglishaspa_91397"}