{"recipe_name":"Nice and spicy Thai minced chicken salad (Larb Gai)","author":"Lorraine Pascale","programme":"Lorraine Pascale: How to be a Better Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/nice_and_spicy_thai_90314_16x9.jpg","method":"Drizzle the oil into a large frying pan over a high heat. Add the minced chicken with salt and pepper and cook for 4-5 minutes, stirring regularly and breaking it up as you do so, until it turns from pink to white. Cut a piece open to check it is cooked and then tip the chicken into a colander set over a bowl. Leave to cool for five minutes (so it doesn’t cause the herbs to wilt) while also allowing any excess liquid to drain off, if necessary. Pour the fish sauce and lime juice into a large bowl and stir in the sugar until dissolved. Add the spring onions, cucumber, red chilli, ginger, coriander, all but a small handful of the mint leaves and the peanuts and stir together well. Tip the chicken in and toss it through. Taste it and check to see if it needs a little bit more of anything to get it just to your liking.  Arrange three lettuce leaves on each of four serving plates and place a couple of spoonfuls of the mixture into each one. Scatter the remaining mint leaves over to garnish and serve. The best way to eat these is to simply just pick a cup up with your hands and bite in. ","ingredients":" 1 tbsp sunflower oil,  2 large, boneless, skinless chicken breasts (about 225g\/8oz each), minced up in a food processor,  flaked sea salt and freshly ground black pepper,  2 tbsp fish sauce,  1 lime, juice only,  1 tsp caster, granulated or soft light brown sugar,  3 spring onions, finely chopped,  ¼ cucumber, finely diced,  1-2 red chillies, finely sliced, seeds removed for less heat if preferred,  1cm\/½in piece fresh root ginger, peeled and finely chopped,  ½ bunch coriander, leaves and stalks roughly chopped (about 2 tbsp),  ½ bunch mint, leaves only, ripped ,  1 handful salted (but not dry roasted) peanuts (about 50g\/1¾oz),  12 largish crisp iceberg lettuce leaves (cup-shaped are best)","vegetarian":false,"calories":237.0,"protein":31.0,"carbs":3.0,"sugars":3.0,"total_fat":11.0,"saturated_fat":2.0,"fiber":2.0,"salt":2.3,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/nice_and_spicy_thai_90314"}