{"recipe_name":"Nigel Slater's Thai green curry","author":"Nigel Slater","programme":"A Taste of My Life","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/nigelslatersthaigree_80244_16x9.jpg","method":"For the curry paste, slice the lemongrass finely. Put it in a food processor with all the remaining curry paste ingredients and whiz to a thick paste, pushing the mixture down from time to time with a spatula. Transfer to a glass or china dish, cover tightly (otherwise it will taint everything in the fridge) and refrigerate. For the curry, cut the chicken into finger-thick strips.  Warm the oil in a casserole and, when hot and sizzling, add the chicken strips and let them colour slightly on all sides. You will need to do this in batches to avoid crowding the pan.  Remove the cooked chicken pieces from the casserole with a slotted spoon. Add the quartered mushrooms to the casserole and fry until golden-brown, adding more oil if needed.  Pour in the coconut milk and stock, then add the lime leaves, four heaped tablespoons of the curry paste, the fish sauce, peppercorns and half of the chopped herbs. Bring to the boil, then turn the heat down and simmer for 10 minutes, stirring from time to time. Return the chicken to the casserole with a further tablespoon of the paste and simmer for five to six minutes, or until the chicken is cooked through. Stir in the last of the herbs and serve. ","ingredients":" 4 lemongrass stalks, tougher outer leaves discarded ,  6 medium-hot green chillies, seeded and chopped ,  3 cloves garlic, peeled and crushed,  5cm\/2in piece of galangal or ginger, peeled and chopped,  2 shallots, peeled and finely chopped,  4 tbsp chopped fresh coriander,  1 tsp ground cumin,  1 tsp chopped lime zest,  1 tbsp nam pla (Thai fish sauce),  ½ tsp ground black peppercorns,  750g\/1lb 10oz free-range chicken breasts or thighs, bones removed,  3 tbsp groundnut oil,  200g\/7oz chestnut mushrooms, quartered,  400ml\/14fl oz tin coconut milk,  400ml\/14 fl oz homemade or ready-made chicken stock,  8 lime leaves,  1 tbsp nam pla (Thai fish sauce),  1 tbsp bottled green peppercorns, drained ,  leaves from a large bunch (about 20g\/0.7oz) basil, shredded ,  15g\/½oz fresh coriander (leaves and stalks,) roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/nigelslatersthaigree_80244"}