{"recipe_name":"Battered cod with chips and homemade tomato ketchup","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato ketchup, place the vinegar, bay leaf, spices and sugar in a heavy-based pan and bring to a simmer.  Add the remaining ingredients and bring to the boil, stirring to prevent any sticking.  Reduce the temperature and simmer, stirring frequently for 30 minutes - be careful the mix doesn’t catch and burn. Blend in a food processor or liquidizer and strain the sauce through a sieve. If you find the sauce too thin once cold, then simply re-boil and thicken with a little cornflour mixed to a paste with water, being careful not to make it to starchy and too thick. This will prevent the tomato water separating from the sauce. Heat a deep fat fryer to 170C\/350F (CAUTION: hot oil can be dangerous. Do not leave unattended).  Place the potatoes into the fat fryer in batches and cook for 2-3 minutes until just tender but not coloured. Drain onto kitchen paper and turn up the fat fryer to 190C\/375F. Sprinkle the yeast and sugar into a mixing bowl.  Pour over the beer and vinegar and whisk in the flour.and salt   Leave to ferment – it is ready to use when the mixture starts to bubble.  Dip the cod fillets into the batter and fry until golden-brown and cooked through – about 3-4 minutes.  Remove with a slotted spoon and drain on kitchen paper.   Keep warm on a tray in the oven if necessary. Place the semi cooked chips back into the fat fryer in batches and cook for another 2-3 minutes until golden-brown and crisp. To serve, pile the chips onto the plate and place the cod alongside. Serve with a dollop of tomato ketchup. ","ingredients":" 250ml\/9floz red wine vinegar,  1 bay leaf,  ½ tsp ground coriander,  ½ tsp ground cinnamon,  75g\/3oz light soft brown sugar,  4 x 400g\/14oz tinned tomatoes,  1 tsp salt,  1 tbsp English mustard powder,  1 garlic clove, crushed,  Tabasco sauce, to taste,  2 tbsp tomato purée,  1-2 tbsp cornflour,  400g\/14oz floury potatoes, peeled and cut into thick batons 6cm\/2½in long and dried on kitchen paper,  15g\/2\/3oz fresh yeast,  pinch sugar,  200ml\/7floz beer,  1 tsp cider vinegar,  200g\/7oz plain flour,  pinch salt,  4 x 175g\/6oz cod fillet, skinned and pin bones removed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/battered_cod_with_chips_15260"}