{"recipe_name":"Battered pollock baguettes with mushy peas and lemon mayonnaise","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03cvt95.jpg","method":"For the mushy peas, measure the peas in a jug. Pour them into a large bowl and cover with 3 times their volume of cold water. Add the bicarbonate of soda and soak for at least 12 hours, or preferably overnight. Drain the soaked peas and rinse them under cold water.  Bring the soaked peas to the boil in a large pan of cold water. Reduce the heat until the water is simmering and simmer for 1½-2 hours, covered, stirring from time to time, or until the peas are mushy in texture but not too dry. If they are still wet in texture after 2 hours, continue cooking, uncovered, to dry out a little.  Beat in the butter and season, to taste, with salt and freshly ground black pepper. Meanwhile, for the lemon mayonnaise, blend the eggs and mustard in a food processor until pale and creamy. With the motor still running, gradually add the oil in a thin stream, until the mixture thickens to a smooth, thick mayonnaise (you may not need all of the oil). Stir in the lemon zest and juice and season, to taste, with salt and freshly ground black pepper. Chill in the fridge until needed.  For the battered pollock, mix the flour, yeast, sugar, salt and vinegar together in a large bowl until well combined. Whisk in the beer until the mixture comes together as a thick, smooth batter. Set the batter aside to ferment for about 30 minutes. It is ready to use when the mixture starts to bubble. Heat the dripping or vegetable oil in a deep-fat fryer to 190C, or heat the oil in a deep, heavy-based frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.) Dip each piece of fish in the batter to coat thoroughly. Lower the fish fingers into the hot oil in batches, and fry for 4-6 minutes, or until the fish is cooked through and the batter is golden-brown. Remove the fish fingers from the oil using a slotted spoon and set aside to drain on kitchen paper. Season, to taste, with salt. When all of the fish has been cooked, drizzle the remaining batter into the hot oil and fry until crisp and golden-brown.  To serve, butter the baguette halves, then spread them with the mushy peas. Fill the baguette with the pieces of pollock, then drizzle over the lemon mayonnaise. Sprinkle over the scraps of batter. Cut the filled baguette into slices and serve on a platter for people to help themselves. ","ingredients":" 225g\/8oz dried marrowfat peas,  1 tsp bicarbonate of soda,  25g\/1oz butter,  salt and freshly ground black pepper ,  2 free-range egg yolks,  1 tsp English mustard,  300ml\/10½fl oz rapeseed oil,  2 lemons, zest and juice,  200g\/7oz plain flour,  15g\/½oz fresh yeast,  pinch caster sugar,  pinch salt,  1 tbsp cider vinegar,  200ml\/7fl oz beer,  dripping or vegetable oil, for deep frying,  1kg\/2lb 4oz pollock fillets, skin on, pin bones removed, cut into 5cm\/2in fishfingers ,  sea salt, to taste,  1 long baguette, cut in half lengthways,  50g\/1¾oz butter, softened","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/battered_pollock_81633"}