{"recipe_name":"Creamy mushroom ragù with nutmeg mash","author":"Lesley Waters","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a large frying pan or wok, heat the butter and fry the mushrooms for 5-7 minutes, or until slightly softened.  Sprinkle over the flour and cook for a further minute. Add the sherry, half the vegetable stock, and the thyme. Season well and simmer for 10-15 minutes. Add the cream and lemon juice to the mushroom broth and simmer for a further five minutes, adding extra vegetable stock if the broth looks too thick. (The broth should be like a thick gravy). Cut the scrubbed potatoes into small, even sized pieces. Place into a saucepan, cover with water and cook until tender.  Drain well, return to the saucepan, and mash with the buttermilk. Season with nutmeg, salt and freshly ground black pepper and keep warm. In a large frying pan or wok, heat the olive oil and fry the leek briskly for two minutes. Add the shredded cabbage and stir fry over a high heat for 2-3 minutes or until just tender. Season with salt and pepper to taste. To serve, ladle the broth into four warmed, large soup plates. Place a scoop of creamy mashed potato in the centre of the broth and top the potato with a flourish of spicy cabbage. ","ingredients":" 25g\/1oz unsalted butter,  450g\/1lb chestnut mushrooms, wiped & thickly sliced,  350g\/12oz flat field mushrooms, wiped, peeled and thickly sliced,  115g\/4oz button mushrooms,  2 heaped teaspoons plain flour,  150ml\/¼ pint dry sherry,  300ml\/½pint vegetable stock,  300ml\/½ pint double cream,  squeeze of lemon juice,  1 bunch fresh thyme, roughly chopped,  salt,  freshly ground black pepper,  900g\/2lb potatoes, scrubbed well,  280g\/10oz buttermilk,  nutmeg, freshly grated,  1 tablespoon olive oil,  1 large leek, washed and shredded,  450g\/1lb dark green cabbage or spring greens, washed and finely shredded","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/nutmegmash_70579"}