{"recipe_name":"Oat pancakes with raspberries and honey","author":"Nigella Lawson","programme":"Simply Nigella","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 6-8 pancakes","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/oat_pancakes_with_14049_16x9.jpg","method":"Warm the honey and raspberries in a small saucepan over a medium heat, stirring frequently, until the raspberries have thawed (if using frozen). This shouldn’t take more than 3 minutes or so. Take the pan off the heat. Put the oats and salt in a blender or a food processor with the small bowl fitted, and process until you get the consistency of flour, a mealy flour to be sure, but it should still be fine-ground. Tip into a bowl and stir in the baking powder and cinnamon. In a measuring jug, whisk together the milk, egg and vanilla, and then stir the wet mixture into the dry, until thoroughly combined. If the batter thickens too much, add more milk. And do not let this batter rest, as otherwise it will thicken too much. Pour ½ a teaspoon of oil onto a smooth, non-stick griddle (or large cast-iron or heavy-based frying pan) and, with a piece of kitchen roll, smear it over the whole surface. Put the griddle on a medium heat and, when hot, add the batter, using a quarter-cup measure but only filling it two-thirds full. You should get 4 pancakes at a time, and they will need around 2 minutes a side. Generally, when cooking pancakes, you turn them over when you see bubbles coming to the uppermost side, and while that still holds true, the bubbles are rather understated here. So slip a spatula underneath a pancake after 2 minutes to see if the underside looks cooked, and then when it is, flip it, and the rest of the pancakes, over and cook for another 2 minutes. As always, do not press down on the pancakes as they cook, and do not flip them more than once. When you’ve cooked the first 4, pile them on a plate, and cover with a clean tea towel, then oil the pan again and proceed as before. Serve immediately – the oats carry on drinking up liquid, and the pancakes will dry on standing – with the warm raspberry honey poured on top. ","ingredients":" 150g\/5½oz clear honey,  150g\/5½oz frozen (or fresh) raspberries,  100g\/3½oz porridge oats (not instant),  ¼ tsp sea salt flakes,  1 tsp baking powder,  1½ tsp ground cinnamon,  100ml\/3½fl oz oat milk, or any other sort you wish,  1 free-range egg,  1 tsp vanilla paste or extract,  1 tsp sunflower oil","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/oat_pancakes_with_14049"}