{"recipe_name":"Octopus, chorizo sausage and oregano with orange, nasturtium and herb salad","author":"Silvena Rowe","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the octopus, bring a large saucepan of water to the boil. Beat the tentacles lightly with a meat mallet to tenderise then peel the skin away.   Cut the head from the body, just below the eyes. Remove the beak from the centre of the tentacles by turning it inside out and pushing the beak through.  Add the salt to the boiling water then dunk the octopus three times in the boiling water. Add the vinegar then return the octopus to the pan and simmer for one hour. (Dunking the octopus makes sure that the tentacles don't seize during cooking and become hard and chewy. The key is to cook the octopus very slowly in simmering water; the vinegar helps tenderise the octopus.)  Cut the tentacles into small chunks. Heat a frying pan until hot, add the chorizo and cook for few minutes until crisp. Add the spring onions and octopus pieces, along with the oregano leaves, and cook all together for further two minutes. Remove the pan from the heat and set aside. For the salad, combine the orange segments, herbs, olives and spring onions.  Scatter with the flowers, drizzle with the olive oil and lemon juice then add the sesame seeds and season with salt and freshly ground black pepper. Serve with the octopus and chorizo. ","ingredients":" 1 octopus, about 1.75kg - 2kg\/4lb - 4lb 8oz,  1 tbsp sea salt flakes,  2 tbsp vinegar,  200g\/7oz cooking chorizo sausage, cubed,  5 spring onions, sliced,  1 handful fresh oregano leaves,  2 oranges, segments only,  1 handful mint leaves,  1 handful oregano leaves,  1 handful parsley leaves,  10 Kalamata olives, stones in,  5 spring onions, sliced,  nasturtium flowers or orange pansies,  2 tbsp olive oil,  ½ lemon, juice only,  1 tsp sesame seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/octopus_chorizo_sausage_91997"}