{"recipe_name":"Octopus, cannellini beans and mustia ricotta","author":"Francesco Mazzei","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring a pan of water to the boil, add the fresh cannellini beans, garlic and thyme sprigs and simmer for one hour, or until tender (or for 8-10 minutes, if using canned cannellini beans). Drain well, then sprinkle over the thyme leaves and season, to taste, with salt and freshly ground black pepper. Meanwhile, bring a saucepan of water to a simmer, add the octopus pieces and simmer for 35-40 minutes, or until tender. Remove from the heat and set aside to cool. Meanwhile, in a bowl, whisk together the red wine vinegar, honey, olive oil and oregano leaves until well combined. Season, to taste, with salt and freshly ground black pepper.  In a serving bowl, mix together the watercress and basil until well combined. Drizzle over the dressing mixture and mix well to coat the leaves. When the octopus has cooled, drain well, then cut the tentacles into 2cm\/¾in pieces. Heat a frying pan until hot over a high heat. When the pan is hot, add the ricotta slices and the octopus pieces and fry for 2-3 minutes on each side, or until golden-brown on all sides. To serve, spoon the seasoned cannellini beans into the centre of each of four serving plates. Arrange the thicker pieces of octopus tentacles on top. Top the octopus with a slice of mustia ricotta and then arrange the thinner pieces of octopus on top. Finish with the dressed watercress and basil. Drizzle any remaining dressing around the edge of the plate. ","ingredients":" 400g\/14oz fresh cannellini beans, (available from some health food shops - can substitute canned cannellini beans, drained, rinsed and refreshed in boiling water),  1 garlic bulb, cut in half horizontally,  4 sprigs fresh thyme, 2 left whole, 2 leaves only,  600g\/1lb 5oz octopus tentacles, cleaned ,  60ml\/2½fl oz Cabernet Sauvignon vinegar,  1 tsp acacia honey,  190ml\/6½fl oz extra virgin olive oil,  2 sprigs fresh oregano, leaves only,  salt and freshly ground black pepper ,  75g\/3oz fresh watercress leaves,  4 sprigs fresh purple basil, leaves only,  160g\/5½oz mustia ricotta (available from some Italian delicatessens), or similar salted, smoked soft cheese, sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/octopuscannellinibea_92343"}