{"recipe_name":"Old-fashioned sweet mince pies","author":"The Hairy Bikers","programme":"The Hairy Bakers' Christmas Special","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Makes 12-15","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mincemeat, cut the boiled, cooled lemon in half and discard the pips.  Blend the lemon, raisins, sultanas, chopped apple, mixed fruit and mixed peel in a food processor to a paste. Transfer the lemon mixture to a large mixing bowl and add the suet, muscavado sugar, currants, cinnamon, nutmeg, mixed spice, ground ginger, brandy and sherry. Mix together until well combined, then set aside overnight.  For the orange pastry, grease one large or two small muffin tins with butter. (You will need a tin with 15-18 wells.) Blend the flour, baking powder, butter and sugar in a food processor until the mixture resembles breadcrumbs.  Add the orange zest and blend until well combined, then gradually add the orange juice, blending continuously, until the mixture comes together as a dough. (You may need to a little extra cold water.) Turn out the dough onto a lightly floured work surface, knead lightly until smooth, then wrap in cling film and chill in the fridge for an hour. Preheat the oven to 200C\/400F\/Gas 6.  Cut the chilled pastry in half. Roll out one half of the pastry onto a lightly floured work surface to a ½cm\/¼in thickness. Using a 7cm\/2½in pastry cutter, cut out 15-18 discs (as the mixture allows) and place one into each of the muffin tin wells. Spoon a tablespoon of the mincemeat mixture into each of the mince pie cases and brush the rim of each pastry case with a little beaten egg. Roll out the remaining pastry onto a lightly floured work surface to a ½cm\/¼in thickness. Using a 5cm\/2in pastry cutter, cut out 15-18 discs and place one on top of each mince pie. Press together the edges of the pastry to seal. Brush the remaining beaten egg over the tops of the mince pies. Using a knife, make a small steam hole in the top of each pie.  Transfer the mince pies to the oven and bake for 20-25 minutes, or until pale golden-brown. Serve warm or cold with whipped cream, brandy butter or ice cream. ","ingredients":" 1 lemon, boiled for 1 hour until soft, left to cool,  100g\/3½oz raisins,  100g\/3½oz sultanas,  ½ Bramley apple or similar large cooking apple, peeled and chopped,  100g\/3½oz dried mixed fruit,  75g\/2½oz mixed peel,  100g\/3½oz suet,  100g\/3½oz dark brown muscavado sugar ,  100g\/3½oz currants,  ½ tsp ground cinnamon,  ¼ tsp freshly grated nutmeg,  1 tsp mixed spice,  ¼ tsp ground ginger,  50ml\/2fl oz brandy,  50ml\/2fl oz sherry,  450g\/1lb plain flour,  1 tsp baking powder,  240g\/8oz unsalted butter, plus extra for greasing,  1 tbsp caster sugar,  140ml\/5fl oz orange juice,  2 oranges, zest only,  1 free-range egg, beaten,  whipped cream, brandy butter or ice cream, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/oldfashionedsweetmin_90635"}