{"recipe_name":"Olive sourdough fougasse","author":"Paul Hollywood","programme":"Paul Hollywood's Bread","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Makes 2 loaves","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/olive_sourdough_fougasse_26097_16x9.jpg","method":"Combine the flour, starter and salt in a large mixing bowl. Add the water, a little at a time (you might not need all of it) and mix with your hands, until you have made a soft dough.  Tip the dough onto a lightly oiled surface and it and knead the dough for 10-15 minutes, or until the dough is soft, elastic and smooth. The dough will form a soft, smooth skin when it's ready.  Tip the dough into a lightly oiled bowl large enough to leave room for it to rise, and cover with cling film a tea towel. Leave to rise in a warm place (22-24C\/71-75F) for six hours, or until at least doubled in size.  Mix white flour and semolina flour in equal quantities and use it to dust the work surface. Tip the dough onto the surface and add the olives and oregano and knead them in, knocking the air out of the dough as you do so. Divide the mixture into two pieces and shape each into a fougasse. To do this, put the dough onto an oiled baking sheet and use your hands or a rolling pin to make each piece into a basic rectangle. Use a sharp knife to make 3-4 diagonal cuts into each half of each rectangle - creating holes in the dough. Carefully pull out the dough to stretch it and open up the holes. Cover loosely with a tea towel or oiled clingfilm and leave to rise in a warm place for four hours. It should spring back to the touch when ready. When you are ready to bake, half fill a roasting tin with water and place on the bottom shelf of the oven, and preheat the oven to 220C\/425F\/Gas 7. This will make steam which helps form a good crust. Bake the loaves for 20 minutes until golden-brown and crisp. Leave to cool on a wire rack. ","ingredients":" 375g\/13oz strong white flour, plus extra for dusting,  250g\/9oz sourdough starter,  7g salt,  130-175ml\/4-6fl oz tepid water,  olive oil, for kneading,  semolina flour, for dusting,  100g\/3½oz whole black pitted olives ,  100g\/3½oz whole green pitted olives,  1 tbsp dried oregano","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/olive_sourdough_fougasse_26097"}