{"recipe_name":"Olive-crusted lamb with sweet and sour aubergine","author":"Jun Tanaka","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/390F\/Gas 6. Place the black olive paste and bread into a food processor and blend for one minute. Spread the breadcrumb mixture onto a baking tray. Transfer to the middle shelf of the oven and bake the crumbs for ten minutes, or until lightly toasted and dried out. Take care not to let them burn. Lightly beat the egg whites in a small bowl. Season the lamb with salt and freshly ground black pepper. Dip the lamb in the egg white and then in the olive crumbs. Pat off any excess crumbs. Place the olive oil and butter in an ovenproof frying pan. When the butter has melted, add the lamb to the pan and fry for one minute. Flip the lamb over and place in the oven. Roast for 20-25 minutes, or until just tender and golden-brown. Remove from the oven, cover with aluminium foil and leave to rest in a warm place. For the sweet and sour aubergine, chop the aubergine into 2cm\/¾in cubes and sprinkle with salt. Leave the aubergine for 15 minutes. The salt will release liquid from the aubergine, so you'll need to dab it dry with kitchen paper. Add the olive oil to a frying pan. When the pan is hot, add the aubergine and fry for two minutes, before adding the celery and red pepper. Fry for three minutes. Add the chopped tomato, honey and vinegar and simmer for a further ten minutes. Add the capers, sultanas, pine nuts, chopped spring onions and basil to the pan and remove from the heat. For the rocket dressing, place the rocket, olive oil and vinegar into a blender or food processor. Blend until smooth. To serve, slice the lamb and spoon the sweet and sour aubergine onto two serving plates. Serve the slices of lamb on top of the aubergine and drizzle around the dressing. ","ingredients":" 3 tbsp black olive paste,  4 slices day-old white bread,  2 free-range egg whites,  salt and freshly ground black pepper,  1.5kg\/3lb 4oz rack of lamb, trimmed of fat and sinew,  1 tbsp olive oil ,  knob of butter ,  1 aubergine ,  salt,  1 tbsp olive oil,  1 stick celery, chopped into 2cm\/¾in squares,  1 red pepper, chopped into 2cm\/¾in squares,  200g\/7oz canned chopped tomatoes, drained,  2 tbsp clear honey,  100ml\/3½fl oz red wine vinegar,  1 tbsp capers,  50g\/1¼oz sultanas,  50g\/1¼oz pine nuts, toasted ,  3 spring onions, finely chopped,  6 basil leaves ,  handful rocket,  150ml\/5¼oz olive oil,  1 tbsp red wine vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/olivecrustedlambwith_87823"}