{"recipe_name":"Smoked haddock, parmesan and crème fraîche omelette ","author":"Tom Kerridge","programme":"Tom Kerridge's Proper Pub Food","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01k2tll.jpg","method":"In a large saucepan, bring the milk up to the boil. Place the smoked haddock into the milk and turn off the heat. Place a lid on the pan and leave to gently poach in the milk for approximately 8-10 minutes. Remove the haddock from the pan and cover with aluminium foil to keep warm. Remove all bones and discard the skin. Pass the poaching milk through a fine sieve into a jug. In a saucepan, melt half of the butter and then add the flour. Mix to form a smooth paste. Gradually add half of the poaching milk in batches, stirring all the time, to make a white sauce. Whisk the whole eggs in a bowl and season with salt and pepper. In a large non-stick frying pan, melt the remaining butter over a low heat. Pour the whisked eggs into the pan and cook slowly. When just cooked, remove from the heat and cover with grated parmesan. Add the chopped chives and place flakes of smoked haddock over the top.  Preheat the grill to the hottest setting. In a mixing bowl, mix together the egg yolks and the crème fraîche with six tablespoons of the white sauce. Spoon this mix over the top of the omelette and place under the preheated grill to make a glaze (alternatively use a blowtorch). ","ingredients":" 850ml\/1½pint milk,  2 fillets good-quality smoked haddock,  30g\/1oz butter,  15g\/½oz plain flour,  10 large free-range eggs,  150g\/5½oz parmesan, grated,  1 bunch chives, chopped,  2 large free-range egg yolks ,  150g\/5½oz crème fraîche,  salt and black pepper, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/one_pan_smoked_haddock_53745"}