{"recipe_name":"Chicken with spicy rice","author":"Angela Hartnett","programme":"Great British Budget Menu","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/one_pot_chicken_with_05336_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Joint the chicken removing the breasts, legs and wings. Place the remaining carcass in a large saucepan and cover with water to make a stock. Bring to the boil then reduce the heat and simmer for 30 minutes. In a small bowl, mix together the grated ginger and cumin with the oil, thyme and a pinch of salt and pepper to make a paste. Place the chicken pieces into a large roasting tray and cover evenly with the paste. Place the courgette and peppers around the chicken pieces, then roast for 30-40 minutes on the top shelf of the oven, or until the chicken is cooked and golden-brown. Strain the chicken stock and discard the carcass, season to taste with salt and pepper. Cover the rice with 500ml\/18fl oz stock (from the chicken carcass) and add the cinnamon stick, bay leaf and cardamom. Cook with the lid on over a high heat for 15 minutes. Towards the last five minutes of cooking time add the raisins.  Check that the rice is cooked, strain off any excess liquid and remove the bay leaf and spices. Add the zest and juice of the lemon and lime. Mix through and season to taste with salt and pepper. Serve the roasted chicken pieces and roasted vegetables on a bed of the spiced rice. Garnish with a sprinkling of chopped toasted nuts and sliced spring onions.  Finish with a little chopped coriander if desired.  ","ingredients":" 1 small whole chicken,  2 tbsp freshly grated ginger ,  1 tbsp ground cumin,  30ml\/2 tbsp vegetable oil,  ½ tbsp dried thyme (if using fresh allow for 1 tbsp thyme leaves),  salt and black pepper,  1 courgette, thickly sliced on the diagonal   ,  1 red pepper, deseeded and sliced into wedges,  200g\/7oz of long grain rice,  1 large cinnamon stick ,  1 bay leaf,  3 cardamom pods,  125g\/4½oz green raisins ,  1 lemon, zest and juice,  1 lime, zest and juice,  100g\/3½oz monkey nuts, shelled, lightly toasted and chopped,  1 tbsp finely sliced spring onions,  1 tbsp chopped fresh coriander (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/one_pot_chicken_with_05336"}