{"recipe_name":"Onion bhajis, tarka dhal and almond rice","author":"Allegra McEvedy","programme":"Economy Gastronomy","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tarka dhal, heat the oil in a heavy-based, medium saucepan over a low to medium heat. Add the garlic and spice seeds and fry for 4-5 minutes, or until golden-brown. (CAUTION: The spice seeds may pop during cooking. Cover the pan with a lid and keep the eyes and face away.)  Add the split peas and stir well to coat them in the oil and spices.  Pour over the water and bring to the boil, skimming off any white foam from the top of the liquid at intervals.  When the water is boiling, reduce the heat until the mixture is simmering, then cover the pan and continue to simmer for 35-45 minutes, stirring occasionally, until the split peas are tender and have absorbed all of the water.  Meanwhile, for the onion bhajis, in a large mixing bowl, stir together the yoghurt, chickpea or plain flour, ground cumin, garam masala and salt. Add three tablespoons of water and stir until smooth and well combined. Set aside to rest for 15 minutes. When the bhaji batter has rested, stir in the chillies, onion, coriander, lime juice and ground turmeric until well combined. Set aside for a further 15 minutes.  Meanwhile, for the almond rice, measure the rice in a measuring jug and take note of the volume - you will need double this amount of water to cook the rice.  Heat the butter in a pan over a low heat. When the butter has melted, add the almonds and fry gently for 2-3 minutes, or until pale golden-brown. Stir in the rice, then pour over the water. Cover and bring the mixture to a simmer.  Reduce the heat to a low simmer, cover with the lid and continue to cook for 8-10 minutes. Turn off the heat and leave the rice to steam on the residual heat for a further 4-5 minutes, then fluff up the grains with a fork before serving. For the bhajis, heat the oil in a deep, heavy-based pan or a deep-fat fryer until a breadcrumb sizzles and turns golden-brown when dropped into it.  Using a dessertspoon, lower dollops of the bhaji batter into the hot oil in batches of four. Fry for 3-4 minutes on each side, or until crisp and golden-brown on both sides and cooked through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining bhaji batter until you have twelve bhajis. When the tarka dhal is ready, mash the softened split peas slightly with a fork. Season, to taste, with salt and freshly ground black pepper. To serve, divide the almond rice equally among four serving plates. Spoon over the tarka dhal. Place three onion bhajis alongside each serving. Serve the yoghurt and mango chutney in dipping bowls alongside. Garnish with sprigs of coriander. ","ingredients":" 3 tbsp groundnut or vegetable oil,  5 garlic cloves, peeled, sliced,  1 tsp mixed spice seeds (such as mustard seeds, cumin seeds, coriander seeds and cardamom pods),  250g\/9oz dried split peas, yellow or green,  750ml\/1¼ pints water,  150ml\/5fl oz Greek-style yoghurt,  75g\/2¾oz chickpea (also sold as gram flour or besan) or plain flour, plus 2 tbsp extra, for dusting,  ½ tsp ground cumin,  ½ tsp garam masala,  pinch salt,  1-2 red or green chillies, finely sliced,  1 large white onion, sliced,  30g\/1oz coriander, leaves only, washed and chopped ,  1 lime, juice only,  ¾ tsp ground turmeric,  1 litre\/1¾ pints sunflower oil,  2 tbsp butter,  80g\/3oz flaked almonds,  350g\/¾lb basmati rice,  500ml\/17fl oz water,  plain or Greek-style yoghurt,  ready-made mango chutney,  4 sprigs fresh coriander","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/onionbhajistarkadhal_92047"}