{"recipe_name":"Onion bhajis with mango chutney","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the bhajis, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, preheat a deep fat fryer to 190C\/375F. Place the cumin, coriander, cardamom and mustard seeds, dried chillies and salt into a pestle and mortar and grind to a coarse powder. Place the spice mixture into a bowl along with the sliced onion and gram flour and mix thoroughly to combine. Add the lemon juice and water and mix to form a very sticky batter. Add the fresh coriander and a pinch of freshly ground black pepper and stir well. Carefully drop spoonfuls of the batter into the hot oil and deep fry for 2-3 minutes, or until golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. For the mango chutney, heat a frying pan until hot. Place all the spices into the dry pan and toast for 30 seconds, shaking the pan frequently, until the mustard seeds start to pop. Add the mangoes and cook for a further minute. Add the sugar and cook until dissolved, then add the vinegar. Cover the pan and simmer for 25 minutes, or until the mixture has thickened and the mango has broken down. Remove from the heat and allow to cool slightly. Place half the chutney into a food processor and blend to a purée, then return to the pan and mix to combine. Pour the chutney into sterilized jars and leave to cool. To serve, divide the bhajis among four serving plates and serve with lemon wedges and a dollop of mango chutney. ","ingredients":" vegetable oil, for deep frying,  2 tsp cumin seeds,  2 tsp coriander seeds,  2 black cardamom pods, split,  2 tsp black mustard seeds,  2 tsp yellow mustard seeds,  2 dried chillies, roughly chopped,  1 tsp salt ,  1 onion, finely sliced,  110g\/4oz gram flour (also sold as besan or chickpea flour),  1 lemon, juice only,  4 tbsp water ,  small handful fresh coriander, chopped,  freshly ground black pepper ,  1 tsp black mustard seeds,  1 tsp black peppercorns,  1 tsp cumin seeds,  1 tsp dried chilli flakes,  1 tsp coriander seeds,  1 green mango, peeled and sliced,  2 ripe mangoes, peeled and sliced,  125g\/4½oz soft light brown sugar,  110ml\/4fl oz malt vinegar,  1 lemon, cut into wedges, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/onionbhajiswithmango_87874"}