{"recipe_name":"Oops! I dropped the lemon tart","author":"Massimo Bottura","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 2-4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lemongrass gelato, process the ingredients in a thermal mixer and bring them to 85C\/185F at full speed. When it reaches temperature, remove and strain the liquid. Let cool in a bowl over ice. Freeze in a Pacojet container and process into sorbet just before serving. For the tart crust, in a bowl, knead together the cold butter and icing sugar by hand. Add the egg yolk and flour and knead thoroughly until smooth. Let the dough rest for two hours in the fridge.  Preheat the oven to 160C\/325F\/Gas 3. Roll out the dough on a silicone baking mat until it is 2mm thick. Use it to line two 8cm\/3¼in tartlet moulds to obtain the shape. Bake for 8 minutes, or until the pastry is cooked through and a pale golden-brown. For the mint sauce, bring a pan of water to the boil and blanch the mint for 10 seconds, then cool in iced water. Blend the mint thoroughly in a thermal mixer with the other ingredients, making sure the temperature does not go above 35C\/95F. Pass it through a fine sieve. For the zabaglione, whisk the egg yolk and sugar in a heatproof bowl. When sugar has dissolved, set the bowl over a pan of boiling water without letting it touching the water. Continue beating vigorously. As soon as the eggs are warm, and before they start to thicken, add the lemon juice and limoncello gradually, pouring them very slowly while continuing to whisk energetically. When it is frothy with a creamy texture, it is ready to be served.  To serve, splash the plate with the zabaglione and dot around the mint sauce. Add a quenelle of lemongrass gelato in the centre. Place the tart crust on top of the gelato, and gently crush it. Decorate the plate with the garnish ingredients. ","ingredients":" 200g\/7oz full-fat milk,  50g\/1¾oz double cream,  3 stems lemongrass,  30g\/1oz sugar,  40g\/1½oz sugar syrup,  1 lemon, zest only,  10 drops lemon oil ,  40g\/1½oz cold butter,  20g\/¾oz icing sugar ,  1 egg yolk,  50g\/1¾oz flour,  2g ground spices (a mixture of star anise, cinnamon, juniper, pepper and cardamom),  50g\/1¾oz fresh peppermint leaves,  20g\/¾oz mineral water,  6g xylitol ,  0.5g mint essential oil,  85g\/3oz egg yolk,  50g\/1¾oz sugar,  80g\/3oz lemon juice,  80g\/3oz limoncello,  40g\/1½oz candied lemon (rind and pulp),  2g candied bergamot ,  1g candied ginger ,  1g lemon powder ,  1g capers","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/oops_i_dropped_the_lemon_63267"}