{"recipe_name":"Open ravioli with dillisk pasta, broad beans, asparagus and fennel in a lemon cream sauce","author":"Catherine Fulvio","programme":"Saturday Kitchen Best Bites","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dillisk pasta, sift the flour and salt into the bowl of a food processor.  Pour in the beaten eggs, oil, saffron and dillisk and process until the dough begins to come together. Turn out onto a clean work surface and and knead for 5-10 minutes, or until smooth. Wrap in cling film and leave to rest for at least 30 minutes.  For the broad beans and asparagus, bring a medium-sized saucepan of salted water to the boil, add the broad beans and cook for three minutes, then add the asparagus spears and cook for about 1½-2 minutes more. Remove the beans and asparagus and plunge into a bowl of iced water. Peel the skin of the broad beans and set aside. To make the lemon and marjoram sauce, heat the oil in a saucepan, add the spring onions and fry gently for about four minutes, or until softened but not brown. Add the garlic and cook for a further minute. Pour in the wine and cook for 1-2 minutes. Stir in the parmesan, cream and lemon zest. Check for seasoning, adding salt and freshly ground black pepper as required. After two minutes, add the fennel to the cream sauce. Cook for a further two minutes. Stir in the marjoram leaves.  Using a slotted spoon, lift the beans and asparagus into the cream sauce and heat through.   Divide the dillisk pasta dough into five equal pieces. Start with the pasta machine at its widest setting and pass the dough through the rollers. Do not fold but repeat this process, decreasing the roller setting down grade by grade with each pass. Take the pasta down to the penultimate setting - do this according to manufacturer's instructions.  Keep the dough you are not working with covered with a damp cloth. Cut the dough into 12x8cm\/5x3in rectangles. Bring a large pot of salted water to the boil. Add a little olive oil. Cook the rectangles for about 2-3 minutes and carefully lift them out with a slotted spoon. To serve, place one square of pasta into a shallow plate or bowl. Using tongs, place some broad beans and asparagus spears on the sheet of pasta, arrange another sheet on top and continue to add the beans and asparagus and spoon over a little sauce. Top with a third sheet, spoon over the sauce and arrange three asparagus spears on top. Three layers per plate is ideal. Spoon over some more sauce.  Sprinkle over the calendula petals, borage flowers, reserved golden marjoram leaves and ricotta salata and serve immediately. ","ingredients":" 200g\/7oz strong white flour,  pinch salt,  2 free-range eggs, beaten ,  2 tbsp rapeseed oil,  pinch saffron powder,  2 tbsp very finely chopped dillisk (also known as dulse),  200g\/7oz shelled broad beans ,  15 young asparagus spears, trimmed, sliced lengthways,  2 tbsp rapeseed oil,  6 spring onions, sliced,  1 garlic clove, finely chopped ,  100ml\/3½fl oz white wine,  3 tbsp grated parmesan,  300ml\/10½fl oz double cream,  1 lemon, zest only,  salt and freshly ground black pepper,  ½ fennel bulb, thinly sliced using a mandolin,  1 tsp chopped golden marjoram leaves, plus extra to garnish,  organic calendula and borage flowers, to garnish,  ricotta salata (pressed, dried and salted ricotta), crumbled, to garnish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/open_ravioli_with_52448"}