{"recipe_name":"Open raviolo with mushrooms and artichoke salad","author":"Antonio Carluccio","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the open ravioli with mushrooms, heat a frying pan with the butter. Once melted, add the garlic and fry gently until softened, but not browned.  Add the mushrooms and stir-fry for about five minutes, then add the tomato purée and parsley and season with salt and pepper to taste. Pour in the wine, bring to the boil and let it bubble for a few minutes.  For the artichoke salad, trim the artichokes of all tough outer leaves. Cut off and discard the top and bottom, then slice very thinly and put into a bowl of water with a splash of the lemon juice to prevent any discolouration until ready to serve.   To finish the ravioli, place a large saucepan of boiling water on the hob and season with salt. Once it comes to a rolling boil, add a couple of sheets of pasta at a time so that they don’t stick together. Once soft but still retaining a little bite, remove the pasta sheets from the pan with a slotted spoon and set aside.  For the artichoke salad, prepare the vinaigrette by whisking together the olive oil, remaining lemon juice, and salt and pepper to taste in a small bowl.   To serve, carefully lay four sheets of pasta on four hot serving plates. Divide the mushroom mixture between them, placing on top, reserving some of the sauce.   Top the mushrooms with the remaining sheets of pasta and brush the top with the remaining sauce.  Sprinkle with grated parmesan, if you like. Drain the artichokes and arrange them on the serving plates.  Pour the vinaigrette over the artichokes and sprinkle the parmesan shavings on top. Serve at once. ","ingredients":" 60g\/2¼oz butter,  1 garlic clove, finely chopped,  600g\/1lb 5oz mixed wild mushrooms, cleaned and the larger ones cut in half,  1 tbsp tomato purée,  1 tbsp chopped fresh flatleaf parsley,  salt and freshly ground black pepper,  125ml\/4fl oz white wine,  8 sheets egg pasta dough, about 15cm\/6in square,  55g\/2oz parmesan (or a similar vegetarian hard cheese), grated (optional),  8 very small, tender globe artichokes, before any chokes have formed,  ¼ lemon, juice only,  6 tbsp extra virgin olive oil,  salt and freshly ground black pepper,  85g\/3oz parmesan (or a similar vegetarian hard cheese), shaved very thinly ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/open_raviolo_with_19015"}