{"recipe_name":"Open ravioli with butternut squash, cherry tomatoes and herb paste","author":"Gino D'Acampo","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pasta, place all of the pasta ingredients together into a food processor and pulse until the mixture comes together to form a dough. Tip out onto a floured surface and knead into a ball, then wrap in cling film and allow to rest in the fridge for 5-10 minutes.  Roll out the pasta dough as thin as possible, then cut into 5cm\/2in squares with a sharp knife. Boil the pasta squares in boiling salted water, or until al dente, then drain.  For the filling, heat the olive oil in a pan and fry the butternut squash and garlic for 2-3 minutes, then add the courgettes and tomatoes and cook for 4-5 minutes, or until the vegetables are tender. Stir in the sage and cream, and season, to taste, with salt and freshly ground black pepper. Simmer for 6-8 minutes, or until the squash is tender. For the herb paste, pulse all of the pesto ingredients together in a food processor until smooth, adding more oil if necessary. Place the pasta squares onto a serving plate and spoon the squash filling into the middle of each square. Spoon the pesto around the edges of the plate and serve. ","ingredients":" 200g\/7oz plain flour, plus extra for dusting,  pinch salt,  2 free-range eggs,  1 tsp olive oil,  2 tbsp olive oil,  ¼ butternut squash, peeled and chopped,  2 garlic cloves, crushed,  2 baby courgettes, chopped,  5 cherry tomatoes, halved,  2 tbsp chopped fresh sage,  100ml\/3½fl oz double cream ,  salt and freshly ground black pepper,  2 handfuls fresh basil,  2 handfuls fresh parsley,  1 garlic clove, crushed,  at least 4 tbsp olive oil,  salt and freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/openravioliwithbutte_90354"}