{"recipe_name":"Orange and lemon curd pots","author":"Diana Beard","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4 and grease six individual pudding moulds. In a pan, bring the orange and lemon juices to the boil. Cook until the volume of liquid has reduced by half. Set aside to cool. In a bowl, beat the butter, sugar and lemon zest until pale and creamy. Mix in the egg yolks, one at a time. In a separate bowl, mix the sifted flour and baking powder together, then add to the butter mixture. Slowly add the reduced orange and lemon juices and milk to the mixture stirring gently to combine. In a large bowl, whisk the egg whites until soft peaks form when the whisk is removed. Beat one-third of the egg whites into the cake batter, then carefully fold in the remainder using a large metal spoon. Stand the moulds in a roasting tin and pour in the cake batter. Pour boiling water into the base of the tin. Bake for 20 minutes, or until the puddings are golden-brown and firm to the touch. If the tops are browning too quickly cover with aluminium foil. Meanwhile, whip the cream until soft peaks form when the whisk is removed and fold in the orange liqueur.  Decorate puddings with the candied orange peel and fresh mint, and serve with the cream. ","ingredients":" 300ml\/10fl oz freshly-squeezed orange juice,  1 lemon, zest and juice only,  60g\/2¼oz unsalted butter, softened, plus extra for greasing,  90g\/3¼oz caster sugar,  4 large free-range eggs, separated,  70g\/2½oz self-raising flour, sifted,  ½ tsp baking powder,  160ml\/5½oz full-fat milk,  150ml\/5fl oz double cream,  25ml\/1fl oz orange-flavoured liqueur (such as Cointreau),  candied orange peel, to decorate,  few sprigs fresh mint, to decorate","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/orange_and_lemon_curd_82994"}