{"recipe_name":"Orange caramel custard","author":"Simon Hopkinson","programme":"The Good Cook","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/orange_caramel_custard_43115_16x9.jpg","method":"Blend the zest and caster sugar to a fine powder in a food processor.  Put the orange zest and caster sugar mixture into a saucepan, add the milk and warm together, occasionally stirring, until just below simmering point. Switch off the heat, cover with a lid and leave to infuse for at least one hour.  Put the granulated sugar into a heavy-based saucepan and add 3-4 tablespoons of cold water. Bring to a simmer and cook slowly until the sugar has turned to a richly coloured caramel.  Pour the caramel into the base of the four dariole moulds and set aside to cool. Preheat the oven to 150C\/300F\/Gas 2. Put the eggs and yolks into a roomy bowl, beat together lightly and then strain over the orange-infused milk. Gently beat the mixture together until well combined. Remove any froth from the surface with a spoon and strain the mixture to make it smooth. Ladle the mixture into the caramel-lined moulds and fill to the brim. Place them into a deep roasting tin and fill with hot (not boiling) water, so that it rises up the outside of the molds by about three-quarters of the way up. Carefully place the tin into the oven and loosely lay a sheet of tin foil flat over the surface of the moulds, but don't secure it down. Bake in the oven until the custards are just set (about 40 minutes) - lightly press a finger on the surface, or give them a little shake; they should gently wobble.  Remove from the oven, take out from the roasting tin and leave to cool. Cover each mould with a small sheet of clingfilm and chill in the fridge for at least two hours.  To unmould, run a small knife around the edge of the custard and upend onto individual, shallow dishes.  ","ingredients":" 4 large oranges, zest only,  75g\/2½oz caster sugar,  500ml\/17fl oz full-fat milk ,  120g\/4oz granulated sugar,  3 free-range eggs,  4 free-range egg yolks","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/orange_caramel_custard_43115"}