{"recipe_name":"BBQ raspberry marshmallows with raspberry sauce","author":"James Martin","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the marshmallows, place the granulated sugar, glucose and 200ml\/7fl oz water into a heavy-based saucepan and bring to the boil. Heat until a sugar thermometer shows 127C\/260F. Add the soaked gelatine sheets and water to the hot sugar syrup. Stir the mixture and pour it into a jug. Place the egg whites into a grease-free bowl and whisk until firm peaks.  Continue to whisk the egg whites, then pour the sugar syrup onto the egg whites, whisking all the time until the whites are shiny. Add the vanilla extract and continue to whisk for about 5-10 minutes until the mixture is thick enough to hold its shape on a whisk. Lightly oil a shallow 30cm x 20cm\/12in x 8in baking tray. Dust the tray with icing sugar and corn flour.  Spoon in half the mixture and scatter the raspberries over the top. Cover with the remaining mixture, smoothing the top with a wet palette knife. Chill in the fridge for at least one hour. For the raspberry sauce, place all of the ingredients into a food processor and blend until a smooth purée. Pass the mixture through a fine sieve using a spatula or spoon. Remove the marshmallow from the fridge, dust some more icing sugar and corn flour over the work surface. Loosen the edge of the marshmallow then turn out onto the dusted work surface. Cut into squares and roll the marshmallows in the icing sugar and corn flour to coat. Preheat the grill to high or use a barbecue. Carefully place the marshmallows onto a wooden skewer. Grill for 1-2 minutes until slightly charred and gooey.  Serve the skewers of marshmallows with a bowl of raspberry sauce. ","ingredients":" 450g\/1lb granulated sugar,  1 tbsp liquid glucose,  9 gelatine sheets, soaked in 140ml\/4¾fl oz water,  2 free-range egg whites,  1 tsp vanilla extract,  vegetable oil, for greasing,  125g\/4½ oz raspberries, lightly crushed,  5-6 tbsp icing sugar,  5-6 tbsp corn flour,  250g\/9oz raspberries ,  2 tbsp icing sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bbq_raspberry_24234"}