{"recipe_name":"Orange savarin with cinnamon cream","author":"Chetna Makan","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 1 large cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Grease a 25cm\/10in savarin tin with butter and dust with flour. For the dough, sift the flour into a large mixing bowl, add the yeast and mix. Pour in the milk and roughly mix using a wooden spoon. In a separate bowl, beat the eggs and sugar until pale and fluffy. Then stir in the orange zest, vanilla extract, salt and melted butter. Mix until well combined then pour it into the flour mixture. Whisk until the batter reaches a smooth pouring consistency. Cover and leave to rise for 15-20 minutes.  When the batter has proved, use a wooden spoon to knock it back and remove the air. Pour the batter into the prepared tin. Oil one side of a large piece of cling film and cover the tin oily-side down. Set aside in a warm room for about 1½ hours until the dough almost reaches the top of the tin. Preheat the oven to 200C\/400F\/Gas 6. Remove the cling film and bake the savarin for about 40 minutes. Allow to cool for a few minutes then turn out into a shallow baking tray.  For the syrup, heat the orange juice, liqueur, 250ml\/9fl oz water and the sugar in a pan. Simmer for five minutes, or until the sugar is dissolved. Slowly pour the syrup over the savarin, allowing it be absorbed as you pour. Place the savarin on a serving plate. For the filling, whip the cream with sugar and cinnamon until peaks form when the whisk is removed. Transfer to a piping bag with a star nozzle attached and pipe the cream in the middle of the savarin until it reaches the top of the cake.  To decorate, slice the oranges very thinly and place them on the top of the cake (if using). Sprinkle the pistachios over and serve. ","ingredients":" 350g\/12oz plain flour, plus extra for dusting,  1 x 7g sachet fast-action yeast,  250ml\/9fl oz full-fat milk, gently warmed to room temperature,  4 large free-range eggs,  40g\/1½oz caster sugar,  1 large orange, zest only ,  1 tbsp vanilla extract,   ½ tsp table salt,  150g\/5½oz unsalted butter, melted, plus extra for greasing,  vegetable oil, for greasing,  6 tbsp freshly squeezed orange juice ,  4 tbsp of orange liqueur, such as Grand Marnier,  150g\/5½oz caster sugar,  300ml\/10½fl oz double cream,  ½ tsp ground cinnamon ,  50g\/1¾oz caster sugar,  2 large oranges (optional),  25g\/1oz unsalted shelled pistachios, chopped ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/orange_savarin_with_16473"}