{"recipe_name":"Orange and raspberry Victoria sponge","author":"Sophie Dahl","programme":"The Delicious Miss Dahl","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 1 cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the cake, grease and line two 20cm\/8in sandwich tins with baking parchment, and dust with flour. In a food mixer, cream together the butter and sugar until pale and fluffy. Gradually beat in the eggs, then add the flour and orange zest and mix until well combined. Divide the mixture evenly between the two cake tins, then bake in the oven for 25-30 minutes, or until golden-brown and slightly springy to the touch. Remove from the oven and set aside to cool slightly in the tins before turning out onto a wire rack to cool completely. Meanwhile, for the jam, place the raspberries, orange juice and golden caster sugar into a small saucepan over a low heat. Cook for 15-20 minutes, or until the raspberries begin to break down. Remove the pan from the heat and set aside to cool completely.   For the icing, beat the butter, icing sugar, orange juice and zest in a bowl until smooth. To serve, place one sponge on a serving plate or cake stand, and spread half of the icing on top. Spoon over the jam, top with the second sponge and finish with the remaining buttercream. Decorate with a little more orange zest if desired. ","ingredients":" 225g\/8oz butter, plus extra for greasing,  225g\/8oz golden caster sugar,  4 free-range eggs, beaten,  225g\/8oz self-raising flour, sifted,  1 large orange, zest only,  300g\/9oz fresh raspberries,  2 tbsp fresh orange juice,  1 heaped tbsp golden caster sugar,  250g\/9oz butter, softened,  250g\/9oz icing sugar, seived,  ½ orange, juice only,  1 large orange, zest only, plus a little zest to decorate","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/orangeandraspberryvi_93622"}