{"recipe_name":"Orange cream-filled choux buns with chocolate sauce and caramelised oranges","author":"James Martin","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the orange cream, first make a custard. Place the vanilla seeds and pod into a pan. Add the milk and bring to the boil. Place the egg yolks, sugar and cornflour into a bowl and mix together.  Once the milk is boiling, pour onto the egg mixture and mix well. Return the mixture to the pan and bring back to the boil, stirring all the time. Once the mixture has boiled, take the pan off the heat, remove the vanilla pod and leave the custard to cool. Meanwhile, place the double cream into a bowl with the orange zest and liqueur. Whip until soft peaks form then fold this into the cooled custard. Spoon into a piping bag fitted with a medium-sized nozzle. For the choux pastry, preheat the oven to 220C\/430F\/Gas 7. Place the water, butter and sugar into a pan and bring to the boil. Boil for one minute. Remove from the heat and add the flour in one go. Beat the mixture thoroughly until it's smooth and comes away cleanly from the sides of the pan. Return to the heat for a minute or two and cook through. Remove from the heat and allow to cool slightly. Add the eggs, one at a time, beating well between each addition. Spoon the mixture into a piping bag fitted with a large, plain nozzle. Pipe six large rounds onto a greased baking tray and push any bumps down with a wet fingertip. Place in the oven, along with a cup of water placed on the bottom shelf (this helps create steam). Cook for five minutes then open the oven door and allow the steam to escape. Remove the cup of water. Cook the choux buns for a further 20 minutes until crisp and golden. Remove the buns from the oven and, using the tip of a sharp knife,  pierce a hole in the bottom of each bun. Place on their sides and return to the oven for a further five minutes to allow the buns to become dry and crisp. Remove from the oven and cool on a wire rack. For the chocolate sauce, place the sugar and water into a pan and bring to the boil. Simmer for 1-2 minutes until the sugar has dissolved completely, then add the chocolate and stir well until smooth. Remove from the heat. For the caramelised oranges, place the orange segments onto a serving plate and dust with the sugar. Use a mini-blowtorch to heat the oranges until the sugar has caramelised (alternatively place under a hot grill). To serve, pipe the orange cream into the choux buns, through the hole in the bottom of each bun. Place alongside the caramelised oranges. Pour the chocolate sauce over the choux buns and serve immediately. ","ingredients":" 1 vanilla pod, halved, seeds scraped out,  300ml\/11fl oz whole milk,  2 free-range egg yolks,  75g\/3oz caster sugar,  20g\/¾oz cornflour,  300ml\/11fl oz double cream,  2 oranges, zest only,  3 tbsp orange liqueur,  250ml\/9fl oz cold water,  110g\/4oz cold butter, diced,  1 tsp caster sugar,  150g\/5oz plain flour,  4 free-range eggs,  50g\/2oz caster sugar,  50ml\/2fl oz water,  175g\/6oz dark chocolate, roughly chopped,  3 oranges, peeled and segmented,  6 tbsp caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/orangecreamfilledcho_86214"}