{"recipe_name":"Orange soufflé","author":"Rory Bremner","programme":"A Taste of My Life","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Butter the inside of a large oven-proof pudding dish and dust with caster to coat the inside evenly with sugar. Rub the sugar cubes over the skin of the orange to extract the oil, then crush the sugar cubes in a pestle and mortar.  Grate the orange peel to remove the orange zest (do not grate the white pith) and reserve the zest. Pour the milk into a pan over a low heat and add the vanilla pod, the sugar cubes and the orange zest. Bring to the boil, stirring occasionally, then cover and remove from the heat. Leave to cool then remove the vanilla pod. Place the flour into a clean pan and add a splash of the cooled vanilla and orange-infused milk. Add the caster sugar and mix well. Place over a low heat and gradually stir in the remaining milk infusion, mixing well to avoid lumps. Bring to the boil, then reduce the heat to simmer for 30 seconds, stirring continuously, until smooth and thickened. Remove from the heat and stir well for a couple of minutes. Whisk the egg yolks into the cooled sauce one at a time, then cover the mixture with cling film and leave to cool. When the mixture is cold, stir in the orange liqueur. Place the egg whites into a clean bowl and whisk until soft peaks form when the whisk is removed. Fold the whisked egg whites into the milk and egg yolk mixture. Transfer the soufflé mixture to the prepared pudding dish and run the handle of a spoon around the inside of the rim of the dish to make a shallow channel in the mixture. Place the soufflé into the oven to bake for 15-20 minutes. Remove from the oven and dust the surface of the soufflé with icing sugar, then return to the oven to cook for another 5-10 minutes, or until risen and golden-brown. Serve immediately at the table in the dish. ","ingredients":" butter, for greasing,  3 tbsp caster sugar, plus extra for sprinkling,  2 large sugar cubes,  1 orange,  250ml\/8 fl oz milk,  1 vanilla pod, split,  25g\/1oz plain flour,  4 free-range eggs, separated,  4 tbsp orange liqueur,  icing sugar, for dusting","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/orangesouffle_89078"}