{"recipe_name":"Organic salmon and brassicas ","author":"Sat Bains","programme":"2007-16","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the onion oil, blend all the ingredients, except the chicken stock, in a food processor for five minutes. Pour the mixture into a cheesecloth set over a clean bowl and leave to drain overnight. Season the oil with salt and store in an airtight container until needed. For the pickled turnip, place the vinegar, sugar and salt into a saucepan and bring to the boil. Leave to cool then place the turnip slices into a bowl or preserving jar and pour the liquid over the top. Leave to marinade for at least one hour. For the salmon, place the extra virgin olive oil, thyme, juniper, coriander and pine into a saucepan and heat to 80C\/175F. Allow to cool.  When you are ready to cook the salmon, heat the infused oil in a wide pan to 46C\/115F. Drop in the salmon, remove the pan from the heat and leave for 30 minutes. For the broccoli purée, bring a large pan of salted water to the boil, add the broccoli florets and blanch for 90 seconds. Drain well, reserving the liquid, then place the broccoli into a food processor and blend until smooth - if the mixture seems a little thick add a little of the cooking water. Season the purée with a little salt then pass through a fine sieve into a bowl set over an ice bath.  For the red cabbage purée, mix the cabbage juice with the soy and mirin in a saucepan. Season with a little salt, if necessary, then whisk in the agar agar. Bring to a boil, let the mixture bubble for 10 seconds then remove from the heat and pour into a bowl set over an ice bath. When cool and set, blend the mixture to a smooth purée, pass through a fine sieve and chill in the fridge until needed. To serve, when the salmon is a few minutes off being cooked, start dressing the plate. Spoon the red cabbage purée into the centre of the plate. Scatter over some of the cauliflower florets then top with the salmon. Place the purple-sprouting broccoli alongside with a spoonful of the broccoli purée. Pile the pickled turnip at the edge of the salmon. Whisk the chicken stock into three tablespoons of the onion oil and quickly warm through in a saucepan. Drizzle the warmed oil around the edge of the food and serve immediately.  ","ingredients":" 50g\/1¾oz chives,  50g\/1¾oz leek tops ,  50g\/1¾oz spring onion tops,  300ml\/10fl oz sunflower oil,  pinch salt,  100ml\/3½fl oz white wine vinegar,  75g\/2¾oz caster sugar,  1 tsp salt,  1 turnip, peeled and sliced,  400ml\/14fl oz extra virgin olive oil,  4 sprigs thyme,  10 juniper berries,  10 coriander seeds ,  4 sprigs pine ,  4 spears purple sprouting broccoli, blanched and roasted,  4 cauliflower florets, blanched and roasted,  4 tbsp chicken stock,  4 x 150g\/5½oz organic salmon fillets,  2 heads broccoli, stems removed and broken into florets,  salt, to taste,  ½ red cabbage, juiced, to yield 250g cabbage juice,  5 tsp soy sauce,  5 tsp mirin,  ½ tsp agar agar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/organic_salmon_and_58694"}