{"recipe_name":"Sticky barbecue chicken wings and drumsticks","author":"Jo' Pratt","programme":null,"prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Makes 12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/orientalstickychicke_67594_16x9.jpg","method":"Slash the chicken drumsticks three to four times each with a sharp knife and place in a non-metallic bowl with the chicken wings. Mix together all of the marinade ingredients and pour over the chicken. Leave to marinate for at least 2 hours, or overnight if you can, turning occasionally.  Once it has marinated, place the chicken on the barbecue over medium-hot coals and cook for about 20 minutes, brushing with any marinade left in the dish as it cooks. If it's colouring too quickly, move to a cooler part of the barbecue to cook more gently. It's important you cook the chicken all the way through.  If you're unsure, pierce a drumstick with a skewer: if the juices are still pink, carry on cooking. Eat as soon as they're cool enough to handle, with the sticky sauce all around your mouth and fingers. Isn't that what barbecues are all about? The chicken can also be cooked in the oven for perfect picnic food. Preheat the oven to 200C\/400F\/Gas 6. Transfer the chicken into a roasting tray with a couple of spoonfuls of marinade. Place in the oven for about 50 minutes, turning occasionally and basting with the marinade and juices until thoroughly sticky and golden, adding extra marinade to the tray if necessary. Once the chicken pieces are cooked, eat them when fresh and hot, or leave to cool before packing up for a picnic or packed lunch. ","ingredients":" 6 chicken drumsticks, preferably free-range ,  6 chicken wings, preferably free-range,  2 tbsp clear honey,  3cm\/1¼in piece of fresh ginger, peeled and grated,  1 garlic clove, crushed,  1½ tsp Chinese five spice ,  2 tsp soy sauce,  3 tbsp orange marmalade,  ½ tsp grated orange zest,  1 tbsp sesame oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/orientalstickychicke_67594"}