{"recipe_name":"Ossobuco of pork with new season garlic and radish","author":"Tom Kerridge","programme":"Spring Kitchen with Tom Kerridge","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Marinade the pork in 150ml\/5½fl oz white wine in a sandwich bag, left in the fridge for at least eight hours and up to 24 hours. Preheat the oven to 150C\/300F\/Gas 2. Drain the pork and discard the wine.  Heat a heavy-based, ovenproof frying pan and add the oil. When hot, add the pork shins and fry until golden-brown and caramelised all over.  Add the carrot and celery to the pan and cook until coloured. Add the stock, thyme and the remaining wine and bring to the boil. Skim off any impurities that come to the top.  Place a lid on top (or cover with aluminium foil) and transfer to the oven. Cook for 2-3 hours, until the pork is very tender.  When the pork is cooked, remove it from the cooking stock and keep warm until ready to serve (you can wrap it in cling film to help keep it warm and moist). Pass the cooking stock through a sieve and return to the pan. Bring to the boil and cook until the volume of liquid has reduced to a sauce consistency. Meanwhile, in a separate frying pan, fry the bacon lardons until crisp and golden-brown. Add the new season garlic and butter and fry for a further 3-4 minutes. Add the radishes and continue to cook until tender.  Add the sage, parsley and three tablespoons of the reduced pork stock. Season to taste with salt and pepper. To serve, glaze the pork shins with the reduced stock and serve on top of the vegetables. ","ingredients":" 2 x 200g\/7oz pork shins,  450ml\/16fl oz white wine ,  25ml\/1fl oz olive oil,  1 large carrot, roughly chopped,  3 sticks celery, roughly chopped,  1litre\/1¾ pints chicken stock,  ½ bunch fresh thyme,  80g\/3oz bacon lardons, diced,  1 bulb new season garlic, broken into cloves,  2 tbsp unsalted butter,  10 leafy breakfast radishes, washed,  3 sage leaves, finely chopped,  2 tbsp curly parsley, chopped,  salt and pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ossobuco_of_pork_with_46639"}