{"recipe_name":"Ostrich en croute with mushrooms, red wine sauce and sage crushed potatoes","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the pastry, place the flour and butter into a food processor and process until the mixture resembles breadcrumbs. Add one of the eggs and the water and process again until a dough forms. Place in the fridge to rest until you are ready to roll it out. For the filling, heat the oil in a frying pan. Season the ostrich steak with salt and freshly ground black pepper and place into the pan with the rosemary and the lightly crushed garlic clove. Sear on all sides, then remove the ostrich from the pan and set aside. Discard the rosemary and garlic from the pan. Heat the butter in the same pan and gently fry the shallot, mushrooms and the remaining finely chopped garlic clove. Add the cream and simmer until reduced slightly, then stir in the chopped sage. Roll out the pastry on a lightly floured surface until large enough to wrap around the meat. Blot the ostrich on kitchen paper, then lay it on one half of the pastry and top with the mushroom mixture. Bring the other half of the pastry over the top. Beat the remaining egg and brush over the edges of the pastry to help to seal it, and over the top to glaze. Place onto a baking sheet and transfer to the oven to bake for about 12-15 minutes, or until the pastry is golden-brown. For the red wine sauce, heat the red wine and shallot in a saucepan and simmer until reduced by half. Add the butter and stir until melted. For the potatoes, boil the potatoes until tender, about 10-12 minutes. Drain and return to the pan with the olive oil and sage. Lightly crush the potatoes with a potato masher or the back of a fork. Season, to taste, with salt and freshly ground black pepper. To serve, cut the ostrich en croute in half and place onto a serving plate with the crushed potatoes. Drizzle over the red wine sauce. ","ingredients":" 200g\/7oz plain flour, plus extra for dusting,  80g\/2¾oz butter,  2 free-range eggs,  1 tbsp water,  1 tbsp olive oil,  100g\/3½oz ostrich steak,  salt and freshly ground black pepper,  1 sprig fresh rosemary,  2 garlic cloves, one lightly crushed, the other finely chopped,  1 tbsp butter,  ½ shallot, finely chopped,  100g\/3½oz wild mushrooms, roughly chopped,  75ml\/2½fl oz double cream,  1 tbsp chopped fresh sage,  175ml\/6fl oz red wine,  ½ shallot, finely chopped,  25g\/1oz butter,  150g\/5½oz new potatoes,  3 tbsp olive oil,  1 tbsp chopped fresh sage,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ostrichencroutewithm_88539"}