{"recipe_name":"Ostrich 'escalope' with cheesy polenta and wilted spinach","author":"Gino D'Acampo","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ostrich escalope, sprinkle the flour and the polenta onto separate plates. Beat the egg in a bowl. Dredge the ostrich steak first in the flour, then dip it in the beaten egg and finally roll it in the polenta. Shake off any excess polenta. Heat the oil and butter in a frying pan over a medium heat and fry the coated polenta on each side for 3-4 minutes, or until golden-brown on both sides and cooked to your liking. Remove from the pan and set aside to rest for 15 minutes. Once rested, cut the escalope into three thick slices. Meanwhile, for the cheesy polenta, heat the stock in a saucepan over a medium heat until boiling. Once boiling, pour in the polenta, stir well and return the mixture back to the boil. Reduce the heat until the mixture is simmering and simmer for 8-10 minutes. Add the butter and cheese and stir until the cheese has melted. Season, to taste, with freshly ground black pepper. Spoon the polenta into a greased 10cm\/4in metal ring mould on a serving plate, set aside for 2-3 minutes, then remove the ring. For the spinach, heat the butter and oil in a frying pan over a medium heat, add the spinach and cook for 2-3 minutes, or until wilted. To serve, spoon the spinach onto the polenta and top with the ostrich escalope slices. ","ingredients":" 100g\/3½ oz ostrich steak, battered until flat like an escalope,  2 tbsp plain flour,  3 tbsp dry polenta,  1 free-range egg, beaten,  1 tbsp olive oil,  15g\/½oz butter,  250ml\/9fl oz vegetable stock,  150g\/5½oz polenta,  15g\/½oz butter,  55g\/2oz Cambozola, chopped,  freshly ground black pepper,  15g\/½ oz butter,  1 tbsp olive oil,  2 handfuls baby spinach leaves, washed,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ostrichescalopeonche_92718"}