{"recipe_name":"Ottoman lamb with saffron and rosewater rice pilaf","author":"Silvena Rowe","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Ottoman lamb, mix together the honey, pomegranate molasses and warm water in a bowl.  Dry fry the lamb rump strips in a pan over a medium heat.  Add the honey mixture and more water if needed and bring to a simmer. Cook very gently until the meat is very soft and almost melting, about 45-60 minutes. Meanwhile, place the minced lamb, cumin and chopped oregano into a bowl and mix well. Season with salt and freshly ground black pepper and then shape into very small meatballs, about the size of hazelnuts. When the lamb rump is very tender, add the meatballs to the pan with the figs, prunes and almonds. Simmer for 20 minutes over a low heat, then season, to taste, with more salt and pepper.  Add the sliced apple and, finally, add the rosewater. For the rice pilaf, add the butter to a pan and melt gently, then stir in the rice and cook for a minute or so.  Add the remaining ingredients, reduce the heat and simmer gently until the rice is tender and the liquid is all absorbed. To serve, pile the rice onto each plate and spoon the lamb alongside. Garnish with a couple of sprigs of oregano. ","ingredients":" 30g\/1¼oz honey,  2 tbsp pomegranate molasses,  200ml\/7fl oz warm water,  500g\/1lb 2oz lamb rump, cut into 2cm\/1in thin strips,  150g\/5½oz lean minced lamb,  ½ tsp ground cumin,  3 tbsp fresh oregano, chopped finely, plus four sprigs to serve,  200g\/7oz dried figs,  200g\/7oz prunes, stones removed,  150g\/5½oz whole blanched almonds,  300g\/10½oz apple, cored and thinly sliced,  20ml\/4 tsp rosewater,  salt and freshly ground black pepper,  40g\/1½oz butter,  200g\/7oz basmati rice, washed and drained,  200g\/7oz whole almonds, blanched,  2g saffron, soaked in 20ml\/4 tsp rosewater for two hours,  30g\/1¼oz honey,  200ml\/7fl oz light vegetable stock","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ottoman_lamb_with_98112"}