{"recipe_name":"Oven-cooked chicken shawarma","author":"Nigella Lawson","programme":"Simply Nigella","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/oven-cooked_chicken_04728_16x9.jpg","method":"Take a large resealable freezer bag and put the chicken thighs in it. Using a fine grater, preferably a microplane, grate in the lemon zest. Squeeze the lemons and add the juice. Pour in the olive oil and add the garlic, then add all the remaining ingredients. Squish everything about together, then seal the bag, place it on a plate or in a dish, and refrigerate for at least 6 hours, or up to 1 day. When you’re ready to cook, preheat the oven to 220C\/200C Fan\/Gas 7. Remove the chicken from the fridge and allow it to reach room temperature. Tip the contents of the freezer bag into a shallow roasting tin – mine measures 44x34x1.5cm\/17x13x½in – and make sure all the chicken thighs are lying flat and not on top of one another (if possible) before roasting in the hot oven for 30 minutes, by which time they should be cooked through (though obviously you must check) and golden on top. When the chicken’s more or less cooked, make the sauce simply by combining the yoghurt with the tahini and garlic, stir and salt to taste, and sprinkle with a few pomegranate seeds. Line a platter or a couple of plates with crisp lettuce, shredded or torn into pieces, and then top with the piping hot chicken, pouring the oily juices over them, unless you are, for some inexplicable reason, anti-oily-juices. If you wanted to make the chicken go further, you could cut the thighs into chunky slices rather than leaving them whole. And please do add any of the suggested accompaniments, itemized in my introduction. ","ingredients":" 12 skinless and boneless chicken thighs,  2 unwaxed lemons,  100ml\/3½fl oz olive oil,  4 fat or 6 smaller garlic cloves, finely grated or minced,  2 dried or fresh bay leaves,  2 tsp paprika,  2 tsp ground cumin,  1 tsp ground coriander,  1 tsp dried chilli flakes,  ¼ tsp ground cinnamon,  ¼ tsp freshly grated nutmeg,  2 tsp sea salt flakes,  lettuce leaves, to serve,  250g\/9oz plain yoghurt,  4 tbsp tahini,  1 fat or 2 smaller garlic cloves, finely grated or minced,  fat pinch salt, or to taste,  1 tbsp pomegranate seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/oven-cooked_chicken_04728"}