{"recipe_name":"Oven baked pollock with radishes, borage flowers and lardo","author":"Tom Kerridge","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sprinkle the pollock with a little sea salt, wrap in cling film then place in the fridge for two hours.  Preheat the oven to 190C\/375F\/Gas 5. Rinse the fish and pat dry with kitchen then cut into four portions and place onto an ovenproof dish lined with a piece of buttered greaseproof paper. Place the shallots, peppercorns and thyme into a saucepan with the white wine and the vinegar and simmer over a medium heat until reduced down to a glaze. Add the double cream and bring to the boil then reduce the heat and gradually whisk in 150g\/5oz of the butter. Season with salt and freshly ground black pepper, pass through a sieve and keep warm. Place a knob of butter onto each of the portions of pollock then place in the oven for three minutes.  Baste the fish with the melted butter and then return to the oven for another 3-4 minutes or until just cooked. While the fish is cooking, wilt the radishes down a frying pan with a little butter and sea salt then set them aside and keep warm. Heat a frying pan until hot, add the remaining butter, the girolles and the water and cook until the mushrooms are softened. When the fish is cooked, spoon the butter sauce onto warmed serving plates, add the radishes and place the fish on top. Add the girolles and then place a couple of slices of lardo on top of the fish. Garnish with the borage flowers and serve immediately. ","ingredients":" 1.2kg\/2lb11oz pollock fillet, skinned and pin boned,  sea salt and freshly ground black pepper,  2 banana shallots, finely chopped,  10 white peppercorns,  5 sprigs fresh thyme,  100ml\/3½fl oz white wine ,  100ml\/3½fl oz white wine vinegar,  50ml\/2fl oz double cream,  200g\/7oz cold butter, diced,  10 radishes, cut in half lengthways with the tops still on,  200g\/7oz girolles mushrooms,  50ml\/2fl oz water,  12 borage flowers, for garnish,  8 thin slices lardo","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/oven_baked_pollock_with_72838"}