{"recipe_name":"Oven-grilled tiger prawns with chilli yuzu and white miso aioli","author":"Nic Watt","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven and grill to 180C\/350F\/Gas 4. For the chilli yuzu paste, blend all of the chilli yuzu paste ingredients except the mirin and vegetable oil in a food processor to a paste.  Gradually add the mirin (or water) and vegetable oil and blend again until all of the liquid has been fully incorporated into the mixture. Set aside. For the white miso aioli, blend the cooked potato, white miso, garlic and poached egg in a food processor until smooth and well combined.  With the motor still running, gradually add the vegetable oil in a thin stream until it is completely incorporated in the mixture.  Add the ginger juice and lemon juice and blend again until well combined. For the prawns, lay each prawn on its back. Cut the tail meat and shells in half lengthways using a sharp knife or scissors. Remove the tail meat from the shells and chop roughly.  Stir the chopped tail meat into the chilli yuzu paste.  Return the prawn and chilli yuzu mixture to the shells (there should be two filled shells per person). Place the four prawn halves onto a baking tray and cook for 1-2 minutes. Remove the prawn halves from the oven. Carefully stir the prawn and chilli yuzu mixture around, in the shells. Return the prawns to the oven and cook for a further 1-2 minutes, or until the flesh is pink and cooked through.  To serve, squeeze the julienned daikon into two cone shapes. Place one cone of daikon onto the end of each of two rectangular serving plates. Sprinkle over the black sesame seeds. Place two filled prawn halves into the centre of each plate. Place the lemon balm leaves on top. Divide the aioli between two dipping bowls. Place them at the other end of the plates. ","ingredients":" 1 tbsp yuzu koshou paste (available from some Asian supermarkets and specialist retailers),  1 tsp fresh garlic paste (blend 1 garlic clove with ½ tsp water),  1 tsp fresh ginger paste (blend 1cm\/½in fresh root ginger with ½ tsp water),  1 tsp chopped fresh coriander,  1 tbsp freshly grated yuzu peel (available from some supermarkets and Asian grocers),  1½ tsp ready-made chilli and garlic sauce,  1 tbsp mirin (Japanese rice wine, available from some supermarkets and Asian grocers), or water,  4 tbsp vegetable oil,  4 tbsp cooked potato,  4 tbsp saikyo white miso (available from some supermarkets and Asian grocers),  1 garlic clove, peeled,  1 poached egg,  250ml\/9fl oz vegetable oil,  1 tbsp fresh ginger juice (made by grating and squeezing fresh root ginger and collecting the juice),  1 lemon, juice only,  2 large tiger prawns, preferably Madagascan, or langoustines, shells on, left whole,  1 daikon (mooli), julienned,  20g\/¾oz black sesame seeds,  10 lemon balm leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ovengrilledtigerpraw_92738"}