{"recipe_name":"Oven ki murghi (chicken baked with green chillies and onions)","author":"Madhur Jaffrey","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/ovenkimurghichickenb_76546_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. Put the tomato purée in a bowl and mix with one tablespoon of water. Add all the remaining sauce ingredients, in the listed order, mixing as you go. Spread out the chicken breasts and season them generously on both sides with salt and freshly ground black pepper. Put three tablespoons of the oil in a non-stick frying pan and place over a high heat. When hot, add the cinnamon, cracked cardamom pods and cloves. After ten seconds, add the chicken breasts in a single layer and brown them lightly on both sides.  Remove with a slotted spoon and place in a single layer in an ovenproof dish.  Add the onions, ginger, and green chillies to the same frying pan and fry them in the residual oil until they are golden-brown in colour. Remove with a slotted spoon and spread evenly over the chicken breasts. Add the remaining one tablespoon of oil to the frying pan. When hot, add the mustard seeds. As soon as they pop - this will be just a few seconds - add the garlic and stir. As soon as the garlic starts to brown, pour in the sauce.  As soon as the sauce heats up and starts bubbling, pour it over and around the chicken without displacing the onion mixture. Place the ovenproof dish, uncovered, in the oven and bake for 25 minutes. Serve immediately with basmati rice. ","ingredients":" 2 tbsp tomato purée,  1 tbsp Dijon mustard,  1 tsp ground cumin,  1 tsp garam masala,  1 tbsp lemon juice ,  ½ tsp salt ,  ¼ tsp chilli powder ,  100ml\/3½fl oz single cream,  4 boned, skinned chicken breasts (weighing approximately 560g\/1 lb 4oz in total),  salt and freshly ground black pepper, to taste,  4 tbsp vegetable oil ,  5cm\/2in piece cinnamon stick ,  6 cardamom pods, cracked open,  6 cloves ,  140g\/5oz onions, cut into fine half-rings,  2.5cm\/1in piece fresh root ginger, peeled and cut into fine slices, then into fine strips,  1-3 hot green chillies, cut at a diagonal into fine strips,  ½ tsp black or yellow mustard seeds,  1 clove garlic, finely chopped,  cooked basmati rice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ovenkimurghichickenb_76546"}