{"recipe_name":"Ox tongue and tripe","author":"Anthony Demetre","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 2-4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tongue, discard the soaking water (if using) and rinse. Cover with cold water, bring to the boil and skim any scum from the surface.  Add all the remaining ingredients and simmer for 3-5 hours, the slower the better. Slower cooking results in a better end product, too fast and you’ll end up with a mushy tongue. You’ll know when the tongue is cooked, the skin will bubble slightly and be easy to pull away from the flesh. Once peeled, place back into the juice and leave to cool completely. This will keep in the fridge for about 3 days. For the tripe, preheat the oven to 150C\/130C Fan\/Gas 1. In a large ovenproof pan, gently fry the carrots, onions, and garlic in the vegetable oil until lightly coloured and soft. Add the tomatoes, herbs and paprika. Cook until the tomatoes are soft and combine to form a homogenous mixture. Add the tripe, vanilla, sherry and vinegar, heat through then cover with the chicken stock and season with salt and pepper. Bring to the boil, cover with a lid and transfer to the oven until the tripe is tender (about 6 hours). Check that the tripe doesn’t dry out and add water if needed. Leave to completely cool in the liquid before slicing into strips for frying. For the green vegetable vinaigrette, finely chop all the ingredients then mix with enough olive oil and lemon juice to create a thick sauce. Season to taste with salt and pepper. For the oyster mayonnaise, in a food processor blend the oysters with the cooked egg whites and some of the reserved juice to create a thick paste. With the motor running, pour in the oil in a thin, steady stream to make the mayonnaise. Thin with the juice and water if needed. Season to taste with lemon juice and salt.  To finish, slice the ox tongue and fry in a non-stick pan until crisp, golden-brown and heated through, set aside. Crisp the tripe pieces in the same way. Serve immediately with the green vegetable vinaigrette and oyster mayonnaise. The addition of some pennywort leaves or sea astor will give the dish a finished touch. ","ingredients":" 1 ox tongue, unsalted,  1 large carrot, halved,  1 onion, halved and studded with 2 cloves,  1 celery stick, halved,  10 black peppercorns,  3 garlic cloves, crushed ,  2 pieces orange zest,  1 large sprig thyme,  1 tbsp sea salt,  1 large carrot, finely chopped,  1 large onion, finely chopped,  5 garlic cloves, crushed,  vegetable oil, for frying,  2 large plum tomatoes, chopped,  1 sprig rosemary,  1 tbsp smoked paprika,  2 large pieces dressed ox tripe (reticulum),  1 vanilla pod, sliced and seeds scraped out,  3 tbsp dry sherry,  3 tbsp sherry vinegar,  1 litre\/1¾ pint chicken stock,  salt and pepper,  1 cucumber, halved and seeds removed,  2 green peppers, scorched, peeled and seeds removed,  2 spring onions,  1 tbsp miniature capers,  1 tbsp chopped gherkins,  1 stick celery ,  1 tbsp chopped flat leaf parsley,  lemon juice, to taste,  extra virgin olive oil, to taste,  5 rock oysters, shucked, juices reserved,  1 tsp cooked egg white,  100-150ml\/3½-5fl oz grapeseed or neutral-tasting oil,  lemon juice, to taste,  salt, to taste,  new pennywort leaves,  sea astor","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ox_tongue_and_tripe_70355"}