{"recipe_name":"Oxtail soup","author":"Jenny White","programme":null,"prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/oxtail_soup_71917_16x9.jpg","method":"Heat the oil in a large, flameproof casserole dish. Add the oxtail pieces and fry over a high heat until browned all over – you may have to do this in batches. Take the oxtail out of the dish and put it on a plate. Add all the vegetables to the casserole and cook for 4-5 minutes, stirring occasionally. Add the herbs, peppercorns and tomato purée and cook for another minute. Pour in the wine and allow to bubble for a few minutes. Return the oxtail to the pan and pour in the stock. Bring to the boil, then turn down the heat to a gentle simmer. Cover and cook for 2½-3 hours, until the oxtail is really tender and falling off the bone. Using tongs or a slotted spoon, transfer the oxtail pieces to a plate and leave to cool. Strain the cooking liquor through a sieve into a bowl and leave to cool. Shred the oxtail meat and discard the bones. Place in a bowl and cover. Cover the bowl of cooking liquor and leave in the fridge, along with the oxtail meat, overnight. The next day, scrape away and discard the layer of fat on top of the cooking liquid. Spoon the remaining jellified soup into a pan and heat through until simmering. In a small bowl, blend the flour and three tablespoons of the hot soup until smooth. Whisk into the soup and simmer for two minutes. Add the oxtail meat to the pan and heat through for a minute or two before serving. ","ingredients":" 3 tbsp olive oil,  1.25kg\/2lb 12oz oxtail, trimmed of fat and cut into pieces,  1 onion, roughly chopped,  1 celery stalk, roughly chopped,  1 large carrot, roughly chopped,  1 bay leaf,  3 thyme sprigs,  10 black peppercorns,  2 tsp tomato purée,  300ml\/10½fl oz red wine,  1.5 litres\/2½ pints litres beef stock,  1 tbsp plain flour","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/oxtail_soup_71917"}