{"recipe_name":"Paella","author":"Sanjeev Bhaskar","programme":"A Taste of My Life","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat half the olive oil in a paella dish or large heavy-based pan over a medium heat, add the chorizo and fry for 2-3 minutes, then remove and set aside. Add the chicken pieces to the same pan and cook for 2-3 minutes until the skin is browned. Remove and set aside. Place the mussels into a pan of boiling water, cover and boil until they open. Discard any that do not open. Strain and reserve the mussels and the broth. Add half the remaining olive oil to the paella pan and fry the onion, two of the cloves garlic, the chilli flakes and the red pepper. Cook slowly until the onion has softened but not browned, about eight minutes. Add the rice to the pan, stirring well to coat it in the oil, for two minutes, then add the bay leaves, paprika, the toasted saffron, white wine, lemon juice and prepared stock. Cook gently for five minutes. Add the fried chicken and chorizo, cover with a piece of dampened greaseproof paper and simmer gently for ten minutes. Stir in the peas and add the clams. Cover and simmer until all the clams have opened, about five minutes (discard any clams that have not opened). Remove the greaseproof paper from the pan and stir in the tomatoes, parsley, lemon zest and butter. Add the remaining olive oil to a separate frying pan over a medium-high heat. Add the remaining clove of garlic and the prawns and fry for 2-3 minutes, adding the squid for the last minute. Season to taste with salt and freshly ground black pepper and add to the paella. Serve immediately. ","ingredients":" 125ml\/4fl oz olive oil,  175g\/6oz chorizo cut into 5mm\/¼inch slices,  8 chicken thighs, de-boned, cut in half, rolled in plain flour,  1kg\/2lb 4oz mussels, cleaned and debearded,  1 large Spanish onion, finely chopped,  3 cloves garlic, chopped,  ½ tsp dried red chilli flakes,  1 red pepper, chopped,  400g\/14oz paella rice (such as calasparra), rinsed and drained,  3 bay leaves,  1 tsp smoked paprika,  1 tsp saffron threads, toasted in a dry frying pan for 1-2 minutes,  125ml\/4fl oz white wine,  1 tbsp lemon juice,  2.8 litres\/5 pints chicken stock made from mussel cooking broth + water and a chicken stock cube,  115g\/4½oz frozen peas, thawed,  18 small fresh clams, cleaned (discard any with broken shells or that do not close when firmly tapped),  4 large tomatoes, de-seeded and chopped,  5 tbsp chopped flatleaf parsley,  1 lemon, zest only,  55g\/2oz unsalted butter,  12 raw king prawns, in their shells,  450g\/1lb squid, cleaned and cut into small pieces,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/paella_89059"}