{"recipe_name":"Paella","author":"Gordon Jones","programme":"Virgin Cooks","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat two tablespoons of the olive oil in a large frying pan or paella pan. Add the sliced onion, the two cloves of finely chopped garlic and the chopped red pepper. Gently fry for 5-6 minutes over a medium heat, or until the onions are softened but not coloured.  Place the tomatoes, parsley and oregano into a bowl and mix well to combine.  Season the chicken thighs with sea salt and freshly ground black pepper and rub with the smoked paprika. Heat the remaining olive oil in a frying pan and fry the chicken for 2-3 minutes on each side, or until golden-brown all over. Transfer the chicken to a bowl, along with any pan juices.  Return the paella pan to the heat and add the chopped onion, the finely sliced garlic, and the chopped chorizo. Cook for 3-4 minutes, or until the chorizo is golden-brown.  Add the rice to the pan along with the saffron and stir to coat in the oil, then add the chicken pieces. Pour in the sherry and stir once, then allow to bubble for 2-3 minutes until most of the liquid has evaporated. Pour in the vegetable stock and turn down the heat to a simmer. Cover the pan with a lid and cook for 20 minutes, stirring once or twice during cooking, until all of the stock is absorbed and the rice is tender.  Sprinkle the fresh peas over the paella, then top with the prepared tomatoes, oregano and parsley. Turn the heat off and cover with a lid for 2-3 minutes. To serve, fluff up the paella with a fork and spoon into serving bowls, with a wedge of preserved lemon to garnish. ","ingredients":" 4 tbsp olive oil, plus extra for drizzling,  2 onions, peeled, one sliced and the other roughly chopped ,  3 garlic cloves, peeled, two finely chopped and the third finely sliced,  1 large red pepper, seeds removed, chopped,  4 large tomatoes, roughly chopped,  3 tbsp chopped fresh flatleaf parsley,  2 sprigs fresh oregano, chopped,  6 skinless and boneless chicken thighs, cut into bite-sized pieces,  sea salt and freshly ground black pepper,  1 tsp smoked paprika,  125g\/4½oz cooking chorizo, chopped,  400g\/14oz Spanish short-grain rice, such as Calasparra,  pinch saffron strands,  150ml\/5fl oz dry sherry ,  1 litre\/2 pints hot vegetable stock,  200g\/7oz fresh peas ,  1 preserved lemon, cut into wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/paella_92222"}