{"recipe_name":"Pain au chocolat blanc with raspberries and cream cheese","author":"Luis Troyano","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Makes 12 pastries","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dough, warm the milk and 90ml\/3fl oz water in a small saucepan until lukewarm.  Place all the other ingredients, except the butter, in the bowl of a freestanding mixer with a dough hook attachment, making sure the yeast doesn’t touch the salt. Add three-quarters of the milk and water mixture.  Start the mixer on a low speed until all the ingredients are incorporated. Add a bit more liquid if the dough seems too dry; you want a slightly sticky dough. Increase the speed and mix for seven minutes.  Spread the dough out onto a baking tray lined with baking parchment. Cover with cling film and place in the freezer to cool.  Using a rolling pin, flatten the butter out between two pieces of baking parchment into a rectangle 33x19cm\/13x7½in and place in the freezer.  After 15 minutes remove the dough from the freezer and roll it out to a rectangle 50x20cm\/19½x8in. With a short edge towards you place the flattened butter on the lower two-thirds of the dough.  Fold the top third of dough over the butter and then fold the bottom third upwards so all the butter is encased. Press the edges of the dough firmly together.  Turn the block of dough 90 degrees and roll out to 50x20cm\/19½x8in. Fold the top third down and the bottom third up and place back in freezer for 15 minutes.  Repeat the rolling and folding twice more, placing the dough in the freezer for 15 minutes in between. Cut the pastry in half and roll out one half on a well-floured work surface to a 42x20cm\/16½x8in rectangle. For the filling, with the long edge of the dough towards you, place a 1cm\/½in row of white chocolate right across the dough about 2.5cm\/1in away from the edge. Roll up the bottom edge of the dough to cover the chocolate.  Mix together the cream cheese and lemon zest in a bowl until smooth and airy.  Place the cream cheese mixture in a piping bag fitted with a 7mm nozzle and pipe two rows right across the dough just above the encased chocolate. Place a row of raspberries on top of the cream cheese. Roll the dough again to encase the filling and trim off any excess dough.  Cut the roll of dough into six even pieces, each one 7cm\/2¾in long. Place each one on a baking tray lined with non-stick baking paper.  Repeat the filling process for the second half of the dough so you end up with 12 pastries. Cover the pastries with cling film and allow to prove at room temperature for 40 minutes.  Preheat the oven to 200C\/400F\/Gas 6. (Do not use a fan-assisted oven.) Brush the pastries with the beaten egg. Bake for 25 minutes, or until well-risen and golden-brown. Remove from the oven and allow to cool slightly before transferring to a cooling rack. ","ingredients":" 125ml\/4fl oz full-fat milk ,  500g\/1lb 2oz strong white flour ,  2 tsp fast-action yeast ,  80g\/3oz caster sugar ,  2 medium free-range eggs ,  2 tsp fine sea salt ,  250g unsalted butter, chilled, in a block ,  120g\/4¼oz white chocolate, chopped ,  150g\/5½oz full fat cream cheese,  1 lemon, zest only,  200g\/7oz raspberries,  1 large free-range eggs, beaten, for glazing","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pain_au_chocolat_blanc_37035"}