{"recipe_name":"Pain au lait","author":"Richard Burr","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Makes 12 buns","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a small bowl, mix the milk and yeast together, and set aside for five minutes. In a large bowl, mix the flours, sugar and salt until thoroughly combined. Pour in the yeast and milk mixture, softened butter and beaten egg and stir to combine. Turn out onto a lightly floured work surface and knead (use a dough scraper) for 10 minutes, or until smooth and no longer sticky. Put the dough into a clean bowl, cover with a clean tea towel and leave to prove for 30 minutes.   Preheat the oven to 210C\/410F\/Gas 6½.   Weigh the dough and cut into 12 equal pieces.  Roll into balls and leave to rest, covered, for 10 minutes.   Using a rolling pin, roll each dough ball out into an 8cm\/3in circle.  Fold one-third of the circle into the centre and press with your thumb to stick it down. Then fold the opposite third of the circle into the centre. Fold this shape in half lengthwise to form a cylinder. Roll gently to seal the sides together, pressing slightly harder at the ends to make them slightly pointed. Place the buns, seam-side down, onto baking trays lined with baking parchment.   Cover the dough with cling film and allow to rise for 30 minutes.  Brush each of the buns with egg and, using scissors, snip a zig-zag shape onto the top. Sprinkle with nibbed sugar and bake for 10-12 minutes. ","ingredients":" 150ml\/5½fl oz lukewarm full-fat milk,  5g fast-action yeast,  275g\/9¾oz plain flour,  75g\/2½oz strong bread flour,  45g\/1¾oz sugar,  1 tsp salt,  75g\/2½oz unsalted butter, softened,  1 large free-range egg, beaten, plus extra for glazing,  nibbed sugar (pearl sugar), for sprinkling","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pain_au_lait_22273"}