{"recipe_name":"Pakora with mango chutney","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chutney, heat two tablespoons of vegetable oil in a frying pan over a medium heat. Add the ginger, chilli, lime zest and garlic and fry for 3-4 minutes, or until softened. Stir in the ground cinnamon, ground coriander, sugar, cider vinegar, lime juice and mangoes. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Continue to simmer for 20-30 minutes, or until the mixture has reduced and has the consistency of jam. (NB: The chutney makes double the amount needed for this recipe. The remaining chutney can be kept in sterilised jars in the fridge for up to 3 weeks.) Meanwhile, for the pakora, boil the onion slices in a pan of salted water for 2-3 minutes. Add the broccoli and cauliflower florets and continue to boil for 1-2 minutes, or until the onions are tender. Drain well and set aside. For the batter, mix together the flour, chilli, ground turmeric, cayenne pepper and seasoning in a bowl until well combined. Gradually add the water in a thin stream, whisking continuously, until a thick batter forms. (NB: You may not need to use all of the water.) Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Dip the blanched cauliflower florets and broccoli into the batter, then lower spoonfuls of the sliced onion into the batter. Carefully lower the battered vegetables into the hot oil in batches and fry for 4-5 minutes, or until crisp and golden-brown. Remove from the heat using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining battered vegetables. To serve, divide the pakora among four serving baskets. Serve the yoghurt (if using) and mango chutney in dipping bowls alongside. ","ingredients":" 2 tbsp vegetable oil,  2.5cm\/1in piece fresh root ginger, peeled, minced,  1 small red chilli, chopped,  1 lime, zest and juice,  1 garlic clove, peeled, crushed,  pinch ground cinnamon ,  pinch ground coriander,  225g\/8oz soft light brown sugar,  225g\/8fl oz cider vinegar,  3 mangoes, stones removed, peeled, diced ,  2 onions, peeled, sliced,  1 head broccoli, cut into florets,  ½ cauliflower head, cut into florets,  200g\/7oz gram flour (chickpea flour),  1 small red chilli, finely chopped,  1 tsp ground turmeric,  1 tsp cayenne pepper,  salt and freshly ground black pepper,  100-175ml\/3½-6fl oz ice cold water,  vegetable oil, for deep frying,  plain yoghurt, to serve (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pakorawithmangochutn_92807"}