{"recipe_name":"Fried bacon with poached egg and tomatoes","author":"The Hairy Bikers","programme":"Hairy Dieters: How to Love Food and Lose Weight","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/pan-fried_bacon_with_76907_16x9.jpg","method":"Brush a large non-stick frying pan with sunflower oil, using the tip of a pastry brush. Place the pan over a medium heat and add the bacon. Cook for 2 minutes until lightly browned, then turn and fry on the other side for another 3 minutes. While the bacon is cooking, half fill a medium non-stick saucepan with water, add the vinegar and bring to the boil. Turn the heat to low, so the water is only just bubbling. Crack the eggs into the water, one at a time, spacing them well apart. Cook for 2½ minutes.  The eggs should rise to the surface within a minute. If the egg white sticks to the bottom of the pan, lift it gently with a wooden spoon. Alternatively, you can use a hob-top egg poacher, lightly greased with sunflower oil. Add the tomatoes to the pan with the bacon and season with plenty of black pepper. Cook the tomatoes for about a minute until just beginning to soften, turning them once.  Put a small pile of watercress on each plate. Put some bacon and tomatoes on the plates and drizzle with a dash of balsamic vinegar. Take the eggs out of the water with a slotted spoon and place them on top. Season with a little more pepper and tuck in right away while it’s all lovely and hot. ","ingredients":" 1 tsp sunflower oil,  4 rashers of rindless smoked back bacon,  1 tsp white wine vinegar,  2 free-range very fresh eggs (fridge cold),  8 cherry tomatoes, halved,  good handful of watercress,  drizzle of good-quality balsamic vinegar,  freshly ground black pepper","vegetarian":false,"calories":264.0,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pan-fried_bacon_with_76907"}