{"recipe_name":"Pan-fried black pudding with scallops and ginger purée","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03cvwcn.jpg","method":"Bring the ginger, curry leaves, palm sugar, tamarind and 500ml\/18fl oz water to the boil in a large saucepan, then reduce the heat and simmer for 10 minutes. Remove from the heat and set aside to cool slightly, then blend to a fine purée in a food processor. Season with a pinch of salt.  Heat the caster sugar in a frying pan over a low to medium heat until melted and beginning to caramelise. Add the apple slices and cook in the caramelised sugar for a few seconds before adding the butter. When the butter has melted, add a splash of water to the pan and swirl the contents, without stirring, until the caramel is smooth and the apple slices are coated in caramel. Dry-fry the pancetta slices in a non-stick frying pan over a high heat, until crisp on both sides. Remove from the pan and set aside. Add the black pudding slices to the same pan and dry-fry for 30 seconds only on each side, until just crisp on the outside but still soft on the inside. Remove from the pan and set aside. Drizzle the scallops with a little of the oil, then add them to the same pan and fry for 1-1½ minutes on each side, or until golden-brown on both sides and just cooked through. Squeeze over the lemon juice then remove the scallops from the pan. To serve, cut the scallops in half widthways. Place one disc of caramelised apple into the centre of the serving plates. Top with a small spoonful of the spice purée, then a slice of black pudding, then half a scallop. Repeat the stacking process once more to create two towers on each plate. Drizzle a spoonful of spice purée around the edge of each plate, then top the towers with a couple of pieces of crispy pancetta and finish with a drizzle of extra virgin olive oil. ","ingredients":" 200g\/7oz fresh root ginger, peeled and thinly sliced,  4 fresh curry leaves,  75g\/2¾oz palm sugar,  50g\/2oz tamarind paste,  pinch salt,  25g\/1oz caster sugar,  1 apple, cut horizontally into 12 thin slices,  10g\/½oz butter,  8 thin slices pancetta,  8 x 1cm\/½in thick slices black pudding,  1 tsp olive oil,  4 large scallops with roe,  ½ lemon, juice only,  4 tsp extra virgin olive oil, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pan-fried_black_pudding_99293"}