{"recipe_name":"Pan-fried courgette risotto with courgette tempura and tomato ragu","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the risotto, melt 25g\/1oz of the butter in a large pan until foaming, then fry the onion and garlic for 2-3 minutes, or until softened. Add the risotto rice and stir well to coat with the butter.  Cook for 1-2 minutes, or until the rice grains start to turn translucent, then add the wine and cook for 3-4 minutes, or until nearly all of the liquid has evaporated. Add a ladleful of the chicken stock to the pan and stir well. Cook for 1-2 minutes, or until nearly all of the stock has been absorbed, then add another ladleful of the stock. Repeat the process until the rice is cooked but still al dente.  Add the courgette during the last 2-3 minutes of cooking and then stir in the mascarpone, 25g\/1oz of the parmesan and 25g\/1oz of butter. Season, to taste, with salt and freshly ground black pepper. Remove the pan from the heat and cool then chill. Heat a frying pan until medium hot, add the last of the butter and the olive oil and place a 10cm x 2.5cm\/4in x 1in metal ring into the pan. Fill the ring with the cold risotto and pack down well. Cook until the bottom is crisp and golden brown then flip over and cook on the other side until it is crisp and the rice is hot through. Set aside and keep warm. For the ragu, heat a sauté pan until medium hot then add the olive oil, tomatoes and garlic.  Cook over a medium high heat for 3-4 minutes, or until the tomato is just starting to break down. Stir in the basil and season, to taste, with salt and freshly ground black pepper. Remove the pan from the heat and set aside in a warm place. For the courgette tempura, heat a deep-sided frying pan filled two thirds full with vegetable oil until hot but not smoking, or heat a deep-fat fryer to 190C. Meanwhile, place the flour, cornflour and salt into a bowl and add the sparkling water. Stir to combine very briefly, until the batter just comes together, leaving any lumps. Add a little more water if necessary. Drop the courgette slices into the batter, coat fully then place straight into the hot oil. Fry on each side until just golden and crisp. Remove from the pan and drain onto kitchen paper. (CAUTION: hot oil can be dangerous. Never leave the pan unattended.) To serve, spoon some tomato ragu into the centre of the plate. Lay the risotto cake on top then add a grating of parmesan and a pile of courgette tempura. ","ingredients":" 75g\/2¾oz butter,  1 onion, finely chopped,  1 garlic clove, finely chopped,  250g\/9oz arborio or other Italian risotto rice,  150ml\/5fl oz dry white wine,  1 litre\/1¾ pints chicken stock,  200g\/7oz courgette, roughly chopped,  3 tbsp mascarpone,  40g\/1½oz parmesan cheese, grated,  3 tbsp olive oil,  4 tbsp extra virgin olive oil,  1 x 400g\/14oz tin chopped tomatoes,  2 garlic cloves, roughly chopped,  1 large handful fresh basil leaves, roughly chopped,  salt and freshly ground black pepper,  vegetable oil, for frying,  50g\/2oz plain flour,  50g\/2oz cornflour,  pinch salt,  125ml\/4fl oz sparkling water,  1 courgette, finely sliced with a peeler","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pan-fried_courgette_83096"}