{"recipe_name":"Pan-fried monkfish with wild garlic and fennel","author":"Rick Stein","programme":"Spring Kitchen with Tom Kerridge","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6.   Cut 13 of the garlic cloves lengthways into long thin pieces.  Melt half of the butter in a pan, add the garlic and sliced fennel and fry over a medium heat until lightly browned.  Add half of the fish stock and salt and pepper, and simmer for 15 minutes, or until the fennel is tender. Meanwhile slice the remaining three cloves of garlic and put into a food processor with the semolina and all but one sprig of fennel leaves. Blend until you have an aromatic pale-green powder.  Coat the pieces of monkfish in the semolina mixture.  Heat the oil in an ovenproof frying pan, add a small knob of the butter and the monkfish pieces and fry over a moderate heat, turning now and then, until they are golden-brown all over.  Transfer the pan to the oven and cook the monkfish for a further 10 minutes. Remove the pan from the oven and lift the fillets onto a chopping board. Slice diagonally into thick slices, keeping each piece in shape. Transfer to a plate and keep warm. Finely chop the remaining wild fennel herb. Add it to the pan in which the monkfish was cooked along with the cooked fennel mixture, lemon juice, liqueur, and wild garlic.   Simmer rapidly until slightly reduced in volume, then add the remaining butter and simmer until it has blended in to make a rich sauce.  Adjust the seasoning if necessary.  Lift the fish onto four warmed plates and spoon some of the sauce around each piece. ","ingredients":" 16 large garlic cloves (new season if possible), sliced,  100g\/3½oz unsalted butter,  450g\/1lb fennel bulb, thinly sliced,  600ml\/20fl oz fish stock,  salt and freshly ground black pepper,  100g\/3½oz semolina,  15g\/½oz sprigs wild fennel leaves,  4 x 225g\/8oz pieces prepared monkfish fillet,  4 tbsp sunflower oil,  2 tsp lemon juice,  splash aniseed liqueur,  20g\/¾oz wild garlic leaves, sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pan-fried_fillet_of_83911"}