{"recipe_name":"Pan-fried John Dory with pickled chestnut mushrooms, caramelised apple and parsnip purée","author":"Kenny Atkinson","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the parsnip and mustard coleslaw, peel and thinly slice the parsnip lengthways and then julienne into thin strips. Place the parsnip into a large bowl, stir in the lemon juice and sea salt flakes and set aside to marinate for 30 minutes. Squeeze out any excess lemon juice and then stir in the mayonnaise and mustard. Cover the bowl with cling film and set aside in the fridge. For the pickled chestnut mushrooms, heat a frying pan until hot. Fry the mushrooms for 30 seconds, then add the thyme and season to taste with sea salt flakes and freshly ground black pepper. Add the sherry vinegar to the pan and continue to cook until all of the liquid has evaporated.  Add the oil and continue to cook until warmed through. Remove the pan from the heat and set aside to cool. For the caramelised apple, heat the sugar in a saucepan until it becomes caramel. Stir in the butter. Add the apple slices and continue to cook for a further two minutes. Remove the pan from the heat and set aside to cool. For the parsnip purée, add the parsnips, shallot, garlic, butter and water to a large saucepan and cook for 5-6 minutes, or until the parsnip is cooked through and the volume of the liquid has reduced by two-thirds. Cool slightly and then blend the mixture in a blender or food processor to a smooth purée. Stir in the cream and season to taste with salt and ground white pepper. For the pan-fried John Dory, lightly dust the presentation side of the dory fillets with a little curry powder. Heat the rapeseed oil in a frying pan and fry the John Dory fillets, presentation-side down, for two minutes. Season the fillets with a little salt and then carefully turn them over. Add the butter and cook for a further minute, basting the fish with the butter. Squeeze over a little lemon juice. To serve, place two small spoonfuls of parsnip purée onto each serving plate, slide a spoon through it to create a cheffy smear. Place two small mounds of coleslaw on top of the purée and top with the John Dory fillet. Place the caramalised apple on one piece of fish and sprinkle some chestnut mushroom around the plate. Garnish with red shiso cress and sliced, roasted cobnuts. ","ingredients":" 1 parsnip,  1 lemon, juice only,  pinch sea salt,  1 tbsp mayonnaise,  ½ tsp wholegrain mustard,  50g\/2oz chestnut mushrooms, quartered,  1 sprig fresh thyme,  sea salt flakes and freshly ground black pepper,  1 tbsp sherry vinegar,  150ml\/5fl oz rapeseed oil,  3 tbsp caster sugar,  100g\/3½oz butter,  1 Braeburn apple, peeled, core removed, sliced,  250g\/9oz parsnips, diced,  1 banana shallot, chopped,  ½ garlic clove,  50g\/2oz unsalted butter,  350ml\/12fl oz water,  100ml\/3½fl oz double cream,  salt and ground white pepper,  2 John Dory fillets, skin removed,  2 tsp curry powder,  20ml\/¾fl oz rapeseed oil,  knob unsalted butter,  ½ lemon,  1 tbsp roasted cobnuts, sliced,  red shiso cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pan-fried_john_dory_with_32679"}