{"recipe_name":"Pan-fried mackerel, black olive croute with tomato and pomegranate salad","author":"Selin Kiazim","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the gazpacho, blend all the ingredients in a food processor until smooth. For the salad, preheat the oven to 200C\/180C Fan\/Gas 6. Drizzle a little olive oil and sea salt on the bread and bake on a tray for 10 minutes or until a little golden and crisp. Combine the tomatoes, red onion, peppers, parsley, extra virgin olive oil and pomegranate molasses with a little salt and pepper. Heat a small frying pan and add the fennel and cumin seeds and cook until the start to release their oils. Place into a pestle and mortar and grind. Heat the sunflower oil in a large frying pan over a medium to high heat. Season the flesh side of the mackerel with salt, the ground fennel, cumin and pul biber. Press the seasoning in. Cook the fish skin-side down in the frying pan for 2 minutes or until the skin is golden-brown and crisp. Turn over and cook for 1 minute or until the fish is just done. For the Turskish chilli butter, heat the butter in a pan until foaming then add the chilli flakes, cook until the butter browns. Keep warm. Just before serving dip some bread into the gazpacho. Place two slices of bread on the serving plate then pile the vegetables, serving ingredients and fish on top, pour over the chilli butter and serve.  ","ingredients":" 4 ripe tomatoes, chopped,  ¼ cucumber, peeled and chopped,  1 red pepper, seeds removed and chopped,  50-100ml\/2-3½fl oz sherry vinegar, to taste,  4 tbsp extra virgin olive oil,  8 slices white baguette, cut on diagonal 1cm\/½in thick,  2 tomatoes, peeled and sliced,  1 red onion, thinly sliced,  2 Charleston peppers (or hot fresh chillies), sliced,  ¼ bunch parsley, finely chopped,  2 tbsp black olive paste (available in Turkish supermarkets and online),  2 tbsp pomegranate molasses,  1 tbsp ground fennel seeds,  1 tbsp cumin seeds,  1 tsp sunflower oil,  4 mackerel fillets, pin-boned,  2 tbsp pul biber (Turkish chilli flakes),  sea salt and freshly ground black pepper,  50g\/1¾oz butter,  pul biber (Turkish chilli flakes), to taste,  100g\/3½oz radishes with leaves, thinly sliced,  pickled chillies, roughly chopped,  nigella seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pan-fried_mackerel_black_81238"}