{"recipe_name":"Pan-fried plaice with crab and samphire","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Season the plaice with a little salt then dust with the flour. Heat a frying pan until hot, add half the butter and the plaice fillets, presentation side down and cook for 1- 1 ½ minutes until just cooked then turn over and cook for another 45 seconds. Remove from the pan and rest for a couple of minutes. Heat a frying pan until medium hot, add the remaining butter and the samphire and sauté for 2-3 minutes until just tender. For the white crab, place all the ingredients, except the olive oil and lemon juice, into a bowl and mix well to combine. Add enough olive oil so that the mixture just holds together if pressed lightly into a quenelle. Check the seasoning and add a little lemon juice if necessary. For the brown crab, heat a frying pan until medium hot, add the butter, shallots and garlic and sweat for 2-3 minutes until just softened. Add the sieved brown crab meat, whisk well to combine then add the white wine and bring to a simmer. Cook for a minute until just reduced then remove from the heat and whisk in the mayonnaise. Check the seasoning and add salt and freshly ground black pepper to taste. To serve, pile some samphire onto the centre of each serving plate then top with a plaice fillet. Form a quenelle of the white crab meat and set on top of the plaice. Drizzle the brown crab sauce around the edge of the dish. ","ingredients":" 4 large plaice fillets, skinned and pin boned,  salt, to season the fish,  3 tbsp plain flour,  75g\/3oz butter,  115g\/4oz samphire,  115g\/4oz white crab meat, picked,  2 tbsp finely chopped capers,  2 tbsp finely chopped flatleaf parsley,  1 tbsp finely chopped chives,  1 tbsp finely chopped chervil,  2 hard-boiled eggs, finely chopped,  3-4 tbsp extra virgin olive oil,  ½ lemon, juice only, to taste,  25g\/1oz butter,  1 shallot, finely diced,  1 garlic clove, finely diced,  75g\/3oz brown crab meat, passed through a fine sieve,  75ml\/2½fl oz white wine,  3 tbsp mayonnaise","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pan-fried_plaice_with_57647"}