{"recipe_name":"Pan-roasted turbot with ratatouille and chive beurre blanc","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ratatouille, heat a frying pan over a medium to high heat, add the olive oil and, when it’s hot, add the onion and peppers. Fry for 2-3 minutes, or until softened. Add the garlic, aubergine and courgettes and fry for a further 2-3 minutes, stirring occasionally. Add the tomatoes and continue to cook for a further minute. Sprinkle over the basil leaves and season, to taste, with salt and freshly ground black pepper. For the chive beurre blanc, bring the finely sliced shallots, white wine vinegar and white wine to the boil in a non-reactive saucepan. Reduce the heat until the mixture is simmering, then continue to simmer until only two tablespoons of liquid are left in the pan.  Add the cold water and continue to simmer until the volume of liquid remaining in the pan is about one tablespoon.  Reduce the heat to low, then gradually whisk in the butter, 25g\/1oz at a time, waiting until all of the butter has melted and incorporated into the mixture before adding more.  Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it into a clean saucepan. Season, to taste, with salt and freshly ground black pepper, then stir in the chives. Set aside at room temperature until needed (do not refrigerate as the sauce will separate). For the turbot, preheat the oven to 200C\/400F\/Gas 6. Season the turbot fillets with salt and freshly ground black pepper. Heat a frying pan over a medium heat, add the butter and, when it’s foaming, add the turbot fillets, skin-side down (in batches if necessary). Fry for 1-2 minutes, or until the skin is crisp and golden-brown, then turn the fish over and add the wine. Cover the fish with the cartouche and transfer the pan to the oven for 3-4 minutes, or until just cooked through (the fish is cooked through when the flesh is opaque). Remove the fish from the pan and set aside to rest for 1-2 minutes. To serve, spoon a quarter of the ratatouille into the centre of each of four serving plates. Place one fillet of turbot on top of each portion. Spoon over the chive beurre blanc. ","ingredients":" 2 tbsp olive oil,  1 red onion, chopped,  1 red pepper, cut into 1cm\/½in dice,  1 yellow pepper, cut into 1cm\/½in dice,  2 garlic cloves, peeled, roughly chopped,  1 aubergine, cut into 1cm\/½in dice ,  2 courgettes, cut into 1cm\/½in dice,  3 tomatoes, cut into 1cm\/½in dice ,  2 tbsp fresh basil leaves, finely chopped,  salt and freshly ground black pepper,  2 shallots, peeled, finely sliced,  1 tbsp white wine vinegar,  4 tbsp white wine,  1 tbsp cold water,  225g\/8oz salted butter, cut into cubes,  salt and freshly ground black pepper,  4 tbsp chives, chopped,  4 x 175g\/6oz turbot fillets,  salt and freshly ground black pepper,  50g\/2oz butter,  75ml\/3fl oz white wine","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pan_roasted_turbot_with_97893"}