{"recipe_name":"Pancakes served with roasted peaches and nectarines and lavender honey","author":"Michael Caines","programme":"Countryfile Summer Diaries","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat oven to 180C\/350F\/Gas 4. For the pancakes, break the eggs into a bowl and whisk in the flour until it is a smooth batter. Whisk in the milk, salt and one teaspoon of vegetable oil. Using a paper kitchen towel, smear the base of a non-stick frying pan with the remaining oil before allowing to gently heat. When the pan is hot, ladle some of the pancake mixture in until it is evenly covering the base of the pan. Allow the pancake to colour until golden-brown underneath before turning and cooking the other side. Once golden-brown remove from the pan and place onto a plate. It is useful to separate the pancakes using small pieces of baking parchment paper. Repeat the process until there are eight pancakes. Place the pancakes into the oven to keep warm. For the roasted fruits, place the butter, one sprig of lavender and the honey into a non-stick, ovenproof pan and heat gently. Add the fruit to the pan and caramelise lightly before placing the pan into the oven and cooking for approximately five minutes. Remove the fruits from the oven. Add the orange juice to the fruits and use a wooden spoon to scrape the caramelised juices off the bottom and sides of the pan. Add another sprig of fresh lavender. Leave to rest. Remove the pancakes from the oven. To serve, place one pancake onto a plate, spoon in some of the fruit and its juice and fold or roll the pancake up. Repeat this for the rest of the pancakes. ","ingredients":" 2 free-range eggs,  200g\/7oz plain flour,  350ml\/12fl oz milk,  pinch of salt ,  2 tsp vegetable oil,  55g\/2oz unsalted butter,  2 sprigs fresh lavender,  3½ tbsp honey,  2 peaches, quartered and stones removed,  2 nectarines, quartered and stones removed,  1 orange, juice only","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pancakesservedwithro_86540"}