{"recipe_name":"Pancetta-wrapped goats' cheese en croute with chilli apple chutney","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the en croute, melt the butter in a frying pan over a medium heat. Add the spinach and cook until just wilted. Add a pinch of freshly grated nutmeg and season well with salt and freshly ground black pepper. Remove from the pan and leave to cool. Wrap the pancetta rashers around the goats' cheese. Place into the same hot frying pan and cook for two minutes on each side, then remove and set aside to cool. Cut the puff pastry into two large rounds. Place the spinach into the centre of one of the pastry rounds. Top the spinach with the cooled pancetta-wrapped goats' cheese and season well with salt and freshly ground black pepper. Brush the edge of the pastry round with the egg and place the remaining piece of pastry over the top. Press the pastry down and crimp the edges. Score the top of the pastry in a circular pattern and brush with the remaining egg wash. Place the pastry parcel onto a baking tray and transfer to the oven to bake for 20 minutes, or until golden brown and cooked through. For the chutney, heat a pan, add the sugar and allow to melt. Add all of the remaining chutney ingredients and cook for 15-20 minutes, until the apples are tender and the chutney has thickened slightly, then remove from the heat and allow to cool. To serve, place a half of the goats' cheese en croute onto each plate with a spoonful of chutney placed alongside. ","ingredients":" 2 tbsp butter,  110g\/4oz baby spinach leaves,  freshly grated nutmeg,  salt and freshly ground black pepper,  4 slices pancetta,  200g\/7oz rindless soft goats' cheese log,  250g\/9oz puff pastry, rolled out to 5mm\/¼in thick,  1 free-range egg, beaten,  110g\/4oz light muscovado sugar,  1 shallot, finely chopped,  1 tsp fresh ginger, finely chopped,  1 tsp mixed spice,  ½ tsp dried chilli flakes,  2 apples, cored and chopped,  110g\/4oz sultanas,  60ml\/2½fl oz white wine vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pancettawrappedgoats_85603"}