{"recipe_name":"Pandhi curry (Coorg-style pork stir fry) with apple and fennel raita","author":"Vivek Singh","programme":"2007-16","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pork, place the cubes of pork into a large dish. Add the remaining pork ingredients, cover, then marinate overnight in the fridge. When the pork cubes have marinated, transfer them and the marinade to a large, heavy-based pan. Add just enough water to cover the pork cubes and cook, covered, over a very low heat for 1-1½ hours, or until the meat is falling apart.  Meanwhile, for the apple and fennel raita, mix together all of the apple and fennel raita ingredients in a bowl until well combined. Chill in the fridge until needed.  Drain the cooked pork and set aside (reserve the cooking liquid). For the stir fry, heat the oil in a wok over a high heat. When the oil is smoking, add the dried red chillies and stir fry until they have darkened and are fragrant.  Add the curry leaves and stir fry for 30 seconds, or until crisp and fragrant.  Add the split green chillies and red onion slices and stir fry for 2-3 minutes until softened. Add the cooked pork cubes and fry, stirring continuously, for 3-4 minutes, or until golden-brown. (If the meat looks dry, add 1-2 tablespoons of the reserved cooking liquid and continue to cook until it has evaporated - this will glaze the pork cubes.) Season, to taste, with salt and freshly ground black pepper, then squeeze in the lime juice and stir to combine.  To serve, spoon some curry into the centre of each of four serving plates. Spoon a portion of apple and fennel raita alongside each serving. Sprinkle over the coriander cress leaves. ","ingredients":" 750g\/1½lb pork shoulder or pork belly, cut into 2.5cm\/1in cubes,  2 tbsp ginger and garlic paste (made from 1cm\/½in garlic, 1cm\/½in ginger and ½-1 tsp vegetable oil, blended to a paste) ,  1 tsp ground turmeric,  2 tsp salt,  8-10 whole black peppercorns,  3 bay leaves,  2 star anise,  4 tbsp clear honey,  3 tbsp soy sauce,  10 kokum (cocum) pods, soaked in 110ml\/4floz hot water to soften (available from some Asian grocers),  1 Granny Smith apple, or similar sharp green eating apple, core removed, flesh finely chopped,  2 heads baby fennel, finely chopped,  1 tsp fennel seeds, lightly toasted in a dry pan,  200g\/7oz Greek-style yoghurt,  ½ tsp salt,  1 tsp caster sugar,  2 tbsp vegetable oil,  4 dried red chillies,  10 curry leaves (available from some Asian grocers),  2 fresh green chillies, split,  2 medium red onions, sliced,  salt and freshly ground black pepper ,  ½ lime, juice only,  small bunch coriander cress, or other micro-leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pandhicurrycoorgpork_91467"}