{"recipe_name":"Paneed lamb with onion jam and roasted baby fennel","author":"Aldo Zilli","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the lamb, flatten the meat out with a meat hammer or rolling pin and set aside.  Place the bread, lemon zest, herbs, salt and freshly ground black pepper in a food processor and pulse to breadcrumbs. Tip the mixture out onto a baking sheet.  Dust the lamb with the flour, then dip into the beaten egg and then roll in the crumb mixture, patting gently to secure the crumbs to the meat. Heat the oil in an ovenproof frying pan and fry the lamb for 2-3 minutes on both sides, or until golden, then transfer to the oven. Cook for 5-6 minutes, or until golden-brown and cooked to your liking.  For the onion jam, melt the butter in a small pan and gently fry the onion with the sugar for 3-4 minutes, or until softened. Add the balsamic vinegar and cook for 4-5 minutes, or until the mixture is thick and sticky.  For the fennel, heat the olive oil in an ovenproof frying pan and fry the fennel with the zest and garlic for 2-3 minutes, then transfer to the oven. Cook for 6-8 minutes, or until the fennel is golden and tender.  Spoon the onion jam onto a serving plate and place the panéed lamb on top. Serve the fennel alongside. ","ingredients":" 1 lamb cutlet, fat trimmed,  1 slice white bread, crusts removed,  ½ lemon, zest only,  1 tbsp chopped fresh rosemary ,  1 tbsp chopped fresh thyme,  salt and freshly ground black pepper,  3 tbsp plain flour,  2 free-range eggs, beaten,  2 tbsp olive oil,  25g\/1oz butter,  1 red onion, chopped,  2 tbsp demerara sugar,  3 tbsp balsamic vinegar,  2 tbsp olive oil,  4 baby fennel, trimmed and left whole,  ½ lemon, zest only,  2 garlic cloves, skin-on and squashed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/paneedlambwithonionj_90323"}