{"recipe_name":"Paneer, mushroom and spinach wrap","author":"Anjum Anand","programme":"Indian Food Made Easy","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 5","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spinach paste, place all the spinach paste ingredients into a blender and blend until smooth. For the tandoori mushrooms, place all the ingredients except the mushrooms into a blender and blend to a smooth paste. Add the mushrooms to the paste and leave to marinate for 20 minutes. Preheat the oven to 200C\/400F\/Gas 6. For the paneer, heat the oil in a large non-stick pan. Add the spinach paste and the water and cook over a medium heat for 8-10 minutes, or until the paste starts to thicken. Add the paneer and the onion and cook for another minute, or until the onion just starts to soften. Meanwhile, thread the marinated mushrooms onto skewers, place onto an oiled baking sheet and transfer to the oven. Bake for 20 minutes, turning halfway through the cooking time. Once cooked, add the mushrooms to the paneer mixture. To serve, divide the filling into five portions and place each portion onto a warmed tortilla. Roll up and cut on the diagonal. ","ingredients":" 225g\/8oz baby spinach leaves, washed ,  45g\/1¾oz fresh coriander, leaves and stalks,  6 large garlic cloves, peeled  ,  5cm\/2in piece fresh ginger, peeled and roughly chopped,  6 tbsp roasted and salted peanuts,  2-3 tbsp lemon juice, or to taste,  1 tbsp vegetable oil,  salt and freshly ground black pepper ,  1-3 green chillies, seeds removed, roughly chopped (optional),  75ml\/2½fl oz Greek-style yoghurt,  1 tsp each garam masala, ground cumin, ground fennel seeds and green cardamom powder,  2 tsp crushed garlic,  1 rounded tsp grated ginger,  2 tsp gram flour,  salt, to taste,  2 tsp lemon juice,  ¼-½ tsp red chilli powder, or to taste,  2 tsp vegetable oil,  2 tbsp water,  200g\/7oz Portobello mushrooms, cleaned, boiled for 15 minutes, cooled and thickly sliced,  2 tbsp vegetable oil,  100ml\/3½fl oz water,  300-350g\/10-12oz paneer, cut into 2.5cm\/1in cubes,  ½ small onion, thinly sliced,  5 ready-made flour tortillas, wrapped in foil and placed in the oven for the last five minutes of cooking,  You'll need 5-6 wooden skewers, soaked in water for half an hour","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/paneermushroomandspi_86563"}