{"recipe_name":"Pan-fried sea bass with a three pepper stir-fry","author":"Paul Merrett","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Score the fillets of sea bass on the skin side - to prevent the fish from curling when it's pan-fried. In a frying pan, heat the olive and ½ tbsp vegetable oil and place the fish skin side down in the hot oil and leave to fry for a couple of minutes Meanwhile, heat the remaining 1 tbsp vegetable oil in a hot wok and add the peppers, and chillies and stir-fry for a minute or two. Check the fish and if the skin is crispy turn the fish over and cook the other side for a couple of minutes. To the peppers and chillies now add the garlic and ginger and stir. Add the chicken stock, the juice of the citrus fruits and allow to bubble. Add the sugar and the citrus zests. Finally add the fresh coriander and it's ready to serve. To serve, place the blanched spinach in the centre of the serving plate and place the fish on top, skin side up. Ladle the peppers and broth over the fish until the broth is at a level with the fish and eat immediately. Garnish the fish with a bit of citrus zest - optional. ","ingredients":" 2x200g\/7oz fillet of sea bass,  1½ tbsp vegetable oil,  ½ tbsp olive oil,  2 red peppers, very neatly and finely sliced,  2 yellow peppers,  very neatly and finely sliced,  2 garlic cloves, finely chopped,  5cm\/2in piece of ginger, sliced and cut into fine julienne,  1.2 litres\/2 pints light chicken stock, hot,  1 orange, zest and juice  ,  1 lime, zest and juice ,  1 lemon, zest and juice,  1 tbsp caster sugar,  2 red chillies, cut at an angle to form long rings and seeds removed,  2 green chillies, cut at an angle to form long rings and seeds removed,  2 tbsp fresh coriander finely chopped,  1 tbsp vegetable oil,  a large handful of baby spinach, blanched in boiling water for 1-2 minutes (this is for the fish to sit on in the centre of the plate)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedbasswithathr_67270"}