{"recipe_name":"Pan-fried calf's liver with port and sage","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a large pan of lightly salted water until boiling for the pasta Meanwhile, heat half the butter with the oil in a frying pan until no longer foaming and feeling hot. Add the liver and  fry for 1-2 minutes on each side until well-browned and just firm when pressed with the back of a fork. Season in the pan,  then remove to a warmed plate and keep warm. Add the port or Madeira to the pan, bring to the boil and allow to bubble until reduced by half. Add the vinegar and cook  for a few seconds. Pour in the stock and bring to the boil, stirring. Continue to boil until reduced by half. Meanwhile, add the pasta to the pan of boiling water and cook for 2-3 minutes for fresh pasta, or according to the packet instructions for dried pasta, until just tender. Drain, and then toss with the remaining butter and the fresh or dried sage. Season the pasta well and divide between two warmed serving plates. Lay the liver over the top (you may want to slice this  into attractive pieces). Whisk the crème fraïche into the sauce in the pan, if using, check the seasoning and  spoon over the liver.  Serve immediately. ","ingredients":" 25g\/1oz butter,  1 tbsp olive oil,  250g\/9oz calf's liver, thinly sliced and cut in half lengthways ,  4 tbsp port or Madeira,  2 tsp red wine vinegar,  100ml\/3½fl oz fresh beef or chicken stock (you can buy this ready-made in a tub),  250g\/9oz fresh, or 200g\/7oz dried, ribbon pasta,  ½ tbsp chopped fresh sage or a good pinch dried sage,  1 tsbp crème fraïche (optional),  sea salt,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedcalvesliverw_71474"}