{"recipe_name":"Pan-fried chicken with chilli beans, fennel and pancetta","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a large heavy-based non-stick frying pan until you feel a good heat rising. Add approximately one tablespoon of the oil, then add the chicken breasts and pan-fry for about five minutes on each side until firm when pressed with the back of a fork. Season well and set aside in the pan. They will keep warm without extra heating. Heat the remaining tablespoon of oil in a separate pan, add the shallots, garlic, chilli and fennel and stir-fry for about five minutes until softened. Add the beans and seasoning to taste, and then heat through until piping hot. Stir in the lemon zest and juice and fresh herbs. Meanwhile, heat the grill until hot and grill the pancetta until crispy. Remove the pancetta from the grill then drain on kitchen paper. Divide the bean and fennel mixture between four warmed serving plates. Slice the chicken breasts into medallions and arrange on top, then add two slices of pancetta to each plate, which you can either crumble or leave whole. Drizzle over any chicken pan juices with a little extra oil. Serve warm with the crusty bread and green leaf salad. ","ingredients":" 2 tbsp. extra virgin olive oil, plus extra for drizzling,  4 skinless, boneless chicken breasts about 150g\/5½oz each,  2 shallots, chopped,  4 garlic cloves, chopped,  1 large fresh red chilli, de-seeded and chopped,  1 small bulb of fennel, thinly sliced,  400g\/14oz can flageolet beans, rinsed and drained,  1 lemon, juice and grated zest only,  3 tbsp chopped mixed fresh herbs, e.g. parsley, mint or basil,  8 thin slices of pancetta,  sea salt and freshly ground black pepper,  green leaf salad,  crusty bread","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedchickenwithc_73603"}