{"recipe_name":"Pan-fried Cornish lobster with young summer vegetables and herbs in a saffron bisque","author":"Michael Caines","programme":"Great British Menu","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6.  Kill the lobsters by first placing them in the freezer for half an hour, then piercing each one between the eyes with a sharp knife. Pull off the claws and separate the tail from the body and head section. Drop the tails into boiling water and cook for 30 seconds only, then place in iced water. Bring the water back up to the boil and add the lobster claws. When boiling again, cook for three minutes. Place in the iced water.  Remove the meat from the lobster tails in one piece. Crack the claws to remove the meat, keeping it as whole as possible. Place the lobster meat on a tray for later use.    Next make the bisque using the lobster carcasses. Pour 400ml\/14fl oz of the olive oil into a roasting tray and place in the oven to heat, then add the lobster carcasses. Roast for 30 minutes (do not let the shells burn). Remove from the oven and deglaze with the Cognac on the hob. Meanwhile, sweat the carrots, onions, fennel and garlic in the remaining olive oil in a saucepan for 10 minutes without colouring. Add the spices and herbs and sweat for a further five minutes. Next add the tomato purée, fresh tomatoes and 200ml\/7fl oz of water, and cook for 10 minutes. Add the roasted lobster carcasses and the juices from the tray including all the oil. Pour in enough water almost to cover the lobster carcasses and bring to the boil. Simmer for 20 minutes.  Pour into a colander set in a bowl and leave to drain well, then pass the resulting liquid through a fine sieve. Taste and adjust seasoning. Pour 200ml\/7fl oz of the bisque into a saucepan with the butter and set aside, ready to reheat. Cook the carrots, fennel, leeks and asparagus tips in boiling salted water, or in a steamer; drain and refresh. Peel the broad beans to remove the tough skins. Set aside. Heat some olive oil in two non-stick frying pans (one for the lobster tails and the other for the claw meat). Carefully add the lobster, then place in the oven to heat for two minutes. Turn the lobster meat over, add some chopped tarragon and heat for a further two minutes.  Meanwhile, heat the lobster bisque. Reheat the vegetables in a steamer.  Slice each lobster tail into six pieces and arrange around warm bowls or plates. Place the claw meat in the middle and scatter the vegetables around.  Froth the bisque using a hand blender and season with salt and freshly ground black pepper and a drop of lemon juice. Spoon around the dish. Drizzle some of the cooking oil from the lobsters around and sprinkle over the picked herbs to garnish. ","ingredients":" 4 live Cornish lobsters, each 500g\/1lb 2oz,  olive oil, for frying the vegetables,  12 baby carrots,  12 bulbs baby fennel ,  12 baby leeks,  12 asparagus tips,  4 small leaves spring cabbage ,  50g\/2oz shelled broad beans ,  50g\/2oz shelled peas ,  chopped tarragon,  picked tarragon, chervil and chives, to garnish,  500ml\/17fl oz extra virgin olive oil,  50ml\/2fl oz Cognac ,  100g\/3½oz carrots, finely chopped,  100g\/3½oz onion, finely chopped,  100g\/3½oz fennel, finely chopped,  ½ clove garlic, chopped,  a few whole white peppercorns,  a few coriander seeds, crushed ,  a few cumin seeds, crushed,  a few cardamom pods, crushed,  pinch saffron strands ,  1 star anise, crushed,  1 bay leaf,  5 sprigs of thyme,  30g\/1oz tomato purée,  250g\/9oz fresh plum tomatoes, chopped ,  salt and freshly ground black pepper,  100g\/3½oz unsalted butter,  a little lemon juice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedcornishlobst_81702"}