{"recipe_name":"Pan-fried fillet of sea bass, sautéed Baby Gem lettuce with prawn and chorizo 'cassoulet'","author":"James Tanner","programme":"2007-16","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cassoulet, drain and rinse the soaked haricot beans. Place into a pan and cover with half of the fish stock. Add the thyme and bay leaves and bring to the boil. Reduce the heat and simmer for 30 minutes, or until the beans are just tender. Drain and discard the thyme, bay leaves and cooking liquor, set the beans aside. Shell half of the tiger prawns, reserving the shells. Set the shelled prawns aside. Roughly chop the remaining whole prawns in their shells and add to the reserved prawn shells. Heat a frying pan until hot, then add the olive oil, garlic, shallot and leek and cook for one minute. Add the chopped shell-on prawns and the reserved prawn shells and cook for a further minute. Add the tomato purée and cayenne pepper and cook for one minute. Add the vermouth and flambé to burn off the alcohol. Add the remaining fish stock and bring to the boil. Reduce the heat to simmer for 5-8 minutes, then add the cream. Stir well and remove from the heat. Allow to cool for 1-2 minutes, then pour into a blender and blend to a purée. Pass the mixture through a fine sieve into a clean pan. Meanwhile, heat a clean frying pan until hot, then add the chorizo and cook for 1-2 minutes. Add the cooked beans, the raw shelled prawns and the spring onion and cook for 2-3 minutes. Add 1-2 ladlefuls of the strained sauce to the chorizo and beans mixture and stir to combine, then simmer until the prawns have turned pink and are cooked through. Reserve the remaining sauce to serve. Add the butter, lemon juice and chervil to the cassoulet and stir well to combine. Season, to taste, with salt and freshly ground black pepper. For the sea bass and lettuce, place the sea bass fillets onto a chopping board and, using a sharp knife, score the skin, at 1cm\/½in intervals. Heat a frying pan until hot, add the olive oil and the sea bass fillets, skin-side down, and cook for two minutes. Carefully turn the sea bass fillets over and cook for a further two minutes. Add the Little Gem leaves to the fish and cook until wilted slightly, then remove from the pan and drain on kitchen paper. Check the sea bass is cooked through, then remove from the heat. To serve, spoon equal amounts of the cassoulet into two bowls and top with the wilted lettuce leaves. Place a sea bass fillet on top of each and spoon the reserved sauce around. Garnish with fresh chervil sprigs. ","ingredients":" 300g\/11oz haricot beans, rinsed, drained, then left to soak in water overnight,  1.5 litres\/2½pints fish stock,  2 sprigs fresh thyme ,  2 bay leaves,  300g\/11oz raw tiger prawns, shell on,  1 tbsp olive oil,  1 garlic clove, roughly chopped,  1 banana shallot, roughly chopped,  1 leek, white only, roughly chopped,  2 tsp tomato purée,  ¼ tsp cayenne pepper,  75ml\/3fl oz dry vermouth or Noilly Pratt,  110ml\/4fl oz whipping cream,  150g\/5oz chorizo cooking sausage, roughly chopped,  2 spring onions, finely sliced,  40g\/1½oz unsalted butter,  1 lemon, juice only,  6 sprigs fresh chervil, roughly chopped,  salt and freshly ground black pepper ,  1 tbsp olive oil,  2 x 120g\/4oz wild sea bass fillets,  1 Baby Gem lettuce, leaves separated,  4 sprigs fresh chervil, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedfilletofseab_89000"}