{"recipe_name":"Pan-fried grouse with skirlie and glazed beetroot","author":"Nick Nairn","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"The grouse breasts are easy to remove. First cut off the legs through the joint next to the rib cage. Then, with a small sharp knife, cut along the breastbone and with small swift strokes, keeping parallel to the breastbones, gradually ease the flesh away and release it from the carcass. Pull off the skin and they are ready to cook.  For the glazed beetroot, melt the butter in a saucepan and add the onion. Cook for five minutes, until softened, then add the beetroot. Pour in 150ml\/5fl oz water and simmer for 15 minutes, turn up the heat and evaporate any remaining liquid. When the liquid has disappeared, stir the beetroot over a high heat for 2-3 minutes, or until it begins to caramelise. Season, to taste, with salt and freshly ground black pepper. Keep warm.  For the skirlie, melt the dripping or fat in a frying pan and add the onion. Cook over a gentle heat until just beginning to turn golden. Add the oatmeal and stir for a couple of minutes, until the fat is absorbed and the oatmeal smells toastie. Keep warm. For the sauce, place the red wine and rowan jelly into a saucepan and reduce to about two tablespoons of liquid. Add the grouse stock and boil to reduce by half. Taste and season. Whisk in the butter and do not allow the sauce to boil. Keep warm. Season the grouse breasts with salt and freshly ground black pepper. Heat a heavy-based frying pan until very hot. Add one tablespoon of oil to the pan then the breasts, skinned-side down. Fry for two minutes then turn over and fry for two minutes more. Take the pan off the heat onto a heatproof surface (this will allow them to rest and keep warm).  To serve, slice the breasts and set the slices on top of the skirlie and pour the sauce around. ","ingredients":" 8 fresh young grouse, breasts removed and skinned (see below for instructions - legs and carcasses kept for stock),  50g\/2oz butter,  1 medium red onion, finely chopped,  500g\/1lb young beetroot, peeled and diced,  Maldon salt and freshly ground black pepper,  50g\/2oz bacon fat, or beef or duck dripping,  1 medium onion, finely chopped,  125g\/4½oz medium or coarse oatmeal,  300ml\/10fl oz red wine,  450ml\/15fl oz grouse stock,  1 tbsp rowan or redcurrant jelly,  25g\/1oz unsalted butter, chilled and diced,  olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedgrousewithsk_9525"}