{"recipe_name":"Pan-fried halibut with late summer vegetables and mussels","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a large lidded frying pan until hot then add the mussels, thyme and 75ml\/3fl oz of the wine. Cover with the lid and cook for 2-4 minutes, or until all the mussels have opened. Discard any mussels that have not opened. Strain the mussels over a bowl, reserving the liquid. Pick the mussels from their shells, and set aside. Discard the empty shells. Season the halibut steaks with salt and freshly ground black pepper. Heat a separate frying pan until hot, add half of the butter and all of the olive oil. When the butter is foaming, add the halibut fillets and fry for 2-3 minutes on each side, or until just cooked through. Meanwhile, add the remaining butter to a separate frying pan over a medium heat. When the butter is foaming, add the shallots, fennel and leeks and cook for 2-3 minutes, or until softened. Add the curry powder, mushrooms and pastis and cook for 3-4 minutes. Add the remaining 175ml\/6fl oz of the Muscat wine and bring to the boil. Cook until almost all of the liquid has evaporated. Remove the halibut steaks from the pan they were cooked in. Add the reserved cooking liquid from the mussels and bring to the boil. Scrape the bottom of the pan with a wooden spoon to deglaze the pan and continue to boil until the liquid is reduced by half. Add the sauce to the pan of leek and fennel mixture. Add the tomatoes, cream, saffron and the reserved cooked mussels. Cook for one minute, seasoning, to taste, with salt and freshly ground black pepper. Add the parsley and chervil and mix well. To serve, spoon the vegetables mixture into four dishes and top each with a halibut steak. ","ingredients":" 1kg\/2lb 2oz mussels, washed, cleaned, beards removed (discard any mussels that stay open after washing),  2 tsp fresh thyme leaves,  250ml\/9fl oz Muscat wine, or similar sweet wine,  4 x 175g\/6oz halibut fillets,  salt and freshly ground black pepper,  50g\/2oz butter,  1 tbsp olive oil,  3 shallots, roughly chopped,  1 fennel bulb, roughly chopped,  1 small leek, roughly chopped,  ½ tsp curry powder,  200g\/7oz chestnut mushrooms, brushed clean, cut into quarters,  25ml\/1fl oz pastis or similar aniseed liqueur,  3 tomatoes, peeled, seeds removed, chopped,  110ml\/4fl oz double cream,  ½ tsp saffron strands,  2 tbsp roughly chopped fresh flatleaf parsley,  2 tbsp roughly chopped fresh chervil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedhalibutwithl_89982"}