{"recipe_name":"Pan-fried John Dory in green spice paste with warm apple salad","author":"Atul Kochhar","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the green spice paste, put all the spice paste ingredients into a food processor and blend to a paste. For the John Dory, marinate the fish in a mixture of the lemon juice and salt for five minutes, to drain any excess moisture.  Pat the fish dry and place into the green spice paste and marinate for 40 minutes. Heat a frying pan over a medium-high heat. Add the oil, Scrape any excess marinade off the fish, then add to the pan, skin-side down. Fry for one minute then turn the fillet and fry the other side for two minutes or until fish is cooked through. Add the butter to the pan and baste the fish with the juices then remove it from the pan and place on a plate lined with kitchen paper to soak off any excess fat. For the apple salad, heat the olive oil in a small frying pan over a medium heat. Add the onions and fry for 1-2 minutes, to soften. Add the coriander, cumin and sesame seeds and fry for a further minute then add the apple batons, lime juice and curry powder. Cook the apples for one minute then add the chopped mango chutney and the mayonnaise. Remove from the heat and sprinkle over the chopped mint. To serve, place the warm apple salad in the middle of a warmed plate, place the fish on top and garnish with mixed baby (micro) cress. ","ingredients":" 50g\/2oz fresh mint leaves,  50g\/2oz fresh coriander leaves,  50g\/2oz baby spinach leaves,  10g\/½oz ginger, peeled, roughly chopped,  2 green chillies, roughly chopped,  1½ tsp ground fenugreek seeds,  2 tsp chaat masala (a mixed spice powder available at some Asian grocers),  1 tsp red chilli powder,  ½ tsp salt,  2 tbsp gram (chickpea) flour,  4 fillets John Dory,  2 tbsp lemon juice,  ½ tsp salt ,  4 tbsp vegetable oil,  2 tbsp butter,  1 tbsp olive oil,  1 tbsp finely chopped red onions,  ¼ tsp toasted coriander seeds, crushed,  ¼ tsp toasted cumin seeds, crushed,  1 tsp black sesame seeds,  2 medium size Queen Cox (or similar) apples, cut in 6x1x1cm\/2½x½x½in batons,  1 tsp lime juice,  ½ tsp curry powder,  2 tbsp mayonnaise,  ½ tbsp finely chopped mango chutney,  1 tbsp finely chopped fresh mint leaves,  mixed baby (micro) cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedjohndoryingr_85340"}