{"recipe_name":"Beef and blue cheese puff pastry pizza ","author":"Tom Kerridge","programme":"Tom Kerridge's Best Ever Dishes","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beef_and_blue_cheese_89652_16x9.jpg","method":"For the base, roll the puff pastry out on a lightly floured work surface into a 28cm\/11in circle about 5mm thick. Transfer the pastry to a baking tray lined with baking parchment. Cover with cling film and place in the fridge for at least one hour. For the sour onions, place a frying pan over a medium heat and add the cider, cider vinegar and demerara sugar. Bring the pan to the boil and place the onion segments in the liquid. Turn the heat down to a simmer and cook for 5-8 minutes until they start to soften. Turn the onions over and cook for a further five minutes.  When soft, remove the pan from the heat, put the onions on a baking tray. Use a blowtorch to char them (alternatively char them under a hot grill). Leave to cool.  For the base, preheat the oven to 220C\/425F\/Gas 7.  Prick the puff pastry all over using a fork. In a small bowl or mug, mix the egg yolk and double cream together and brush it on top of the pastry. Place the pastry in the preheated oven and bake for 20 minutes, or until risen, crisp and golden-brown. Turn the oven down to 110C\/225F\/Gas ¼ and continue to ‘dry’ the pastry out for a further 15 minutes. Do not let it burn. Once the pastry is crisp and dried out, remove it from the oven and leave to cool for five minutes. Increase the oven temperature to 180C\/350F\/Gas 4.  For the beef, toss the bavette steak strips in the cornflour and shake off any excess.  Heat the oil in a non-stick frying pan. Add the beef strips in batches (do not crowd the pan) and fry until crisp, this will take about 6-8 minutes. Once crisp, drain on kitchen paper and season with salt and cayenne pepper while the beef is still warm. Brush the pastry with the beef extract, spread a layer of onion marmalade on top and add the beef. Warm through in the oven for a few minutes.  For the crème fraîche dressing, whisk the crème fraîche and blue cheese in a bowl until thick. Fold in the chopped chives and season with salt and pepper. If the mixture is too thick, add a little water to loosen it up so it can be drizzled on top of the pizza. Take the pizza out of the oven, spoon some of the blue cheese and crème fraîche dressing on top and garnish with watercress. Serve immediately.  ","ingredients":" 500g\/1lb 2oz all-butter puff pastry,  plain white flour, for dusting,  1 free-range egg yolk,  1 tbsp double cream, for the glaze,  2 tsp beef extract ,  3 tbsp onion marmalade,  100ml\/3½fl oz cider,  100ml\/3½fl oz cider vinegar,  50g\/1¾oz demerara sugar,  3 small red onions, peeled and cut into six wedges with the root intact,  75g\/2¾oz full-fat crème fraîche,  75g\/2¾oz soft blue cheese, such as Dolcelatte,  1 tbsp chopped chives,  salt and freshly ground black pepper ,  200g\/7oz bavette steak, thinly sliced,  50g\/1¾oz cornflour,  4 tbsp vegetable oil, for cooking,  cayenne pepper, to taste ,  salt, to taste ,  watercress, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_and_blue_cheese_89652"}