{"recipe_name":"Fried mackerel with chilli cucumbers","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Grind the rock salt, dried chillies and smoked dried chillies in a coffee grinder to a fine powder. Place the cucumber wedges into a bowl and pour over the lime juice. Sprinkle over the lime zest and one teaspoon of the ground chilli mixture. Mix the contents of the bowl to coat the cucumber all over in the lime zest and spice mixture. Set aside for five minutes to marinate.  Meanwhile, in a shallow bowl, mix together the polenta and breadcrumbs until well combined. Beat the egg in a separate bowl.  Season the mackerel fillets, to taste, with salt and freshly ground black pepper.  Dip each seasoned mackerel fillet first in the beaten egg, then dredge in the polenta and breadcrumb mixture. Heat the oil in a large frying pan over a medium to high heat. Add the coated mackerel fillets, in batches if necessary, and fry for 3-4 minutes on each side, or until crisp and golden-brown on both sides and cooked through. (NB: The mackerel fillets are cooked through when the flesh is opaque.)  When the cucumber has marinated, pour over the tequila.  To serve, spoon some of the marinated cucumber into the centre of each of four serving plates. Sprinkle over the remaining spice mixture. Place one fried mackerel fillet on top of each serving. ","ingredients":" 2 tsp rock salt,  4 dried chillies,  4 smoked dried chillies,  2 cucumbers, cut in half lengthways, each half cut lengthways into four long wedges,  4 limes, juice and zest ,  100g\/3½oz polenta,  100g\/3½oz fresh breadcrumbs,  1 free-range egg,  4 x 150g\/5½oz mackerel fillets,  salt and freshly ground black pepper,  3-4 tbsp vegetable oil,  25ml\/1fl oz tequila","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedmackerelwith_92575"}