{"recipe_name":"Pan-fried mullet with potato gratin and lemon and rosemary sauce","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6 and place an ovenproof dish into the oven. For the gratin, place the garlic, onion, potatoes, thyme and olive oil into a bowl, season with salt and freshly ground black pepper and stir. Transfer the gratin mixture to the preheated baking dish and cook in the oven for 12-15 minutes. Remove from the oven and add the wine and tomatoes. Stir well, then return to the oven and bake for a further five minutes, or until the potatoes are cooked. Meanwhile, for the pan-fried mullet, heat the oil in a frying pan. Season the mullet with salt and freshly ground black pepper and fry for 2-3 minutes on each side, or until completely cooked through. For the sauce, place the white wine, lemon juice and rosemary sprig into a pan and bring to the boil. Simmer until the liquid has reduced by half. Add the cream and simmer until the liquid has reduced by half, then season, to taste, with salt and freshly ground black pepper. To serve, place the pan-fried mullet fillets on top of the gratin and drizzle over the sauce. ","ingredients":" 5 garlic cloves, chopped,  ½ onion, sliced,  250g\/9oz small potatoes, sliced,  1 tbsp fresh thyme leaves,  50ml\/2fl oz olive oil,  salt and freshly ground black pepper ,  100ml\/3½fl oz white wine,  100g\/3½oz cherry tomatoes, halved,  1 tbsp olive oil,  2 fillets red mullet, skin left on, scales removed,  salt and freshly ground black pepper,  100ml\/3½fl oz white wine,  ½ lemon, juice only,  1 sprig fresh rosemary,  50ml\/2fl oz double cream,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedmulletwithpo_85956"}