{"recipe_name":"Beef and chorizo with horseradish mash and rosemary dumplings","author":"Dick Strawbridge","programme":"Celebrity MasterChef","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beef_and_chorizo_with_86545_16x9.jpg","method":"For the beef, make sure there are two available shelves in your oven and preheat the oven to 160C\/320F\/Gas 3. Heat the olive oil in a flameproof casserole and brown the beef. (You will need to do this in batches, so don't overcrowd the pan.) Using a slotted spoon, lift out the meat and set aside.  Add the chorizo and onion to the pan and fry until softened and the fat runs from the chorizo. Add the carrots and parsnips and continue to cook until tinged with colour and beginning to soften. Sprinkle in the flour and cook for 2-3 minutes, stirring frequently. Pour over the wine and stirring constantly, bring to the boil.  Stir in the beef stock. Return the beef to the pan and season with salt and freshly ground black pepper. Cover with a tight fitting lid and braise on the bottom shelf of the oven for two hours, or until the meat is tender - check during the cooking time to ensure that the meat doesn't become too dry. If it does, add a splash of boiled water. For the dumplings, line a baking tray with non-stick baking paper. Sift the flour into a bowl with a pinch of salt. Add the suet and rosemary and bind together with enough cold water to form a soft dough.  Using floured hands and working as lightly fingered as possible, divide the mixture into eight and shape into oval dumplings. Place on a baking tray slightly spaced apart. Bake the dumplings on the shelf above the beef for the last 25 minutes of the beef’s cooking time, until they are puffed up and cooked through. Meanwhile, for the mash, boil the potatoes in a pan of boiling, salted water for 15 minutes, or until tender. Drain well and press through a potato ricer into a warm bowl. Mix in the horseradish, butter and cream. Season to taste with salt and freshly ground black pepper.  Serve the mash with the beef and dumplings. ","ingredients":" 3 tbsp olive oil,  1kg\/2lb 4oz shin of beef, cut into 4cm\/1½in pieces,  225g\/8oz chorizo, diced,  1 large onion, diced,  2 large carrots, cut to same size as beef,  2 large parsnips, cut to same size as beef,  2 tbsp plain flour,  300ml\/½ pint red wine,  600ml\/1 pint beef stock,  salt and freshly ground black pepper,  225g\/8oz self-raising flour,  pinch salt,  100g\/4oz shredded suet,  1-2 tbsp fresh rosemary, finely chopped,  900g\/2lb potatoes, peeled and cut into chunks,  25g\/1oz fresh grated horseradish, or to taste,  25g\/1oz butter,  about 100ml\/4floz single cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_and_chorizo_with_86545"}