{"recipe_name":"Pan-fried sea bass on a red risotto with roasted cherry tomatoes","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the sea bass, rub the sea bass fillet with olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until very hot, place the sea bass fillet skin-side down into the pan and fry for three minutes. Turn over and fry for a further three minutes on the other side. Remove from the heat and keep warm. For the risotto, heat the olive oil in a small saucepan, add the onion and fry over a gentle heat until softened but not coloured. Add the garlic and fry for one minute. Add the chorizo and fry for two minutes. Add the blanched rice, turmeric and tomato purée to the pan and stir well. Add the wine and salt and freshly ground black pepper, to taste, and simmer, stirring frequently, until the rice is al dente. Add Tabasco sauce, to taste. For the roasted cherry tomatoes, place the cherry tomatoes into a small roasting tin. Drizzle with olive oil and salt and freshly ground black pepper, to taste, and roast in the oven for 6-8 minutes. To serve, pile the risotto onto a serving plate. Top with the pan-fried sea bass and garnish with the roasted cherry tomatoes. ","ingredients":" 150g\/5½oz sea bass fillet,  dash olive oil,  salt and freshly ground black pepper,  dash olive oil,  ½ onion, finely chopped,  1 garlic clove, finely chopped,  30g\/1oz chorizo, chopped,  200g\/7oz basmati rice, boiled for five minutes, then drained,  pinch ground turmeric,  1 tsp tomato purée,  100ml\/3½fl oz white wine,  dash Tabasco sauce,  1 small bunch cherry tomatoes on the vine,  dash olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedseabassonare_87954"}