{"recipe_name":"Beef and mustard pie","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beef_and_mustard_pie_58002_16x9.jpg","method":"Preheat the oven to 150C\/300F\/Gas 2. Toss the beef and flour together in a bowl with some salt and black pepper. Heat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole. Fry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef. Return the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper. Cover with a lid and place in the oven for two hours. Remove from the oven, check the seasoning and set aside to cool. Remove the thyme. When the beef is cool and you're ready to assemble the pie, preheat the oven to 200C\/400F\/Gas 6.  Transfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg. Trim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through. For the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender. Drain and toss with the butter, then season with black pepper.  To serve, place a large spoonful of pie onto each plate with some green beans alongside. ","ingredients":" 1kg\/2lb 4oz beef skirt, cut into large chunks,  2 tbsp plain flour ,  salt and freshly ground black pepper,  2 tbsp rapeseed oil ,  200ml\/7fl oz red wine,  400ml\/14fl oz beef stock,  1 onion, finely sliced,  2 large carrots, cut into 2.5cm\/1in pieces,  3 sprigs thyme ,  2 tbsp wholegrain mustard ,  2 free-range egg yolks, beaten,  400g\/14oz all-butter puff pastry, rolled to 5mm\/¼in thick,  300g\/10½oz fine green beans,  25g\/1oz butter,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_and_mustard_pie_58002"}