{"recipe_name":"Beef and onion pie","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the filling, preheat the oven to 150C\/300F\/Gas3. Mix the beef, flour and seasoning together in a bowl. Heat some of the olive oil in a large flameproof casserole until hot. Shake the excess flour from the beef and fry, in batches, for 4-5 minutes, or until browned all over. Remove the beef and set aside. Add the remaining olive oil and onions to the pan and fry for 3-5 minutes, or until softened and just coloured. Return the beef to the casserole and add the garlic and beer. Continue to cook until the volume of the liquid has reduced by half then add the beef stock and bring to a simmer. Cover with a lid and cook in the oven for 2 hours.  Season, to taste, with salt and freshly ground black pepper. Set aside to cool completely. For the suet pastry, mix the self-raising flour, suet, water and salt in a bowl to form a soft dough (do not overwork the pastry). Roll out three-quarters of the pastry to a 1cm\/½in thickness and use it to line a 1.2 litre\/2 pint pudding basin. Fill with the cold cooked beef filling and moisten the pastry around the rim of the basin with water. Roll the remaining dough to a 1cm\/½in thickness and place over the top of the basin. Pinch the edges firmly together and trim off any excess. Cover with a double layer of greaseproof paper and a single sheet of aluminium foil. Tie around the top edge with string. Steam the pudding for 1½ hours in a steamer, or on an upturned plate in a covered saucepan half-filled with water. For the cabbage, heat a frying pan until hot, add the butter, cabbage and 3 tbsp water and cook for 4-5 minutes, stirring occasionally, until just tender. Stir in the parsley, salt and freshly ground black pepper. Serve the pudding in slices with the cabbage alongside. ","ingredients":" 750g\/1lb 10oz stewing beef, diced,  3 tbsp plain flour ,  salt and freshly ground black pepper,  4 tbsp olive oil,  150g\/5oz whole baby onions, peeled,  1 onion, sliced,  3 garlic cloves, roughly chopped,  150ml\/5½fl oz beer,  300ml\/11fl oz beef stock,  500g\/1lb 2oz self-raising flour,  250g\/9oz beef suet ,  325ml\/12fl oz water,  pinch salt,  50g\/2oz butter,  1 hispi cabbage, core removed, shredded,  3 tbsp chopped fresh flatleaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_and_onion_pie_88258"}