{"recipe_name":"Pan-fried veal fillet with wild mushrooms, asparagus, wild garlic and sherry sauce","author":"Michael Caines","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sauce, heat a frying pan until just hot, add half the butter and the shallots. Cook over a low heat until soft and transparent.  Add the thyme and mushrooms and cook until the mushrooms have softened. Add the sherry, turn up the heat and simmer until the liquid is reduced in volume by half. Add the chicken stock and simmer until the liquid has reduced in volume by half again. Add the cream and simmer until the liquid has reduce in volume by half again. Whisk in the remaining butter, pass through a fine sieve into a clean pan and season, to taste, with salt and freshly ground black pepper. Keep warm. For the veal, season the veal medallions with salt and freshly ground black pepper. Heat a frying pan until hot and add a third of the butter and all of the olive oil. Add the veal and fry gently for 2-3 minutes, without turning, until golden-brown on one side. Turn the veal over, add the garlic and thyme and fry for 2-3 minutes or until the veal is golden-brown on both sides and the garlic is golden in colour and soft. Remove the veal and garlic from the pan and leave to rest in a warm place. Spoon off any excess fat from the cooking juices in the pan and add a splash of water to the pan to deglaze, scraping off any brown bits stuck to the bottom of the pan. Add this liquid to the sherry sauce. Reheat the sauce, whisking all the time, until the cooking juices have been incorporated. Keep warm. Bring a shallow pan of water to the boil, add another third of the butter and the asparagus. Cook gently for 2-3 minutes, until just tender, and drain Heat a separate frying pan until hot, add the remaining butter, the mushrooms, wild garlic and spinach leaves and sauté for 2-3 minutes, or until the mushrooms are cooked and the leaves wilted. Season, to taste, with salt and freshly ground black pepper. To serve, spoon two-thirds of the mushroom mixture into the centre of a large warm serving platter. Top with the veal medallions and the remaining mushroom mixture. Place the asparagus to one side and spoon over the sauce. ","ingredients":" 110g\/4oz unsalted butter ,  75g\/3oz shallots, sliced ,  10 sprigs fresh thyme,  110g\/4oz button mushrooms, sliced ,  200ml\/7fl oz dry Amontillado sherry ,  200ml\/7fl oz chicken stock ,  200ml\/7fl oz double cream ,  salt and freshly ground black pepper,  4 x 175g\/6oz rosé veal fillets, cut into medallions ,  salt and freshly ground black pepper,  110g\/4oz butter ,  1 tbsp olive oil ,  20 garlic cloves, peeled and blanched 3 times (place in cold water, bring to the boil, drain and refresh in cold water and repeat twice more),  sprig fresh thyme,  20 asparagus tips, peeled and trimmed,  150g\/5oz mixed wild mushrooms (such as mousserons, girolles, pied blue),  110g\/4oz wild garlic,  110g\/4oz baby spinach leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedvealfilletwi_88996"}