{"recipe_name":"Pan-fried wild salmon with spiced shellfish butter","author":"Antony Worrall Thompson","programme":"Great British Menu","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the Café de Paris butter. Combine all the ingredients, except the butter, in a large bowl. Set aside for 4 hours.  Beat the butter until fluffy, then mix with the other ingredients. Transfer to a sheet of cling film and shape into a neat log about 2.5cm\/1in in diameter. Wrap in the cling film and chill. (This will make more butter than you need for this recipe, but it can be kept in the freezer for up to 6 months; it is good on steaks, chicken and fish.) For the salmon, heat the wine with the shallots, garlic and thyme in a large saucepan over a low heat for 3 minutes. Turn the heat up and add the mussels and cockles or clams. Cover with a lid and give the pan a good shake, then cook for about 3 minutes or until all the shells have just opened. Discard any that do not open. Tip into a sieve or colander set over a bowl so you can retain the juices. When cool enough to handle, remove the mussels and cockles from their shells and set aside; retain a few in their shells for garnish. Return the juices to the pan and reduce over a high heat until you have 4 tablespoons left. Keep warm.  Heat a large frying pan until very hot. Add 1 tablespoon of the Café de Paris butter and the olive oil. Season the salmon with salt and freshly ground black pepper and place in the pan. Cook for 2-3 minutes on each side, depending on the thickness. Remove and keep warm.  Pour the shellfish juices into the hot fish pan and stir to combine with the pan juices. Add 2 tablespoons of the Café de Paris butter, the unsalted butter and the reduced passata and cook until emulsified. Check the seasoning. Add the shelled mussels and cockles, shrimps and scallops and warm through.  To serve, place the salmon on four warmed plates and spoon the shellfish butter over the fish. Garnish with the mussels and cockles in shell and the steamed potatoes. ","ingredients":" 35ml\/1fl oz tomato ketchup,  25g\/1oz English mustard,  25g\/1oz capers,  2 shallots, finely chopped,  handful parsley, finely chopped,  1 tbsp snipped chives,  ½ tsp chopped marjoram,  ½ tsp thyme leaves,  6 tarragon leaves, finely chopped,  ½ tsp chopped rosemary,  1 clove garlic, finely chopped,  6 anchovy fillets, finely chopped,  1 tbsp brandy,  1 tbsp Madeira,  ½ tsp Worcestershire sauce,  1 tbsp paprika ,  ½ tsp curry powder,  ½ tsp cayenne,  1 lemon, zest and juice,  1 orange, zest only,  1 tsp salt,  450g\/1lb butter, at room temperature, cut into small cubes,  150ml\/5fl oz dry white wine ,  2 shallots, finely chopped,  1 clove garlic, finely chopped,  ½ tsp soft thyme leaves ,  350g\/12oz each small mussels and cockles or small clams ,  1 tsp olive oil ,  4 wild salmon fillets, each about 175g\/6oz, skinned ,  salt and freshly ground black pepper ,  25g\/1oz unsalted butter ,  1 tbsp reduced tomato passata or thinned tomato purée,  115g\/4oz cooked brown shrimps, peeled ,  2 large diver-caught scallops, diced ,  8 Ratte or Pink Fir Apple potatoes, steamed until tender and peeled, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panfriedwildsalmonwi_81726"}