{"recipe_name":"Panna cotta with roasted rhubarb and dripping cake","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the panna cotta, chill a large jug or bowl in the freezer. Heat the double cream, vanilla pod and seeds and sugar in a saucepan until just boiling. Remove the pan from heat, add the soaked gelatine and buttermilk and whisk until well combined Pass the mixture through a fine sieve into the chilled jug, and then stir in the vodka. Return the jug to the fridge and whisk the mixture every five minutes until it begins to set.  Pour the mixture into dariole moulds and chill in the fridge for at least two hours, or until completely set. For the dripping cake, preheat the oven to 180C\/350F\/Gas 4. Grease and line an 18cm\/7in cake tin. Put the sugar, dripping, dried fruit and candied peel into a saucepan. Add 225ml\/8fl oz water and bring to the boil. Simmer gently for 10 minutes, then allow to cool in the pan. Sift the dry ingredients together in a large bowl. Make a well in the middle and add the cooled dried-fruit mixture. Stir with a wooden spoon, gradually drawing in the flour from around the edge of the well, until you have a smooth batter. Spoon the batter into the prepared tin and bake for about 40 minutes, or until a skewer inserted in the centre comes out clean. Leave in the tin for five minutes before turning out on to a wire rack to cool completely. For the roasted rhubarb, preheat the oven to 200C\/400F\/Gas 6. Place the rhubarb on a roasting tray, sprinkle over the sugar then drizzle over the apple juice. Roast in the oven for 8-12 minutes, or until just tender. Blend 125g\/4½oz of the roasted rhubarb to a purée in a food processor. Reserve the remaining roasted rhubarb.  To serve, remove the panna cotta from their moulds, by briefly dipping the base of each mould into a bowl of boiled water. Gently slide a knife around the edge of each panna cotta and turn out into the centre of a serving plate. Serve with the rhubarb purée, a slice of dripping cake and roasted rhubarb.  ","ingredients":" 300ml\/10½fl oz double cream,  1 vanilla pod, split in half lengthways and seeds scraped out,  100g\/3½oz caster sugar,  2-3 gelatine leaves, soaked in water for a few minutes,  350ml\/12fl oz buttermilk,  25ml\/1fl oz vodka,  oil, for greasing,  140g\/5oz soft brown sugar,  85g\/3oz clarified beef dripping,  225g\/8oz mixed dried fruit and candied peel,  225g\/8oz wholemeal flour,  1 tsp baking powder,  1 pinch ground cinnamon,  1 pinch freshly grated nutmeg,  1 pinch ground allspice,  ½ tsp bicarbonate of soda,  500g\/18fl oz rhubarb, cut into batons,  2 tbsp light soft brown sugar,  4 tbsp apple juice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panna_cotta_with_roasted_37276"}