{"recipe_name":"Pan-roasted chicken with beetroot and cauliflower with horseradish cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/355F\/Gas 4. For the chicken, heat a large ovenproof frying pan and add the butter and olive oil. Season the chicken all over with salt and freshly ground black pepper and, once the butter is foaming, place into the pan, skin-side down. Fry for 3-4 minutes, until golden. Turn the chicken breasts over and transfer to the oven to roast for 12-15 minutes, or until completely cooked through. Meanwhile, for the beetroot, heat a small pan with the olive oil. Add the garlic and shallots and gently fry for 2-3 minutes, until tender but not browned. Add the balsamic vinegar, extra virgin olive oil and herbs and mix well. Place the beetroot into a serving bowl and pour the shallot mixture over. Stir to coat and season, to taste, with salt and freshly ground black pepper. Meanwhile, for the cauliflower, bring a pan of water to the boil and add the cauliflower. Boil for 4-5 minutes, until just tender, then drain and refresh in iced water. Drain the cauliflower and set aside. Place the horseradish and lemon juice into a large bowl and whisk together. Add the whipped cream and season, to taste, with salt and freshly ground black pepper. Add the cauliflower to the horseradish mixture and stir well. To serve, place a spoonful each of the beetroot mixture and cauliflower mixture beside each other onto four plates and place a chicken breast onto each. ","ingredients":" 1 tbsp butter,  1 tbsp olive oil,  salt and freshly ground black pepper,  4 chicken breasts, skin on,  1 tbsp olive oil,  4 shallots, finely chopped,  1 clove garlic, finely chopped,  2 tbsp balsamic vinegar,  75ml\/3fl oz extra virgin olive oil,  10g\/½oz fresh chives, roughly chopped,  10g\/½oz fresh flatleaf parsley, roughly chopped,  10g\/½oz fresh dill, roughly chopped,  8 beetroot, cooked until tender, peeled and cut into segments,  salt and freshly ground black pepper ,  1 large cauliflower, cut into florets,  4 tbsp horseradish cream from a jar,  1 lemon, juiced,  150ml\/5fl oz double cream, lightly whipped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/panroastedchickenwit_84338"}