{"recipe_name":"Papeta pur eeda with cod masala salad","author":"Cyrus Todiwala","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the papeta pur eeda, heat the oil and butter in a large frying pan and add the cumin seeds. Allow them to sizzle for a minute or two over a medium heat. Add the chopped green chillies and garlic and fry gently for a further minute or two then add the sliced onion. Gently fry the vegetables for 1-2 minutes until softened, then add the potato slices. Fry for 3-4 minutes, sprinkle with a pinch of salt and level out the contents of the pan. Add enough water to come just below the level of the potatoes, cover and cook over a very low heat until the potatoes are just tender, but not mushy - about 10-15 minutes. Sprinkle the spring onions and coriander over the top, then add salt and pepper to taste. Stir the mixture very gently, scraping down the sides of the pan. Make four indentations with the back of a spoon in the potatoes well spaced-apart and away from the sides of the pan. Break an egg into each indentation, then cover with a lid and cook on a very low heat. Cook until the egg is done to your liking, from 4-5 minutes.  Meanwhile, for the cod masala salad heat a frying pan until medium hot, add the oil, cumin, coriander, turmeric, chilli, garlic, ginger and chilli and stir-fry for one minute. Add the cod and stir fry for 2-3 minutes until just cooked through. Place the remaining salad ingredients into a bowl and toss to combine. Then carefully fold the cod through. To serve, pile the salad onto the plate with a wedge of the potato and egg then finish with some buttered bread. ","ingredients":" 2 tbsp vegetable oil,  25g\/1oz butter,  1 tsp cumin seeds,  1 green chilli, finely chopped,  2 garlic cloves, finely chopped,  1 medium onion, thinly sliced ,  1 large potato, peeled and cut 3mm\/1\/8in slices, washed and patted dry,  sea salt, to taste,  2 spring onions, finely sliced,  1 heaped tbsp finely chopped fresh coriander ,  4 free-range eggs (preferably organic),  1 tbsp oil,  1 tsp ground cumin,  1 tsp ground coriander,  ¼ tsp turmeric,  ½ tsp red chilli powder,  2 garlic cloves, finely chopped,  2cm\/1in piece ginger, peeled and finely chopped,  1-2 slender green chillies, finely chopped,  250g\/9oz cod, skinned, pin boned and diced,  1 heaped tbsp chopped fresh coriander,  sea salt and freshly ground black pepper,  1 small red onion, diced,  1-2 tomatoes, seeds removed and chopped,  ½ small cucumber, diced,  1 small Cos lettuce, cut into pieces,  ½ lime, juice only,  1 tbsp finely shredded mint leaves,  4 slices white bread and butter, to serve,  2 tbsp vegetable oil,  25g\/1oz butter,  1 tsp cumin seeds,  1 green chilli, finely chopped,  2 garlic cloves, finely chopped,  1 medium onion, thinly sliced ,  1 large potato, peeled and cut 3mm\/1\/8in slices, washed and patted dry,  sea salt, to taste,  2 spring onions, finely sliced,  1 heaped tbsp finely chopped fresh coriander ,  4 free-range eggs (preferably organic),  1 tbsp oil,  1 tsp ground cumin,  1 tsp ground coriander,  ¼ tsp turmeric,  ½ tsp red chilli powder,  2 garlic cloves, finely chopped,  2cm\/1in piece ginger, peeled and finely chopped,  1-2 slender green chillies, finely chopped,  250g\/9oz cod, skinned, pin boned and diced,  1 heaped tbsp chopped fresh coriander,  sea salt and freshly ground black pepper,  1 small red onion, diced,  1-2 tomatoes, seeds removed and chopped,  ½ small cucumber, diced,  1 small Cos lettuce, cut into pieces,  ½ lime, juice only,  1 tbsp finely shredded mint leaves,  4 slices white bread and butter, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/papeta_pur_eeda_with_cod_62820"}