{"recipe_name":"Paprika monkfish with romesco sauce and padrón peppers","author":null,"programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the romesco sauce, preheat the oven to 225C\/450F\/Gas 8. Place the tomatoes onto a roasting tray and drizzle with a little of the olive oil, salt and black pepper. Roast in the oven for 15 minutes, or until tender. Using tongs, char the pepper on a gas ring for 4-5 minutes, or until charred all over. Place the pepper into a bowl, cover with cling film and set aside to steam for five minutes. Once cool enough to handle, remove the skin and seeds from the pepper and roughly chop. Heat a frying pan until hot and add some of the olive oil and the bread. Season with salt and freshly ground black pepper. Fry for 2-3 minutes, or until golden-brown and crisp. Remove the bread from the pan and set aside to drain on kitchen paper. Remove the tomatoes from the oven then remove the seeds. Blend the tomatoes, bread and chopped peppers with the remaining ingredients in a food processor until coarsely chopped. Season with salt and freshly ground black pepper. For the paprika monkfish, mix the paprika and salt on a plate.  Roll the monkfish in the paprika mixture until completely covered. Heat a frying pan until hot, add a little of the olive oil and seal the monkfish until golden-brown all over, cook for a further 3-4 minutes. Remove the monkfish from the pan and set aside to rest for 2-3 minutes. Heat a frying pan until hot then add the remaining olive oil and the peppers. Fry for 2-3 minutes, or until the peppers are golden-brown and puffed. To serve, carve the monkfish into thick slices. Spoon the romesco sauce into the centre of the serving plates and top with the pardon peppers. Place the sliced monkfish on top then finish with a scattering of coriander cress. ","ingredients":" 2 plum tomatoes, halved,  3 tbsp olive oil,  salt and freshly ground black pepper,  1 red pepper,  40g\/1½oz bread, cut into cubes,  110g\/4oz piquillo peppers,  40g\/1½oz almonds,  25g\/1oz hazelnuts,  ½ lemon, juice only,  1 tsp smoked sweet paprika,  3 tbsp chopped fresh flatleaf parsley,  4 x 200g\/7oz monkfish fillets, trimmed,  1 tbsp smoked paprika,  1 tsp fine sea salt,  3 tbsp olive oil,  200g\/7oz padrón peppers,  2 tbsp coriander cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/paprika_monkfish_with_54566"}