{"recipe_name":"Fruity paprika pork with cashew nut couscous","author":"James Martin","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Lay the pork, flesh-side up, on a chopping board with the belly flap facing away from you.  With a sharp knife make an incision halfway down the meat, running parallel to the board, cutting almost all the way through. Open the loin up and season well with salt and freshly ground black pepper. Place the prunes, apricots and parsley into a bowl, season with salt and black pepper and mix well. Place the prune mixture onto the pork and roll the meat up around the stuffing, into a sausage shape and tie in three or four places with kitchen string. For the paprika paste, place all of the ingredients for the paste into a clean bowl and mix to form a paste. Smear the paprika paste over the pork and set aside to marinate for at least 30 minutes, longer if possible. Place the meat onto a heated griddle pan or barbecue and cook on each side for 2-3 minutes to brown all over. Reduce the heat and cook for a further 30-40 minutes, turning every ten minutes, or until the pork is completely cooked through. Remove from the heat and allow to rest for ten minutes. For the cashew nut couscous, place the couscous into a bowl and pour over the boiling water. Set aside and leave until all the water is absorbed. Stir the couscous with a fork. Add the remaining couscous ingredients and stir well to combine. To serve, cut the pork into thick slices. Place a large spoonful of the couscous onto each plate and top with a couple of slices of the pork. ","ingredients":" 750g\/1lb 10oz boneless pork loin,  salt and freshly ground black pepper ,  75g\/3oz prunes, roughly chopped,  75g\/3oz apricots, roughly chopped,  3 tbsp flatleaf parsley, roughly chopped,  2 tbsp paprika,  1 tsp fresh oregano leaves,  1 tsp fresh thyme leaves,  1 garlic clove, finely chopped,  1 tsp Maldon sea salt, or other sea salt,  2 tbsp olive oil,  125g\/4½ oz couscous,  150ml\/5fl oz boiling water,  75g\/3oz cashew nuts, roughly chopped,  75g\/3oz apricots, roughly chopped,  1 lemon, juice only,  2 tbsp fresh mint, roughly chopped,  2 tbsp fresh flatleaf parsley, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/paprikafruityporkwit_86356"}