{"recipe_name":"Paprika prawns with roasted pepper and coriander pasta salad","author":"Alex Mackay","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. Place the pepper into an ovenproof frying pan or baking tray and drizzle over the olive oil, then season well with salt and freshly ground black pepper. Place into the oven to bake for 12-14 minutes, until cooked through and lightly charred. Remove from the oven, place the pepper into a bowl and cover with cling film for five minutes. Remove the cling film and peel away the pepper skin. Finely chop the pepper. For the linguine, mix the olive oil, lemon juice, coriander and chilli together in a bowl. Season, to taste, with salt and freshly ground black pepper and stir to combine. Add the pasta to the dressing and stir in the roasted red pepper until evenly combined. Set aside to allow the flavours to combine. Meanwhile, for the prawns, heat the rest of the olive oil in a frying pan. Add the olive oil and butter and once the butter is foaming, add the prawns. Sprinkle over the paprika, stirring well to coat, then fry the prawns for 1-2 minutes or until the prawns are cooked through. Season, to taste, with salt and freshly ground black pepper. To serve, place the pasta salad into a bowl and place the prawns on top. ","ingredients":" ½ romano pepper, core and seeds removed,  1 tbsp olive oil,  salt and freshly ground black pepper,  2 tbsp olive oil,  squeeze lemon juice,  2 tbsp chopped fresh coriander,  ½ red chilli, seeded and cut into long thin strips,  salt and freshly ground black pepper,  85g\/3oz linguine pasta, cooked according to packet instructions,  1 tbsp olive oil,  knob of butter,  150g\/5oz raw peeled tiger prawns,  pinch paprika,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/paprikaprawnswithroa_87758"}