{"recipe_name":"Parma ham, camembert and mozzarella pizza ","author":"James Martin","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pizza, place the flour, salt and yeast into a large bowl and add the water and three tablespoons the olive oil and mix together to form a dough. Knead the dough for at least five minutes, until elastic. Add more oil if necessary. Cover the dough with cling film, then set aside and allow to prove for one hour. Divide the dough into four equal pieces and roll each piece into a ball, then roll out onto a floured work surface until about 5mm\/¼in thick. Place onto a greased baking tray and set aside to prove for 30 minutes. Preheat the oven to 220C\/425F\/Gas 7. Heat a frying pan until hot and add the butter, spinach and garlic and stir-fry until the spinach has wilted down. Remove from the heat, allow to cool, then squeeze out any excess liquid. Season, to taste, with salt and freshly ground black pepper and divide among the four circles of dough. Place the camembert, mozzarella and the Parma ham on top of the spinach. Season well with salt and freshly ground black pepper. Place the pizzas into the oven to bake for ten minutes, then remove and spoon over the double cream and scatter over the coriander leaves. Return the pizzas to the oven for a further five minutes until the pizzas are cooked through. For the salad, place the Parma ham onto a baking tray and place into the oven for 3-4 minutes, or until crisp. Place the ciabatta cubes into a bowl and drizzle with the olive oil and season with salt and freshly ground black pepper. Place onto a separate baking tray and place into the oven to bake for five minutes, or until golden and crisp. Remove the ciabatta pieces from the oven place into a clean bowl with the mizuna and spinach leaves. Crumble the crisp Parma ham over and sprinkle with the parmesan. Add the lemon juice and toss once more. To serve, place a pizza onto each of four plates and place a small portion of salad alongside. ","ingredients":" 500g\/1lb 2oz strong flour,  1 tsp salt,  30g\/1oz fresh yeast,  200ml\/7fl oz tepid water,  3-6 tbsp olive oil, plus extra for greasing,  25g\/1oz butter,  400g\/14oz baby spinach leaves,  2 garlic cloves, finely chopped,  salt and freshly ground black pepper ,  250g\/9oz camembert, roughly chopped,  1 ball fresh buffalo mozzarella, torn into large pieces,  16 slices Parma ham,  4 tbsp double cream,  1 small bunch fresh coriander, chopped ,  75g\/3oz Parma ham,  1 small ciabatta, cut into 2cm\/1in cubes,  3 tbsp olive oil,  salt and freshly ground black pepper ,  50g\/2oz mizuna leaves,  50g\/2oz baby spinach leaves,  25g\/1oz parmesan, shaved,  ½ lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parmahamcamembertand_86322"}