{"recipe_name":"Parmesan crusted chicken escalope with slow roasted tomatoes","author":"James Martin","programme":"2007-16","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/300F\/Gas 1. Place the tomatoes, cut side up onto a roasting tray and drizzle with the olive oil. Season with salt and black pepper then scatter half the thyme leaves over the top. Place in the oven and roast for 4-6 hours until slightly dried out. Turn the oven off and allow to cool, preferably overnight in the oven. For the chicken, place the breadcrumbs, parmesan, lemon zest and remaining thyme leaves into a food processor and blitz to fine crumbs. Butterfly the chicken breasts (Place the chicken onto what would have been the skin side, then cut down the centre line to half the way through. Turn the knife sideways and cut horizontally almost to the side of the breast to open it out, then repeat with the other side so you have a chicken breast, twice the size it was and half the thickness.) Season the flour with salt and black pepper then dust the chicken in the flour. Dip into the egg then into the breadcrumbs, making sure to coat each side thoroughly. Heat the olive oil and the butter in a large frying pan then add the chicken breasts, one at a time, and fry until golden-brown, about two minutes on each side. Place onto kitchen paper to drain. To serve, pile some tomatoes onto the plate, add the chicken and a handful of watercress then finish with a wedge of lemon. ","ingredients":" 6 tomatoes on the vine, halved widthways,  4 tbsp olive oil,  6 sprigs thyme, leaves picked,  salt and freshly ground black pepper,  60g\/2½oz Japanese panko breadcrumbs,  25g\/1oz parmesan cheese, freshly grated,  1 lemon, zest only,  4 chicken breasts, boneless and skinless,  75g\/3oz plain flour,  2 free-range eggs, beaten,  50g\/2oz butter,  1 bunch watercress, leaves picked,  1 lemon, cut into wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parmesan_crusted_chicken_56186"}