{"recipe_name":"Parmesan and Parma ham crusted lamb chops with leek and mint purée","author":"Merrilees Parker","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chops, tip the breadcrumbs into a bowl and mix in the Parma ham, parmesan and parsley. Season generously with freshly ground black pepper.   Trim any excess fat off the chops or cutlets, then beat out a little bit with a meat tenderizer or a rolling pin (a frying pan would also do the job). Beat the egg in a separate dish and season generously with salt and freshly ground black pepper, then use to coat the chops or cutlets.  Cover with the breadcrumb mixture, ensuring they are evenly coated.  Leave to chill and set in the fridge for one hour. Remove half an hour before cooking to allow the meat to come back to room temperature. Heat the olive oil in a large heavy-based frying pan. Add the chops or cutlets and cook for 3-4 minutes each side for large chops and 1-2 minutes each side if using cutlets.  They should be crisp on the outside but still pink in the middle. Drain on kitchen towel. For the leek purée, bring the butter and stock to the boil in a pan with a lid until it thickens to form an emulsion. Add the leeks with a good pinch of salt, cover and cook for 3-4 minutes until just tender but still vibrant green in colour, shaking the pan occasionally and stirring once or twice.  Transfer to a food processor or liquidiser, then add the cream and mint (if using) with the white pepper.  Blend to a smooth purée and season to taste with salt and freshly ground black pepper. Transfer to a clean pan. Gently reheat the leek purée and divide among warmed serving plates. Arrange a crisp chop on top of each one to serve. ","ingredients":" 50g\/2oz fresh white breadcrumbs,  50\/2oz Parma ham, very finely chopped,  4 tbsp freshly grated Parmesan,  1 tbsp chopped fresh flatleaf parsley ,  salt and freshly ground black pepper,  4 boneless lamb chops or 8 lamb cutlets ,  1 free-range egg ,  4 tbsp light olive oil,  25g\/1oz butter,  4 tbsp vegetable stock ,  4 leeks, finely sliced,  salt and freshly ground black pepper,  6 tbsp double cream,  2 tbsp fresh mint leaves (optional),  1 tsp white pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parmesanandparmahamc_83101"}