{"recipe_name":"Parmesan-crusted halibut, sag aloo and lime emulsion","author":"Will Holland","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the parmesan-crusted halibut, in a bowl, mix together the parmesan, curry powder, garam masala, turmeric and salt until well combined. Dredge one side of each cube of halibut in the parmesan mixture until thickly coated.  Heat a heavy, non-stick frying pan over a low to medium heat. When the pan is warm, add the halibut cubes, parmesan-coated sides down, and dry fry for 4-5 minutes, or until the parmesan crusts are crisp and golden-brown. Season the halibut cubes, to taste, with salt, then turn them over and remove the pan from the heat. (NB: The residual heat from the pan will cook the other sides of the halibut cubes.)  For the lime emulsion, immediately add all of the lime emulsion ingredients to the pan containing the halibut cubes and set aside for 2-3 minutes. Meanwhile, for the sag aloo, heat the oil in a large frying pan over a high heat. Add the shallot and garlic and cook for 2-3 minutes, or until softened. Add the spices and continue to fry for 1-2 minutes, or until fragrant.  Add the cooked new potatoes and continue to cook for a further minute, or until warmed through.  Remove the pan from the heat and add the baby spinach. Stir well until the spinach has wilted, then season, to taste, with salt. To serve, divide the sag aloo equally among each of four serving plates. Place four cubes of parmesan-crusted halibut on top of each portion of sag aloo. Transfer the lime emulsion mixture from the pan to a bowl and whisk until well combined, then drizzle it over the halibut cubes and around the edge of the plates. Garnish with the coriander cress. ","ingredients":" 50g\/2oz parmesan, finely grated,  ½ tsp mild Madras curry powder,  ¼ tsp garam masala,  ¼ tsp ground turmeric,  ½ tsp sea salt flakes,  500g\/1lb halibut fillet, cut into 16 equal-sized cubes ,  2 limes, juice and zest, plus 1 lime, juice only,  25g\/1oz butter,  25g\/1oz sugar,  2 tbsp vegetable oil,  1 banana shallot, finely chopped,  1 garlic clove, grated,  1 heaped tsp garam masala,  1 heaped tsp mild Madras curry powder,  ¼ tsp ground turmeric,  500g\/1lb 2oz new potatoes, cut into quarters, boiled for 8-10 minutes until just tender,  50g\/2oz baby spinach leaves,  salt, to taste,  1 x 20g\/¾oz punnet coriander cress, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parmesancrustedhalib_91767"}