{"recipe_name":"Parmesan-crusted pork chops with roasted red peppers","author":"Curtis Stone","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To roast the red peppers, preheat oven to 220C\/430F\/Gas 7.  Place the red peppers in a hot pan with a little olive oil and warm over a low heat.  Once they are warm, place them in the hot oven and turn every five minutes for 15-20 minutes. Remove peppers, place in a bowl and cover with cling film for approximately 20 minutes. This will make them easy to peel. Once the peppers are cool, remove the skin and seeds and cut them into strips.  Mix together the extra virgin olive oil and parsley and warm gently on stove while you cook the escalopes. For the potatoes, place the potatoes, savoy cabbage and spring onions in a small saucepan. Warm gently and slowly add milk as required.  Season and keep warm.  For the pork, mix the breadcrumbs and the parmesan together in a small bowl. Dip the pork escalopes into flour, then into the beaten egg and finally into the parmesan and breadcrumbs.  In a large non-stick frying pan, cook the pork escalopes over a medium heat in the olive oil and butter, until golden brown. Turn pork escalopes and cook on the other side, turning as necessary until thoroughly cooked. Transfer the pork onto kitchen paper and drain.  Return to the pan and add the warmed oil and parsley and the lemon segments and capers. To serve, place a pile of the peppers on each plate and place a pork escalope on top of the peppers.  Drizzle a little of the capers, lemon and butter mixture around the plate to serve. ","ingredients":" 4 red peppers, cut into thin strips,  1 tbsp parsley, roughly chopped,  2 tbsp extra virgin olive oil,  60g\/2¼oz fresh breadcrumbs,  30g\/1¼oz parmesan cheese,  4 x 100g\/3½oz escalopes of pork,  25g\/1oz plain flour,  3 free-range eggs, beaten,  1 tbsp olive oil,  30g\/1¼oz butter,  50g\/1¾oz extra fine capers ,  1 lemon, segmented ,  4 large baking potatoes (peeled, diced and boiled),  6 leaves savoy cabbage (blanched, refreshed and cut into strips),  3 spring onions, finely chopped ,  200ml\/7¼fl oz milk,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parmesancrustedporkc_74758"}