{"recipe_name":"Parmesan polenta crostini with caramelised onions","author":"Annabel Karmel","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 20 canapés","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring the stock to the boil in a large pan.  Gradually add the polenta in a thin stream, whisking continuously. Reduce the heat to medium and stir with a wooden spoon until the polenta is very thick (this should take about four minutes).   Remove from the heat, stir in the Parmesan and season well with salt and freshly ground black pepper.  You should season generously as the flavour tends to become less strong as the polenta cools.  Using a palette knife spread the polenta onto an oiled baking tray to a thickness of about 1cm\/0.5in. When cool, place the baking tray in the fridge for about one hour for the polenta to firm up.  You can place the baking tray in the freezer before you spread out the polenta to speed up the cooling process. The cheesy polenta base can be made up to three days in advance. For the onion topping, sauté the onions in the olive oil together with the fresh thyme leaves in a large frying pan over a low heat for about 30 minutes, or until softened.  Add the balsamic vinegar and brown sugar.  Turn up the heat to medium and cook for about five minutes or until the vinegar has evaporated.  Season with salt and freshly ground black pepper. Heat the grill. Cut out 20 circles from the polenta using a 5cm fluted pastry cutter and place these on two oiled baking sheets. Spoon about one teaspoon of the red onion mixture on top of each polenta base and arrange the cubes of Taleggio on top.   Place under the grill for 3-4 minutes until the cheese has melted and is turning golden brown.  Transfer onto serving plates and decorate with sprigs of thyme. ","ingredients":" 190g\/7oz instant quick cook polenta,  750ml\/1 pint 7fl oz boiling water mixed with 3 tsp vegetable stock powder,  75g\/3oz Parmesan (or a similar vegetarian hard cheese), grated,  salt and freshly ground black pepper,  2 large red onions, peeled and thinly sliced,  2 tbsp olive oil,  2 tsp fresh thyme leaves, plus extra for garnishing,  2 tbsp balsamic vinegar,  1 tbsp brown sugar,  160g\/5oz Taleggio cheese (or a vegetarian alternative), cut into cubes","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parmesanpolentacrost_82322"}