{"recipe_name":"Parsee fish in banana leaf with egg and peanut salad","author":"Cyrus Todiwala","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Parsee fish, preheat the oven to 190C\/375F\/Gas 5. In a bowl, mix together the salt and ground turmeric until well combined, then rub the spice mixture into the fish. Blend the grated coconut, coriander, chillies, garlic, ginger, cumin seeds, sugar, lime juice and mint to a paste in a food processor. If necessary, gradually add enough water, a tablespoon at a time, to loosen the mixture. Rub the paste all over each seasoned grey mullet, both on the outside skin of the fish and inside the belly cavities. Pass one side of each of the banana leaves over the flame of a gas cooker (5-10 seconds is sufficient) to soften the leaves. Alternatively, soften the leaves using a chefs' blow torch.  Place one piece of fish into the centre of each banana leaf. Fold the leaves over to make four parcels. Tie each parcel securely with string. Place the banana leaf parcels into a roasting tray. Sprinkle over the malt vinegar and a few drops of cold water. Bake in the oven for 15-20 minutes. For the egg and peanut salad, cut each of the hard-boiled eggs in half. Remove the yolks from the whites. Crumble the yolks, then finely chop the whites. In a bowl, mix together the diced egg whites, crumbled egg yolks and the remaining egg and peanut salad ingredients. Season, to taste, with salt and freshly ground black pepper. To serve, place one banana leaf parcel into the centre of each of four serving plates. Remove the string from the banana leaf parcels and open them up. Serve a portion of the egg and peanut salad alongside each Parsee fish portion, inside the banana leaf. ","ingredients":" 1 tsp salt,  ½ tsp ground turmeric,  4 grey mullet, head and backbone removed (ask your fishmonger to do this),  1 fresh coconut, flesh grated (or 200g\/7oz desiccated coconut, soaked in water and squeezed dry),  2 large bunches fresh coriander, leaves only,  4-5 long green chillies,  6-8 garlic cloves,  7.5cm\/3in piece fresh ginger, peeled and roughly chopped,  1 heaped tsp cumin seeds, toasted,  1 tbsp caster sugar,  1-2 limes, juice only,  1 large bunch fresh mint, leaves only,  3-4 tbsp water, as necessary,  4 banana leaves, trimmed, any hard stem removed (available from some Asian grocers, sometimes frozen),  4 tbsp malt vinegar,  5 free-range eggs, hard boiled, cooled, peeled,  6 tbsp freshly grated coconut (or desiccated coconut, soaked in water and squeezed dry),  1-2 large green chillies, trimmed, finely chopped,  2 tbsp chopped fresh coriander,  1 tbsp tamarind pulp (or 1½ tsp tamarind concentrate, available from Asian grocers),  3-4 tbsp chopped roasted peanuts,  1 tbsp chopped shallots,  2 tbsp chopped fresh tomatoes,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parseefishinbananale_90849"}