{"recipe_name":"Parsley and pea soup with smoked salmon fish cakes","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the parsley and pea soup, heat the butter in a frying pan over a medium heat. Add the shallot and garlic and fry gently for about 3-4 minutes, or until softened.  Add the parsley, peas and hot stock (or water), bring the mixture to the boil, then reduce the heat until the mixture is simmering and continue to simmer for three minutes, or until the peas are bright green and just tender. Place in a blender and blend until smooth. For the smoked salmon fish cakes, heat a deep-fat fryer to 180C\/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Boil the potatoes in a pan of boiling water for 12-18 minutes, or until tender. Drain and return the pan to the heat for one minute to drive off any excess moisture. Mash the potatoes, or pass through a potato ricer into a bowl. Set aside to cool slightly. Melt the butter in a frying pan and fry the spring onions for 2-3 minutes, or until just softened. Stir the spring onions, parsley, lemon zest and juice into the potatoes and stir until well combined. Season with plenty of salt and freshly ground black pepper, then add the salmon and carefully fold together. Divide the mixture into 16 small fishcakes, each one the size of a thumb nail. Put the flour, beaten egg and panko breadcrumbs into three separate bowls. Coat the fish cakes in the flour, then beaten egg and finally in the breadcrumbs. Deep fry them (in batches if necessary) for 1-2 minutes, or until golden-brown. Remove from the fryer and place on kitchen paper to drain away any excess fat. To serve, pour the soup into shallow bowls and place the fish cakes in the centre. Garnish with the pea shoots and drizzle with cream and olive oil. ","ingredients":" 50g\/1¾oz butter,  1 shallot, chopped,  2-3 garlic cloves, finely chopped,  500g\/1lb 2oz flatleaf parsley, roughly chopped,  400g\/14oz frozen peas,  1 litre\/1¾ pints hot vegetable stock (or water),  50ml\/2fl oz double cream,  25ml\/1fl oz olive oil,  handful of pea shoots, to serve,  oil, for deep-fat frying,  225g\/8oz floury potatoes, peeled and cut into chunks,  40g\/1½oz butter,  6 spring onions, thinly sliced,  1 tbsp chopped flatleaf parsley,  1 lemon, zest and juice,  salt and freshly ground black pepper,  375g\/13oz smoked salmon, diced,  110g\/4oz plain flour,  2 free-range eggs, beaten,  110g\/4oz panko breadcrumbs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parsley_and_pea_soup_58491"}