{"recipe_name":"Parsnip soup with steamed clams","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a frying pan over a medium heat and fry half of the bacon for 1-2 minutes, or until golden-brown. Remove from the pan, using a slotted spoon, and set aside to drain on kitchen paper. Meanwhile, heat a lidded frying pan over a medium heat. Add the clams and white wine, cover the pan with a lid and steam the clams for 2-3 minutes, or until all of the clams have opened. (Discard any clams that have not opened during cooking.)  Strain the clams through a colander and reserve the cooking liquor. Pick the clam meat from the shells, place into a bowl, season, to taste, with freshly ground black pepper. Stir in the parsley and cooked bacon and set aside. Heat half of the butter in a saucepan until foaming and fry the onion, garlic and the remaining half of the bacon for 2-3 minutes, or until softened. Add the parnsips and thyme and cook a further 2-3 minutes. Pour in the reserved cooking liquor from the clams, bring the mixture to the boil and cook until the volume of the liquid has reduced by one-third. Pour in the chicken stock and return the mixture to the boil. Reduce the heat and simmer for 8-10 minutes, or until the parsnips are tender. Stir in the double cream and blend the mixture in a blender until smooth.  Pass the blended soup through a sieve into the saucepan and return to the heat. Season, to taste, with salt and freshly ground black pepper and whisk in the remaining 25g\/1oz butter. To serve, spoon some of the clams into the middle of each of 4 serving bowls. Ladle the soup around the clams and top with a slice of toast. ","ingredients":" 8 slices streaky bacon, roughly chopped,  1.5kg\/3lb 4oz clams, cleaned (discard any clams that remain open after rinsing),  175ml\/6fl oz white wine,  salt and freshly ground black pepper,  2 tbsp chopped fresh flatleaf parsley,  50g\/2oz butter,  1 onion, peeled, roughly chopped,  2 garlic cloves, peeled, finely chopped,  500g\/1lb 2oz parsnips, peeled, roughly chopped,  2 fresh sprigs thyme, leaves only,  750ml\/1pint 7fl oz chicken stock,  75ml\/3fl oz double cream,  1 tbsp olive oil,  4 thin slices baguette, rubbed with a little oil and toasted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parsnipsoupwithsteam_93513"}