{"recipe_name":"Parsnip-stuffed roast saddle of lamb with fondant potatoes, roast beetroot and red wine sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the lamb, heat the oil in an ovenproof frying pan and add the parsnips. Fry for 2-3 minutes, then add the honey, thyme and rosemary. Stir to coat and season, to taste, with salt and freshly ground black pepper. Transfer to the oven and roast for 20-25 minutes, or until just tender and golden-brown. Remove from the oven and allow to cool. Open up the lamb and season with salt and freshly ground black pepper. Place the parsnips down the centre of the lamb. Fold the lamb over the parsnips, then turn over so that the join is on the bottom and tie securely with string to enclose the filling. Heat a large frying pan until hot. Place the lamb into the pan and cook on each side for 2-3 minutes, until lightly browned all over. Place in the oven for 30-40 minutes, until the lamb is cooked through but still pink, or until cooked to your liking. Remove from the oven and leave to rest for five minutes. For the fondant potatoes, place the potatoes into a heat-resistant plastic food bag with the water and thyme and seal tightly. Place a pan of water over a high heat and place the bag of potatoes into it. Bring to the boil, then reduce the heat and simmer for 20-25 minutes, or until the potatoes are just tender. Remove the bag from the water and take the potatoes out of the bag, taking care as there will be steam. Heat the butter in a frying pan and fry the potatoes, turning frequently, until golden-brown all over. Meanwhile, for the roast beetroot, place the beetroot into a roasting pan, drizzle with olive oil and season with salt and freshly ground black pepper. Place in the oven along with the lamb and roast for 30 minutes, or until just tender. For the sauce, heat the red wine in a small pan. Bring to the boil, then reduce the heat and simmer until reduced by half. Add the beef stock and simmer until reduced by two thirds. Season, to taste, with salt and freshly ground black pepper and whisk in the butter. To serve, slice the lamb and place onto serving plates with the fondant potatoes and beetroot. Pour over the sauce. ","ingredients":" 1 tbsp olive oil,  400g\/14oz parsnips, cut into 3cm x 10cm (1¼in x 4in batons),  2 tbsp honey,  2 sprigs fresh thyme,  2 sprigs fresh rosemary,  salt and freshly ground black pepper ,  1.5kg\/3lb 4oz boned saddle of lamb,  6 large potatoes, cut into cylinders about 5cm\/2in long,  1 tbsp water,  2 sprigs fresh thyme,  50g\/2oz butter,  3 large beetroot, cut into wedges,  1 tbsp olive oil,  salt and freshly ground black pepper ,  200ml\/7fl oz red wine,  300ml\/11fl oz beef stock,  salt and freshly ground black pepper ,  50g\/2oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/parsnipstuffedroasts_86957"}