{"recipe_name":"Partridge croustillant","author":"Galton Blackiston","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pickled blackberries, mix the sugar, cider vinegar, tarragon, thyme, ginger and chilli in a saucepan. Bring to the boil then cool a little before adding the blackberries. Allow to infuse for a few hours and for up to 2 weeks. For the carrot purée, put the carrots in a large saucepan and cover with enough carrot juice to cover. Bring to the boil and then simmer until the carrots are soft. Transfer to a blender and pulse until smooth. Push through a sieve, season with salt and pepper. Keep warm until ready to serve. For the partridge, preheat a deep-fat fryer to 160C. Or until a small piece of bread turns crisp and golden-brown within a minute. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Lay out 6 spinach leaves on a work surface. Put a partridge breast in the middle of each leaf and season with salt and pepper. Wrap up into a parcel, then layout 2 circles of the brick pastry and cut each circle into quarters. Wrap each spinach parcel in a quarter of pastry, brushing the edges with beaten egg to help them stay in place.  Wrap the parcels completely in potato strings. Lower each parcel into the fryer and cook for 3 minutes. Remove using a slotted spoon and set aside to rest and drain on kitchen paper.   Heat the butter in a large frying pan, then fry the shallot until soft. Add the mushrooms and when cooked, finish with the tarragon. When ready to serve, if necessary, fry the parcels again briefly to ensure they are hot. To serve, lay a leaf of hispi cabbage in centre of each plate. To one side place the fried bread, on top of this add the mushrooms. Slice the croustilliant parcels in 2 and lay them on the cabbage. Drain the blackberries and arrange them around the plates. Spoon over partridge jus and finish with a neat spoonful of carrot purée.  ","ingredients":" 250g\/9oz caster sugar,  250ml\/9fl oz cider vinegar,  1 sprig fresh tarragon,  1 sprig fresh thyme,  2cm\/¾in piece fresh root ginger,  ½ red chilli,  500g\/1lb 2oz fresh blackberries,  500g\/1lb 2oz carrots, sliced,  1 litre\/1¾ pint fresh carrot juice,  salt and freshly ground black pepper,  450g\/1lb large-leaf spinach, stalks removed, leaves blanched briefly in lightly salted water,  6 partridge breasts (off the bone),  6 feuilles de brick pastry circles (available online and from specialist retailers),  4 Maris Piper potatoes, cut into strings using a spiraliser,  vegetable oil, for deep-frying,  1 free-range egg, beaten ,  1 shallot, finely chopped,  75g\/2½oz unsalted butter,  150g\/5½oz girolles, cleaned,  150g\/5½oz chanterelles, cleaned,  2 tbsp chopped fresh tarragon,  6 circles sliced bread, fried in lard,  6 leaves hispi cabbage, cooked and refreshed in ice water,  partridge jus or gravy","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/partridge_croustillant_20604"}