{"recipe_name":"Partridge with cobnut crust and potted game","author":"Stephanie Moon","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/300F\/Gas 2. Heat the oil in a pan and fry the partridge legs to colour them all over. Place the partridge legs in an ovenproof dish.  Add the mixed game and pour over the goose fat. Set aside the partridge breasts. Place in the oven for two hours to gently confit.  Once cooked, carefully remove the partridge from the fat with a slotted spoon. Season the confit and press it together to form a slim sausage shape and wrap tightly in cling film. Place in the fridge to set. Set the oven to 180C\/350F\/Gas 4. Mix the oats, flour, parmesan, cayenne pepper, salt and pepper in a bowl.  Add just enough boiling water to make a dough that is not sticky.  On a lightly floured surface, roll out the dough and cut into rounds.  Grease a baking tray with olive oil and place the rounds on the prepared baking tray. Cook for 12-15 minutes Gently fry the cobnuts in a frying pan. Chop them finely and set aside for the crust. Season the partridge breasts, brown lightly in a pan before placing in the oven for 6-8 minutes, or until the partridge is cooked but still slightly pink in the middle. Brush with some of the melted butter and dip into the cobnuts to form a crust.  To assemble the dish, slice a small round of the confit game, brush with a little melted butter and dip in chopped chives. Put the game, breast and oatcakes onto each plate and garnish with blackberries and fresh herbs. ","ingredients":" dash vegetable oil,  3 whole partridge, jointed (ask your butcher to do this),  300g\/10½oz mixed game,  1 x 340g\/12oz tin goose fat, melted,  100g\/3½oz oats,  100g\/3½oz plain flour, plus extra for flouring,  50g\/1¾oz grated parmesan,  ½ tsp cayenne pepper,  salt and freshly ground black pepper,  1 tbsp olive oil,  100g\/3½oz shelled cobnuts,  200g\/7oz melted butter,  50g\/1¾oz finely chopped chive,  1 punnet blackberries,  fresh herbs, for garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/partridge_with_cobnut_86862"}