{"recipe_name":"Passion fruit and chocolate tart","author":"Flora Shedden","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Makes 1 large tart","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, put all the ingredients, except the egg white, in a food processor and briefly blitz to combine. Add a few drops of water and pulse to bring the dough together. Cover with cling film and chill for 20 minutes.  To make the macarons, blitz the ground almonds and icing sugar to a fine powder using a food processor. In a separate bowl, whisk the egg white until stiff peaks form when the whisk is removed. Add the caster sugar and whisk until glossy. Add a drop of the food colouring and stir through. Fold the powder mixture into the egg whites. Transfer to a piping bag fitted with a plain nozzle. Line a baking tray with non-stick baking paper. Pipe small rounds of the macaron mixture about the size of a 10p coin then set aside until they form a skin. Preheat the oven to 160C\/140C Fan\/Gas 3. Bake the macarons for 12-15 minutes, or until they are no longer sticky to the touch.  Place the macarons on wire racks to cool.  Roll out the chilled pastry on a lightly floured work surface until it is about 4mm thick. Line a 23cm\/9in tart tin with the pastry. Chill for 20 minutes. Preheat the oven to 200C\/180C Fan\/Gas 6. For the passion fruit layer, put all the ingredients in a saucepan and whisk gently over a low heat until it thickens.  Line the pastry case with baking parchment and fill with baking beans. Bake for 10 minutes, then remove from the oven and reduce the temperature to 180C\/160C Fan\/Gas 4. Remove the baking beans and brush the pastry with the egg white.  Pour in the passion fruit layer and return to the oven for 10 minutes, or until set. Allow to cool slightly then place in the fridge to chill.  For the chocolate mousse layer, melt the chocolate drops, butter and marshmallows together until combined. Leave to cool.  Whip the cream until stiff peaks form when the whisk is removed. Fold in the chocolate mixture then whisk it in the bowl of a freestanding mixer for approximately 10 minutes, or until very pale in colour and fluffy. Pour on top of the passion fruit layer, smooth the surface and chill again.  To make the jelly, combine the sugar and passion fruit in a pan with 100ml\/3½fl oz water. Bring to the boil then squeeze any excess water from the gelatin and add to the pan.  When the gelatin is dissolved, pour the mixture into a 23cm\/9in sandwich tin lined with cling film. Chill until set.  To make the buttercream for the macarons mix all the ingredients together until smooth. Transfer to a piping bag fitted with a 1cm\/½in plain nozzle. Use the buttercream to sandwich the macarons together. For the passion fruit ganache, heat the cream in a pan then add the chocolate drops. When the chocolate is melted, stir in the passion fruit, leave to cool slightly then smooth on top of the chocolate mousse and chill in the fridge until set.  To assemble the tart, cut the jelly into cubes. Decorate the top of the tart with the macarons, some squares of jelly and pansies.  ","ingredients":" 270g\/9¾oz plain flour, plus extra for dusting,  30g\/1oz cocoa powder,  30g\/1oz ground almonds,  65g\/2½oz icing sugar,  170g\/6oz unsalted butter, cubed,  1 medium free-range egg,  1 free-range egg white, for egg wash,  40g\/1½oz ground almonds,  60g\/2¼oz icing sugar,  1 large free-range egg white,  1 tbsp caster sugar,  orange or yellow gel or paste food colouring,  125ml\/4fl oz double cream,  4 tbsp sieved passion fruit ,  2 free-range egg yolks,  1 large free-range egg,  55g\/2oz caster sugar,  200g\/7oz milk chocolate drops ,  50g\/1¾oz dark chocolate drops ,  50g\/1¾oz unsalted butter,  150g\/5½oz mini white marshmallows,  200ml\/7fl oz double cream,  100g\/3½oz caster sugar,  3 large passion fruits, seeds scooped out,  3 gelatine leaves, soaked in cold water for 10 minutes,  50g\/1¾oz butter,  125g\/4½oz icing sugar,  1 tbsp sieved passion fruit,  50ml\/2fl oz double cream ,  200g\/7oz dark chocolate drops,  50ml\/2fl oz sieved passion fruit ,  small yellow and purple edible pansies (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/passion_fruit_and_76131"}