{"recipe_name":"Passion fruit soufflé with passion fruit ice cream and lemon shortbread ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the passion fruit ice cream, place the cream, vanilla pod and seeds, and passion fruit into a large saucepan and heat until it starts to simmer gently. Place the egg yolks and sugar in a large mixing bowl and whisk until it thickens and turns pale. Gradually add the cream mixture to the bowl, continually whisking. Once you have added all the liquid, pour it back in the pan.  Cook until the mixture thickens. Transfer to an ice cream machine for 40-50 minutes before freezing, or follow the manufacturer’s instructions.   For the lemon shortbread, line two baking trays with silicone paper or baking parchment. Sift the icing sugar, flour and cornflour together into a bowl and add the ground almonds. Transfer the flour mixture to a food processor. Add the butter and pulse until there are no visible lumps of butter. Add the almond essence and lemon zest. Pulse again, then turn the mixture out onto a lightly floured surface and bring together to form a smooth dough. Dust the work surface with flour and roll out the dough. Cut out shapes as desired and place on the baking tray.  Transfer to the oven and bake the shortbreads for 8-12 minutes, or until they are a light golden-brown colour. Dust with caster sugar. Remove from the oven and allow to cool.  For the passion fruit soufflé, preheat the oven to 180C\/350F\/Gas 4. Grease two ramekin dishes with butter and sprinkle with one tablespoon of the caster sugar. Place the egg whites into a large clean bowl and whisk until stiff peaks form when the whisk is removed. Add the remaining sugar and whisk again until thick and glossy. Place the custard in a separate large bowl, add the passion fruit seeds and pulp and mix well. Gently fold in the whisked egg whites. Spoon the mixture into the prepared ramekins and place onto a baking tray. Bake for 15-20 minutes, or until risen and golden-brown. Dust with icing sugar before serving. To serve, place the soufflé in the middle of the plate and drop a quenelle of ice cream in the centre of the soufflé.  Serve with the lemon shortbread on the side of the plate. ","ingredients":" 568ml\/1 pint double cream,  1 vanilla pod, split lengthways,  12-14 passion fruit,  6 medium free-range egg yolks,  150g\/5½oz caster sugar ,  90g\/3¼oz icing sugar,  185g\/6½oz plain flour, plus extra for flouring,  60g\/2¼oz cornflour,  30g\/1oz ground almonds,  250g\/9oz butter, cut into cubes, plus extra for greasing,  2 drops almond essence,  1 lemon, zest only,  caster sugar, for dusting,  butter, for greasing,  2 tbsp caster sugar,  4 medium free-range egg whites,  120ml\/4fl oz fresh ready-made custard,  1 passion fruit, halved, seeds and pulp scraped out","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/passion_fruit_souffl_10439"}