{"recipe_name":"Passion fruit bhapa doi with dark chocolate mousse and pistachio kulfi","author":"Atul Kochhar","programme":"Great British Menu","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 140C\/275F\/Gas 1. First make the pistachio kulfi. Put the milk and cardamom in a heavy-bottomed pan and bring to the boil, then turn down the heat. Reduce the milk, stirring constantly, until it is one-third of the original quantity and has a granular consistency.  Remove from the heat, add the sugar and toasted pistachios and mix well. Return to a low heat and stir until the sugar has dissolved. Allow the mixture to cool, then stir in the screwpine flower essence. Chill in the fridge.    Churn the kulfi in an ice cream machine for 30-45 minutes or until softly set (this will produce a good texture), then spoon into two 8cm\/3in conical moulds (or four smaller moulds) and freeze until firm.  Next make the bhapa doi. Whisk the condensed milk and yoghurt with the passion fruit purée. Line four ramekins with muffin papers and spoon some passion fruit pulp into each. Pour in the yoghurt mixture. Set the ramekins in a baking tray and pour enough hot water into the tray to come one-quarter of the way up the sides of the ramekins. Place the tray in the oven and bake for 30-40 minutes. Remove the ramekins from the tray and allow to cool, then chill. To make the mousse, melt the chocolate in a heatproof bowl set over a pan of simmering water (the water should not touch the bowl). Remove the bowl and stir the chocolate until smooth, then set aside. Set another bowl with the egg yolks on the pan of hot water and whisk until the yolks leave a ribbon-like trail when the whisk is lifted. Remove from the pan of hot water. Whip the double cream to soft peaks, then fold into the melted chocolate and whisked egg yolks. Mix in the ground pistachios and liqueur. Leave to set in the fridge for 2-3 hours.  For the passion fruit chutney, heat together the purée, sugar, chilli flakes and salt. Reduce to three-quarters of the original quantity.  Add the cornflour and stir until thickened. Remove from the heat and allow to cool, then add the lime juice.   Chill before serving. To serve, turn out the bhapa doi to four square plates and peel off the muffin papers. Turn out half of a kulfi (or a whole small one) alongside and add a large spoonful of mousse. Drizzle with raspberry coulis and passion fruit chutney. Finish each plate with a sprig of mint and 3-5 raspberries on the bhapa doi. ","ingredients":" 200ml\/7fl oz milk,  good pinch ground cardamom seeds,  40g\/1½oz granulated sugar,  30g\/1oz pistachios, lightly toasted and ground,  2-3 drops screwpine flower essence (available in specialist Asian food shops),  150ml\/5fl oz condensed milk,  200g\/7oz plain Greek yoghurt,  30ml\/1fl oz passion fruit purée (sieved pulp),  2 passion fruits, cut in half and pulp scooped out,  125g\/4½ oz dark chocolate (55 per cent cocoa),  3 large free-range egg yolks,  280ml\/10fl oz double cream,  30g\/1oz pistachios, ground,  20ml\/¾fl oz Cointreau or other orange liqueur,  200ml\/7fl oz passion fruit purée (sieved pulp),  60g\/3oz palm sugar,  ¾ tsp red chilli flakes,  1 tsp salt,  ¼ tsp cornflour mixed with water ,  ½ tsp lime juice,  raspberry coulis (whiz raspberries in a food processor and strain to remove seeds),  sprigs of mint,  raspberries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/passionfruitbhapadoi_82083"}