{"recipe_name":"Passion fruit delice with autumn berries","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sugar syrup, place all the syrup ingredients into a pan and bring to the boil, stirring occasionally with a wooden spoon. Boil for 2-3 minutes, skimming the surface if necessary. Pass the syrup through a fine sieve and set aside until completely cooled. For the Italian meringue, place the sugar and water into a pan and slowly bring to the boil until the syrup reaches 110C\/230F (use a sugar thermometer to check the temperature). At this stage, place the egg whites into a bowl and whisk until firm peaks form when the whisk is removed.  As soon as the sugar reaches 121C\/250F, remove the pan from the heat. Immediately resume whisking the egg whites. While whisking, gradually pour the sugar and water mixture into the egg whites in a steady stream, keeping it clear of the beaters. Continue whisking for 4-5 minutes, until the meringue is tepid.  For the passionfruit delice, blend the passion fruit pulp and the sugar syrup in a food processor until smooth. Strain the mixture through a fine sieve. Place the passion fruit purée into a pan, add the powdered milk and vanilla pod and bring to the boil.  Place the egg yolks and sugar into a bowl and whisk until the mixture forms a ribbon when the whisk is removed (this is called the ribbon stage). Pour the passion fruit mixture onto the egg mixture, whisking continuously, then pour this custard mixture back into the pan. Heat gently, stirring continuously with a spatula, until the custard is thick enough to coat the back of the spatula (do not allow the mixture to boil). Remove the pan from the heat and stir the drained gelatine into the custard. Strain the custard through a conical sieve and set aside to cool. Stir occasionally to prevent a skin forming.  When the custard is lukewarm, gently fold in half of the Italian meringue (the remaining meringue can be used in another recipe). Stir in the passion fruit liqueur, and then fold in the whipped double cream. (You must now assemble the dessert immediately, before the gelatine causes the mixture to set.) Place the sponge flan bases onto a chopping board. Mix together 50ml\/2fl oz of the sugar syrup and one tablespoon of the reserved passion fruit purée and brush this mixture over the sponge. Place a 25cm\/10in flan ring (6cm\/2½in deep) onto the sponge and cut out a circle to form the base (discard the excess sponge).  Fill the flan ring with the passion fruit custard mixture, leaving a small gap at the top, and carefully smooth the surface with a palette knife. Transfer to the freezer and chill for several hours.  For the glaze, place the sugar syrup and the passion fruit pulp into a pan and heat gently, then remove from the heat, stir in the drained gelatine and set aside to cool. Once cool, remove the delice from the freezer and spread the glaze over the top of the passion fruit filling. Transfer to the fridge to chill again before serving. To serve, remove the tart ring by heating the outside of the ring with a blowtorch for a few seconds, then slide the ring upwards, rotating it slightly. Place a slice of delice onto a serving plate and garnish with redcurrants, blackberries, and passionfruit pulp. ","ingredients":" 370g\/13¼oz caster sugar,  325ml\/11½fl oz water,  30g\/1¼oz liquid glucose,  170g\/6oz caster sugar,  5 tbsp water,  3 free-range egg whites,  16 passion fruit, pulp only,  50ml\/2fl oz sugar syrup (see above),  12g\/½oz powdered milk,  ½ vanilla pod,  3 free-range egg yolks,  25g\/1oz caster sugar,  4½ gelatine leaves, soaked in cold water for 15 minutes, drained, squeezed dry,  20ml\/¾fl oz passion fruit liqueur,  400ml\/14fl oz double cream, whipped until soft peaks form when the whisk is removed,  ½ ready-made round sponge flan base, cut in half horizontally to form two thinner cakes (second cake reserved for another recipe),  50ml\/1¾fl oz sugar syrup (see above),  5 passion fruit, pulp only,  3 gelatine leaves, soaked in cold  water for 15 minutes, drained,  200g\/7¼oz fresh blackberries,  200g\/7¼oz fresh redcurrants,  1 passion fruit, inner pulp only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/passionfruitdelicewi_92675"}