{"recipe_name":"Beef chilli with bitter chocolate ","author":"The Hairy Bikers","programme":"Hairy Bikers Everyday Gourmets","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beef_chilli_with_bitter_27455_16x9.jpg","method":"Heat two tablespoons of the oil over a medium to high heat in a large, heavy-based pan with a tight fitting lid. Fry the diced beef steak in batches until browned all over, setting each batch aside on a plate using a slotted spoon. Add another tablespoon of oil to the pan and add the beef mince, frying until browned all over. Remove the mince from the pan using a slotted spoon and set aside with the beef steak. Add the remaining tablespoon of oil to the pan and fry the white onion, red onion and celery for 3-4 minutes, or until the onions have softened but not browned. Stir in the chipotle chilli, chilli flakes, chilli powder and oregano until well combined. Cook for a further two minutes. Return the diced and minced beef to the pan, then stir in the sugar, chopped tomatoes, beef stock, kidney beans and black-eyed peas. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Cover and continue to simmer over a low heat for 2-3 hours. (Alternatively, preheat the oven to 140C\/280F\/Gas 1 to cook in an ovenproof dish for the same amount of time.) Just before serving, season the chilli with crushed sea salt flakes and freshly ground pepper. Stir in the chocolate until melted, then stir in the chopped coriander. Serve the chilli with a bowl of steamed rice and top each serving with a dollop of soured cream. Garnish with the sliced spring onions. ","ingredients":" 4 tbsp vegetable oil,  500g\/1lb 2oz good-quality beef steak, finely diced,  500g\/1lb 2oz good-quality beef mince,  1 white onion, peeled, finely chopped,  1 red onion, peeled, finely chopped,  2 sticks celery, trimmed, chopped,  1 dried chipotle chilli,  1 tbsp dried chilli flakes,  ½ tbsp chilli powder,  2 tsp dried oregano,  3 tbsp light brown sugar,  2 x 400g\/14oz cans chopped tomatoes,  500ml\/17fl oz beef stock,  1 x 400g\/14oz can kidney beans, drained and rinsed,  1 x 400g\/14oz can black-eyed beans, drained and rinsed,  sea salt flakes and freshly ground black pepper,  75g\/3oz plain chocolate, minimum 70% cocoa solids, roughly chopped,  bunch fresh coriander,  steamed rice,  8 tbsp soured cream,  4 spring onions, trimmed, finely sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_chilli_with_bitter_27455"}