{"recipe_name":"Pasta fazool","author":"Joe Hurd","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cavatelli, bring all the ingredients together in a large bowl or food processor and to form a dough. Allow the dough to rest for at least an hour in the fridge before shaping the pasta. To make the cavatelli, cut the pasta into pieces and roll into long batons. Cut into 1cm\/½in pieces. Using a sharp knife roll the knife along the pasta to create rolled up tiny shells. For the pasta fazool, bring the chicken stock to the boil in a saucepan.  In a separate pan, on a medium-to-low heat, add the 'nduja and let some fat render out. Add the finely chopped onion and cook briefly for 2-3 minutes, just until the n’duja has melted and the onion is soft and translucent. Add the celery and carrot and cook for 5 minutes. Add the chilli and the garlic. Cook for 5 minutes without letting the garlic brown. Add the beans and enough of the boiling chicken stock to just cover the mixture. Let all this cook for 10 minutes and then remove about a third of the beans. Mash or blend them then put back in the pan. Add the tomatoes and stir, add the tomato purée, cook for a couple of minutes and season with salt and pepper, to taste.  Add 150g\/5½oz of the pasta to the chicken stock and cook for 8-10 minutes. Then drain and add the pasta to the beans with some of the stock - the consistency should not be too soupy, but not really dry. Finish with the basil, baby red vein sorrel and a little extra virgin olive oil. ","ingredients":" 130g\/4½oz semolina,  130g\/4½oz 00 flour,  120g\/4oz egg yolks (about 6 large yolks),  1.5 litres\/2½ pints chicken stock,  20g\/¾oz 'nduja, chopped, or use pancetta,  ½ onion, finely chopped ,  2 celery stalks, including leaves, finely chopped ,  1 small carrot, grated on a fine microplane,  small pinch dried chilli flakes,  1 garlic clove, crushed,  1 x 400g tin borlotti beans,  100-125g\/4-4½oz good-quality tinned tomatoes, skinned and de-seeded ,  1 tsp tomato purée,  2-4 tbsp extra virgin olive oil ,  salt and pepper,  1 tbsp micro basil cress,  1 tbsp micro baby red vein sorrel","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pasta_fazool_04131"}