{"recipe_name":"Peach and raspberry roly-poly with vanilla ice cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Place two clean jam jars into the oven to heat and sterilise. For the jam, place the sugar and lemon juice into a large pan over a low heat and heat until the sugar has melted. Add the peaches and stir gently. Increase the heat to bring to the boil and cook for ten minutes. Check the temperature with a sugar thermometer - it should reach 105C\/220F. Leave to cool slightly, skimming off any froth with a clean spoon, to prevent the jam from going cloudy. Carefully remove the hot jam jars from the oven. Spoon the jam into the sterile jars, seal and label with the date. They should keep for a few months in a cool, dark place. For the roly-poly, place the flour, sugar and suet into a bowl and mix thoroughly. Make a well in the centre of the mixture and gradually add enough water, mixing from the centre, until a soft dough is formed. Turn the dough out onto a floured work surface and knead lightly until smooth. Roll the dough out into an oblong shape about 1cm\/½in thick. Slide the pastry onto a sheet of greaseproof paper. Spread the peach jam onto the pastry, leaving a 2.5cm\/1in border all around, then add the raspberries evenly across the jam. Roll up the dough into a pinwheel, keeping the greaseproof paper on the outside, until all of the pastry is enclosed. Twist the ends of the greaseproof paper tight. Place the parcel into a bamboo or metal steamer, then place over a large pan of boiling water. Reduce the heat and steam for one hour, or until the pastry is completely cooked. To serve, place the sugar and water into a saucepan over a medium heat and bring to the boil. Reduce the heat and simmer until the sugar has melted and the liquid has turned a light caramel colour. Drizzle the caramel over each serving plate and top with a spoonful of ice cream and a scattering of toasted almonds. Cut the roly-poly into thick slices and place alongside each portion of ice cream. ","ingredients":" 1kg\/2lb 2oz jam sugar,  1 lemon, juice only,  1 kg\/2lb 4oz fresh peaches, skins and stones removed, cut into chunks,  175gm\/6oz self-raising flour ,  25g\/1oz caster sugar,  85g\/3oz shredded suet ,  125-150ml\/4-5fl oz water,  150g\/5oz peach jam ,  75g\/3oz raspberries,  85g\/3oz caster sugar,  50ml\/2fl oz water,  4 tbsp flaked almonds, toasted ,  vanilla ice cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/peachandraspberryrol_86416"}