{"recipe_name":"Beef fillet with wild garlic purée and a fricasse of wild mushrooms","author":"Michael Caines","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the wild garlic purée, melt the butter in a sauce pan. Add the shallots and garlic in and cook gently without colouring them. Add the wild garlic, chervil and tarragon and cook until the wild garlic is tender.  Transfer to a blender. In a small pan bring the cream to the boil. Add this to the blender. Blend until smooth. Season with salt, to taste. Put into a plastic bottle and keep warm until serving.  For the beef, season the beef with salt. Heat the oil and butter in a frying pan until foaming. Cook the beef for a few minutes on each side until cooked to your liking. Set it aside to rest before serving. For the fricassee of wild mushroom, melt 20g\/¾oz of the butter in a pan, add the garlic and chopped shallot and cook until transparent. Add the mushrooms, season with salt and pepper and cook gently for 3 minutes. Add the Madeira to the pan and scrape the bottom of the pan. Cook until reduced by a third in volume. Add the stock and bring to the boil. Whisk in the mustard and then the rest of the butter. Season with salt and pepper and then and the tomato and tarragon just before serving.  For the asparagus tips, heat a griddle pan to hot. Coat the asparagus in the oil, season with salt and pepper, then place onto the hot griddle, turning occasionally. Cook for about 5 minutes until done and ready to serve.  To serve, pipe the wild garlic purée onto the plate from the plastic bottle. Cut the beef in half, add to the plate with the mushroom fricassee and asparagus. Garnish with wild garlic leaves.  ","ingredients":" 50g\/1¾oz unsalted butter,  4 small shallots, sliced,  1 garlic clove, crushed,  300g\/10½oz wild garlic ,  30g\/1oz fresh chervil, chopped,  30g\/1oz fresh tarragon, chopped,  150ml\/5fl oz double cream ,  pinch salt,  2 tbsp olive oil\/rapeseed oil,  75g\/2½oz unsalted butter,  4 x 120g\/4oz beef fillets,  100g\/3½oz unsalted butter,  1 garlic clove, crushed,  1 shallot, finely chopped,  200g\/7oz assorted wild mushrooms,  2 tbsp Madeira ,  100ml\/3½fl oz beef stock or brown chicken stock,  1 tsp wholegrain mustard ,  1 tomato, peeled, de-seeded and finely chopped,  1 tsp chopped fresh tarragon ,  2-3 tbsp olive oil or rapeseed oil,  12 asparagus tips,  whole fresh wild garlic leaves ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_fillet_with_wild_74776"}