{"recipe_name":"Peanut butter cheesecake with chocolate peanut sauce and sautéed bananas","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":null,"serves":"Serves","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cheesecake, blend the peanuts in a food processor to a buttery paste. In a bowl, beat the double cream, cream cheese and crème fraîche together until smooth and well combined. Fold in two-thirds of the ground peanuts and mix until well combined. Fold in the icing sugar a spoonful at a time, to taste. Place one 7.5cm\/3in chefs' ring (at least 5cm\/2in in height) onto each serving plate. Carefully divide the cheesecake mixture equally among the chefs' rings, tapping the mixture after adding each spoonful to eliminate air pockets. For the chocolate peanut sauce, heat the sugar, water and dark chocolate in a pan over a low heat until the chocolate has just melted. Once the chocolate has melted, whisk the mixture to a smooth sauce. Add the remaining ground peanuts and stir until well combined. For the bananas, heat a separate frying pan until smoking, add the butter and sugar and heat until the butter has melted and the sugar has dissolved. Add the bananas and fry for 2-3 minutes on each side, or until golden-brown on both sides. To serve, using a blow torch, heat each chefs' ring to loosen, then remove the chefs' ring from each cheesecake. Spoon a little of the chocolate peanut sauce and a spoonful of the sautéed bananas alongside each cheesecake. Garnish each cheesecake with the slices of chocolate coated honeycomb. ","ingredients":" 250g\/9oz roasted salted peanuts,  300ml\/11fl oz double cream, whipped until soft peaks form when the whisk is removed,  300g\/11oz full fat cream cheese,  250g\/9oz crème fraîche,  6 tbsp icing sugar,  50g\/2oz caster sugar,  50ml\/2fl oz water,  175g\/6oz dark chocolate, cut into small pieces,  50g\/2oz butter,  50g\/2oz caster sugar,  4-6 baby bananas, peeled and cut in half lengthways,  40g\/1½oz chocolate-coated honeycomb, cut into slices, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/peanutbuttercheeseca_90361"}