{"recipe_name":"Beef in oyster sauce","author":"Ken Hom","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beef_in_oyster_sauce_14507_16x9.jpg","method":"Put the beef, soy sauce, sesame oil, Shaoxing rice wine or dry sherry and cornflour into a bowl and mix together until well combined. Set aside to marinate for 20 minutes. Heat a wok or large frying-pan until it is very hot.  Add the oil, and when it is very hot and slightly smoking, add the beef slices and stir-fry for 5-6 minutes or until they are pale golden-brown.  Remove the beef strips and set aside to drain in a colander over a bowl. Discard the drained oil. Wipe the wok or pan clean and reheat it over a high heat until it is hot.  Add the oyster sauce, and bring to a simmer.  Return the drained beef slices and mix them thoroughly with the sauce.  Turn the mixture onto a serving platter and garnish with the spring onions. Meanwhile, for the salad, mix the mustard, curry powder, soy sauce, salt, pepper and olive oil together in a bowl.  Cook the broccoli, green beans and cauliflower in boiling water for 2-3 minutes, then add peas and cook for 1-2 minutes. Drain the vegetables into a warm bowl, then add the water chestnuts and tomatoes, shallots and chives.  Drizzle over the salad dressing and mix until well combined. Serve the salad alongside the beef. ","ingredients":" 450g\/1 lb fillet of beef, cut into 5cm\/2in thin strips,  1 tbsp light soy sauce,  2 tsp sesame oil,  1 tbsp Shaoxing rice wine or dry sherry,  2 tsp cornflour,  3 tbsp groundnut or vegetable oil,  3 tbsp oyster sauce,  1½ tbsp finely chopped spring onions,  2 tsp Dijon mustard,  2 tsp Madras curry powder,  2 tbsp light soy sauce ,  2 tsp salt,  1 tsp freshly ground black pepper,  4 tbsp extra virgin olive oil ,  100g\/3½oz broccoli florets, cut into small florets,  100g\/3½oz French beans, trimmed ,  100g\/3½oz cauliflower florets, cut into small florets,  100g\/3½oz peas,  225g\/8oz fresh tomato, peeled, seeds removed, chopped,  50g\/2 oz fresh water chestnuts, peeled, sliced,  3 tbsp finely chopped shallots, squeezed dry through a linen cloth ,  3 tbsp finely chopped fresh chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_in_oyster_sauce_14507"}