{"recipe_name":"Pear and rosemary 'tarte tatin' with vanilla ice cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rough puff pastry, place the flour and salt into a large mixing bowl. Add the butter and use your hands to rub the butter into the flour. When the flour and butter mixture resembles breadcrumbs, add the cold water. Mix it in with a round-tipped knife to keep the mixture cool. When the mixture comes together to form a dough, turn it out onto a clean, floured work surface and knead briefly until just smooth. Form the dough into a rectangular block (this will make it easier to roll out later), wrap in cling film and refrigerate for 20 minutes. Roll the dough out on a clean, floured work surface into a rectangle approximately 40x20cm\/16x8in.  Take one of the short edges of the pastry and fold one-third of the dough into the centre, then fold the other third over that. Turn the pastry by 90 degrees and repeat the rolling and folding. Wrap the pastry in cling film, refrigerate for 20 minutes, then repeat steps 4 and 5. Wrap the pastry block in cling film and refrigerate for 30 minutes before using. For the pear tatin, preheat the oven to 200C\/400F\/Gas 6. Place the pears, 25g\/1oz of the sugar and vanilla seeds into a saucepan. Fill the pan with enough water to just cover the pears. Gently heat the pears until the mixture is simmering. Cook for 15 minutes, or until the pears are just tender. Drain the pears and pat dry. Heat the remaining sugar in a 24cm\/9½in ovenproof frying pan over a low heat until it has caramelised. Add the butter, cream and rosemary to the pan and heat gently until the mixture forms a smooth caramel.  Very carefully remove the springs of rosemary (these can be used as a garnish if desired). Place the pears into the caramel, cut-side up. Roll the chilled pastry out onto a floured work surface to a 5mm\/¼in thickness. Cut the pastry into a circle slightly larger than the frying pan. Place the pastry circle over the pears. Tuck the edges of the pastry inside the pan to surround the pears. Transfer to the oven and bake for 20-25 minutes, or until the pastry is risen, golden-brown and cooked through. Once cooked, remove the pear tatin from the oven and set aside to cool for 5-10 minutes. Loosen the edges of the tatin and place a large serving plate or board on top of the frying pan. Very carefully, but quickly, turn it over, using a folded dry tea towel to help you hold it, and allow the tarte tatin to drop gently on to the serving plate.  To serve, slice the tatin into wedges and place on serving plates. Top with a scoop of vanilla ice cream. ","ingredients":" 250g\/9oz plain flour,  ½ tsp salt,  250g\/9oz cold butter, cut into small cubes,  125ml\/4fl oz ice-cold water,  4 pears, peeled, cores removed, cut in half,  110g\/4oz caster sugar,  2 vanilla pod, split and seeds removed,  110g\/4oz butter,  150ml\/5fl oz double cream,  2 sprigs rosemary,  500ml\/18fl oz vanilla ice cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pear_and_rosemary_tatin_79310"}