{"recipe_name":"Pear, apple and blackberry crumble with hazelnut ice cream","author":"Paul Rankin","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4.  For the fruit, heat the butter in a large roasting tray, add the chopped apples and pears. Sprinkle over the sugar and stir well. Cook for 10 minutes, or until the fruit is starting to soften and then set to one side.  Make the topping by rubbing together the butter, flour and sugar with your fingers until it has a texture like very large breadcrumbs.  Stir in the roughly chopped hazelnuts.  To finish the fruit, stir the blackberries into the apple and pear mixture and then tip this into a serving dish. Top with the crumble mixture. Bake for 15-20 minutes, or until the crumble is golden-brown.  For the ice cream, heat the milk and cream together in a large saucepan until hot, but not boiling. Whisk together the egg yolks and sugar in a bowl. Pour the hot milk and cream mixture over the eggs gradually, whisking all the time.  Pour everything back into a clean saucepan over a low heat and stir constantly until the mixture coats the back of a spoon. Remove from the heat and leave to cool.  Stir in the hazelnut syrup and then add the mixture to an ice cream machine. Churn according to manufacturer’s instructions until frozen.  Serve the apple, pear and blackberry crumble with a scoop of hazelnut ice cream.  ","ingredients":" 30g\/1oz butter ,  500g\/1lb 2oz Bramley apples, peeled, cored and roughly chopped,  500g\/1lb 2oz pears, peeled, cored and roughly chopped,  100g\/3½oz sugar (or to taste),  150g\/5½z frozen blackberries,  250g\/9oz unsalted butter ,  500g\/1lb 2oz plain flour,  125g\/4½oz soft light brown sugar ,  125g\/4½oz caster sugar,  125g\/4½oz roasted hazelnuts, skinned, roughly chopped,  1 orange, zest only,  500ml\/18fl oz milk ,  500ml\/18fl oz double cream,  7 free-range egg yolks,  30g\/1oz caster sugar,  2 tbsp hazelnut syrup  ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pear_apple_and_11326"}