{"recipe_name":"Pear and walnut upside-down cake with chocolate sauce","author":"Paul Rankin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4.   Grease a 23cm (9in) round or square cake tin with a little melted butter. Pour the melted butter into the cake tin.  Add the caster sugar and light brown sugar and stir together until the sugars are mixed into the butter. Peel, halve and core the pears. Arrange them attractively, curved-side down, in the butter\/sugar mix. Place the walnut halves between each pear half. To make the sponge batter, cream the butter and sugar until light and fluffy. Stir together all dry ingredients.   Break the egg, stir it lightly and add it slowly to the creamed butter and sugar.  Incorporate each addition fully before adding more.   By hand, lightly fold in the dry ingredients until the batter is well mixed, but not over-beaten.   Pour the batter over the pears and bake in the oven for 40 minutes, or until the cake is firm to the touch. Remove from the oven and cool at least ten minutes. Loosen the cake from the sides of the tin and invert it on to a rimmed plate. Most of the juices should have been absorbed by the pears but if any are left in the tin, spoon them onto the cake. Serve the cake warm, sliced into individual portions and arranged on warm plates with whipped cream and\/or toffee or chocolate sauce on the side. To make chocolate sauce, bring the milk and cream to the boil.  Remove from heat and leave to cool slightly.  Add the chocolate and then stir until well mixed and all the chocolate has melted. To reheat the sauce melt in a bowl over a pan of simmering water, or at about half power in the microwave for 1-2 minutes. ","ingredients":" 175g\/6oz butter, for greasing,  45g\/1½oz caster sugar,  45g\/1½oz light brown sugar,  2-3 ripe pears,  25g\/¾oz walnut halves, skinned and lightly roasted,  whipped cream and\/or toffee sauce or chocolate sauce, to serve,  45g\/1½oz unsalted butter,  75g\/2¾oz caster sugar,  50g\/1¾oz plain white flour,  2 tsp baking powder,  ½ teaspoon bicarbonate of soda,  salt,  ½ tsp ground cinnamon,  ¼ tsp ground cloves,  ¼ tsp ground nutmeg,  1 egg,  60ml\/2fl oz buttermilk,  150ml\/5fl oz milk,  50ml\/2fl oz whipping cream,  250g\/9oz dark chocolate, finely chopped or grated","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pearandwalnutupsided_70759"}