{"recipe_name":"Pear tarte tatin, fromage frais sorbet and star anise salt","author":"Ben Axford","programme":"MasterChef","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the lemon stock syrup, pour the water into a large pan and add the sugar and the peppercorns to the pan. When the sugar has dissolved, add the lemon rind and juice to the pan and stir. Transfer the lemon stock syrup to a suitable container to store in the fridge, and leave overnight. Pass through a sieve when ready to use, into a clean container. For the caramel for the tarte, place the water and sugar in a pan and heat to a deep caramel colour. Add the butter to the pan.   Peel and cut the pears in half, and core them. Dry them off in a clean tea towel. Roll out the puff pastry to 3mm thickness. Lay on a baking tray, cover in cling film and chill until ready to use. Pour the caramel into four 9cm (3½in) tart tins and add one half of a pear to each tart tin.   Remove the pastry from the fridge and cut out circles of pastry using a pastry cutter the same size as the tins.  Place the circles of pastry over each pear and tuck in around the edges with a knife. Cut a slash in the top of each tarte to allow some moisture to escape while cooking and chill.  Mix 350ml\/12¼oz of the lemon stock syrup with the fromage frais. Pour into an ice cream maker and freeze according to manufacturer's instructions. Crush together half a star anise with the fleur de sel in a pestle and mortar. Set aside. Place the caramelised almonds in a food processor and whiz into small pieces. Set aside. When you are ready to cook the tarts, preheat the oven to 230C\/450F\/Gas 8. Remove the tarts from the fridge, dredge with icing sugar and place on two baking trays. Transfer the baking trays to the oven and cook for 15-20 minutes until the pasty is crisp. Remove the tarts from the oven. Allow to rest for a few minutes and then turn each tart out onto a plate (taking care as the filling will be extremely hot). Transfer each tart to one of four serving plates.  Place a small amount of the crushed almonds on each plate, place a ball of sorbet on top of the almonds and sprinkle the star anise salt over the tarts. Serve at once. ","ingredients":" 500ml\/18fl oz water,  250g\/8¾oz caster sugar,  4 black peppercorns,  2 slices lemon rind,  1 lemon, juice only,  5 tbsp water,  250g\/8¾oz caster sugar,  50g\/1¾oz butter,  2 ripe Comice pears,  375g\/13¼oz shop-bought puff pastry (in a block),  350ml\/12¼oz lemon stock syrup (see above),  400g\/14¼oz fromage frais (6-8 per cent fat) ,  ½ star anise,  pinch fleur de sel,  150g\/5¼oz caramelised almonds,  icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/peartartetatinfromag_85712"}