{"recipe_name":"Peas, mint, girolles and seared scallops ","author":"Bryn Williams","programme":"Spring Kitchen with Tom Kerridge","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a pan, bring the stock and butter to the boil. Season with salt and pepper, add the peas and mushrooms and cook for 2-3 minutes, or until tender.  Remove the peas and mushrooms from the pan. Pour half the cream into the pan and bring to the boil. Cook until the volume of liquid has reduced to a sauce consistency.  Preheat the grill to hot. Put the egg yolks in a bowl and whisk in the reduced cream. Whisk the remaining cream until soft peaks form when the whisk is removed. Add the peas, mushrooms and the mint to the sauce, then add a spoonful of the whipped cream. Pour the mixture into a heatproof bowl and place under the grill for a few minutes, or until the vegetables are glazed and the sauce is bubbling. Heat a knob of butter in a frying pan until foaming. Place the prepared scallops in the hot pan and cook for a minute and a half on both sides, or until golden-brown and just cooked. In a bowl, mix the shallot with a little olive oil, lemon juice and a pinch of sugar.  To serve, divide the glazed peas and mushrooms between the serving plates. Place the scallops on top and put the shallot mix on top. Dress the plates with the pea shoots.  ","ingredients":" 250ml\/9fl oz chicken stock ,  50g\/1¾oz butter, plus extra for frying the scallops ,  sea salt,  black pepper,  150g\/5½oz fresh peas ,  100g\/3½oz girolles (chanterelle mushrooms),  200ml\/7fl oz double cream,  2 free-range egg yolks,  10 leaves fresh mint, chopped ,  4 large scallops (with or without roes, as preferred),  1 banana shallot, finely sliced ,  olive oil, to taste ,  lemon juice, to taste ,  pinch sugar ,  large handful pea shoots ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/peas_mint_girolles_and_53451"}