{"recipe_name":"Beef ragù and courgetti","author":"Hemsley + Hemsley","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the ghee or butter in a large saucepan and gently fry the onion over a low heat until softened but not browned (about 10 minutes). Add the garlic, bay leaves, mixed spice, oregano and fry for a further two minutes.  Increase the heat and add the beef to the pan, using a wooden spatula to break it up as you cook. After five minutes, add the chicken livers, pour in the red wine and stir to deglaze the pan, then add the tomatoes, tomato purée and bone broth or water. Bring to the boil, cover with a lid, leaving the lid just slightly off, then reduce to a gentle simmer, stirring occasionally, for 2½ hours, or until rich and thickened. It is even better after 3-4 hours. Keep an eye on it and add more liquid if needed. Add the grated carrots 15 minutes before the end of cooking. Turn up the heat to a medium simmer and season with sea salt, a good grind of pepper and the fresh parsley. Meanwhile, use a spiralizer or julienne peeler to make the spaghetti from the courgettes. This is the courgetti. Or you can use a regular vegetable peeler to slice the courgettes lengthways into very wide ribbons, which you can then slice in half. You might want to cut the long strands in half to make them easier to eat. Soften the courgetti in a pan with a little butter, stirring over a low heat for three minutes. Alternatively, save washing up another pan by just running some of the hot sauce through your spirals – the heat and salt in the sauce will soften them. Serve the courgette and beef ragù in bowls. Drizzle each bowl with extra virgin olive oil and serve with grated parmesan. ","ingredients":" 2 tbsp ghee or butter ,  2 onions, finely chopped ,  2 garlic cloves, finely chopped,  2 dried bay leaves,  ¼ tsp mixed spice (or try a tiny pinch of nutmeg),  2 tsp dried oregano,  400g\/14oz beef mince (chuck or braising steak - not lean meat),  100g\/3½oz chicken livers, trimmed and chopped,  250ml\/9fl oz red wine,  14 large tomatoes, roughly chopped, or 2 x 400g\/14oz tins chopped tomatoes or 800g\/1lb 12oz tomato passata ,  2 tsp tomato purée ,  200ml\/7fl oz bone broth or water (you won’t need much if using tinned tomatoes),  2 large carrots, finely grated ,  sea salt and freshly ground black pepper ,  1 large handful fresh parsley, finely chopped,  4 large courgettes ,  knob of butter,  extra virgin olive oil, to serve,  100g\/3½oz parmesan, grated, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_rag_and_courgetti_60735"}