{"recipe_name":"Pecan pie with cardamom ginger ice cream","author":"Mike Robinson","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the ice cream. In a mixing bowl, combine the caster sugar and egg yolks together. Beat the mixture until it is a thick yellow paste and set it aside.  Bring the semi-skimmed and the whole milk to a simmer in a heavy-based, medium-sized saucepan. Slowly beat the hot semi skimmed and whole milk mixture into the egg and sugar mixture. This mixture should be hot, but not boiling.  Return the mixture to the saucepan and simmer very gently, stirring constantly, for a few minutes until it thickens to a custard-like consistency. Strain the mixture into a large bowl, cool and chill overnight in a refrigerator.  The next day, stir in the double cream, vanilla, ginger and ground cardamom. Churn in an ice cream maker, following manufacturer's instructions, until frozen. Cover and freeze until required.  Preheat the oven to 170C\/325F\/Gas 3.  Make the pecan pies. In a saucepan, melt together the muscovado sugar and butter. Remove from the heat and stir in the honey, finely chopped pecans, beaten egg and cinnamon. Mix together thoroughly.  Pour the pecan mixture into the tartlet cases and top with the whole pecans.  Bake the pecan tarts for 20 minutes.  Serve the tarts warm from the oven topped with a scoop of the cardamom ginger ice cream. Decorate the serving plates with pecans and a drizzle of maple syrup. ","ingredients":" 55g\/2oz muscovado sugar,  110g\/4oz butter,  110ml\/4fl oz honey,  140g\/5oz pecans (65g\/2½oz finely chopped, remainder left whole),  1 egg, beaten ,  a pinch of ground cinnamon,  4 small deep sweet pastry tartlet cases, baked blind,  pecan halves, to decorate,  maple syrup, to decorate,  225g\/8oz caster sugar,  4 eggs, yolk only,  170ml\/6oz semi-skimmed milk,  170ml\/6oz full-fat milk,  340ml\/12fl oz double cream,  2 tsp vanilla extract,  1 heaped tbsp chopped stem ginger,  6-8 cardamom seeds, finely ground","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pecanpiewithcardamom_67749"}