{"recipe_name":"Peking-style duck with udon noodle soup","author":"Ching-He Huang","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Place all of the marinade ingredients into a shallow bowl and mix well to coat the duck. Marinate for as long as you can - preferably overnight, but anything more than 20 minutes will do. Heat a dry frying pan until just warm. Place the duck skin-side down and cook for 8-10 minutes, until golden brown. Turn up the heat, turn over the duck and cook for a further minute until crisp. Transfer to the oven and cook for 10-15 minutes. Remove from the oven and rest for five minutes, before slicing. For the noodle soup, pour the chicken stock into a saucepan and bring to a gentle simmer. Add the shiitake mushrooms and their soaking liquid, and the Chinese leaf. Add the light soy sauce, rice wine, rice vinegar and udon noodles to the pan. Bring to the boil. Scatter over the chopped spring onions, bean sprouts and coriander. Season to taste. To serve, ladle some of the noodle soup into a bowl, place the duck breast on top and serve straightaway. ","ingredients":" ½ tsp Chinese five-spice powder,  1 tbsp sesame oil,  3 tbsp hoi sin sauce,  3 tbsp brown sugar,  3 tbsp water,  1 tbsp dark soy sauce,  2 x 175g\/6 oz duck fillets, skin on ,  1 litre\/35fl oz chicken stock,  2 dried shiitake mushrooms, soaked in 200ml hot water for 20 minutes,  100g\/4oz Chinese leaf, shredded,  1  tbsp light soy sauce,  1  tbsp rice wine,  1  tbsp rice vinegar,  200g\/8oz flat udon noodles, cooked ,  3 spring onions, sliced on the diagonal,  40g\/2oz bean sprouts,  1 large handful coriander, roughly chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pekingstyleduckwithu_83641"}