{"recipe_name":"Peking-style vegetable dumplings","author":"Ed Baines","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/pekingvegetabledumpl_91214_16x9.jpg","method":"Heat half a tablespoon of the oil in a wok over a high heat. Add the morning glory, pak choi, shiitake mushrooms, red onion, bamboo shoots and bean sprouts and stir fry for 2-3 minutes, or until the vegetables have softened slightly.  Remove from the heat and add the coriander and chilli. Season with salt and freshly ground black pepper and allow to cool. Lay the wonton wrappers on a clean surface. Place one tablespoon of the fried vegetables in the centre of each wrapper. Using a pastry brush, brush the edges of each wrapper with the cornflour paste. Fold the sides together to create a semi-circular wonton shape. Place the wontons in a steamer over boiling water, and steam for six minutes. Remove and allow to cool. Heat the rest of the oil in a shallow pan until hot. Place the steamed wontons one by one into the hot oil and cook on one side until golden-brown. Remove with a slotted spoon and drain on kitchen paper before serving. Serve with hot and sour sauce. ","ingredients":" 4 tbsp vegetable oil,  50g\/1他oz morning glory, finely sliced (available in some Asian markets; substitute spinach if unavailable),  50g\/1他oz pak choi, finely sliced,  50g\/1他oz fresh shiitake mushrooms, finely sliced,  1 small red onion, finely sliced,  25g\/1oz bamboo shoots, finely sliced,  50g\/1他oz bean sprouts,  small handful fresh coriander, finely chopped,  1 red chilli, seeds removed, finely chopped,  salt and freshly ground black pepper ,  8 circular wonton wrappers (for vegan versions, look for egg-free wrappers),  1 tsp cornflour, mixed to a paste with 1 tsp water,  vegetable oil, to shallow fry,  ready-made hot and sour sauce, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pekingvegetabledumpl_91214"}