{"recipe_name":"Pembrokeshire seafood","author":"James Martin","programme":"James Martin's Food Map of Britain","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2-4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/pembrokeshire_seafood_29704_16x9.jpg","method":"Prepare the shellfish by cleaning the shells and removing any beards from the mussels. Discard any with open shells that do not close when given a sharp tap. Place all the seafood in a large, hot pan. Add the white wine, cover with a lid and cook for 2-3 minutes. Discard any shells that have not opened. Strain and reserve the cooking liquor. Remove all the flesh from the shells and chop the white meat from the razor clams into 2cm\/1in pieces. Place the razor clam shells onto a serving plate or flat stone. In the same pan, melt half of the butter and add the samphire. Season generously with pepper and cook for 1-2 minutes. Spoon the cooked samphire into the razor clam shells.  Add the remaining butter to the pan along with the shallot and garlic. Gently fry for 1-2 minutes, then add the reserved cooking liquor (taking care not add the dregs from the bottom of the bowl). Stir in the cream and simmer until the volume of liquid is reduced by half and the sauce is thick enough to coat the back of a spoon. To finish, add the seafood and tomatoes to the sauce and gently warm through. Season to taste with salt and pepper then add the lemon juice.  Spoon the sauce over the samphire and top with red seaweed to serve. ","ingredients":" 500g\/1lb 2oz clams,  250g\/9oz mussels, cleaned,  500g\/1lb 2oz razor clams,  150ml\/5fl oz white wine,  25g\/1oz dulse butter (alternatively use salted butter),  100g\/3½oz samphire,  black pepper,  1 shallot, finely chopped,  1 garlic clove, crushed ,  100ml\/3½fl oz cream,  2 tomatoes, skin and seeds removed, cut into 1cm\/½in cubes ,  1 lemon, juice only,  10g red seaweed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pembrokeshire_seafood_29704"}