{"recipe_name":"Beef rendang ","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beef_rendang_62793_16x9.jpg","method":"In a food processor combine the lemongrass, onions, garlic, ginger, galangal and chillies. Blend to a fine paste (you may need to remove the lid and push the mixture down a couple of times with spatula until the right consistency is reached). Heat the sunflower oil in a large flame-proof casserole and fry the paste gently for 3-4 minutes, stirring constantly. Add the cumin, coriander and turmeric and cook for two minutes. Add the beef to the pan and stir to coat in the paste and spices. Cook for five minutes, stirring constantly until the meat is very lightly coloured all over. Pour the coconut milk and 400ml\/14fl oz cold water into the casserole. Add the lime leaves, cinnamon stick, sugar, tamarind paste or lime juice, soy sauce and salt and bring to a simmer.  Reduce the heat and leave to gently simmer uncovered for about 2½-3 hours, or until the meat is meltingly tender and the sauce is very thick, glossy and rich. Stir the beef occasionally towards the beginning of the cooking time then more often as the coconut milk reduces. You don’t want the sauce to stick. Season to taste with more salt and freshly ground black pepper. Spoon the curry into warm serving dishes, pick out the kaffir lime leaves and cinnamon stick, and sprinkle with the toasted coconut, if using. ","ingredients":" 2 lemongrass stalks, dry outer leaves removed, roughly chopped ,  3 medium-sized red onions, quartered,  6 garlic cloves, peeled,  25g\/1oz fresh root ginger, peeled and roughly chopped,  75g\/2½oz chunk galangal, peeled and roughly chopped ,  3 plump red chillies, roughly chopped without deseeding ,  3 tbsp sunflower oil,  2 tsp ground cumin,  1 tbsp ground coriander,  1 tsp ground turmeric,  1.5kg\/3lb 5oz beef chuck steak (or any good braising beef), trimmed and cut into 3cm\/1¼in cubes,  400ml\/14fl oz can coconut milk,  4 fresh kaffir lime leaves,  1 cinnamon stick,  1 tbsp soft light brown sugar or palm sugar,  2 tsp tamarind paste or freshly squeezed juice of 1 lime,  2 tbsp dark soy sauce,  2 tsp flaked sea salt, plus extra to season,  ground black pepper,  toasted coconut flakes, to serve (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_rendang_62793"}