{"recipe_name":"Beef rendang with mango chutney and sticky rice","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the beef rendang, pound the lemongrass to a pulp in a pestle and mortar.  Gently toast the coriander seeds, cumin seeds and turmeric, star anise and cardamom in a dry frying pan until fragrant, then grind until the spices are as smooth as possible. In a wide pan (or cast-iron wok), heat the block of coconut cream until it melts, but keep the heat low so it does not burn. Add the onions, garlic, chillies, ginger and pounded lemongrass and cook gently until the onions have softened and the mixture starts to smell beautiful and fragrant.  Add the ground spices and the bay leaf and fry for a few minutes more until the mixture is really bursting with aroma. Stir in the beef and increase the heat so that it browns it well and is completely coated with the spices – this will take a few minutes.  Add the coconut milk, bring to the boil and then add the hot stock. Turn the heat up to high and continue cooking - the amount of liquid will quickly reduce. Only stir occasionally until the sauce reduces to a thick paste. Reduce the heat and keep cooking and stirring until the sauce becomes thick like lava and really coats the meat – at least 1-1½ hours. For the mango chutney, heat a frying pan until hot. Add all the spices and toast for 30 seconds, or until the mustard seeds start to pop. Add the green mango and ripe mangoes and cook for 1-2 minutes. Add the sugar and cook until dissolved into the mango juices, then add the vinegar. Cover with a lid and reduce the heat. Simmer for 25 minutes, or until the mango has broken down and the mixture resembles chutney. For the sticky rice, rinse the rice three times and drain thoroughly. Cook the rice according to the packet instructions, or place it in a saucepan and cover with water up to the first knuckle on your finger. Add the salt, cover with a lid and bring to the boil. Boil for five minutes, then, without opening the lid, turn the heat off and let the rice steam for 20 minutes.  To serve, pile the rice onto serving plates, and add the beef rendang alongside with a spoonful of the mango chutney. ","ingredients":" 1 lemongrass stalks, roughly chopped,  20g\/¾oz coriander seeds,  ½ tsp cumin seeds,  ½ tsp ground turmeric,  1 star anise,  3 cardamom pods, crushed and seeds removed,  50g\/1¾oz coconut cream,  1½ large onions, sliced,  3 garlic cloves, chopped,  3 red chillies, seeds removed, chopped,  1 thumb-sized piece fresh root ginger, peeled and chopped,  1 bay leaf,  750g\/1lb 10oz beef shin, boneless and cut into 2.5cm\/1in cubes,  1 x 400g\/14oz tin coconut milk,  250ml\/9fl oz strong veal or beef stock, heated,  1 tsp black mustard seeds,  1 tsp black peppercorns,  1 tsp cumin seeds,  1 tsp dried chilli flakes,  1 tsp coriander seeds,  1 green (under ripe) mango, sliced,  2 ripe mangoes, sliced,  125g\/4½oz light soft brown sugar,  110ml\/3¾fl oz malt vinegar,  400g\/14oz sticky rice,  1 tsp salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_rendang_with_mango_78223"}