{"recipe_name":"Penne pasta with pancetta and parsley and Little Gem salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to its highest setting. For the pasta, place the pancetta slices onto a tray and place under the grill for 2-3 minutes, or until crisp and golden-brown. Meanwhile, heat a frying pan until hot. Add the pancetta cubes and cook for 3-4 minutes, until golden-brown all over. Bring a large pan of salted water to the boil and add the pasta. Cook according to packet instructions or until al dente. While the pasta is cooking, mix the egg yolks, cream and freshly grated parmesan together in a bowl. Season the mixture well with salt and freshly ground black pepper, then add the flatleaf parsley and cooked pancetta cubes. Drain the pasta and quickly add to the eggs and cream mixture. Add a little olive oil and check the seasoning, adding more salt and freshly ground black pepper if necessary. Spoon the pasta and sauce into bowls and top with parmesan shavings and a little extra freshly ground black pepper. Serve with the grilled pancetta slices on the top. For the salad, heat a clean frying pan until hot. Add one tablespoon of the olive oil and the bread cubes. Fry until golden-brown all over to make croûtons. Place the Little Gem leaves into a large salad bowl and add the croûtons. Whisk the remaining olive oil and the vinegar together in a clean bowl and season with salt and freshly ground black pepper. Pour the dressing over the salad, mix well to combine, and serve with the pasta. ","ingredients":" 4 slices pancetta,  175g\/6oz pancetta, cut into cubes,  250g\/10½oz fresh penne pasta,  3 free-range egg yolks,  110ml\/4fl oz double cream,  175g\/6oz parmesan, grated, plus parmesan shavings, to serve,  salt and freshly ground black pepper,  6 tbsp flatleaf parsley, roughly chopped,  2 tbsp extra virgin olive oil,  3 slices crusty bread, cut into cubes,  4 tbsp extra virgin olive oil,  2 Little Gem lettuce, leaves separated,  1 tbsp red wine vinegar,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pennewithpancettaand_88250"}