{"recipe_name":"Beef steak burger with truffle mayonnaise, tomato chutney in a brioche bun with fries","author":"James Martin","programme":"Christmas Kitchen","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the burger and fries, put the mince in a large bowl and season with salt and pepper. Use your hands to shape the mince into four burger-shaped patties. Wrap the patties individually in cling film and place in the fridge for an hour. Meanwhile, for the tomato chutney, heat the oil in a small pan. Add the shallot, tomatoes and garlic and cook for 5-8 minutes until softened. Add the vinegar and sugar and cook for 3-5 minutes until the chutney has caramelised slightly. For the truffle mayonnaise, put the egg yolks, mustard and a pinch of salt and pepper in a food processor and combine. Mix the oils in a jug, then, with the motor running, slowly pour oil through the feed tube until you have a thick emulsion. Mix in the lemon juice and a little warm water to loosen, if necessary.  The mayonnaise will keep for up to 2 days in the fridge. Just before serving, stir in the truffle shavings. When you are ready to cook the burger and fries, heat the vegetable oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep saucepan until a cube of bread sizzles and turns brown when dropped in. (CAUTION: Hot oil can be dangerous; do not leave unattended.)  Carefully add the potatoes to the fryer and cook for 2-3 minutes, or until just coloured and crisp. Remove from the pan using a slotted spoon and set aside to drain on a plate lined with kitchen paper. Season with salt. Heat a large frying pan with a little oil. Cook the burgers on each side for 2-3 minutes, or until cooked to your liking (you can serve the burger rare as you are using fresh steak mince). To serve, put each burger in a brioche roll topped with the gherkins, tomato slices, chutney, lettuce, a few onion slices and the truffle mayonnaise. Secure with a wooden skewer and serve with the fries. ","ingredients":" 500g\/1lb 2oz minced beef steak,  2 large chipping potatoes, peeled and cut into thin fries,  vegetable oil, for deep-frying,  4 brioche rolls,  8 gherkins, sliced,  4 beef tomatoes, sliced,  ½ round lettuce, leaves separated,  1 red onion, sliced,  1 tbsp olive oil,  ½ shallot, chopped,  1½ tomatoes, chopped,  1 garlic clove, crushed,  1 tbsp balsamic vinegar,  1 tsp brown sugar,  3 egg yolks ,  2 tsp Dijon mustard ,  150ml\/5fl oz light olive oil ,  100ml\/3½fl oz sunflower oil ,  50ml\/2fl oz truffle oil,  2 tbsp lemon juice ,  few shavings of black truffle (optional),  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_steak_burger_with_02716"}