{"recipe_name":"Peppered pork on potato rosti with braised red cabbage","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the pork, heat the olive oil in an ovenproof frying pan. Season the pork fillet with salt and freshly ground black pepper and add to the pan. Cook for 2-3 minutes, turning regularly, until coloured on all sides. Transfer to the oven and roast for 10-12 minutes, or until cooked through. Leave to rest in a warm place for a few minutes before serving. Meanwhile, for the red cabbage, heat a tablespoon of the olive oil in a pan and fry the onion for 4-5 minutes until softened but not browned.  Add the wine, vinegar, honey, sugar and mixed spice. Season, to taste, with salt and freshly ground black pepper. Stir in the red cabbage and cook over a gentle heat for 15-20 minutes, or until the cabbage has softened. For the potato rosti, heat a heavy-bottomed pan. Coarsely grate the potato and squeeze dry in a clean tea towel. Season, to taste, with salt and freshly ground black pepper. Divide the mixture in two and shape into rounds. Add the olive oil and the butter to the pan, then add the potato rostis and fry for five minutes on each side, until crisp and golden brown. To serve, carve the pork into thick slices. Place the potato rostis on the plates and top with the slices of pork. Serve the red cabbage on the side. ","ingredients":" 1 tbsp olive oil,  225g\/8oz pork tenderloin, fat and membrane trimmed,  salt and freshly ground black pepper,  1 tbsp olive oil,  ½ onion, thinly sliced,  4 tbsp red wine,  1 tbsp red wine vinegar,  2 tbsp clear honey,  1 tbsp light muscovado sugar,  pinch ground mixed spice,  salt and freshly ground black pepper,  1 small red cabbage, finely shredded,  1 large potato,  salt and freshly ground black pepper,  1 tbsp olive oil,  knob of butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pepperedporkonpotato_87791"}