{"recipe_name":"Peppered pork with citrus garlic sauce and potato and bean mash","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the peppered pork, place the pork chops between two sheets of cling film and flatten with a meat mallet or rolling pin. Place the peppercorns, coriander seeds and salt into a pestle and mortar. Grind together, then place the spice mixture into a bowl. Add the parsley and stir well. Rub the spice mixture all over the pork. Heat the oil in a frying pan and cook the pork for 3-4 minutes on each side, or until completely cooked through. Remove from the pan and leave to rest. For the potato and bean mash, heat the oil in a pan and gently fry the onion until softened. Place the cooked potatoes into a large bowl with the broad beans and butter and mash together using a potato masher. Add the chives, season with salt and freshly ground black pepper and mix well. For the citrus garlic sauce, heat the butter and oil in a pan and gently fry the garlic for one minute. Add the wine and orange juice and simmer until reduced by half. For the caramelised oranges, heat the oil in a frying pan and cook the orange slices for a minute on each side, until caramelised. To serve, place the potato and bean mash onto plates and top with the peppered pork. Drizzle over the sauce and top with the caramelised orange slices. ","ingredients":" 2 x 150g\/5½oz pork chops, bones removed and fat trimmed off ,  1 tbsp black peppercorns,  1 tbsp coriander seeds ,  1 tbsp sea salt,  2 tbsp chopped fresh parsley,  1 tbsp olive oil,  1 tbsp olive oil,  ½ onion, finely sliced,  200g\/9oz new potatoes, boiled until tender and drained,  50g\/1½oz broad beans, blanched, skins removed,  50g\/1½oz unsalted butter,  1 tbsp chopped fresh chives,  salt and freshly ground black pepper ,  50g\/1½oz unsalted butter,  1 tbsp olive oil,  2 garlic cloves, finely chopped,  50ml\/2fl oz white wine,  1 orange, juice only,  1 tbsp olive oil,  2 orange slices","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pepperedporkwithcitr_85557"}