{"recipe_name":"Peppered steak, sweet potato, griddled fennel and balsamic blueberry sauce","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Place the sweet potato into a pan of boiling water and boil for ten minutes, until soft. Drain off the water then mash and season, to taste, with salt and freshly ground black pepper. Meanwhile, heat an ovenproof griddle pan until smoking. Place the fennel and lemon juice in a bowl and mix well. Place the fennel onto the hot griddle pan and griddle for four minutes on each side, until softened and browned. Squeeze over the orange juice and transfer to the oven to roast for five minutes. To make the sauce, heat the olive oil in a small frying pan over a medium heat. Add the shallot and fry until soft. Add the balsamic vinegar, blueberries and freshly ground black pepper, then bring to the boil and reduce the liquid volume by half. For the steak, rub the steak with olive oil and black pepper. Heat a griddle pan until smoking then add the steak and griddle for three minutes on each side, or until cooked to your liking. Remove from the heat and rest the steak on a warm plate for one minute. To serve, place the sweet potato mash into the centre of a warm plate. Place the steak on top of the mash and place the fennel onto the steak. Drizzle the blueberry sauce around the plate. ","ingredients":" 200g\/7oz sweet potato, peeled and chopped,  ½ fennel bulb, chopped and blanched,  ½ lemon, juice only,  ½ orange, juice only,  1 tbsp olive oil,  2 shallots, roughly chopped,  1 tbsp balsamic vinegar,  75g\/2¾oz blueberries,  ½ tsp freshly ground black pepper,  salt and freshly ground black pepper,  1 tsp olive oil,  1 tsp coarsely ground black pepper,  200g\/7oz beef fillet","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pepperedsteaksweetpo_80866"}