{"recipe_name":"Peppered steak with roasted courgette, dauphinoise brie potatoes and pesto","author":"James Martin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. To make the roasted courgettes, place the olive oil into an ovenproof frying pan over a medium heat. Add the thyme, chilli flakes and fry for a minute. Add the courgette cubes and fry gently for five minutes. Transfer to the oven and cook for a further five minutes, until the courgette is cooked through. To make the pesto, place the flatleaf parsley, basil and olive oil into a food processor. Season, to taste, with salt and freshly ground black pepper and blend until smooth and transfer to a small serving bowl. To make the dauphinoise, place a small saucepan over a medium heat. Place all of the dauphinoise ingredients into the pan, bring to the boil and reduce the heat to a simmer. Stir well and simmer for five minutes, until the cheese has melted and the potato and onion are cooked through. Season, to taste, with salt and freshly ground black pepper and transfer to a gratin dish. Place the dish under the grill and cook the dauphinoise for a further five minutes, or until golden brown. To make the peppered steak, rub the steak with olive oil, season, to taste, with salt and rub all over with the black pepper. Place the vegetable oil in a frying pan over a high heat. Add the steak and fry for 1½ minutes each side, or until cooked to your liking. Remove the steak from the pan to rest for 2-3 minutes. To serve, place the courgettes in the centre of the plate. Drizzle with the pesto and place the steak on top. Serve the dauphinoise alongside in the gratin dish it cooked in. ","ingredients":" 1 tbsp olive oil,  1 tsp thyme,  pinch dried chilli flakes,  ½ courgette cut into thick cubes,  small bunch fresh flatleaf parsley,  small bunch fresh basil,  2 tbsp olive oil,  salt and freshly ground black pepper, to taste ,  1 potato, peeled and thinly sliced,  2 garlic cloves, thinly sliced,  ½ medium onion, thinly sliced,  150g\/5½oz brie,  250ml\/9fl oz double cream,  100ml\/3½fl oz milk,  salt and freshly ground black pepper, to taste ,  150g\/5½oz rump steak,  1 tbsp olive oil,  Salt, to taste,  1 tbsp freshly ground black pepper,  1 tbsp vegetable oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pepperedsteakwithroa_79706"}