{"recipe_name":"Peppered steak with roasted asparagus, 'drunken' potatoes, roasted tomatoes and mustard sauce","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the peppered steak, rub the steak with the oil and press the chopped garlic and cracked pepper onto one side. Heat a griddle pan until smoking hot and sear the beef on both sides, then transfer the pan to the oven to continue cooking for about five minutes, or until cooked to your liking. Remove from the oven and leave to rest in a warm place. For the roasted asparagus and tomatoes, place the asparagus and tomatoes onto a baking sheet and drizzle over the olive oil. Season with salt and freshly ground black pepper. Sprinkle the sugar over the tomatoes. Place in the oven to roast for about 6-7 minutes, or until tender. For the 'drunken' potatoes, heat the oil and butter in an ovenproof frying pan and fry the potato slices until they start to colour. Add the wine and season, to taste, with salt and freshly ground black pepper. Transfer the pan to the oven for about 5-7 minutes, or until the potatoes are tender. For the mustard sauce, heat the wine in a small pan and simmer until reduced by half. Stir in the mustard and cream and bring to a simmer. To serve, place the 'drunken' potatoes onto a serving plate. Slice the beef and arrange on top, followed by the asparagus and tomatoes. Drizzle over the mustard sauce. ","ingredients":" 150g\/5½oz sirloin steak,  1 tbsp olive oil,  1 garlic clove, finely chopped,  1 tsp black peppercorns, cracked in a pestle and mortar,  1 bunch asparagus, trimmed,  2 tomatoes, halved,  3 tbsp olive oil,  salt and freshly ground black pepper,  2 tsp caster sugar,  1 tbsp olive oil,  25g\/1oz butter,  100g\/3½oz Anya potatoes, sliced into 1cm\/½in thick slices,  75ml\/2½fl oz white wine,  salt and freshly ground black pepper,  75ml\/2½fl oz white wine,  1 tsp Dijon mustard,  75ml\/2½fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pepperedsteakwithroa_88528"}