{"recipe_name":"Pepperoni pizza","author":"Lorraine Pascale","programme":"The Hairy Bikers and Lorraine Pascale: Cooking the Nation's Favourite Food","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 240C\/220 Fan\/Gas 9.  For the pizza dough, place the flour, yeast and salt into a large mixing bowl and stir to combine. Make a well in the centre of the dry ingredients and pour in the warm water and oil. Mix the wet ingredients into the dry ingredients using first a wooden spoon, then your hands, until the mixture comes together as a soft ball of dough.  Turn out the dough onto a lightly floured work surface and knead it thoroughly for 8-10 minutes, or until the dough has become smooth and springy to the touch and is no longer sticky. Use a floured finger to make an indent in the surface of the dough; it should spring back when the dough is ready. Dust the work surface again with a little more flour, then roll out the pizza dough, moving it around on the work surface as you roll to keep the shape circular and prevent the dough from sticking, until you have a large, thin disc. Press your fingertips down into the dough all over the pizza base. This prevents it from rising too much during cooking. For the topping, spread the passata over the pizza base, leaving a 2cm\/1in gap around the edge. Season, to taste, with salt and freshly ground black pepper. Scatter over the roasted pepper slices, pepperoni slices and pieces of mozzarella.  Bake the pizza in the oven for 10-15 mins, or until the base is crisp and starting to char around the edges. Before serving, drizzle over a little olive oil, garnish with the basil sprigs, and season again with a grinding of black pepper. ","ingredients":" 300g\/10½oz strong white flour, plus extra for dusting,  1x 7g sachet fast-action yeast,  1½ tsp salt,  175ml\/6fl oz warm water,  3 tbsp extra virgin olive oil, plus extra for greasing,  100ml\/3½fl oz passata,  1 roasted red pepper, skin removed, sliced (or 200g\/7oz jar small, piquant roasted peppers, available from delicatessens and online),  200g\/7oz pepperoni, sliced into rounds,  200g\/7oz mozzarella, broken into pieces or sliced,  drizzle extra virgin olive oil,  few sprigs fresh basil leaves,  salt and freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pepperoni_pizza_46786"}