{"recipe_name":"Beef stew with dumplings ","author":"Nigel Slater","programme":"Nigel Slater: Eating Together","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beef_stew_with_dumplings_15297_16x9.jpg","method":"For the beef stew, heat the oil in a large, lidded casserole over a medium heat. Fry the chuck steak for 3-4 minutes, until browned on all sides. Remove from the pan and set aside. Add the onions, carrot, celery and swede and fry for 6-8 minutes, or until golden-brown, adding a little more olive oil if need be. Season with salt and pepper. Add the plain flour and stir well. Cook for 1-2 minutes, or until it turns a nut-brown colour. Pour in the stock and stir well until the sauce thickens. Return the beef to the casserole, add the red wine and bay leaves and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then leave to simmer gently for 1 hour with the lid slightly ajar. Meanwhile, for the suet dumplings, combine the flour, suet, baking powder and salt in a bowl until well combined. Add the water gradually, stirring the mixture with your fingers, until it comes together as a slightly sloppy dough. Shape the dough into balls roughly the size of a plum. For the herby oat dumplings, combine the oatmeal, flour, baking powder, salt and herbs in a mixing bowl until well combined. Grate the chilled butter into the bowl and mix again. Bring the dough together with your fingers, gradually adding enough water, as before, to make a wet dough. Shape the dough into plum-sized balls. When the stew has been simmering for an hour, season it again with salt and pepper, if necessary. Put the dumplings on top of the stew, cover the casserole with the lid, and cook for a further 15-20 minutes, or until the dumplings have proudly puffed up. Serve.  ","ingredients":" 4 tbsp olive oil,  500g\/1lb 2oz chuck steak, cubed,  2 onions, roughly chopped,  1 large carrot, peeled, roughly chopped,  1 celery stalk, trimmed, roughly chopped,  ½ swede, peeled, roughly chopped,  2 tbsp plain flour,  1 litre\/1¾ pints beef stock,  400ml\/14fl oz red wine,  2 bay leaves,  salt and freshly ground black pepper,  125g\/4½oz plain flour,  65g\/2¼oz shredded suet,  1 tsp baking powder,  1 tsp salt ,  4-5 tbsp cold water, to mix,  70g\/2½oz fine oatmeal,  70g\/2½oz plain flour,  1 tsp baking powder,  1 tsp salt,  1 tbsp chopped fresh parsley,  2 tsp chopped fresh rosemary leaves,  2 tsp fresh thyme leaves,  80g\/2¾oz chilled butter ,  4-5 tbsp cold water, to mix","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_stew_with_dumplings_15297"}