{"recipe_name":"Perfect cauliflower cheese with bacon and mushrooms ","author":"The Hairy Bikers","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/perfect_cauliflower_27405_16x9.jpg","method":"For the cauliflower, cook the florets in a large pan of boiling water for about 10 minutes, or until just tender. Drain and set aside.  Meanwhile for the béchamel sauce, fry the bacon strips in a dry frying pan until coloured but not crisp. Remove the bacon with a slotted spoon and set aside, keeping the bacon fat in the pan.  Add the mushrooms to the pan of bacon fat and fry for 2-3 minutes, or until golden-brown. Remove from the pan and set aside.  Melt the butter in a clean saucepan and beat in the flour until smooth. Slowly whisk in the milk until smooth, then stir in the mustard powder, grated cheese and double cream. Keep stirring until the cheese has melted and the mixture is thick and creamy. Season to taste with salt and freshly ground black pepper, then fold in the bacon and mushrooms.  Preheat the oven to 180C\/350F\/Gas 4.  Place the cauliflower florets into an ovenproof casserole dish and pour over the cheesy sauce. Sprinkle over a pinch of freshly grounded nutmeg.  For the topping, mix the ciabatta breadcrumbs with the parmesan cheese, then sprinkle the mixture over the cauliflower. Place into the oven for 15 minutes, or until the topping is golden-brown and bubbling.  Spoon the cauliflower cheese onto plates and serve with a crisp green salad and crusty bread.  ","ingredients":" 1 head cauliflower, trimmed and broken into florets,  250g\/9oz smoked streaky bacon, cut into 1cm\/½in strips ,  250g\/9oz chestnut mushrooms, finely sliced,  25g\/1oz butter,  50g\/2oz plain flour,  250ml\/9fl oz full-fat milk,  pinch English mustard powder,  200g\/7oz gruyère cheese, grated,  55ml\/2fl oz double cream,  salt and freshly ground black pepper,  pinch ground nutmeg,  50g\/2oz ciabatta breadcrumbs,  50g\/2oz parmesan cheese, finely grated,  green salad,  crusty bread","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/perfect_cauliflower_27405"}