{"recipe_name":"Beef stew with fluffy dumplings","author":"James Martin","programme":"Home Comforts at Christmas","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beef_stew_with_fluffy_95002_16x9.jpg","method":"Dredge the beef in the flour until coated. Heat half of the vegetable oil in a large, lidded casserole dish over a high heat. Fry the beef, in batches, until browned on all sides, about 3-4 minutes. Remove and set aside. Add the onions, carrots and celery to the casserole and fry for 2-3 minutes. Add the tomato purée, stir well, then cook for a further 1-2 minutes. Pour in the red wine, bring it to the boil, then reduce the heat until the mixture is simmering and simmer until it has reduced in volume by half. Add the beef stock and return the mixture to a simmer. Return the beef to the casserole and stir well.  Tie the herbs together as a bouquet garni using cooking string and add it to the casserole. Finally, stir in the garlic.  Cover the stew with the lid and simmer gently for 1½ hours, or until the beef is really tender. For the dumplings, in a bowl, mix together the flour, baking powder, suet, chopped parsley and a pinch of salt, then gradually add 3-5 tablespoons water, mixing as you do so, until the mixture comes together as a slightly sticky dough (you might not need to use all of the water).  Turn out the dough onto a lightly floured work surface and roll into small balls, each half the size of a golf ball. Set aside until the stew is ready. Remove the bouquet garni from the stew, season, to taste, with salt and freshly ground black pepper, then stir in the butter and redcurrant jelly. Top the stew with the dumplings, cover the casserole with the lid, then return to the oven for 10-15 minutes, or until the dumplings have puffed up and are cooked through. Serve in bowls. ","ingredients":" 1kg\/2lb 4oz silverside beef, cut into large pieces,  1 tsp plain flour,  2 tbsp vegetable oil,  2 onions, cut into chunks,  3 carrots, scrubbed and cut into large pieces,  4 sticks celery, cut into large pieces,  1 tbsp tomato purée,  300ml\/10½fl oz red wine,  500ml\/18fl oz beef stock,  2 sprigs fresh parsley,  1 bay leaf,  3 sprigs fresh thyme,  2 garlic cloves, finely sliced,  25g\/1oz butter,  1 tsp redcurrant jelly,  200g\/7oz plain flour, plus extra for dusting,  1½ tsp baking powder,  100g\/3½oz suet, shredded ,  2 tbsp finely chopped flatleaf parsley,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_stew_with_fluffy_95002"}