{"recipe_name":"Perfect vegetable spring rolls","author":"Ching-He Huang","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a wok over a high heat until it starts to smoke. Add the groundnut oil. Add the ginger and stir-fry for a few seconds. Tip in the mushrooms, bamboo shoots and water chestnuts. Stir-fry for 1–2 minutes, season with 1 tablespoon of the soy sauce and the five-spice powder. Add a small splash of water around the edges of the wok to help create some steam. Remove from the wok and set aside to cool, this should take about 30 minutes to 1 hour.  Put the beansprouts, cavolo nero, spring onions and carrot in a bowl. Add the remaining 1 tablespoon of soy sauce, oyster sauce, toasted sesame oil, salt and pepper. Stir together to mix.  Once cooled add in the mushroom mixture and stir well to combine.  Arrange one spring roll wrapper so that the corners are pointing upwards, downwards and to the sides. Spoon 2 teaspoons of the filling starting at the bottom corner about 2cm\/¾in from the edge. (Make sure the filling is cool but not too wet – otherwise the spring roll will be soggy and you will break the spring roll wrapper.) Roll over the filling, squeezing any air out as you roll away from you. As you reach the middle bring the two corners that are pointing to the side to the middle making sure they overlap. Continue to roll  and tuck the top edge in and seal it with a little of the beaten egg. Repeat with the remaining spring roll wrappers and filling. Half-fill a large saucepan or deep-fat fryer with the oil. Heat the oil to 180C\/350F. (A 2cm\/1in cube of bread should go brown and crisp in 1 minute when dropped into the oil.). Deep-fry the spring rolls for 5-6 minutes swishing them in the fryer until golden-brown crisp. Remove with a slotted spoon and drain on kitchen paper. Serve with Thai sweet chilli sauce.  ","ingredients":" 1 tbsp groundnut oil,  1 tsp grated, peeled fresh root ginger,  100g\/3½oz fresh shiitake mushrooms or soaked porcini mushrooms, sliced, stalks removed,  100g\/3½oz tinned bamboo shoots, drained and cut into matchsticks,  50g\/1¾oz tinned water chestnuts, drained, sliced into small strips,  2 tbsp low-sodium, light soy sauce,  1 tbsp Chinese five-spice powder,  75g\/2¾oz beansprouts, must be very fresh,  2 leaves of cavolo nero, washed, shredded,  2 large spring onions, sliced lengthways,  1 small carrot, peeled, cut into matchsticks,  1 tbsp of oyster sauce or vegetarian oyster sauce,  1 tsp toasted sesame oil,  pinch sea salt,  pinch ground white pepper,  25-30 large spring roll wrappers (15x15cm\/6x6in square), frozen variety, defrosted (see tip),  1 medium free-range egg, lightly beaten ,  peanut oil, for deep-frying ,   Thai sweet chilli sauce, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/perfect_vegetable_spring_12478"}