{"recipe_name":"Perry jelly and summer fruits with elderflower ice cream","author":"Mark Hix","programme":"Great British Menu","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the elderflower ice cream, bring the milk to the boil in a heavy-based saucepan, then remove from the heat. Whisk the egg yolks and sugar together in a bowl, pour in the milk and whisk well. Return to the pan and cook over a low heat for about five minutes, stirring constantly with a whisk. Do not boil. Remove from the heat and whisk in the cream and elderflower cordial. Leave to cool, then churn in an ice cream machine (according to manufacturer's instructions) until thickened. Decant into a clean container and place in the freezer. For the perry jelly and summer fruits, immerse the gelatine leaves one at a time in a shallow bowl of cold water and leave for a minute or so until soft. Bring 100ml\/3½fl oz of the perry to the boil in a medium saucepan, add the sugar and stir until dissolved. Drain and squeeze the gelatine leaves, then add to the hot perry and stir until melted. Remove from the heat, add the rest of the perry and stir well. Put the pan of jelly somewhere cool, but do not let it set.  Divide half the berries among four individual jelly moulds, or use one large mould. Pour in half of the cooled jelly. Chill for an hour or so to set, then top up with the rest of the berries and unset jelly. (This ensures the berries stay suspended and don't float to the top.) Return to the fridge to chill until set.  To serve, turn the jellies out onto plates and place a scoop of the elderflower ice cream in the middle of each one. ","ingredients":" 300ml\/½ pint whole milk, preferably Channel Island ,  6 medium free-range egg yolks ,  100g\/4oz caster sugar,  300ml\/½ pint Jersey or clotted cream, or a mixture of the two,  200ml\/7fl oz elderflower cordial,  4 gelatine leaves ,  500ml\/18fl oz perry (sparkling pear cider),  75g\/2¾oz caster sugar ,  125g\/5oz mixed berries, such as blueberries, raspberries and wild strawberries","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/perryjellyandsummerf_86328"}