{"recipe_name":"Petits Monts Blancs","author":"Delia Smith","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Pre-heat the oven to 150C\/300F\/Gas 2.  To make the meringues, place the egg whites in a large bowl and, using an electric hand whisk on a low speed, begin whisking. Continue for about 2 minutes, until the whites are foamy, then switch the speed to medium and carry on whisking for 1 more minute. Now turn the speed to high and continue whisking until the egg whites reach the stiff-peak stage. Next, whisk the sugar in on fast speed, a little at a time (about a dessertspoon), until you have a stiff and glossy mixture. Now all you do is spoon 8 heaped dessertspoons of the mixture on to the prepared baking sheet, spacing them evenly. Then, using the back of the spoon or a small palette knife, hollow out the centres. Don't worry if they are not all the same shape - random and rocky is how I would describe them. Next, pop them on the centre shelf of the oven, immediately reduce the heat to gas mark 1, 2750F (1400C) and leave them for 30 minutes. (For important information about cooking at gas mark 1, click here.) After that, turn the oven off and leave the meringues to dry out in the warmth of the oven until it is completely cold (usually about 4 hours) or overnight. The meringues will store well in a tin or polythene box, and will even freeze extremely well. To assemble the Monts Blancs, spoon equal quantities of the créme de marrons into each meringue, whisk the topping ingredients together and spoon equal amounts on top of the chestnut purie. A light dusting of icing sugar is good for a snowcapped-mountain image. ","ingredients":" 2 large egg whites ,  4oz\/110g white caster sugar ,  2x250g tins crème de marrons de l'Ardèche (sweetened chestnut purée), chilled ,  9oz\/250g mascarpone ,  7fl oz\/200ml 8 per cent fat fromage frais ,  1 rounded dessertspoon caster sugar ,  1 tsp vanilla extract ,  a little icing sugar ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/petitsmontsblancs_68027"}