{"recipe_name":"Pheasant, artichoke pebbles and glazed chicory with stout and oyster sauce","author":"Pascal Aussignac","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pheasant, preheat the oven to 180C\/160C Fan\/Gas 4. Put the pine needles in a large pan over a low heat and place a wire rack on top. Use a blowtorch to smoke the pine needles. They should be almost be on fire. Sit the pheasants on the wire rack and continue to smoke the pine. Cover with aluminium foil, with the heat still low, and leave for 5 minutes. Rub the fat into the skin of the pheasant and transfer to the oven, skin-side down, for 10 minutes. For the artichoke pebbles, in a pan, cook the Jerusalem artichokes gently in the oil with the herbs and a little water until tender. Leave to cool. Dry them, then fry in a little oil until crisp on the outside. For the chicory, in a large non-stick pan, melt the sugar. Add in the chicory halves and butter, and cook until caramelised. Deglaze the pan with stout and cook until tender. Set aside 4 chicory halves for presentation. Blend the rest in a blender with the oysters and a splash of lemon juice. Strain through a fine sieve. Taste and season with salt. To serve, on each plate, put some fried artichoke ‘pebbles’, a slice of pheasant breast, a chicory half on top and the sauce around. Decorate with some oyster leaves. ","ingredients":" 1 pheasant breast, skin on,  100g\/3½oz pine needles (for smoking the pheasant),  50g\/1¾oz duck fat,  500g\/1lb 2oz Jerusalem artichokes, peeled,  100g\/3½oz olive oil, plus extra for frying,  1 sprig thyme ,  1 sprig rosemary,  1 bay leaf,  salt,  100g\/3½oz sugar,  5 heads chicory, cut in half,  100g\/3½oz butter,  1 bottle stout ,  10 oysters,  2 lemons, juice only,  pinch salt,  1 punnet oyster leaves, for garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pheasant_artichoke_73035"}