{"recipe_name":"Beef sukiyaki ","author":"The Hairy Bikers","programme":"The Hairy Bikers' Asian Adventure","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01t7nnh.jpg","method":"For the sauce, mix the liquid dashi with 175ml\/6fl oz of water in a jug to bring the total liquid to 375ml\/13fl oz. Stir in the remaining ingredients for the sauce. Set aside. For the beef, heat a large lidded frying pan that’s suitable to serve at the table. Heat the groundnut oil and sesame oil until hot. Add the beef and sprinkle the sugar over. The sugar will help caramelise the meat.  Turn the meat over after about 30 seconds - as the beef is so thin it will cook very quickly. Remove the meat from the pan. Add the mushrooms, cabbage, celery, tofu and bamboo shoots to the same pan and cook for another two minutes - just to brown the tofu slightly and to wilt the cabbage. You do not want to over-cook as you still want to retain the textures of the celery. Add the sukiyaki sauce to the pan, put the lid on and simmer for two minutes. Remove the lid, turn the vegetables and the tofu over and then combine the beef into the vegetables. Add the spring onions and simmer for a further two minutes. Serve in the pan at the table so that everyone can help themselves, or divide the mixture into four bowls with a bowl of rice each. ","ingredients":" 175ml\/6fl oz liquid instant dashi ,  150ml\/5fl oz soy sauce,  50ml\/1¾fl oz mirin ,  2 tbsp groundnut oil ,  2 tsp sesame oil,  450g\/1lb fillet or well-trimmed rib-eye beef steak, thinly sliced (a little thicker than carpaccio),  1½ tbsp sugar ,  12 button mushrooms, sliced,  4 brown cap mushrooms sliced,  100g\/3½oz enoki mushrooms, split into 4,  6 fresh shiitake mushrooms (remove stalks and cut in ½),  ½ Chinese cabbage (ideally Napa cabbage) sliced 2.5cm\/1in thick ,  1½ sticks celery, sliced on a diagonal 5mm\/¼in thick ,  160-175g\/5¾-6oz block firm tofu, cubed ,  200g\/7oz sliced bamboo shoots sliced, vacuumed-packed (alternatively used canned and drained bamboo shoots) ,  6 spring onions, cut into 2.5cm\/1in pieces on a slant ,  cooked rice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_sukiyaki_84557"}