{"recipe_name":"Pheasant salad with fresh chestnuts, pomegranate, dandelion and pancetta","author":"Theo Randall","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Season the inside of the pheasant with salt and pepper and stuff it with rosemary. Wrap the pancetta over the pheasant and secure with cook's string.  In a heavy-based, ovenproof frying pan, heat a tablespoon of olive oil and cook the pheasant on all sides to seal and colour a light golden-brown. Add the Marsala to the pan and place in the oven for 25-30 minutes depending on the size of the pheasant. Remove from the oven and leave to cool down.  Score the chestnuts on their flat side and boil in water for 10-15 minutes. Remove from pan and leave to cool.   Wash the salad leaves thoroughly and dry them. Mix the salad leaves with two tablespoons of olive oil and the balsamic vinegar. Season with salt and pepper, then mix in the dandelion, mint and pomegranate. Take off the pancetta from around the bird and chop into small strips.   Carve the pheasant so you have a nice mixture of breast and leg meat.  Cut the chestnuts in half and scoop out the insides with a teaspoon.  To serve, put a pile of pheasant on each serving plate and pour over a little of the juice from the pan the pheasant was cooked in. Add a scoop of chestnuts, some pancetta pieces and serve with the salad. ","ingredients":" 1 x 1kg\/2lb 4oz hen pheasant,  salt and freshly ground black pepper,  1 sprig rosemary,  100g\/3½oz sliced pancetta,  3 tbsp olive oil,  75ml\/2½fl oz dry Marsala wine,  100g\/3½oz fresh chestnuts,  1 head trevisse tardivo red chicory, leaves separated,  ½ head castelfranco chicory, leaves separated,  ½ tsp balsamic vinegar,  1 bunch dandelion leaves,  1 tsp chopped mint,  ½ pomegranate, seeds only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pheasant_salad_with_16420"}