{"recipe_name":"Pheasant suprême with wild mushroom compote","author":"Smiths of Smithfield","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 20","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/pheasantsupremewithw_92589_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6.  Heat an ovenproof griddle pan until very hot. Rub a little olive oil onto the pheasant (or other chosen bird) breasts and season with salt and freshly ground black pepper.  Place the breasts onto the griddle pan, at an angle to the ridges, and cook for one minute on each side. Transfer to the oven and roast for six minutes (three minutes if using small game birds such as partridge), or until cooked to your liking. Remove and leave to rest for five minutes.  Place the redcurrant jelly in a small pan and heat gently until melted. Brush over the pheasant or other bird and sprinkle over the chopped parsley or coriander. Leave to cool completely. Meanwhile, drain the soaked dried mushrooms and squeeze out any excess moisture (save the liquid and use it in this recipe to add flavour to stocks or sauces). Rinse the soaked mushrooms in fresh water, drain again and dry with paper towels, then finely chop. Wipe clean the fresh mushrooms and finely chop. Heat the olive oil in a non-stick, lidded pan over a low heat. Add the red onion and garlic and a pinch of salt. Cover with a lid and cook gently for 15 minutes.  Add the dried and fresh mushrooms to the pan and cook, covered, for a further ten minutes. Season, to taste, with salt and freshly ground black pepper. If there is too much liquid in the pan, remove the lid and boil down until all the liquid has evaporated. Remove from the heat and leave to cool. If using panini or baguettes, cut on the diagonal; for ciabatta or focaccia, split horizontally and use a 5cm\/2in pastry cutter to cut out rounds of bread for the canapé bases.  Toast the bread on a very hot griddle pan. Alternatively place under a grill until toasted on both sides. Leave to cool. To serve, cut the breasts very thinly on the diagonal. Spread a little mushroom compote on the toasted bread slices and place 2-3 slices of breast meat on top. Garnish with chopped fresh herbs, cranberries or redcurrants, as you prefer. ","ingredients":" drizzle olive oil,  2 x 125g\/4½oz pheasant breasts (or breasts of guinea fowl, duck, partridge, pigeon of the same weight),  salt and freshly ground black pepper,  2 tbsp redcurrant jelly,  handful fresh flatleaf parsley or coriander, finely chopped,  20g\/¾oz dried porcini (ceps) or dried mixed wild mushrooms, soaked for 30 minutes in warm water,  100g\/3½oz fresh mushrooms (use wild mushrooms such as Chanterelles, Pied de Mouton and Girolles, or less expensive brown caps, oysters, shiitake, button, or a mixture of the above),  2 tbsp olive oil,  1 small red onion, finely chopped,  2 cloves garlic, finely chopped,  salt and freshly ground black pepper,  3 ready-to-bake panini, baguettes, ciabatta or 1 large focaccia (approximately 18cm\/7in x 30cm\/12in or 30cm\/12in diameter round, sliced through the middle),  Fresh parsley, chopped,  cranberries or redcurrants, to garnish (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pheasantsupremewithw_92589"}