{"recipe_name":"Beef tournedos Rossini","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Rossini, heat a small frying pan and add a little of the butter. Cut the crusts off the bread and cut to the same size as the steak. Add the bread to the pan and toast on each side. Heat a separate frying pan and add the oil. Cook the steak to your liking. Remove from the pan and place on the toasted bread to rest. In the pan you cooked the steaks in add the madeira. Deglaze the pan by scraping off the stuck on parts from cooking the steak. Cook until the volume of liquid is reduced by half, then add the beef stock and peppercorns. Cook for 2-3 minutes, then strain through a fine sieve into a clean pan and finish with a knob of butter. In a separate frying pan, add the remaining butter and, once hot, add the wild mushrooms and cook for 2-3 minutes. For the mash, place the potatoes into a large pan filled with cold water and bring to the boil. Cook for 15-20 minutes, or until the potatoes are soft. Drain and place back in the pan. Mash or rice the potatoes. Add the cream, milk and butter and mix to form a smooth mash. To serve, add a few shavings of truffle to the sauce. Place a spoonful of the mash onto serving plates, place the bread and steak next to it and pour the sauce over the steaks. Finish with more truffle shavings and scatter the wild mushrooms around the steak. ","ingredients":" 2 tbsp butter,  4 slices white bread,  1 tbsp olive oil,  4 x 200g\/7oz beef fillet steak,  8 tbsp madeira,  200ml\/7fl oz beef stock,  5 peppercorns,  50g\/1¾oz unsalted butter,  200g\/7oz wild mushrooms,  a few slices of fresh truffle,  1kg\/2lb 4oz white potatoes, peeled and cut into chunks,  300ml\/10fl oz double cream,  300ml\/10fl oz whole milk,  100g\/3½oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_tournedos_rossini_16043"}