{"recipe_name":"Pheasant kiev, crushed swede, hazelnut butter and smokey bacon cabbage","author":"Adam Byatt","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Take the legs and breasts off the pheasant carcass and skin them, discarding the skin. Cut the drumstick flesh and sinews away from the drumstick bone and discard. Clean the bone down then turn the leg over and cut out the thigh bone. You will be left with a boneless thigh attached to a drumstick bone. To make the garlic butter, place the hazelnuts, 50g\/1¾oz of the butter and the clove of garlic in a food processor and blend. Make a small incision into the underside of the breast and fill with the garlic butter, season well with salt and freshly ground black pepper then place the mini fillet over the top of the incision to seal. Place the leg on top with the bone toward the thinner end of the breast. Carefully pass the pheasant Kievs through the flour, then the eggs and then the breadcrumbs. Heat the rapeseed oil in an ovenproof frying pan, gently fry the Kievs until lightly coloured on one side then transfer to the oven for 12-15 minutes. Remove the skin from the pancetta and set aside, then thickly slice the pancetta. Meanwhile, place the swede, pancetta skin, 500ml\/18fl oz of the chicken stock and the remaining butter into a pan, season lightly and bring to the boil. Simmer for 25-30 minutes and leave to cool slightly.  Strain, discarding the stock and pancetta skin, then return the swede to the pan and mash well. Place the quartered cabbage into an ovenproof dish, layer the Toulouse sausage and pancetta inside, add the garlic head, fresh thyme and season well with salt and freshly ground black pepper. Pour 500ml\/18fl oz of the chicken stock over the top and cover with the outer cabbage leaves. Cover with a tightly fitting lid or tin foil and bring to the boil, then place into the oven for 45 minutes.  To serve, carve the sausage into thick slices and place onto the plate with a piece of pancetta. Set a piece of cabbage alongside then spoon some swede next to it. Place the cooked Kiev on top and a few crushed hazelnuts around.  ","ingredients":" 1 large pheasant, plucked and cleaned,  50g\/1¾oz peeled and toasted hazelnuts, plus extra for garnish,  115g\/4oz salted butter,  1 clove garlic, peeled,  25g\/1oz plain flour,  2 eggs, beaten,  50g\/1¾oz panko breadcrumbs,  2 tbsp rapeseed oil,  115g\/4oz smoked pancetta or pancetta, in one piece with skin on,  1 large swede, peeled and cut into 2cm\/¾in dice,  1 litre\/1¾ pint white chicken stock,  1 small Savoy cabbage, outer leaves removed and retained, inner quartered,  1 Toulouse sausage,  1 head garlic ,  ½ bunch fresh thyme,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pheaseant_kiev_crushed_76083"}