{"recipe_name":"Picnic basket pie","author":"Ruby Tandoh","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the pastry, rub the butter into the flour using your hands until it resembles fine breadcrumbs. Add 150ml\/5fl oz water and bring the mixture together to form a dough (be careful not to overwork it).  Wrap the dough in cling film and leave to rest in the fridge while you prepare the filling. For the roasted vegetables, lightly oil a roasting tray with sunflower oil, and arrange the onions, garlic, peppers, courgette and aubergine on the tray. Toss to coat the vegetables in oil. Roast for 30-40 minutes, or until the vegetables are tender. Season with salt and freshly ground black pepper. Set aside to cool. For the filling, put the couscous in a bowl and add enough boiling water to just cover it. Cover the bowl and let it stand for 5-10 minutes.  When the water has been absorbed, use a hand-held blender to blend half of the couscous with the sun-dried tomato paste. Combine with the unblended couscous. Season with salt and pepper and set aside in the fridge. Slice the halloumi, pat dry with kitchen paper and dry-fry until brown spots appear.  Flip it over and fry the other side in the same way. Leave to cool.  To make the pastry basket, divide the pastry dough into four portions: 350g\/12oz for the case, 300g\/10½oz for the lattice 'basket', 150g\/5½oz for the lattice lid, and 100g\/3½oz for the handle and other extras. Roll out the pastry dough for the lattice to about 3mm thick, keeping the pastry cold (return it to the fridge for five minutes to chill if required). Cut five strips 2cm\/1in wide. The strips need to be long enough to go down one side of the tin, across the width of the base and up other side of tin, leaving a slight overhang each side.  The strips will be about 25-30cm\/10-12in long (depending on the size of the tin).  Lay the strips inside the tin - spacing the strips evenly along the length of the tin. Cut four strips also 2cm\/1in wide and the same length as the tin (two strips for each long side of the tin). Place one strip flush with the tin's base and the other about two-thirds of the way up.  Weave the strips in an out of the vertical strips to make a lattice.  Where the strips overlap, brush with a little water or milk and press into place. Freeze the tin with the lattice inside. Meanwhile, roll out the pastry for the case into a rectangle big enough to line the base and sides of the tin. Transfer the pastry rolled pastry to the fridge to rest. Make a rectangular lattice for the hamper lid, cutting long strips of pastry, and interweaving them (it's best to do this on a baking tray lined with greaseproof paper). Leave small gaps between rows so there are holes in the lid where any steam can escape during cooking.  Rest the pastry in the fridge. Make a basket handle and two buckles out of the remaining pastry (you can mould the handle over a piece of scrunched up tin foil).  Transfer to the fridge to rest. Brush the inside of the frozen lattice with milk and line it with the rolled pastry case, pressing lightly to stick the case to the lattice. Rest it in the fridge for 15 minutes. Preheat the oven to 200C\/400F\/Gas 6. Remove the garlic cloves from the cooled roasted vegetables and discard. To fill the pie, lay half of the couscous on the bottom (this will soak up any liquid) and pack it firmly by pressing it down. Layer the vegetables, halloumi and grated mozzarella on top. Sprinkle over the oregano and basil. Top with the remaining couscous, again pressing down.  Make sure all layers are tightly packed. Brush the edges of the pastry with milk, then slide the lattice lid into place from the greaseproof paper.  Press the edges to seal. Brush the top of the pie with beaten egg. Bake for 50 minutes. Bake the pastry buckles, hinges and handles separately for 10-15 minutes towards the end of the pie's cooking time. Remove the pie from the tin and brush the sides with beaten egg. Return it to the oven and bake for another three minutes. Remove from the oven and leave to cool. For the caramel, melt the sugar in a pan with a couple of tablespoons of water. Do not stir. Let it reach a light golden-brown colour.   Dip the handle ends and buckles into the caramel and stick them to the pie (caution: melted sugar is very hot. Take care not to burn yourself). Hold in place while the caramel sets. ","ingredients":" 600g\/1lb 5oz plain flour,  300g\/10½oz unsalted butter, at room temperature but not soft,  salt,  ½ tsp baking powder,  50ml\/2fl oz milk, to brush,  1 free-range egg, beaten, to glaze,  2 tbsp sunflower oil,  2 medium red onions, chopped,  2 garlic cloves, in whole cloves, skin on, lightly crushed under fork,  3 Romano red peppers, chopped,  1 large courgette, chopped,  1 aubergine, chopped into 1cm\/½in cubes,  salt and freshly ground black pepper,  100g\/3½oz couscous,  90g\/3¼oz sun-dried tomato paste,  250g\/9oz halloumi,  100g\/3½oz mozzarella, grated,  small bunch fresh oregano,  small bunch fresh basil,  100g\/3½oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/picnic_basket_pie_50454"}