{"recipe_name":"Pie-shaped hidden design cake","author":"Victoria Chester","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Makes 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lemon sponge cakes, preheat the oven to 180C\/350F\/Gas 4. Grease and line the bases of four 23cm\/9in cake tins. In a large bowl, beat the butters with the sugar until pale and fluffy. Gradually add the eggs, beating well after each addition. Mix in a little flour and the lemon zest. Sieve the remaining flour and the baking powder and fold into the butter mix using a metal spoon. Divide the mix between the four tins and gently smooth the surface. Bake for 20–25 minutes, or until a skewer comes out clean, then set aside to cool on wire racks. For the small, coloured sponges, grease three mini cake tins (8cm\/3in round tins are ideal). In a large bowl, beat the butter with the sugar. Gradually add the eggs, beating well after each addition and then mix in a little flour. Sieve the remaining flour and the baking powder and fold into the butter mix using a metal spoon. Divide the mix into three bowls and add the black food colouring to one, the yellow to another and the pink\/flesh colour to the third. Pour the mixes into the prepared tins and bake for 15–20 minutes, or until a skewer comes out clean. Cool in the tins on a wire rack.  For the buttercream, beat the butter until soft, then add the icing sugar in batches until it is completely incorporated. Mix in the lemon zest and juice. Transfer one tablespoon of buttercream to a separate bowl and mix in the black food colouring a few drops at a time until the buttercream has turned an even black colour.  When the small coloured sponges are completely cool, take the yellow sponge and cut it into an open beak shape that is approximately 5cm\/2in long. Use the pink cake to make a nose shape that can sit inside the open ‘beak’. To assemble the cake, sandwich three lemon sponge cakes together with butter cream. To create a cavity for the ‘beak’ and ‘nose’ to sit in, mark the centre of the cake and cut out a tapered cylinder shape. Insert the pink ‘nose’ and the yellow ‘beak’ (use a small amount of buttercream to fix in place and fill any gaps).  Spread buttercream over the top of the cake and add the final layer of cake. To form the cavity for the blackbird’s head, mark the centre of the cake and draw a 10cm circle round it. Scrape out a dome that is deep enough to reach the next layer of cake (so the blackbird’s head will sit immediately on top of the beak). Cut out the same sized dome from the black cake and insert into the dome-shaped cavity. To decorate, cut the edge of the bottom cake layer away slightly to create a ‘pie dish’ effect. Cut and shape the top of the cake so it that it resembles a pie top (it doesn't need to be perfect at this stage as it will be covered in fondant icing later).  Cover the entire cake with a layer of buttercream. To ice the cake, first roll out the white fondant into a strip large enough to wrap around the side of the cake and form the pie dish base. Trim to fit and apply in one strip. Secure the ends by brushing them with water so they’ll stick together. Mix the icing sugar with water to make a paste and add drops of blue food colouring until the icing is a deep-blue colour.  Pipe clusters of three dots all around the pie dish to create a blue and white ceramic effect.  Roll out the cream coloured fondant icing large enough to make a ‘pastry top’. Take one of the cake tins used for the lemon sponge and use it as guide to cut out a circle in the cream fondant icing. Apply to top of cake and crimp the edge so it resembles a pastry top. Cut a cross in the top of the pie and roll back the corners For the decorations, use the black and yellow coloured fondant to make a few small blackbird heads and sit them inside the cross of the ‘pastry top’.  ","ingredients":" 175g\/6oz salted butter, softened,  175g\/6oz unsalted butter, softened,  350g\/12oz caster sugar,  6 free-range eggs, lightly beaten,  350g\/12oz self-raising flour, sifted,  2 unwaxed lemons, zest only ,  2 tsp baking powder ,  175g\/6oz salted butter, softened,  175g\/6oz caster sugar,  3 medium free-range eggs, lightly beaten,  175g\/6oz self-raising flour,  ½ tsp baking powder,  food colouring in egg yellow, pink\/flesh and black ,  125g\/4½oz unsalted butter, softened ,  125g\/4½oz salted butter, softened ,  350g\/12oz icing sugar,  1 lemon, zest and juice,  few drops black food colouring,  1 x 500g pack ready-to-roll fondant icing,  150g\/5oz icing sugar,  few drops blue food colouring,  1 or 2 packs modelling paste, cream coloured,  1 x 250g pack sugarpaste, cream coloured,  coloured sugarpaste, black and yellow ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pie-shaped_hidden_design_24020"}