{"recipe_name":"Beef Wellington","author":"Paul Hollywood","programme":"The Great British Bake Off","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, begin by putting the flours, eggs and water in a large bowl and gently mixing everything to a stiff dough. Transfer the dough to a lightly floured work surface and knead it well for 10 minutes. The dough should feel tight but elastic so the kneading will take a bit of effort. When the dough is smooth, shape it into a ball and put it in a plastic bag in the fridge to chill, either overnight or for seven hours.  Flatten your butter out into a rectangle about 40x20cm\/16x8in and 5mm\/1\/5in thick, and chill for one hour to harden the butter again.   Roll out your dough to about 60cm\/24in long. It will be about 20cm\/8in wide and 1cm\/1\/5in thick. Put the butter on the top so it covers the bottom ⅔ of the dough. Make sure that it is positioned neatly and comes almost to the edges. Fold in the edges slightly so the butter does not escape during the rolling and folding process, a little fold will do.  Fold the exposed dough at the top down over ⅓ of the butter, then gently cut off the exposed bit of butter and put it on the top of the dough you have just folded down. Fold the bottom half of the dough up. You will now have a sandwich of two layers of butter and three of dough. Put it back in a plastic bag and chill for an hour.  Take the dough out of the bag and put it on the lightly floured work surface with the short end towards you. Roll out your dough into a rectangle as before, fold the top ¼ down and the bottom ¼ up so they meet neatly in the centre. Then fold the dough in half along the centre line. This is called a book turn. Chill in the bag for an hour.  Take the dough out of the bag and put it on the lightly floured work surface with the short end towards you, roll into a rectangle as before. This time fold ⅓ of the dough down and then the bottom ⅓ up on top to make a neat square. This is called a single turn.  Chill in the bag for another hour.   Bring your dough out again and do a single turn as previously. Chill in the bag overnight. Your dough is now ready to use. Trim down the fillet, carefully removing any sinew and squaring off the ends.  Drizzle with a little oil, sprinkle on salt and massage into meat. Put a large frying pan onto a high heat. When frying pan is very hot, seal the fillet all over. Set aside to cool. Meanwhile, roll out the puff pastry into a rectangle with appropriate dimensions to wrap-up your fillet. Spread  the pâté over the pastry that will be in contact with the fillet. Place the fillet on top of pâté and wrap in the pastry. Seal up the pastry running up the length of fillet and also either end. Place on baking tray. Beat the whole egg together with a little salt, and use this to egg-wash the pastry all over. Leave in fridge for one hour, repeat egg wash and refrigerate again for another hour.  Pre-heat the oven to 220C\/425F\/Gas 7. When the pastry is ready, take it out of the fridge and score the top of the pastry. Cook for 20-25 minutes in the hot oven until a deep golden-brown. Allow to rest for 20 minutes before carving. ","ingredients":" 150g\/5½oz strong bread flour,  150g\/5½oz plain flour, plus extra for dusting,  2 free-range eggs, beaten,  100ml\/3½fl oz ice cold water,  160g\/5¾oz unsalted butter, well chilled,  1 x 750g\/1lb 10oz fillet of beef,  olive oil,  salt, to taste,  100g\/3½oz chicken liver pâté,  free-range egg, for egg wash","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beef_wellington_49845"}