{"recipe_name":"Pina colada roulade","author":"Benjamina","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/150C Fan\/Gas 3. Grease and line a 33x22cm\/13x8½in Swiss roll tin. For the roulade, in a bowl whisk the egg yolks, 90g\/3¼oz icing sugar, vanilla paste and coconut extract paste together using an electric hand whisk for 5–10 minutes, or until pale and thick. In a separate bowl, sift the flour and cornflour together. Using an electric hand whisk, beat the egg whites in a large bowl until soft peaks form when the whisk is removed. Add the remaining icing sugar and whisk to a thick and glossy meringue. Add a third of the meringue to the egg yolk mixture and fold in until combined. Add in the rest of the meringue in small batches, carefully folding in each batch before adding the next, until fully incorporated. Sift in the flour and fold in gently.  Pour into the prepared tin, spread in an even layer and bake for 40 minutes, or until springy to the touch and lightly golden-brown. Cool in the tin for a couple of minutes then turn out onto greaseproof paper that has been lightly dusted with icing sugar. Peel away the baking paper used to line the tin. Score a line near one of the shorter ends – it should cut about halfway through the depth of the sponge and the full width of the cake (this will help you form a tight roll later). Roll up the sponge loosely with the greaseproof paper. Allow the sponge to cool completely whilst rolled up. For the syrup, heat the sugar and 50ml\/2fl oz water in a saucepan until the sugar is dissolved. Bring to the boil until it is thickened but not coloured. Remove from the heat and stir in the white rum.  For the pineapple filling, set aside four pineapple rings for the decoration and roughly chop the rest. Put the lime juice, sugar and half the rum in a saucepan over a medium heat. Add the chopped pineapple, then simmer for 10 minutes, or until softened. Stir in the rest of the rum and blend until smooth in a food processor.  Mix the cornflour with 1 tablespoon water. Mix the paste into the pineapple mixture and transfer to a saucepan. Heat gently until for 15–20 minutes, or until thickened aside until you are ready to assemble the roulade. For the coconut mascarpone, lightly whip the double cream and coconut extract paste. Add the mascarpone, icing sugar and rum and whisk until smooth. To decorate, preheat a griddle and lightly char the reserved pineapple rings. Cut one of the rings into chunks. In a frying pan, lightly toast the coconut flakes. Unroll the roulade and brush it with the sugar syrup. Spread a thin layer of the mascarpone mixture over the top (reserve some for decoration). Add a layer of the pineapple filling and then tightly roll up the roulade, using a clean tea towel to help you. Transfer the roulade to a serving plate. Put the remaining mascarpone mixture in a piping bag fitted with a large closed star nozzle. Pipe decorative ruffles along the top of the roulade. Top with the toasted coconut flakes, chunks of griddled pineapple and maraschino cherries. Arrange the remaining pineapple slices to the side. ","ingredients":" 5 large free-range eggs, separated,  140g\/5oz icing sugar, plus extra for dusting,  ¼ tsp vanilla bean paste,  ½ tsp coconut extract paste (or 1 tsp coconut extract),  80g\/2¾oz plain flour,  1½ tbsp cornflour,  100g\/3½oz caster sugar,  3 tbsp white rum,  2 small pineapples, peeled, cored and cut into rings,  ½ lime, juice only,  50g\/1¾oz caster sugar,  3 tbsp coconut rum ,  1 tbsp cornflour,  100ml\/3½fl oz double cream,  ½ tsp coconut extract paste (or 1 tsp coconut extract),  300g\/10½oz mascarpone,  60g\/2¼oz icing sugar,  2 tbsp coconut rum ,  coconut flakes,  maraschino cherries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pina_colada_roulade_77630"}