{"recipe_name":"Pina colada trifle","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Break up the muffins (or other cake) into chunks and place over the bottom of a large glass bowl, to cover. Drizzle the rum over the cake pieces. Place the pineapple pieces into a clean bowl and sprinkle with the icing sugar and coconut liqueur. Place into the fridge to chill for one hour, then spoon the pineapple pieces on top of the cake in the glass bowl. Add the kiwi slices. Warm the apricot jam in a small pan with a little water to dilute it, then pour over the cake and fruit. For the custard, whisk the egg yolks and sugar together in a clean bowl, until pale and light. Sieve in the flour and whisk well, ensuring there are no lumps. Place the coconut milk and vanilla seeds into a clean pan over a low heat. Bring to the boil, then remove from the heat and pour over the egg yolk and sugar mixture. Whisk well to combine. Pour the custard mixture back into the pan and bring back up to the boil. Reduce the heat and simmer for 5-6 minutes, stirring constantly. Pour the custard into a bowl, cover with cling film and allow to cool. Once cooled to room temperature place into the fridge to chill for one hour. Remove from the fridge and fold the whipped cream into the custard. Spoon the custard and cream mixture onto the fruit layer in the trifle bowl. For the topping, place the cream and mascarpone into a clean bowl and mix well. Spread the cream and mascarpone mixture over the custard layer in the trifle bowl. Sprinkle the toasted desiccated coconut over the top and serve. ","ingredients":" 250g\/10½oz ready-made white chocolate muffins (or Madeira cake or Swiss roll),  30ml\/1fl oz dark rum,  400g\/14oz fresh pineapple, peeled, chopped,  50g\/2oz icing sugar,  50ml\/2fl oz coconut liqueur,  2 kiwi fruit, peeled, sliced,  150g\/5oz apricot jam,  2 tsp water,  6 free-range egg yolks,  125g\/4oz sugar,  40g\/2½oz plain flour,  400ml\/14fl oz tin of coconut milk,  1 vanilla pod, split, seeds scraped out,  200ml\/7fl oz double cream, whipped,  100ml\/3½fl oz double cream, whipped until stiff peaks form when the whisk is removed,  100g\/3½oz mascarpone cheese,  50g\/2oz desiccated coconut, toasted","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pinacoladatrifle_88603"}