{"recipe_name":"Pineapple, prawn and scallop curry","author":"Atul Kochhar","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Laotian curry paste, blend or pound all the ingredients together with a small quantity of water to make a smooth paste. It can be kept, tightly covered, in the fridge for 3-4 days or frozen in ice cube trays.  For the pineapple, prawn and scallop curry, heat the oil in a wok and gently fry the curry paste for a minute until fragrant. Add the prawns and scallops. Cook for 2-3 minutes, then add the fish sauce, sugar and kaffir lime leaves. Stir for a minute. Use a slotted spoon to remove the seafood from the wok and keep warm. Add the coconut milk to the wok and bring to the boil, then simmer for 2-3 minutes. Add the pineapple and simmer for five minutes. Return the seafood to the wok and add the spring onions and basil leaves. Cook, stirring, for a couple of minutes, then transfer to serving bowls.  For the salad, place all the ingredients in a large bowl and gently toss. To serve, garnish each bowl of curry with a sprig of basil and serve with the salad. ","ingredients":" 1 tsp cumin seeds, lightly toasted,  2 tsp coriander seeds, lightly toasted,  1 lemongrass stalk, hard outer leaves removed, chopped,  1 tbsp chopped galangal,  1 lime (preferably kaffir), grated zest and juice only,  1 tbsp finely chopped garlic ,  1 large shallot, chopped,  3 tbsp chopped coriander root (alternatively use coriander stems),  1 tbsp chopped fresh turmeric,  1 tsp ground turmeric,  1 tbsp chopped fresh ginger,  4 red Thai or bird’s-eye chillies,  2 tsp kaapi (dried shrimp paste),  1 tbsp medium curry powder,  2 tbsp vegetable oil,  2 tbsp groundnut or vegetable oil,  3 tbsp Laotian curry paste (from above),  300g\/10oz raw prawns, peeled, cleaned and deveined,  200g\/7oz scallops, coral removed,  2 tbsp fish sauce,  1 tbsp sugar,  4 kaffir lime leaves,  500ml\/18fl oz coconut milk,  1 small pineapple, peeled and diced,  4 spring onions, cut into 2.5cm\/1in pieces,  handful of holy basil or ordinary basil leaves, plus extra to garnish,  250g\/9oz cherry tomatoes, halved,  1 cucumber, sliced,  1 bunch spring onions, finely sliced,  1 red chilli, sliced into long strips,  1 iceberg lettuce, sliced,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pinapple_prawn_and_02199"}