{"recipe_name":"Pineapple upside-down sponge with rum and raisin ice cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rum and raisin ice cream, heat the raisins and rum in a small saucepan until just warm.  Remove from the heat and set aside for 15 minutes to allow the raisins to plump up. Place the milk into a saucepan and bring to the boil.  Whisk the egg yolks and sugar in a bowl until combined. Whilst whisking continuously, slowly pour the boiling milk onto the egg yolks, then pour the mixture back into the saucepan. Stir in the cream, rum and raisins and cook the custard over a low heat, stirring continuously, for 4-5 minutes, or until the mixture has thickened. Do not let the mixture boil.  Pour the custard into a bowl and set aside to cool completely. Transfer the custard to an ice cream machine to churn (according to manufacturer's instructions). Transfer to the freezer and freeze until needed. For the cake, preheat the oven to 180C\/350F\/Gas 4. Line the sides and bottom of a 26cm\/10in cake tin with greaseproof paper, making sure there is no gap for the syrup to leak through. Place onto a shallow baking sheet. Heat the golden syrup and 50g\/2oz of the butter in a small saucepan over a low heat until melted. Pour into the bottom of the cake tin. Place the pineapple rings on top, pressing 6 around the outside and 1 in the centre. Finely chop the remaining pineapple and set aside. Beat the sugar and the remaining butter together in a bowl and until light and fluffy. Add the eggs, one at a time, beating well between each egg. Fold in the flour. Stir in the chopped pineapple until well combined. Spoon the cake mixture over the pineapple rings in the tin and tap to settle the mixture. Bake in the oven for 45-60 minutes, or until or until golden-brown on top and a skewer inserted into the middle comes out clean. Remove the cake from the oven and set aside to cool in the tin for 10 minutes. Invert the cake onto a large plate and peel off the greaseproof paper. Serve slices of the cake with a scoop of rum and raisin ice cream. ","ingredients":" 115g\/4oz raisins,  115ml\/4fl oz rum,  400ml\/14fl oz full-fat milk,  8 free-range egg yolks,  200g\/7oz light soft brown sugar,  400ml\/14fl oz double cream,  175g\/6oz golden syrup,  325g\/12oz butter, softened,  1 x 1.5kg\/3lb 4oz medium pineapple, peeled, cut into 7x8cm\/2.5-3in diameter, 1cm thick cored rings, remainder reserved (about 175g\/6oz),  275g\/10oz caster sugar,  5 free-range eggs,  275g\/10oz self-raising flour","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pineappleupsidedowns_93615"}