{"recipe_name":"Piri-piri prawns and harissa couscous","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/piripiriprawnsandhar_86697_16x9.jpg","method":"For the piri-piri prawns, place all the ingredients except the prawns into a food processor and blend until smooth. Place the prawns on a plate and rub over the piri-piri sauce, reserving a little to garnish. Leave to marinate in the fridge for an hour. Heat a griddle pan until hot and cook the prawns for 4-5 minutes on each side, depending on their size, until the prawns have turned pink and are cooked through. For the couscous, place the couscous into a bowl, pour over the boiling water and stir with a fork to combine. Add the harissa, pomegranate molasses, baharat and lemon juice and stir once more. Cover with cling film and set aside for 3-4 minutes, until all the liquid has been absorbed into the couscous. Remove the cling film and fluff up with a fork. Add the red onion, fleshy pomegranate seeds and coriander and mix well. To serve, place three prawns onto each plate with a pile of couscous. Drizzle over the reserved piri-piri sauce and a squeeze of lemon. ","ingredients":" 2 red chillies, seeds removed, roughly chopped,  1 dried chilli, roughly chopped,  ½ lemon, juice only,  3 garlic cloves, peeled ,  1 tbsp sweet smoked paprika,  4 tbsp olive oil,  1 tbsp red wine vinegar,  1 tsp sea salt,  ½ tsp freshly ground black pepper,  12 very large prawns, shells removed but tails left on, cleaned,  200g\/7oz wholegrain couscous,  400ml\/14fl oz boiling water,  1 tsp harissa,  1 tbsp pomegranate molasses,  1 tsp baharat spice mix (available from Middle Eastern stores and some supermarkets),  ½ lemon, juice only,  1 red onion, finely sliced,  1 pomegranate, fleshy seeds only,  1 small bunch coriander, roughly chopped,  1 lemon, quartered, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/piripiriprawnsandhar_86697"}