{"recipe_name":"Pistachio, cardamom and lemon drizzle cake","author":"Benjamina","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 1 loaf cake","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/pistachio_cardamom_and_90362_16x9.jpg","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. Grease and line a 900g\/2lb loaf tin. In a food processor, pulse the pistachios to make a powder. In a large bowl, mix together the sunflower oil and caster sugar. Add the eggs, vanilla paste, ground cardamom and lemon zest. Stir until combined. In a separate bowl, add the flour, ground pistachios, ground almonds, salt, baking powder and bicarbonate soda. Stir until well combined then fold into the wet ingredients in the other bowl. Fold in the soured cream. Pour the mixture into the prepared tin and bake for 45-50 minutes, or until a skewer inserted into the middle of the cake comes out clean. Meanwhile, prepare the syrup. Heat the lemon juice and sugar in a saucepan until the sugar is dissolved, then briefly bring to the boil. Remove from the heat and set aside. As soon as the cake is cooked, poke holes all over the top using a skewer. Pour over two-thirds of the hot syrup and leave to cool in the tin for 5-10 minutes. Add half the extra pistachios (for decorating the cake) to the remaining syrup.  When the cake is cool, remove it from the tin. For the lemon icing, sift the icing sugar into a bowl and stir in the lemon juice until smooth. Drizzle over the cooled cake. To finish, finely chop the remaining pistachios and scatter over the icing. Top with the syrup-coated pistachios and some dried rose petals. ","ingredients":" 100g\/3½oz shelled pistachios, plus extra to decorate ,  125ml\/4fl oz sunflower oil, plus extra for greasing,  125g\/4½oz caster sugar,  2 large free-range eggs ,  1 tsp vanilla bean paste ,  8 green cardamom pods, seeds removed and ground (to make 1 tsp ground cardamom),  1 unwaxed lemon, zest only,  100g\/3½oz plain flour,  30g\/1oz ground almonds, sifted,  pinch salt,  1 tsp baking powder,  ½ tsp bicarbonate of soda,  50g\/1¾oz soured cream,  2 lemons, juice only,  120g\/4¼oz caster sugar,  75g\/2½oz icing sugar,  1-2 tbsp lemon juice,  dried rose petals ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pistachio_cardamom_and_90362"}