{"recipe_name":"Pistachio crusted rack of lamb, fig and olive tapenade with orange roasted roots","author":"Catherine Fulvio","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the orange honey roasted vegetables, preheat the oven to 180C\/350F\/Gas 4. In a roasting tray, mix the vegetables with the orange rind.  Drizzle over the olive oil and orange juice, add the thyme and toss the vegetables to coat.   Roast for 40 minutes, or until golden-brown and tender. Meanwhile, prepare the lamb. For the crust, blend all the ingredients, except the lamb racks and mustard, in a food processor. Take care not to over process, as a textured crust is needed. Season the lamb racks with salt and freshly ground black pepper. Spread a thin layer of mustard over and spoon the crust on, pressing down firmly (you can leave it to set in the fridge for an hour if you have the time). Place the lamb in a roasting tin and drizzle with olive oil.  Roast in the oven at the same temperature as the vegetables for 20-35 minutes, depending on the size of the rack and how rare you prefer your meat. Baste occasionally with olive oil. When cooked, remove the lamb from the oven and set aside to rest for 10 minutes before carving into cutlets. For the fig and olive tapenade, place the chopped figs and 100ml\/3½oz water in a small saucepan and simmer for 5-6 minutes, or until the figs are tender. Drain and set aside to cool. Place the anchovies, olives, pistachios, capers, honey, mustard, orange juice and zest and cooked figs in a food processor and blend. With the motor still running, add the olive oil in a thin, steady stream until you have a thick paste. Season to taste with freshly ground black pepper To serve, spoon small amounts of tapenade around serving plates with a few parsley leaves placed in between. Spoon the honey roasted vegetables into the centre and arrange a cutlet or two on top. Serve the extra fig tapenade alongside in a small bowl.    ","ingredients":" 3 large carrots, roughly chopped ,  10 shallots, halved ,  1 small butternut squash, peeled and roughly chopped,  1 orange, juice and rind,  3 tbsp extra virgin olive oil ,  5 small sprigs thyme,  extra virgin olive oil,  salt and freshly ground black pepper,  2 slices bread,  3 dried figs,  4 tbsp pistachios,  1tbsp honey,  2 tbsp butter, melted,  1tbsp balsamic vinegar,  1 tsp chopped fresh thyme,  4 tbsp roughly chopped parsley,  3 to 4 racks of lamb (depending on the size),  salt and freshly ground black pepper,  2 tsp Dijon mustard,  8 dried figs, roughly chopped,  3 anchovies, drained,  2 tbsp chopped and pitted black olives ,  3 tbsp roughly chopped pistachios,  1 tbsp capers ,  1 tbsp honey,  2 tsp wholegrain mustard,  1 orange, juice and zest ,  300ml\/10½oz extra virgin olive oil,  freshly ground black pepper,  flat leaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pistachio_crusted_rack_91352"}