{"recipe_name":"Pistachio-crusted lamb on rosti potato with shallot and red wine sauce","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the lamb, rub the lamb with olive oil and garlic. Heat an ovenproof frying pan and briefly cook the lamb over a high heat, turning frequently, until lightly browned all over. Add the honey and mustard, sprinkle over the pistachio nuts and baste the meat with any pan juices. Transfer the lamb to the oven and roast for 6-8 minutes, or until cooked to your liking. Remove from the oven and allow to rest for five minutes in a warm place. For the rösti potato, heat the oil and butter in a small non-stick ovenproof frying pan. Season the grated potato well with salt and freshly ground black pepper, then press into the pan. Fry the potato on both sides until golden, then transfer to the oven for 6-8 minutes, or until the potato is tender. For the sauce, heat the butter and flour in a saucepan, stirring constantly, for 1-2 minutes. Add the wine and simmer until reduced by half, then add the shallot and simmer for ten minutes, or until well reduced and syrupy. To serve, place the rösti potato onto a serving plate. Slice the lamb rack in half and place on top of the rösti. Drizzle the shallot and red wine sauce around the plate. ","ingredients":" 1 x 4-bone rack of lamb, trimmed,  1 tbsp olive oil,  2 garlic cloves, crushed,  1 tbsp honey,  2 tsp wholegrain mustard,  55g\/2oz pistachio nuts, crushed,  1 tbsp olive oil,  30g\/1oz butter,  250g\/9oz new potatoes, grated and squeezed dry in a clean tea towel,  salt and freshly ground black pepper ,  1 tbsp butter,  1 tbsp flour,  75ml\/2½fl oz red wine,  1 shallot, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pistachiocrustedlamb_86922"}