{"recipe_name":"Pistachio meringues with warm blueberries","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/365F\/Gas 4. For the meringues, whisk the egg whites until stiff peaks form when the whisk is removed. Gently whisk in the caster sugar, one tablespoon at a time, until the mixture becomes glossy. Add the vinegar and pistachios and fold gently into the meringue mixture. Line a non-stick baking tray with greaseproof paper and place a 7cm\/3in chefs' ring on top. Spoon the egg white mixture into the chefs' ring. Remove the chefs' ring and rinse to clean. Repeat this process to create 6-8 moulded mounds of meringue mixture. (Be careful to leave plenty of space between each portion.) Transfer to the oven and immediately reduce the temperature to 150C\/300F\/Gas 2. Bake for 45 minutes, or until the meringues are golden-brown and hard on the outside but still chewy in the middle. For the filling, whisk the cream in a bowl with the vanilla seeds and sugar until stiff peaks form when the whisk is removed.  Add the yoghurt and gently fold into the cream mixture. For the blueberries, melt the butter in a clean pan over a medium heat. Add the honey and bring to the boil. Add the orange juice and zest and stir well.  Add 300g\/10½oz of the blueberries and stir until they are completely coated in sauce, then remove from the heat. To serve, place a meringue onto each serving plate. Top with a generous dollop of cream mixture and drizzle the cream with the warm blueberries. Arrange a few of the remaining uncooked blueberries around the plate and serve. ","ingredients":" 6 free-range egg whites,  300g\/10½oz caster sugar,  1 tsp vinegar,  150g\/5oz pistachios, shelled and roughly chopped,  1 tsp good quality vanilla extract,  200ml\/7fl oz double cream,  1 vanilla pod, seeds only ,  1 tbsp caster sugar,  200ml\/7fl oz Greek-style yoghurt,  25g\/1oz butter,  100ml\/3½fl oz clear honey,  ½ orange, juice and zest only,  400g\/14oz blueberries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pistachiomeringueswi_87003"}