{"recipe_name":"Pistachio millefeuille with strawberries and vanilla and mascarpone cream","author":"Paul Rankin","programme":"Put Your Money Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the filling, fold together all of the filling ingredients in a bowl until well combined (do not overmix or the mixture will lose its lightness). Transfer the filling mixture to a piping bag and chill in the fridge for 30 minutes to one hour. Meanwhile, for the millefeuille pastry, preheat the oven to 200C\/400F\/Gas 6. Mix together the butter and the egg whites until combined (small lumps of butter may remain in the mixture - this will not affect the result). Place one sheet of filo pastry onto a greased baking tray and brush all over with the egg and butter mixture.  Place another sheet of filo pastry on top of the first and brush all over with more of the butter and egg mixture. Repeat the process with a third and fourth sheet of filo pastry, brushing all over with the butter and egg mixture.  Repeat the layering process with the remaining four sheets of filo pastry. Transfer the prepared filo pastry stacks to the oven and bake for 2-3 minutes, or until the pastry sheets are crisp and golden-brown. Remove from the oven and set aside to cool. Cut six discs from both of the cooked filo pastry sheets using an upturned mug or cookie cutter as a template to make 12 discs. Sprinkle each disc with caster sugar, then return to the oven and continue to cook for a further 2-3 minutes, or until the sugar has melted. Remove from the oven, sprinkle over the pistachios and set aside to cool on a wire rack. For the strawberry coulis, blend the raspberries, strawberries and caster sugar in a food processor until smooth. Strain the mixture through a sieve and discard the seeds.  To serve, place one filo pastry disc into the centre of each of four serving plates. Pipe over some of the filling mixture then arrange some of the strawberry halves on top. Repeat the process until each millefeuille has three layers and all of the pastry and filling mixture has been used up, finishing each tower with a pastry disc. Top each millefeuille with a few fresh strawberries. Drizzle the strawberry coulis around the edge of each plate. ","ingredients":" 125g\/4½oz  mascarpone,  125g\/4½oz double cream, whipped until soft peaks form when the whisk is removed,  50g\/1¾oz caster sugar,  1 vanilla pod, seeds only,  160g\/5½oz butter, chopped, softened, plus extra for greasing,  2 egg whites, lightly whisked until frothy ,  8 sheets ready-made filo pastry,  200g\/7¼oz caster sugar,  200g\/7¼oz pistachios, roughly chopped,  200g\/7¼oz frozen raspberries (or fresh raspberries),  12 fresh strawberries, hulls removed, cut in half,  3 tbsp caster sugar,  2 x 250g\/9oz punnets fresh strawberries, hulls removed, cut in half, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pistachiomillefeuill_91399"}