{"recipe_name":"Beef and ale stew with dumplings","author":"Mike Robinson","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/320F\/Gas 2. Heat a large casserole on the hob. Add some of the vegetable oil and, when hot, add some of the beef in a single layer and cook over a high heat until browned. When browned, remove the beef to a bowl, before adding the next batch and browning. Don't crowd the pan. Remove the last batch of meat and place in a bowl. Roughly chop the celery. Add the last bit of oil to the casserole and add the celery. Roughly chop the carrots and onions and add to the casserole. Slice the garlic and add to the casserole. Stir all the vegetables thoroughly and allow them to brown gently, scraping up the browned bits from the bottom of the pan as you go. Once the vegetables are coloured, add the tomato purée and stir. Add the flour and stir together well until the flour is incorporated. Season with salt and freshly ground black pepper. Add the ale to the casserole, followed by the beef stock. Bring up to the simmer and return the browned beef to the casserole. Cover with a lid and simmer. Make the dumplings. Place the suet in a clean bowl and add the flour. Using your hands, mix the suet and flour well, then season with salt and freshly ground black pepper. If you want horseradish dumplings, now is the time to add it to the mix. Make a well in the centre of the flour and suet mixture and add water a bit at a time. Mix with your hands until you get a firm dough that comes away cleanly from the sides of the bowl. Turn the dough out onto a clean board and sprinkle over some flour. Roll the dough out into a sausage shape, then form into six golf ball-sized dumplings (they'll double in size when cooking). Carefully drop the dumplings into the stew. You can store any unused dumpling dough wrapped in cling film in the fridge for two or three days. Cover the casserole with a lid and place in the preheated oven to cook for 2½-3 hours, checking periodically. After two hours, turn the dumplings over. Add the bay leaves and the thyme and continue cooking for a further half hour to an hour. When the beef is done, it should fall apart to the touch and the dumplings should be light and fluffy. Serve the dumplings and beef stew in large bowls. ","ingredients":" 2 tbsp vegetable oil,  1kg\/2lb 3oz diced shin of beef (cut off the bone into large pieces),  2 sticks celery,  2 carrots,  2 large onions,  3 cloves garlic,  1 heaped tsp tomato purée,  1 tbsp plain flour,  salt and freshly ground black pepper,  ½ litre\/17fl oz real ale or bitter,  200ml\/7fl oz dark beef stock,  2 bay leaves,  1 sprig fresh thyme,  150g\/5oz beef suet,  150g\/5oz self-raising flour, sifted, plus extra for dusting,  salt and freshly ground black pepper,  1 tsp prepared horseradish (optional),  water to bind","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefandalestewwithdu_90180"}