{"recipe_name":"Pittsburgh black and blue steak, fried duck egg and bone marrow with radish and watercress","author":"Tom Kerridge","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the bone marrow, soak the bone marrows in salted water for 24 hours, changing the water three times to make sure all the blood has washed out. For the steak and marinade, add the paprika, cayenne, cumin, garlic, vegetable oil and sage to a bowl. Whisk until fully combined. On a chopping board or firm surface, lay out pieces of cling film or baking parchment and place the steak on top, then lay a another sheet of cling film (or baking parchment) over the meat. Using a cutlet bat or rolling pin, flatten the steak until the steak is 1cm\/½in thick. Remove from the cling film and place the steaks in the marinade. Rub until coated all over and set aside. For the English dressing, whisk the mustard, vinegar and rapeseed oil together. Season with salt and sugar. Set aside. For the salad, pick the watercress leaves, discarding any thicker stalks, and place in a bowl of iced water. Cut the radishes in half and leave to dry on kitchen paper. Lightly salt the cucumber slices with sea salt, leave for 20 minutes, then wash and dry the cucumber slices. Remove the watercress from the iced water and dry using a salad spinner or kitchen paper. In a large salad bowl, combine the watercress, radish, cucumber and grated horseradish. Lightly toss together and set aside.  Preheat the oven to 180C\/350F\/Gas 4. Put a roasting tray on the top shelf to warm. Add the bone marrow to the preheated roasting tray, put in the oven for six minutes, or until the marrow is just cooked. Remove from the oven leave to rest in a warm place.  In a small frying pan, melt the beef dripping over a low heat, then break in the duck eggs and cook very gently. Add the roasted bone marrows to one side of the pan.  Brush the sourdough with the melted beef dripping and then toast in a hot frying pan, griddle or under a hot grill.  To cook the steak, preheat a heavy-based frying pan until smoking hot.  Add a little oil to the pan. Remove the steaks from the marinade and transfer to the hot pan and cook for 30 seconds on both sides, so the steaks and spices are darkly toasted but the steak remains very rare in the middle. Remove from the pan and set aside to rest while you make the salad. When the duck egg is cooked, remove the egg and bone marrow from the pan. Place the toasted sourdough on serving plates and lay the bone marrow at one end of the bread and an egg to one side. Season the egg with sea salt and black pepper. To serve, slice the steaks and lightly season with salt and pepper. Add the dressing to the salad leaves and toss to coat. Serve with the sourdough, marrowbone and fried egg. ","ingredients":" 2 x 2½cm\/1in cut bone marrows, with a hole wide enough to fit a teaspoon ,  flaked sea salt and black pepper,  2 tsp smoked paprika,  1 tsp cayenne pepper,  ½ tsp ground cumin,  1 garlic clove, peeled and grated,  2 tsp vegetable oil, plus extra for frying ,  1 tsp dried sage ,  2 x 250g\/9oz beef fillet tails ,  50g\/1¾oz beef dripping,  2 free-range duck eggs,  2 x 1½cm\/⅝in thick slice sourdough bread,  10g\/⅓oz English mustard,  20g\/¾oz white wine vinegar,  80g\/3oz rapeseed oil,  salt, to taste,  5g sugar,  200g\/7oz watercress ,  6 breakfast radishes, green tops left on, washed ,  ½ cucumber, peeled, seeds removed and cut into 5mm slices,  flaked sea salt,  50g\/1¾oz fresh horseradish, grated ,  3 tbsp English dressing (from above)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pittsburgh_black_and_30011"}