{"recipe_name":"Beef and mango Jamaican stew","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the nutmeg, curry powder, soy sauce, chilli and salt and freshly ground black pepper into a bowl and mix well. Add the chunks of beef and mix well to coat evenly in the mixture.  Heat the vegetable oil in a pan until smoking, then fry the meat for 1-2 minutes on all sides, or until golden-brown all over. Remove the beef from the pan and set aside.  Add the onion, pepper and garlic to the pan and fry for for 3-4 minutes, or until softened, then stir in the tomato purée and chopped tomatoes and cook for 2-3 more minutes.  Add the meat back into the pan along with the potato chunks, rum and stock, then bring to boil. Reduce to a simmer and cook for 1 hour to 1 hour 30 minutes, or until the beef is tender. Stir in the mangoes and thyme and cook for a further 4-5 minutes to heat through.  Serve the Jamaican stew alongside cooked long grain rice, and a rum cocktail if desired. ","ingredients":" 1 tsp freshly grated nutmeg,  1 tbsp curry powder,  1 tbsp light soy sauce,  1 Scotch bonnet chilli, finely chopped ,  salt and freshly ground black pepper ,  450g\/1lb braising steak, cut into chunks,  2 tbsp vegetable oil,  1 onion, peeled, thinly sliced,  1 green pepper, seeds removed, sliced,  1 garlic clove, peeled, crushed ,  1 tbsp tomato purée,  4 tomatoes, chopped,  1 baking potato, peeled and cut into large chunks,  50ml\/2fl oz rum,  300ml\/10½fl oz beef stock,  2 just-ripe mangoes, peeled, stones removed, chopped,  1 tbsp chopped fresh thyme,  long grain rice, cooked according to packet instructions, drained, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefandmangojamaican_92087"}