{"recipe_name":"Plum and almond pie","author":"Polly Whitehead","programme":"Hairy Bikers' Meals on Wheels","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 18","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease and line three loose-bottomed 18cm\/7in tart tins. For the pastry, measure the water in a jug, add the sugar and stir until the sugar has dissolved.  Sift the flour, baking powder and salt into a bowl. Add the fat and rub in with your finger tips until it resembles fine breadcrumbs. Make a well in the centre of the flour mixture and pour in the water as quickly as possible, using your fingertips to mix together and form a dough. You may need to add a little more water. Wrap the dough in cling film and rest for at least an hour. Roll the pastry out thinly on a floured work surface and use it to line the tart tins. Spread the base of each tart with about two tablespoons of the jam. Meanwhile, melt the butter and sugar together, add the ground almonds, eggs and almond essence and mix well. Pour the mixture evenly into the three pastry-lined tins. Place the plums on top of the tarts cut side up, sprinkle with flaked almonds then bake in the oven for 40-45 minutes or until the filling is set. Melt the redcurrant jelly in a pan and brush it over the warm tarts. ","ingredients":" 4 tbsp water,  60g\/2¼oz caster sugar,  450g\/1lb plain flour,  1 tsp baking powder,  pinch salt,  175g\/6oz lard or vegetable shortening,  55g\/2oz butter ,  60g\/2¼oz caster sugar,  6 tbsp plum jam ,  350g\/12oz butter,  350g\/12oz sugar,  350g\/12oz ground almonds,  6 free-range eggs,  3 drops almond essence,  12-14 plums, washed, halved, stones removed,  flaked almonds, to garnish,  3 tbsp redcurrant jelly","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/plum_and_almond_pie_62805"}