{"recipe_name":"Plum pudding cake","author":"Nigel Slater","programme":"Nigel Slater's Simple Cooking","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/plum_pudding_cake_75784_16x9.jpg","method":"Set the oven to 180C\/350F\/Gas 4. Use baking parchment to line a 24cm\/9½in square cake tin or baking dish.  Sift the flour, baking powder, bicarbonate of soda, cinnamon and ginger into a bowl. Warm the golden syrup, honey and butter very gently in a pan until the butter and sugar melts. Stir in the muscovardo sugar.  Set aside and allow to cool slightly. Halve the plums, or cut them into quarters if they are very large, and remove the stones. Break the eggs into a bowl, pour in the milk and whisk lightly to mix.  Pour the golden syrup mixture into the flour and mix with a large, metal spoon. Pour in the egg and milk and continue stirring till you have a loose, almost sloppy batter without any traces of flour. Tip the mixture into the lined cake tin, drop in the plums and bake for 30-35 minutes.  Now for the topping; halve and de-stone the plums and add to the same pan as you cooked the syrup and honey. Add the sugar, butter and the syrup from a jar of crystallised ginger. Cover and leave to cook down. Serve the cake with a generous topping of  the spicy plums and a dollop of cream. ","ingredients":" 250g\/8oz plain flour,  1 lightly heaped tsp baking powder,  1 level tsp bicarbonate of soda,  1 lightly heaped tsp ground cinnamon,  1 lightly heaped tsp ground ginger,  200g\/7oz golden syrup,  2 heaped tbsp thick honey,  125g\/4oz butter ,  125g\/4oz light muscovado sugar,  350g\/12oz plums,   2 large eggs,  240ml\/8fl oz milk,  5 plums,  1tbsp light muscovado sugar,  1tbsp butter,  1tbsp syrup from a jar of stem ginger,  double cream, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/plum_pudding_cake_75784"}