{"recipe_name":"Plum frangipane tarts with roasted, spiced plums","author":"James Martin","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Grease six 10cm\/4in fluted tart cases. For the tarts, lightly flour the work surface and divide the pastry into six.  Roll each piece of pastry out so that it is 2cm-3cm\/1in-1½in bigger than the tart cases.  Place the pastry into the tart cases and push into the edges. Leave the excess pastry hanging over the top of each tin. Place a large sheet of greaseproof paper into each case and fill with baking beans or rice. Place on a tray and bake in the oven for 15 minutes until just golden. After 15 minutes, take the pastry out of the oven and remove the greaseproof paper and beans. Then return to the oven for another five minutes. Remove the pastry cases from the oven and trim the excess from the top of each tart to give a clean edge. Set them to one side. For the frangipane, place the butter and 150g\/6oz of  icing sugar into a bowl and beat until light and softened.  Add the ground almonds, flour and cinnamon and stir until combined. Add the eggs, one at a time, beating carefully. Add the rum and stir to make a smooth thick batter. Spoon the frangipane mixture into the pastry cases and place the plum wedges in a circle on top of the batter. Dust with two tablespoons of the icing sugar. Place in the oven for 20 minutes until golden and risen. Remove the tarts from the oven and cool for a couple of minutes, then carefully remove from the tart tins. For the roasted plums, preheat the oven to 200C\/400F\/Gas 6. Heat a frying pan until hot, add the butter, allspice, cinnamon, nutmeg and sugar and cook for one minute. Add the plums and toss to coat. Place in the oven for five minutes until just softened. To serve, place the tarts onto serving plates. Spoon some roasted plums to the side and a dollop of whipped cream and dust with the remaining tablespoon of icing sugar. ","ingredients":" plain flour, for dusting,  500g\/1lb 2oz sweet dessert pastry,  150g\/6oz unsalted butter,  150g\/6oz icing sugar, plus 3 tbsp,  150g\/6oz ground almonds,  50g\/2oz plain flour,  ½ tsp ground cinnamon,  3 free-range eggs, beaten,  2 tbsp dark rum,  6 plums, stones removed, cut into wedges,  50g\/2oz butter,  1 tsp ground allspice,  2 cinnamon sticks, broken,  freshly grated nutmeg, to taste,  2 tbsp caster sugar,  6 plums, stones removed, quartered,  150ml\/6floz double cream, lightly whipped, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/plumfrangipantartwit_87608"}