{"recipe_name":"Poached chicken, tomato and artichoke salad and aioli","author":"Henry Harris","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the poached chicken, take a sharp knife and remove the legs from the chicken. Using a pair of heavy duty scissors or a heavy duty knife cut out the back bone. Flatten the chicken breast and turn it over. Remove the rib cage bone and as many other bones as you feel skilled to do. (Reserve the bones as you will need these later.) Cut off the top two joints of the wings and clean the remaining bone. Using a meat cleaver or a heavy duty knife, chop all the collected bones and place in a saucepan with the remaining ingredients. Joint the chicken legs and nestle these amongst the bones. Cover with cold water and bring to gentle simmer. (Reserve the chicken breasts and set aside as they are not used in this recipe.) Poach on a gentle heat for about 30 minutes or until the chicken is cooked and can be pulled from the bone. Set to one side and keep warm until needed. For the tomato and artichoke salad, cut off the top half of the artichokes and then pull away the leaves until all the woody green base leaves are gone and you are left with the tender yellow ones. Trim the outer part of the stalks. Place the artichokes into a pan of salted water as soon as you trim them. Simmer for about 10-15 minutes, or until tender, then drain and cut into quarters. Toast the bread to golden-brown and, while hot, rub a garlic clove into each slice. Cut the bread into fingers and put them in a bowl. Cut the tomatoes into wedges and add them to the bowl along with the quartered artichokes, red onion and parsley leaves. Lift the chicken legs from the cooking liquor, discard the skin and pull the meat off the bone and add it to the bowl. Season with salt and pepper, olive oil and a good squeeze of lemon juice. For the aioli, put the egg yolks into a food processor. Crush the garlic with the flat edge of a large knife and mash with the sea salt, add it to the yolks along with the mustard, a splash of lemon juice and four teaspoons of cold water. Blend until pale. Then, with the motor running, add the oil in a thin steady stream until you have a thick consistency. Taste to check the salt and lemon seasonings and add more if required. Finally add some freshly ground black pepper. Divide the salad between the two plates and top with a blob of aioli. ","ingredients":" 1 free-range chicken,  150ml\/5fl oz white wine,  2 garlic cloves, crushed,  2 springs fresh thyme,  1 lemon, zest only,  salt and freshly ground black pepper,  6 baby artichokes,  2 slices sourdough bread,  2 garlic cloves, peeled,  4 heirloom tomatoes,  1 red onion, finely sliced,  1 small bunch of parsley, leaves only,  olive oil,  1 lemon, juice only,  3 free-range eggs, yolks only,  2 garlic cloves ,  ¼ tsp sea salt,  ½ tsp Dijon mustard,  lemon juice, to taste,  350ml\/12fl oz rapeseed oil,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/poached_chicken_tomato_84209"}