{"recipe_name":"Poached sea trout ","author":"Raymond Blanc","programme":"Great British Food Revival","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the vegetable stock, add all of the ingredients to a large saucepan with 750ml\/1 pint 6fl oz water. Bring to the boil, skim off any scum and reduce the heat until simmering. Simmer for 40 minutes. Meanwhile, for the lemon sabayon, sit a large stainless steel bowl on top of a saucepan of boiling water (do not let the base of the bowl touch the water). Place the egg yolks and four tablespoons water into the bowl and whisk vigorously for 5-6 minutes, or until the egg yolks are pale and foamy (they should be 6-7 times their original volume). Continue whisking for another 2-3 minutes, then slowly pour the melted butter into the sabayon and whisk briefly. Season to taste, with the salt, cayenne pepper and lemon juice. Slide the trout into the simmering stock. Bring the pan back to a gentle simmer and cook the fish for 5-6 minutes. Reduce the heat to very low and add the spinach, cucumber ribbons and seaweed. Cook for a further 2-3 minutes. To serve, spoon the sliced vegetables into the middle of the serving plates, place the poached trout on top and generously spoon the sabayon on and around it, garnish with the chopped herbs.  ","ingredients":" ¼ medium carrot, peeled and thinly sliced,  ¼ medium onion, peeled and thinly sliced,  ½ celery stalk, washed and thinly sliced,  ¼ medium leek, washed and thinly sliced,  2 lemon slices,  1 bouquet garni,  1 tsp sea salt,  5 whole black peppercorns,  100ml\/3½fl oz white wine,  3 free-range egg yolks,  50g\/2oz unsalted butter, melted ,  pinch sea salt ,  pinch cayenne pepper,  2 tsp lemon juice,  4 x 100g\/3½oz trout steaks, pin bones removed,  50g\/2oz baby spinach,  50g\/2oz cucumber, peeled, sliced into ribbons,  5g\/⅛oz dried seaweed, rehydrated in hot water for 2 minutes,  1 tbsp chopped fresh chives,  1 tbsp chopped fresh chervil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/poached_sea_trout_52430"}