{"recipe_name":"Poached smoked haddock Monte Carlo","author":"Lawrence Keogh","programme":"2007-16","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fish stock, in a large pan, add the butter and gently fry the onions, leek and celery with the thyme and bay leaf, without browning. Then add 2 litres\/3½ pints water, the fish bones, parsley stalks and peppercorns. Bring the stock up to a boil, turn the heat down to a simmer and cook the fish stock, skimming occasionally. Simmer the stock for 20 minutes only - otherwise it will go cloudy. Take the stock off the heat, pour into a large container, add the lemon slices and cover the container with cling film. Leave to cool with all the bones and vegetables in. Once cooled, place in the fridge and leave overnight if possible. Next day, take the stock out and strain through a sieve. It is now ready to use. For the white wine sauce, heat a frying pan until medium hot, add the butter, shallots, mushrooms, thyme and bay leaf and cook for a few minutes, without browning. Add the white wine and reduce until the liquid has almost completely evaporated then add the fish stock and cook until reduced in volume again until almost evaporated. Add the double cream, bring to a simmer and cook on a gentle simmer very carefully for 20 minutes. Strain the sauce through a fine sieve into a clean saucepan. For the haddock Monte Carlo, pour the milk into a large pan add the onion studded with the bay leaf and cloves, the peppercorns and 200ml\/7fl oz water. Bring to a simmer. Carefully place the haddock fillets, skin side up, into the liquid and simmer for five minutes. Bring a saucepan of water to a simmer and add the white wine vinegar. Crack the eggs into the water and cook for three minutes. Remove the eggs from the pan, and keep warm in clean hot water on stove ready for use. Heat a frying pan until hot, add the olive oil and spinach and cook gently, until just wilted, then remove from the pan. Place the spinach into a colander and press to drain off any excess liquid. To serve, warm four plates. Remove the haddock fillets from the poaching liquid and gently peel back the skin. Place a small amount of spinach in the centre of each plate and place a haddock fillet on top.Sit a small amount of spinach on top of the haddock, this will act as a nest for the poached egg and prevent it from slipping.  Liberally spoon sauce over the fish and scatter over the chives and tomatoes. Serve with boiled parsley potatoes and a simple green salad. ","ingredients":" 25g\/1oz butter ,  1 onion, sliced ,  115g\/4oz leek, chopped,  115g\/4oz celery, chopped ,  2 sprigs thyme ,  2 bay leaves,  1kg\/2lb 2oz white fish bones, washed and chopped ,  1 handful parsley stalks,  10 whole white peppercorns,  2 lemon slices,  25g\/1oz butter,  115g\/4oz shallots, sliced ,  115g\/4oz button mushrooms, sliced ,  2 thyme sprigs ,  1 bay leaf,  300ml\/10fl oz white wine,  1 litre\/1¾ pints fish stock (made above),  800ml\/1 pint  8fl oz double cream,  salt and freshly ground black pepper,  1.3 litres\/2¼ pints milk,  1 onion, halved ,  1 bay leaf,  2 cloves,  10 black peppercorns,  4 x 175g\/6oz natural smoked haddock, pin boned and skin on,  4 free-range eggs, for poaching ,  50ml\/2fl oz white wine vinegar,  50ml\/2fl oz olive oil,  500g\/1lb 2oz spinach,  115g\/4oz chives, finely chopped,  3 ripe tomatoes, skinned, seeds removed and cut into diamonds,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/poached_smoked_haddock_22381"}