{"recipe_name":"Poached chicken stuffed with Stilton with creamy mushroom sauce","author":"Richard Phillips","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the chicken, with a sharp knife, carefully make a slit in the chicken, being careful not to cut all the way through, to make a pocket. Stuff the chicken with the tarragon and Stilton. Season with salt and freshly ground black pepper. Wrap the chicken in two layers of aluminium foil. Bring a saucepan of water to the boil and reduce the heat to a gentle simmer. Add the chicken parcel to the gently simmering water and poach for 12-14 minutes, or until completely cooked through.  Carefully remove the chicken parcel from the water with a slotted spoon and set aside to keep warm. Meanwhile, place the mushrooms, stalk-side up, on a non-stick baking tray and drizzle with olive oil. Place in the oven and roast for 6-8 minutes. For the sauce, in a small saucepan, heat the olive oil and butter and add the onion. Cook until soft but not coloured. Add the chopped mushroom to the pan and increase the heat. Sauté the mushrooms for 2-3 minutes, or until soft. Add the wine to the pan and gently simmer until reduced by half. Take off the heat to cool slightly. Add the cream to the pan and gently simmer again until the sauce thickens slightly.   Stir through the tarragon. Carefully unwrap the chicken parcel and, using a sharp knife, slice the breast into three medallions. To serve, place the roasted mushrooms onto a serving plate and arrange the chicken slices on top. Pour over the sauce. ","ingredients":" 1 chicken breast,  1 tbsp chopped fresh tarragon,  30g\/1oz Stilton, crumbled,  salt and freshly ground black pepper,  2 large mushrooms,  2 tbsp olive oil,  ½ tbsp olive oil,  1 tbsp butter,  ½ onion, finely chopped,  1 large mushroom, finely chopped,  3 tbsp white wine,  5 tbsp double cream,  ½ tbsp finely chopped fresh tarragon","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/poachedchickenstuffe_86947"}