{"recipe_name":"Poached chicken with carrots, kale and mushrooms","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/poachedcornfedchicke_90894_16x9.jpg","method":"For the chicken, place the chicken into a large lidded pan with the stock. Cover with the lid, then bring to the boil, reduce the heat and simmer for 20 minutes. Carefully remove the chicken from the pan and pat dry with kitchen paper. Set the chicken aside. Place the stock back onto the heat and bring to the boil. Reduce the heat and simmer for 5-8 minutes, or until the volume of liquid has slightly reduced. Season with salt and freshly ground black pepper, to taste. Meanwhile, carve the breasts from the carcass and pat dry once more. Heat a frying pan until hot, add the butter and olive oil and the chicken, skin-side down. Fry for 2-3 minutes on both side until golden-brown. For the vegetables, bring a large pan of salted water to the boil. Add the turnips and cook for 3-4 minutes, before adding the carrots. Cook for a further two minutes, then add the kale and peas. Boil for one minute, drain the vegetables and set aside. Meanwhile, heat a frying pan until hot, add the butter and olive oil and fry the mushrooms for 1-2 minutes until just cooked through. Add the drained vegetables to the pan and mix to combine. To serve, divide the vegetables between two soup bowls and place the chicken breasts on top. Ladle the stock over the top and serve immediately. ","ingredients":" 1 whole chicken, legs and thighs removed (you can use them in another dish),  1 litre\/1¾ pints chicken stock,  salt and freshly ground black pepper,  25g\/1oz butter,  1 tbsp olive oil,  125g\/4½oz baby turnips, peeled and halved,  125g\/4½oz Chantenay carrots, or other small carrots,  75g\/3oz curly kale, leaves trimmed and roughly torn,  75g\/3oz frozen peas,  25g\/1oz butter,  1 tbsp olive oil,  60g\/2½oz black trompette or other wild mushrooms (alternatively, use sliced portobello or chestnut mushrooms)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/poachedcornfedchicke_90894"}