{"recipe_name":"American-style chocolate brownies","author":"Bonnie and Peter Woods","programme":"Recipe for Success","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/355F\/Gas 4. Grease a 20cm\/8in round sandwich tin and line the base with baking parchment.  Melt the chocolate in a heatproof bowl placed over a saucepan of barely simmering water (do not allow the water to touch the bottom of the bowl), or in a microwave on low. Once the chocolate has melted, add the butter and the sugar. Stir to thoroughly combine and leave to cool slightly.  Mix the beaten eggs into the melted chocolate mixture.   In a separate bowl, sieve the flour and baking powder together, then gently fold into the chocolate mixture.  Chop the Snickers bar into small pieces and stir into the brownie mixture.  Pour the mixture into the prepared tin and bake for 15-20 minutes, or until almost firm. Leave to cool in the tin before turning out onto a wire rack. For the sauce, place all of the chocolate sauce ingredients into a heatproof bowl placed over a saucepan of barely simmering water (do not allow the water to touch the bottom of the bowl), or heat in a microwave on low, until melted. Stir together. To serve, cut the brownies into six triangles and serve with a scoop of ice cream and a generous drizzle of the warm chocolate sauce. ","ingredients":" 180g\/6¼oz dark chocolate, broken into squares,  150g\/5¼oz unsalted butter, plus extra for greasing ,  120g\/4¼oz caster sugar ,  2 free-range eggs, lightly beaten,  50g\/1¾oz plain flour ,  ½ tsp baking powder,  1 Snickers bar or similar confectionery,  140ml\/5fl oz double cream,  1 tbsp golden syrup,  140g\/5oz dark chocolate, broken into squares,  25g\/1oz butter,  vanilla ice cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/americanstylechocola_88413"}