{"recipe_name":"Beef bavette (skirt steak) with mash and garlic Portobello mushrooms","author":"Gordon Jones","programme":"Virgin Cooks","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02bynpm.jpg","method":"For the beef, season the steaks with salt and freshly ground pepper. Heat a non-reactive frying pan until hot, then add the oil then the steaks. Sear the steaks for 2-3 minutes on both sides, or until golden-brown all over.  Carefully add the white wine vinegar to the pan, then add half of the brandy and carefully tip the pan towards the flame of the hob, so that the alcohol catches alight (NB: keep clothing and fabric well clear of the flame and do not leave unattended). When the flame has gone out, add the beef stock, the garlic and the thyme. Cook for a further 2-3 minutes, then remove the steak from the pan and set aside to rest on a warm plate.   Return the pan to the heat and add the green peppercorns and the remaining brandy. Simmer the mixture for 8-10 minutes, or until the liquid has reduced to a sauce consistency. Stir in the double cream and simmer again for a further 6-8 minutes, or until the sauce is thickened and glossy. Keep warm and pour into a gravy boat when ready to serve. For the béarnaise sauce, place the egg yolks into a heatproof bowl and add the white wine vinegar and warm water. Whisk to combine, then place the bowl over a pan of just-simmering water (make sure the bottom of the bowl does not touch the water) and whisk continuously for 3-4 minutes, or until the mixture is pale and fluffy and has doubled in volume.  Slowly drizzle in the melted butter in a thin, steady stream while whisking continuously, until all of the butter is incorporated and the mixture is thickened and emulsified. Stir in the chopped tarragon and whisk in a splash of olive oil. Pour into a gravy boat when ready to serve.   For the mash, cook the potatoes in a pan of boiling water for 10-12 minutes, or until tender. Drain, return the potatoes to the pan and place back over the heat for a few minutes to drive off any excess moisture, then pass the potatoes through a potato ricer or mash with a masher. Beat in the butter and cream until well combined and season, to taste, with salt and freshly ground black pepper.  For the garlic mushrooms, melt the butter in a pan until foaming, then add the mushrooms and fry for 2-3 minutes, or until golden-brown and tender. Season, to taste, with salt and freshly ground black pepper and add the garlic and thyme. Cook for a further minute, or until the mushrooms are softened.  To serve, place the steaks onto serving plates and spoon the mash and garlic mushrooms alongside. Serve with a choice of the green peppercorn or béarnaise sauce. ","ingredients":" 4 x 250g\/9oz thick beef skirt steaks ,  salt and freshly ground black pepper,  2 tbsp olive oil,  1½ tbsp white wine vinegar,  50ml\/2fl oz brandy,  200ml\/7fl oz beef stock,  2 cloves garlic, peeled,  1 handful fresh thyme leaves,  2 tsp butter,  25g\/1oz green peppercorns,  100ml\/3½fl oz double cream,  3 free-range egg yolks,  25ml\/1fl oz white wine vinegar,  2 tsp warm water,  120g\/4oz butter, melted,  1 sprig fresh tarragon, leaves only, finely chopped,  splash olive oil,  1kg\/2lb 3oz Maris Piper or King Edward potatoes,  1 tbsp butter ,  100ml\/3½fl oz double cream ,  salt and freshly ground black pepper,  500g\/17½oz Portobello mushrooms,  50g\/2oz butter,  2 cloves garlic, peeled, thinly sliced ,  salt and freshly ground black pepper ,  1 handful picked fresh thyme leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefbavettewithmasha_92174"}