{"recipe_name":"Poached salmon with griddled asparagus, lemon mayonnaise and salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salmon, place the salmon in either a fish kettle or a large roasting tin and pour in enough cold water to cover the fish. Add the onion, bay leaves, vinegar, lemon and a good pinch of salt and freshly ground black pepper. Cover with a lid or tin foil and bring to the boil. Once at a boil, turn off the heat and leave the fish to stand in the water until it has cooled to room temperature. Meanwhile, for the salad, preheat a griddle pan until smoking hot. Toss the asparagus spears with one tablespoon of the olive oil and season with salt and black pepper.  Place the asparagus onto the hot griddle pan and cook for 2-3 minutes until charred and just tender. Remove from the pan and set aside. Prepare the croutons by adding the remaining two tablespoons of olive oil, the bread cubes and rosemary to a hot frying pan and fry for 2-3 minutes until golden and crisp. Drain onto kitchen paper. For the mayonnaise, place the egg yolks, vinegar, mustard, salt and lemon juice into a food processor. Blend to combine, then gradually add the rapeseed oil while still blending.  Continue until all the oil has been added and the mayonnaise has thickened. Season with salt and freshly ground black pepper. Once the salmon has cooled, carefully remove it from the cooking juices and transfer to a chopping board. Scrape off the skin and discard, then place the salmon on a large flat serving dish.  For the salad dressing, put the mustard and vinegar into a bowl and whisk in the extra virgin olive oil. Season the mixture with salt and freshly ground black pepper and toss with the Little Gem leaves and croutons. To serve, place some asparagus spears onto each plate with a spoonful of salad. Carefully lift the salmon off the bone and place some onto each plate. Serve with a dollop of mayonnaise. ","ingredients":" 2.5kg\/5lb 6oz whole salmon, scaled and gutted,  1 onion, quartered ,  2 bay leaves,  4 tbsp white wine vinegar ,  1 lemon, quartered,  salt and freshly ground black pepper,  24 asparagus spears,  3 tbsp olive oil,  6 thick slices white bread, cut into 1cm\/½in cubes,  2 sprigs fresh rosemary,  ½tsp Dijon mustard,  1 tbsp white wine vinegar,  3 tbsp extra virgin olive oil,  2 heads baby Little Gem lettuce, leaves separated,  2 large free-range egg yolks ,  1 tsp white wine vinegar,  ½tsp mustard powder,  1 tsp salt ,  1 lemon, juice only,  275ml\/10fl oz rapeseed oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/poachedsalmonwithgri_86412"}