{"recipe_name":"Polenta-coated gurnard with sweetcorn and tomato relish and jalapeño mayonnaise","author":"Nathan Outlaw","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the gurnard, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with sunflower oil. Heat to 180C. (To check the oil is at the right temperature, drop a cube of bread into the hot oil. It should become golden-brown in 1 minute.) (CAUTION: Hot oil can be dangerous. Don't leave unattended.)  Place the flour, egg and polenta in three dishes and dip the fish through the three dishes in that order to coat it in flour, egg and polenta. Carefully lower the fish into the fat and fry for 4-6 minutes, then remove and drain on kitchen paper. To make the relish, put all the ingredients in a large bowl, season with salt and pepper, mix and set aside. For the jalapeño mayonnaise, put the egg yolks into a food processor and start to blend. Gradually add the oil in a thin stream until you have the consistency of mayonnaise. Remove the mayonnaise from the food processor and place in a large bowl. Add the remaining ingredients and mix to combine. To serve, place the fried fish on serving plates with the relish and jalapeño mayonnaise alongside. Garnish with the lime halves and fresh coriander leaves. ","ingredients":" sunflower oil, for deep-frying,  1 free-range egg, beaten,  50g\/1¾oz plain flour,  100g\/3½oz fine polenta,  1 x 600g\/1lb 5oz gurnard, filleted and pin-boned,  1 small red onion, finely diced,  1 Dutch green chilli, seeds in and finely chopped,  1 lime, juice,  1 tbsp coriander, chopped (save a few pretty bits for the finished dish),  1 fresh corn on the cob, cooked and kernels removed,  3 ripe plum tomatoes,  1 tsp caster sugar,  50ml\/2fl oz olive oil ,  2 medium free-range egg yolks,  250ml\/9fl oz sunflower oil,  10g flatleaf parsley, leaves only, chopped,  10g coriander, leaves only, chopped,  30g\/1oz rocket leaves, chopped,  15g\/½oz grated parmesan cheese,  20ml\/¾fl oz verjus,  40g\/1½oz chopped jalapeño pepper, from a jar,  1 tsp sea salt,  1 lime, halved ,  fresh coriander leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/polenta-coated_gurnard_76777"}