{"recipe_name":"Pollack goujons with tamarind sauce","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sauce, place the tamarind concentrate, honey, soy sauce, crushed garlic and ginger into a pan and bring to the boil. Boil for 3-4 minutes, then remove from the heat. Add the lime juice and stir gently. Meanwhile, for the pollack, place the breadcrumbs and desiccated coconut into a bowl and mix well. Heat the oil in deep, heavy-bottomed pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Season the fish all over with salt and freshly ground black pepper, then dredge in the flour to coat.  Dip the floured pollack strips into the egg, then into the breadcrumb mixture to completely coat. Carefully place the fish strips into the hot oil and deep-fry for 4-5 minutes, or until crisp and golden. Carefully remove with a slotted spoon and drain on kitchen paper. To serve, place the pollack goujons onto a bowl with the dipping sauce in a bowl alongside. Garnish with lime wedges and sprinkle chopped parsley over the fish. ","ingredients":" 200ml\/7fl oz tamarind concentrate, diluted, to taste, with water (available from Asian and Indian supermarkets and online),  75ml\/2½oz clear honey,  1 tbsp light soy sauce,  2 garlic cloves, crushed ,  1 tbsp grated fresh ginger,  2 limes, juice only,  vegetable oil, for deep-frying,  150g\/5oz breadcrumbs,  75g\/3oz desiccated coconut,  250g\/8½oz pollack, or similar white fish, skinned and cut into strips,  salt and freshly ground black pepper,  125g\/4oz plain flour,  2 free-range eggs, beaten,  lime wedges,  fresh parsley, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pollackgoujonswithta_85572"}