{"recipe_name":"Polpettone","author":"Katie and Giancarlo Caldesi","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato sauce, heat the olive oil in a frying pan and fry the onion for 5-7 minutes.  Add the whole garlic cloves and cook for about one minute. Season with salt and freshly ground black pepper. Add the chopped tomatoes and the stock. Let the mixture simmer and reduce for about 40 minutes. You may wish to add more stock and let it boil for longer, or add further seasoning, according to taste. Preheat the oven to 180C\/350F\/Gas 4. For the polpettone, mix the onion, parsley, carrot, parmesan, mince, one egg and garlic. Season with salt and freshly ground black pepper.  Add another egg and mix by hand. Form the mixture into a rectangle, placing the slice of ham along the centre.  Heat the olive oil in a frying pan. Beat the last egg, then coat the polpettone in the beaten egg and the breadcrumbs and sauté in the olive oil until brown on all sides, about 10-15 minutes. Put the polpettone in a deep baking tray, pour the sauce over the top, season with salt and freshly ground black pepper to taste and cook in the oven for 30-40 minutes. To see if the meatloaf is cooked, insert a knife into the centre. If the juices run clear, it is ready. Serve. ","ingredients":" 6-8 tbsp olive oil,  ½ large red onion, finely chopped,  2 cloves garlic,  salt and freshly ground black pepper,  2 x 400g\/14oz tins chopped tomatoes,  200ml\/7fl oz vegetable stock,  75g\/3oz onion, finely chopped ,  handful parsley, finely chopped,  40g\/1½oz carrot, chopped,  large handful grated parmesan,  400g\/14oz minced beef,  3 free-range eggs,  2 cloves garlic, finely chopped,  salt and freshly ground black pepper,  100g\/3½oz ham, sliced,  5 tbsp olive oil,  110g\/4oz breadcrumbs soaked in water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/polpettone_82904"}