{"recipe_name":"Porchetta with mulled apple compôte and bread pudding","author":"Brian Turner","programme":"A Taste of Britain","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/435F\/Gas 7. Rub the oil into the pork loin and season with salt and pepper. Place on a baking tray and bake for 30 minutes. Reduce the temperature to 160C\/320F\/Gas 2½ and cook for a further 90 minutes. Cover with tin foil and leave to rest in a warm place for 10 minutes before serving. For the compôte, put the cinnamon stick and cloves in a pan with the cider, bring to the boil, remove from the heat and set aside. Remove the cinnamon and cloves. In a clean pan, heat the butter, then fry the apples until they start to brown. Pour in the honey, cider and cider brandy and simmer for 15-20 minutes, until the apples are soft but still holding their shape. Remove the apples and set aside in a dish. Heat any remaining cooking liquid to reduce it to a good sauce consistency. Pour this over the apples and leave to cool. Increase the oven temperature to 180C\/350F\/Gas 4. For the bread pudding, melt the butter in a frying pan, add the onion and garlic and fry gently, but do not allow to brown. Add the bread, start to brown it, then remove from the heat and pour into a bowl. Season the mixture with salt and pepper, add the chopped herbs, then the egg and stock and mix together. Grease an ovenproof dish, pour in the mixture and bake for 25-30 minutes, until crisp and golden-brown on top. Serve slices of pork alongside the bread pudding, with a good helping of compôte on the side.  ","ingredients":" 3kg\/6lb 8oz rolled and stuffed pork loin,  2-3 tbsp olive oil,  sea salt and freshly ground black pepper,  1 cinnamon stick,  2 cloves,  285ml\/½ pint dry cider,  55g\/2oz butter,  10 hard red apples, quartered and cored,  4 tbsp runny honey,  2 tbsp cider brandy,  85g\/3oz butter, plus extra for greasing,  1 onion, finely chopped,  1 garlic clove, crushed,  20 slices white bread, crust left on, diced,  2 tbsp chopped sage,  1 tbsp chopped parsley,  2 free-range eggs, beaten,  140ml\/¼ pint chicken stock","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porchetta_with_mulled_34996"}