{"recipe_name":"Pork dumplings with red wine sauce","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"no cooking required","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dumplings, beat the eggs and milk together in a bowl. Add the chopped ham and pork, breadcrumbs and parmesan, mix until well combined and mould into six small balls.  Place the balls on a plate or tray and chill the dumplings in the fridge for 20 minutes. Heat the oil and butter in a frying pan and fry the dumplings for eight minutes, turning regularly, until golden-brown all over. Remove from the pan and set aside to drain on kitchen paper. Keep warm. Fry the black pudding in the same pan for 2-3 minutes on each side, or until crisp, then set aside to drain on kitchen paper. Keep warm. Meanwhile, for the red wine sauce, heat the oil in a frying pan and fry the onion for 4-5 minutes, or until softened. Add the beetroot, wine, stock and thyme. Bring the mixture to the boil and cook for 20 minutes, then blend with a hand-held blender to a purée. Pass the sauce through a fine sieve, then return to the pan and heat until the volume of the liquid has reduced by half. Whisk in the butter. To serve, place a spoonful of sauce onto serving plates, top with a slice of black pudding followed by a dumpling. ","ingredients":" 2 free-range eggs,  125ml\/4½fl oz full-fat milk,  1 x 340g\/12oz can processed ham and pork, chopped,  200g\/7oz breadcrumbs,  75g\/2¾oz parmesan, grated,  1 tbsp vegetable oil,  1 tbsp butter,  6 thick slices black pudding,  1 tbsp vegetable oil,  1 onion, sliced,  200g\/7oz cooked beetroot, plus extra to garnish,  200ml\/7fl oz red wine,  75ml\/2¾fl oz chicken stock,  sprig fresh thyme,  1 tbsp butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_and_ham_dumplings_04499"}