{"recipe_name":"Pork, apple and cider pie","author":"Paul Hollywood","programme":"Paul Hollywood's Pies & Puds","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/pork_apple_and_cider_pie_14554_16x9.jpg","method":"For the filling, heat one tablespoon of oil in a large, wide pan over a medium-low heat. Add the onion and celery and cook gently for 8-10 minutes, or until soft but not coloured. Remove the vegetables from the pan. Add a little more oil if necessary, increase the heat to medium-high and add half of the pork. Brown it well on all sides, remove from the pan and repeat with the remaining pork. Turn the heat down a little. Return all the pork to the pan with the onion and celery. Sprinkle in the flour, stir and cook for one minute.  Gradually add the cider and stock, stirring them in so that the flour is absorbed. Add the apples and sage. Bring to the boil, reduce the heat and simmer for about 45 minutes, or until the pork is tender. Taste the sauce and season with salt and pepper. Transfer the filling to a 1.2 litre\/2lb 12oz pie dish and leave to cool. For the cider pastry, beat the egg in a large bowl with the cider, olive oil, baking powder and salt. Gradually mix in the flour until you have a soft dough. You may not need all the flour. Wrap the dough in cling film and leave to rest in the fridge for 30 minutes. Heat your oven to 200C\/400F\/Gas 6. On a lightly floured surface, roll out the pastry to a 3mm thickness. Cut a 2cm\/¾in strip from the pastry. Dampen the rim of the pie dish with water. Press the pastry strip onto the rim and dampen this too. Sit a pie funnel in the centre of the filling. Put the remaining pastry over the pie and press down the edges to seal. Crimp the edges then trim off the excess pastry. Brush the pastry with beaten egg and make a steam hole in the centre, exposing the funnel. Bake for 35-40 minutes, or until the pastry is crisp and golden-brown. Leave for 10-15 minutes before serving, with mash and greens. ","ingredients":" 1-2 tbsp vegetable oil,  1 medium-large onion, chopped,  2 celery sticks, chopped,  500g\/1lb 2oz pork shoulder, cut into 3-4cm\/1½ pieces,  2 tbsp plain flour,  175ml\/6fl oz dry cider,  175ml\/6fl oz chicken stock,  1 cooking apple, about 150g\/5½oz, peeled, cored and sliced,  2 eating apples, 225-250g\/8-9oz in total, peeled, cored and sliced,  6 large sage leaves, chopped ,  salt and pepper,  1 free-range egg, beaten,  125ml\/4fl oz dry cider,  125ml\/4fl oz olive oil,  1 tsp baking powder,  pinch of salt,  350-400g\/12-14oz plain flour,  1 free-range egg, to glaze,  mash,  greens","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_apple_and_cider_pie_14554"}