{"recipe_name":"Pork, apple and fennel sausage rolls","author":"Aldo Zilli","programme":"Country Show Cook Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a small, non-stick frying pan over a medium heat. Add the fennel seeds and toast until aromatic (approximately 30 seconds), shaking the pan occasionally. Use a pestle and mortar to grind the seeds to a powder. Heat the olive oil in a frying pan set over a medium-low heat. Add the chopped fennel, shallot and garlic. Cook for five minutes, or until the fennel is golden-brown and tender. Add the pancetta to the pan.  In a large bowl, combine the minced pork, toasted fennel seeds, cooled fennel mixture, breadcrumbs, apples, parsley and egg yolk. Season generously with salt and freshly ground black pepper and add a pinch of lemon zest. Preheat the oven to 200C\/400F\/Gas 6 and line two large baking trays with baking paper.  Cut the pastry in half widthways, roll each piece out on a lightly floured work surface to a 25cm\/10in square. Cut each pastry sheet in half. Divide the mince mixture into four equal portions. Shape each portion into a log and place on the centre of each piece of pastry. Brush the edges of the pastry well with the beaten egg. Fold the pastry over to enclose the filling, overlapping the edges and pressing to seal. Transfer to the lined trays and refrigerate for 20 minutes. Place the sausage rolls on a chopping board, seam-side down. Cut each roll into three equal pieces. Transfer back to the lined trays, leaving room between the pieces for them to spread during cooking. Brush the sausage rolls with more beaten egg and sprinkle with sesame seeds. Bake for 15 minutes, then reduce the temperature to 180C\/350F\/Gas 4. If the trays are on separate shelves swap them around at this point. Bake for a further 10-15 minutes, or until golden-brown.  ","ingredients":" 3 tsp fennel seeds,  1 tbsp olive oil,  1 small fennel bulb, trimmed and finely chopped,  1 shallot, finely sliced,  2 garlic cloves, finely chopped ,  60g\/2¼oz pancetta, chopped,  300g\/10½oz minced pork,  60g\/2¼oz fresh breadcrumbs,  2 small dessert apples (approximately 100g\/3½oz), peeled and coarsely grated,  2-3 tbsp flat-leaf parsley, coarsely chopped ,  1 free-range egg yolk,  1 lemon, zest only,  550g\/1lb 4oz ready-made puff pastry,  1 free-range egg, lightly beaten,  1 tbsp sesame seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_apple_and_fennel_99604"}