{"recipe_name":"Pork fest","author":"James Martin","programme":"Home Comforts at Christmas","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03b24nh.jpg","method":"Put the pork belly and ribs into a large, heavy-based, lidded saucepan and cover with cold water.  Add the carrots, cinnamon, bay leaves, onions, star anise and cloves. Cover the pan with the lid and bring to the boil, then simmer very gently for 1½ hours. Remove from the heat and set aside to cool.  Meanwhile, for the sauce heat the butter in a frying pan over a medium heat. Add the Bramley apples and fry for 3-4 minutes, or until just softened.  Add the sugar, soy, ketchup, teriyaki sauce, tamarind paste and maple syrup, stir well to combine and bring to the boil. Reduce the heat and simmer, uncovered, for 4-5 minutes, or until the apple is very soft.  Beat the mixture until the apple has broken down and the sauce is smooth. Season with salt and pepper. Preheat the oven to 230C\/210C Fan\/Gas 8. Lift the pork belly and ribs from the cooking liquor. Place the ribs into a large roasting tray and spread half of the sauce over them. Roast in the oven for 10-15 minutes, basting the ribs in their sauce halfway through cooking, and spooning on more sauce if necessary. Meanwhile, heat a frying pan over a high heat. When the pan is hot, add the pork belly, fat-side down, and fry for 3-4 minutes, or until golden-brown.  Turn over the meat and fry on the other side until browned. Spoon over the remaining sauce and continue to cook until the pork belly is warmed through. To serve, pile the ribs onto a serving platter. Carve the pork belly and pile it alongside. Sprinkle with the chopped spring onions and serve with a dressed green salad. ","ingredients":" 1kg\/2lb 4oz pork belly,  1.5kg\/3lb 5oz baby back pork ribs,  2 carrots, cut into chunks,  1 cinnamon stick,  2 fresh bay leaves,  2 onions, roughly chopped,  2 star anise,  1 tsp cloves,  25g\/1oz butter,  500g\/1lb 2oz Bramley apples, peeled, cores removed, roughly chopped,  100g\/3½oz soft light brown sugar,  5 tbsp dark soy sauce,  200g\/7oz chilli-tomato ketchup,  5 tbsp ready-made teriyaki sauce ,  2 tbsp tamarind paste,  5 tbsp maple syrup,  salt and freshly ground black pepper,  4 spring onions, trimmed and sliced,  dressed green salad","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_belly_and_pork_ribs_11840"}