{"recipe_name":"Pork belly with fennel salt, potato and celeriac purée and an apple and fennel sauce ","author":"Ed Baines","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7.  Pound the salt and fennel seeds together in a pestle and mortar and rub over the scored pork skin. Place the pork into a large roasting tray and add 500ml\/18fl oz of hot water to the bottom of the tray. Roast for 45-60 minutes, or until the skin is crisp and golden-brown all over. Turn the oven down to 150C\/300F\/Gas 2 and cook for a further three hours. Set aside to rest before carving. For the apple and fennel sauce, heat the butter in a saucepan and add the garlic, apples and fennel. Cook over a low heat until the apples and fennel have softened.  Add the stock and lemon juice and cook very gently for 30 minutes, stirring occasionally.  Cool slightly and then purée with a hand-held blender and add a pinch of sugar. Set aside. For the pork gravy, heat a little olive oil in a large saucepan. Add the pork trimmings and fry for 6-8 minutes, or until golden-brown. Add the vegetables and cook for 8-10 minutes, or until softened and caramelised.  Add the star anise and pork stock (or chicken stock) to the vegetables, bring to the boil and simmer for an hour. Strain the sauce into a clean pan, whisk in the butter and season to taste with salt and freshly ground black pepper. While the gravy is cooking, make the purée. Put the celeriac in a saucepan, cover with the milk and bring to the boil. Reduce to a simmer and cook for 40 minutes, or until completely soft.  Strain the celeriac and then tip into a food processor and blend until smooth.  Boil the potatoes in a large pan of salted boiling water and cook until tender. Drain thoroughly then mash with the butter and cream. Combine with the celeriac purée and season to taste with salt and freshly ground black pepper. For the cabbage, heat a little oil and the butter in a large saucepan, add the pancetta and fry for five minutes until golden-brown. Add the cabbage, fry for 2-3 minutes, then add the pork stock (or chicken stock). Cover with a lid then transfer to then oven for 20 minutes. To serve, place slices of the pork belly on serving plates. Add the purée, apple and fennel sauce and cabbage and serve the gravy alongside. ","ingredients":" 2kg\/4lb 8oz piece pork belly, boned and rolled, skin scored (your butcher can do this for you),  2 tbsp sea salt,  1 tbsp fennel seeds,  85g\/3oz butter,  3 garlic cloves, peeled,  3 Bramley apples, peeled and cored,  1 head fennel, finely chopped,  4 tbsp chicken stock,  1 tsp lemon juice,  pinch sugar,  olive oil, for frying,  200g\/7oz pork trimmings, chopped ,  1 fennel bulb, chopped,  1 leek, chopped,  1 onion, chopped,  2 carrots, chopped,  2 star anise,  500ml\/18fl oz pork stock( or chicken stock),  25g\/1oz cold unsalted butter,  1 small head celeriac, peeled and sliced,  500ml\/18fl oz full-fat milk ,  2 large potatoes, peeled,  50g\/1¾oz unsalted butter,  200ml\/7oz double cream,  salt and freshly ground black pepper,  dash olive oil,  25g\/1oz unsalted butter,  200g\/7oz cubed pancetta,  1 savoy cabbage, shredded,  150ml\/5fl oz pork stock (or chicken stock)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_belly_with_fennel_81958"}