{"recipe_name":"Pork cheeks with sauerkraut","author":"Antonio Carluccio","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Dust the pork cheeks with the flour to coat. Heat a casserole dish until hot, add the olive oil and pork cheeks and cook on each side for about five minutes until golden-brown. Remove the pork cheeks from the pan, and set aside. Add the speck to pan and fry for a couple of minutes. Then add the vegetables and fry gently for a few minutes. Add the peppercorns, a couple of gratings of nutmeg, the wine and stock and bring to a simmer. Return the pork to the pan and mix well then cover with a lid and place in the oven for 1½ - 2 hours. Season, to taste, with the apple balsamic vinegar. For the sauerkraut, tie the peppercorns and juniper in piece of muslin, secured with string.  Put all the sauerkraut ingredients into a large saucepan with a lid. Bring to the boil, then reduce the heat and cover. Cook for 20 minutes, stirring from time to time. Taste the sauerkraut for seasoning and texture: you want a little bit of crunch still. If you need more moisture, add some more apple juice. Remove the muslin bag and season with salt and pepper.  To serve, divide the pork cheeks equally among the plates and serve the sauerkraut alongside.  ","ingredients":" 8 pork cheeks, weighing 75g\/3oz each,  1-2 tbsp plain flour ,  2 tbsp olive oil,  115g\/4oz speck, finely diced,  2 tbsp Chantenay carrots, very finely chopped,  2 tbsp celery, very finely chopped,  10 black peppercorns ,  nutmeg, whole, for grating,  50ml\/2fl oz dry white wine,  500ml\/18fl oz chicken stock,  2 tsp apple balsamic vinegar,  salt and freshly ground pepper,  ½ tsp whole black peppercorns ,  1 tsp juniper berries,  1 savoy cabbage, cut into very thin strips ,  1 litre\/1¾ pint apple juice ,  1 tbsp granulated sugar ,  50ml\/2fl oz white wine vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_cheeks_with_90856"}