{"recipe_name":"Pork fillet stuffed with black pudding and an apple, mushroom and cider sauce","author":"The Hairy Bikers","programme":"Hairy Bikers' Meals on Wheels","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oven to 190C\/375F\/Gas 3.  Cut a slash down the pork loin to form a pocket down its length. Mould the black pudding into a sausage shape and stuff it into the pork loin.  Spread a piece of aluminium foil onto the work surface and lay on the rashers of bacon to form a rectangular sheet of meat. Lay the stuffed loin onto the bacon, at right angles to the rashers, and place the sage leaf strips on top of the pork. Season with sea salt and freshly ground black pepper then roll up using the foil to help you to make a tidy roll. Carefully roll out of the foil onto an oiled baking tray, with the loose ends of the bacon tucked underneath the roll.  Heat the vegetable oil in an ovenproof frying pan then place the roll join side down into the hot fat to seal the join. Gently turn the roll and fry until the bacon starts to colour. Place in the oven for 20-25 minutes then remove from the oven and set aside to rest for at least ten minutes. Meanwhile make the sauce. Place the sugar and butter in a pan and stir until the sugar has dissolved. Cook the apples in this caramel for 10-12 minutes, or until golden-brown, then set aside. Heat the olive oil in a clean frying pan and gently cook the onion until soft but not brown. Add the mushrooms and continue to cook for a minute or two then add the bouquet garni, cider, mustard and salt and freshly ground black pepper. Simmer for ten minutes until the cider has reduced then add the cream and cooked apples and heat gently. (Do not allow the sauce to boil.) To serve, slice the pork and arrange on serving plates. Pour over the sauce and garnish with a few sprigs of chervil. ","ingredients":" 800g\/1lb 2oz pork fillet,  400g\/7oz black pudding, skin removed,  250g\/9oz streaky bacon, thinly sliced,  4 sage leaves, cut into strips,  sea salt and freshly ground black pepper,  1 tbsp vegetable oil, for frying,  1 tbsp soft dark brown sugar,  30g\/1oz butter,  3 apples, peeled, cored, quartered,  1 tbsp olive oil,  1 onion, finely chopped,  150g\/5½oz button mushrooms,  1 bouquet garni of celery, parsley, bay and thyme,  250ml\/9fl oz cider,  2 tsp Dijon mustard,  200ml\/7fl oz cream,  few sprigs fresh chervil, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_fillet_stuffed_with_95175"}