{"recipe_name":"Pork loin chops with apples, cider and creamy butter bean mash","author":"The Hairy Bikers","programme":"The Hairy Bikers' Cook Off","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pork, rub half the olive oil into the chops and season with sea salt and freshly ground black pepper. Heat the remaining oil and the butter in a frying pan over a medium heat then place the chops in the pan along with the wedges of apple and fry for 2-3 minutes or until golden-brown underneath.  Turn the chops and apple wedges over and cook for another 2-3 minutes.  Add the sage leaves, fry for another 1-2 minutes, then increase the heat to high. Pour in the cider and boil for a minute or two to reduce slightly, then pour in the cream and boil for one more minute, or until the sauce thickens slightly and the pork is cooked through. Set aside to rest for a few minutes. Meanwhile, for the mash, heat the olive oil and butter in a pan over a medium heat and fry the garlic and onion together for five minutes, or until softened. Season with sea salt and freshly ground black pepper, then add the butter beans, cream and sage to the pan and heat through.  Gently mash the mixture with a potato masher, adding a splash of boiling water to loosen the consistency if needed. Stir in the mustards, to taste, and check the seasoning. For the spinach, wilt the spinach in a hot pan with just the water clinging to its leaves then add the butter and stir until melted. Season, to taste, with salt and freshly ground black pepper. To serve, place the mash onto two warm plates and top with the spinach, followed by a pork chop. Spoon over the sauce and arrange the apples around the edge of the plates. ","ingredients":" 2 pork loin chops, preferably British and free-range,  2 tbsp olive oil,  sea salt and freshly ground black pepper,  knob of butter,  1 English eating apple, cored and cut into wedges,  4 fresh sage leaves, chopped,  100ml\/4fl oz dry cider,  2 tbsp double cream,  1 tbsp olive oil,  knob of butter,  1 garlic clove, crushed,  ½ red onion,  1 x 400g\/14oz can butter beans, drained and rinsed,  100ml\/4fl oz double cream,  3-4 sage leaves, finely chopped,  1 tsp wholegrain mustard,  1 tsp Dijon mustard,  small bunch spinach, washed and drained,  25g\/1oz butter,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_loin_chops_with_55999"}