{"recipe_name":"Pork medallions on a bed of chard with bacon and cider sauce","author":"Brian Turner","programme":"A Taste of Britain","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the pork between two sheets of greaseproof paper and bash them with a rolling pin until 2cm\/¾in thick. Gently heat a frying pan, add the oil and then 25g\/1oz butter. Fry the pork in batches until it begins to brown, then turn over and brown the other side, until cooked through. Remove from the pan and season with salt and pepper. For the sauce, add the apple to the pan used to cook the pork. Colour it lightly, then drain and take out of pan and set aside. Fry the bacon in the same pan. Remove and set aside.  Drain the excess fat from the pan, then add the cider, apple juice and stock and heat until reduced in volume by half. Stir in 25g\/1oz butter and set aside. Meanwhile, in a clean pan, heat 25g\/1oz butter and cook the shallots until soft. Remove the stalks from the chard and finely chop, then add them to the shallots. Cook for a few minutes until softened. Add the leaves and cook until wilted. Remove from the pan and drain well, then season with salt, pepper and nutmeg. To serve, reboil the sauce. Taste and season with salt and pepper, if necessary. Pass it through a sieve then add the fried apple. To serve, divide the chard between four plates and lay two pieces of pork on top. Pour the sauce over the meat, sprinkle with the cooked bacon and serve. ","ingredients":" 8 x 85g\/3oz pork medallions,  1 tbsp vegetable oil,  25g\/1oz butter,  salt and freshly ground black pepper,  1 dessert apple, peeled and cut into batons,  3 rashers back bacon, cut into thin strips,  3 rashers streaky bacon, cut into thin strips,  100ml\/3½fl oz cider,  100ml\/3½fl oz apple juice,  100ml\/3½fl oz chicken stock,  25g\/1oz butter,  25g\/1oz butter,  2 shallots, finely chopped,  500g\/1lb 2oz rainbow chard,  pinch freshly grated nutmeg","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_medallions_on_a_bed_58892"}