{"recipe_name":"Pork rillettes","author":"Toby Gritten","programme":null,"prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place all the meat, fat and bones into a large bowl. Add the salt, sugar and bay leaves. Using a spice grinder, grind the juniper berries, black peppercorns, cloves and nutmeg to a smooth powder and add it to the meat. Get your hands in there and mix thoroughly. Cover the bowl in cling film and refrigerate overnight.  The next day preheat the oven to 140C\/280F\/Gas 1 and transfer the cured meat mixture to a heavy-bottomed pan (preferably cast iron). Add the wine, thyme, garlic and duck or goose fat. Place the pan over a low heat and stir constantly for a few minutes. When the rillette mixture is close to boiling, lay the pork skin on the surface and put the lid on the pan. Place into the oven and cook for 2½-3 hours.  Remove from the oven, take off the lid and allow to cool for 15 minutes. Remove the skin, bones and bay leaves and strain the liquid through a colander. Skim the fat off the liquid and set aside. Put the meat into a bowl with the remaining liquid and blend with an electric hand blender. Gradually add the reserved fat until the mixture is soft  Add the ground spices, taste the mixture and adjust the seasoning to your preference. Line a terrine mould with cling film and fill it with the warm rillettes mixture. Place in a fridge until set. The rillettes can be eaten as soon as set but will improve with age, and is best eaten at least one week after cooking. Serve with toast and pickles.  ","ingredients":" 1kg\/2lb 4oz pork belly (bone-in), cut into 3cm\/1¼in cubes, bones reserved,  500g\/1lb 2oz pork back fat, cut into 2cm\/1in cubes,  1 tbsp sea salt,  1 tbsp light muscavado,  2 bay leaves ,  15 juniper berries,  2 tsp black peppercorns,  4 cloves,  a good grating of nutmeg,  200ml\/7fl oz dry white wine,  3 tsp finely chopped thyme ,  5 garlic cloves, chopped,  2 tbsp duck or goose fat,  pinch ground nutmeg,  pinch ground ginger,  pinch ground cloves,  pinch white pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_rillettes_06539"}