{"recipe_name":"Pork schnitzel with fried duck egg, pickled apple and apple purée","author":"Tom Kerridge","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the peppercorns, star anise and cloves into a small, sealed muslin bag.  Place the vinegar, 100g\/3½oz of the sugar and the muslin bag in a saucepan and bring to the boil.  Remove from the heat and leave to cool. With a small melon baller, shape the Cox’s apples into balls and add them to the vinegar mixture. Set aside for at least ten minutes for the apples to absorb the vinegar. Bring 100ml\/3½fl oz of water, the remaining caster sugar and the lemon juice to the boil in a saucepan. Add the Bramley apple dice and cook until soft. Remove from the heat, cool slightly, then blend with a hand-blender and pass through a sieve into a clean saucepan. Cut the pork tenderloins in half and place between two sheets of cling film. Using a meat mallet or rolling pin bash to about 1cm\/½in thick. Remove the cling film.  Tip the flour, eggs and breadcrumbs into separate shallow dishes. Place the pork slices in the flour, then the egg and then the breadcrumbs, tossing to coat thoroughly.  Heat a non-stick frying pan until hot, add a little oil and butter and fry the pork on each side until golden-brown and just cooked through. In a separate frying pan, heat a little oil and butter and fry the duck eggs, season with salt and freshly ground black pepper and place on top of the pork. Bring the butter and 200ml\/7fl oz of water to the boil in a small saucepan, season with salt and freshly ground black pepper and add the sliced celery. Cook until the celery just loses its bite. Drain well.   To serve, re-heat the apple purée, if necessary, and serve the pork with the apple purée, pickled apple and celery, and garnish with celery leaves. ","ingredients":" 5 peppercorns,  2 star anise,  4 cloves,  110ml\/4fl oz white wine vinegar,  125g\/4½oz caster sugar,  2 English Cox’s apples,  1 lemon, juice only,  1 Bramley apple, peeled and diced,  2 pork tenderloins,  75g\/3oz plain flour,  3 free-range eggs, lightly beaten,  125g\/4½oz Japanese panko breadcrumbs,  vegetable oil and butter, for frying,  4 free-range duck eggs,  50g\/2oz butter,  4 sticks celery, peeled and sliced,  celery leaves for garnish ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_schnitzel_with_81329"}