{"recipe_name":"Pork with pomme purée and charcutière sauce","author":"Cary Docherty","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pork brine, combine all the ingredients in a large pan. Add 1.1 litres\/2 pints water and bring to the boil. Remove from the heat, strain through a fine sieve and chill in the fridge overnight. For the sauce, heat a medium saucepan and drizzle in enough vegetable oil to just cover the base of the pan. Gently fry the chopped shallot, peppercorns, thyme and bay leaf until the shallots are tender. Increase the heat to high, add the vinegar, wine and brandy. Cook until most of the liquid has evaporated and the shallots are almost dry. Add the veal and chicken stock and reduce until almost dry again. Stir in the cream and bring to the boil. Strain through a fine sieve and set aside until ready to serve.  For the pomme purée, put the potatoes in a pan with enough cold, salted water to cover. Over medium-high heat bring the potatoes the boil, then reduce heat and simmer until the potatoes are tender.  Meanwhile, heat a knob of butter and a little oil in a frying pan. Take the pork chops from the brine and pat them dry with kitchen paper. When the butter is foaming, fry the pork chops for approximately 3½ minutes on each side, or until cooked through. Set aside to rest for 5 minutes. While the potatoes are hot, peel them and put the flesh through a ricer, working quickly to ensure the potatoes stay hot (alternatively mash the potatoes thoroughly). Once the potatoes have been mashed, pass them through a sieve and place them in a pan with the melted butter and cream. Whisk until combined, season to taste with salt and pepper.  To serve, gently warm the sauce, and stir in the cornichons, capers, mustard and parsley. Carve the chops and serve in the sauce with the pomme purée alongside. ","ingredients":" 80g\/2¾oz honey,  12 bay leaves,  3 sprigs rosemary, sprigs left whole,  1 small bag fresh thyme (about 14g\/½oz), sprigs left whole ,  55g\/2oz fresh parsley, sprigs left whole,  118g\/4oz garlic cloves (about 20 garlic cloves), skin left on and squashed,  2 tbsp crushed black peppercorns,  140g\/5oz salt,  4 pork chops (bone in, if possible),  ½ banana shallot, roughly chopped,  2 black peppercorns,  1 sprig thyme,  1 bay leaf,  4 tsp white wine vinegar,  4 tsp white wine,  4 tbsp brandy,  500ml\/18fl oz reduced veal stock,  500ml\/18fl oz white chicken stock,  200ml\/7fl oz double cream,  250g\/9oz waxy potatoes (preferably Ratte),  150g\/5½oz unsalted butter, melted,  150g\/5½oz double cream,  a little cold milk, to finish (only used if the mash splits),  2 tbsp olive oil,  large knob butter,  50g\/1¾oz chopped cornichons ,  50g\/1¾oz chopped lilliput capers,  30g\/1oz wholegrain mustard,  6g chopped flatleaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pork_with_pomme_pure_and_24056"}