{"recipe_name":"Pork alla Genovese","author":"Gennaro Contaldo","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the pork joint on a chopping board and, with a sharp knife, unroll the joint until you obtain a long flat piece skin-side down. Season with salt and pepper, rubbing them well into the meat, followed by the garlic and parsley. Roll the meat up and tie together with pieces of string, trimming any excess. In a large saucepan, heat the olive oil and brown the pork on all sides. Remove the meat and set aside. Add the onions, celery and carrots to the pan, season with salt and pepper and stir well. Add the bouquet garni and cook until the onions begin to soften. Place the meat back in the pan, cover with a lid, lower the heat and cook for three hours or until very tender. Check from time to time that it isn't sticking to the pan, stirring the onions and turning the meat. After three hours, increase the heat, add the white wine and simmer for five minutes. Remove the meat and set aside. Using a potato masher, mash the onions slightly.  Taste and adjust for seasoning. Serve the onion sauce with some pennette pasta and freshly grated parmesan cheese. As a main course, slice the pork and serve with a little of the sauce and a green salad. ","ingredients":" 1kg\/35¼oz pork joint,  salt and freshly ground black pepper,  3 garlic cloves, sliced,  handful of fresh flatleaf parsley, roughly torn,  4 pieces of string, approx. 20cm\/8in long each,  150ml\/5½fl oz olive oil,  2½kg\/5lbs 8½oz large cooking onions, sliced,  1 celery stick, diced,  1 carrot, diced,  200ml\/7¼fl oz white wine,  1 rosemary branch,  2 bay leaves,  2 sage leaves,  salt and freshly ground black pepper,  pennette pasta, cooked,  freshly grated parmesan,  green salad","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkallagenovese_73184"}