{"recipe_name":"Pork and beef meatballs with mushroom cream sauce","author":"Martin Blunos","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pork and beef meatballs, remove the crusts from the bread.  Place into a bowl and pour over the milk.  Leave to stand for five minutes. Place the beef and pork mince into a blender along with the shallot, garlic, anchovies and seasoning.  Squeeze the excess milk from the bread, discarding the milk, and add bread to the blender.  Blend until it forms a thick mixture.  With slightly wet hands form the meat mixture into balls the size of a small walnut. Heat a non-stick pan and add a teaspoon each of olive oil and butter.  Fry the balls in batches rolling them in the pan until they are evenly browned; this will take between 6-8 mins per batch. Lift the balls out of pan and place in a non-stick roasting tray. Heat the oven to 180C\/350F\/Gas 4. Put the meatballs into the oven to finish cooking for 15 minutes. For the mushroom sauce, place the stock, wine, shallot, garlic, bay leaf, mushrooms and ketchup into a saucepan and bring to the boil. Reduce the heat and simmer for 40 minutes.                     Pour in the cream and bring it back to a simmer and continue cooking for a few minutes until it is the consistency of a thin sauce. Adjust the seasoning with the lemon juice, salt and freshly ground black pepper. Remove meatballs from oven and drain off any excess fat.   Dish up alongside some buttered curly kale and plain boiled new potatoes. Spoon over the mushroom sauce and serve with redcurrant jelly on the side. ","ingredients":" 2 thick slices of wholemeal bread,  100ml\/3½fl oz full-fat milk,  250g\/9oz lean beef mince,  200g\/7oz pork shoulder mince,  1 small shallot, peeled and chopped,  1 small clove garlic, peeled and crushed to a paste ia a pestle and mortar,  2 anchovy fillets, drained of oil and finely chopped,  salt and freshly ground black pepper,  1 tsp olive oil,  1 tsp butter,  300ml\/10fl oz chicken or vegetable stock,  100ml\/3½fl oz dry white wine,  1 small shallot, peeled and chopped,  1 clove garlic, peeled and crushed to a paste,  1 fresh bay leaf,  50g\/2oz button mushrooms, cleaned and finely sliced ,  1 tbsp mushroom ketchup,  250ml\/9fl oz double cream,  fresh lemon juice, to taste,  salt and freshly ground black pepper,  250g\/9oz curly kale, steamed or blanched in boiling water, drained and tossed in a little butter with salt and freshly ground black pepper,  5 small potatoes, boiled,  4 tsp redcurrant jelly","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkandbeefmeatballs_79802"}