{"recipe_name":"Beef fillet in coconut milk with crispy noodles and dipping sauce","author":"Nick Nairn","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the beef slices, salt and freshly ground black pepper and olive oil into a bowl and mix well. Heat a frying pan and add the beef. Avoid turning the meat too much - you want it to develop a nice crust.  Once the beef is golden-brown all over, add the coconut milk. Bring to the boil, then reduce the heat and simmer for 4-5 minutes, stirring occasionally. The coconut milk will reduce down to give a sticky consistency, coating the beef. Remove from the heat and set aside. Grate the ginger onto the middle of a sheet of muslin. Fold over the muslin to seal around the ginger, then squeeze out the juice over a clean bowl by slowly twisting the muslin with the ginger inside. Place the rice wine vinegar and caster sugar into a pan over a medium heat and stir until the sugar has dissolved. Add the Thai fish sauce, chilli flakes, and the squeezed ginger juice and cook over a low heat for five minutes.  Add the chopped nuts and heat for one minute. Add the chopped coriander and heat for one minute.   Heat a deep fat fryer to 180C\/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Add the noodles to the oil - they will expand quickly and dramatically. Once the noodles are all crisp and golden-brown remove them from the oil with a slotted spoon and transfer to a baking sheet lined with a paper towels to drain. Divide up the leaves from the Little Gem lettuces and arrange on serving plates. To serve, spoon the beef into the 'cups' of the Baby Gem leaves, and then drizzle the dipping sauce over. Gently crumble a handful of the crispy noodles over each dish and serve. ","ingredients":" 200g\/7oz beef fillet, sliced thinly,  sal and freshly ground black pepper,  olive oil,  75ml\/3fl oz coconut milk,  2.5cm\/1in piece fresh ginger,  110ml\/4fl oz rice wine vinegar,  110g\/4oz caster sugar,  50ml\/2fl oz Thai fish sauce (nam pla),  2 tsp dried chilli flakes,  50g\/2oz cashew nuts, finely chopped,  1 small bunch fresh coriander, roughly chopped,  vegetable oil for deep frying,  40g\/1½oz ready-made rice noodles,  2 Little Gem lettuces","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beeffilletwithcoconu_87454"}