{"recipe_name":"Pork, chorizo and butter bean stew","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/porkchorizoandbutter_90830_16x9.jpg","method":"Heat the oil in a large pan over a medium heat, add the pork pieces and fry for 4-5 minutes, or until browned on the outside but not completely cooked through, then remove from the pan and set aside to rest on a warm plate.  Add the chorizo to the pan the pork was fried in and fry for 3-4 minutes, or until crisp and golden-brown. Remove from the pan and set aside with the pork. Add the onion and chilli to the same pan and fry for 2-3 minutes, or until softened. Add the garlic and the wine and bring the mixture to a simmer. Simmer for 2-3 minutes, or until the volume of liquid has reduced by a quarter.  Add the chopped tomatoes and the butter beans, then return the cooked pork and chorizo to the pan and stir well.  Bring the mixture to a gentle simmer over a low heat, cover the pan with a lid and cook for at least 45 minutes, or until the sauce has thickened and reduced in volume. Add a few tablespoons of water to the simmering mixture now and again, as necessary, when the sauce becomes too dry. Just before serving, sprinkle over the parsley and stir in the honey and season, to taste, with salt and freshly ground black pepper, as necessary.  To serve, spoon some of the pork stew into the centre of each of six serving plates. Place a portion of garlic bread alongside each serving. ","ingredients":" 2 tsp vegetable oil,  600g\/1lb 5½oz pork shoulder, cut into serving pieces,  150g\/5½oz chorizo, cut into serving pieces,  1 medium onion, sliced,  1 bird's-eye chilli, seeds removed, flesh chopped,  2 garlic cloves, finely chopped,  75ml\/2¾fl oz white wine,  400g\/14oz tinned tomatoes, chopped,  200g\/7oz canned butter beans, rinsed and drained,  2-3 tbsp chopped fresh parsley,  1 tbsp clear honey","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkchorizoandbutter_90830"}