{"recipe_name":"Pork cooked with milk, cinnamon, bay and lemon","author":"Matt Tebbutt","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/300F\/Gas 2. For the pork, season the pork all over with salt and freshly ground black pepper. Heat a deep casserole large enough to hold the pork until hot, then add the olive oil and pork. Fry for 1-2 minutes on each side, until browned all over, then rest bone-side down in the pan. Add the butter, onions and garlic and fry for 2-3 minutes more. Add enough milk to cover the pork, then add the lemon zest, half of the lemon juice, the coriander, bay leaves and spices. Transfer to the oven and cook uncovered for 1½-2 hours, or until the bones pull away from the meat easily. Remove the pork and set aside in a warm place. Skim the remaining milk sauce of excess fat with a spoon. Season, to taste, with salt and freshly ground black pepper and add the remaining lemon juice, to taste.  Place the sauce over a medium heat and bring to the boil, then reduce the heat to simmer until thickened. For the rice, bring a pan of salted water to the boil. Add the rice and cook for 12-14 minutes until tender. Drain and return to the pan to remove any excess moisture. Season the rice, to taste, with salt and freshly ground black pepper, then add the herbs and stir to combine. Meanwhile, bring a separate pan of salted water to boil. Add the greens and cook for 2-3 minutes, or until tender. Drain and return to the pan, then add the butter and season, to taste, with salt and freshly ground black pepper. To serve, remove the bones from the pork, then carve the meat into slices and place onto plates. Spoon over the sauce and place some greens and herbed rice alongside. ","ingredients":" 2kg-3kg\/4lb 4oz - 6lb 10oz pork loin, French trimmed with the chine bone removed (you can ask your butcher to do this),  salt and freshly ground black pepper ,  2 tbsp olive oil,  110g\/4oz unsalted butter,  2 onions, peeled and cut into quarters,  3 garlic bulbs, cut in half,  2-2.5litres\/3 pints 10fl oz - 4 pints 8fl oz full fat milk (enough to cover the pork completely),  2 lemons, zest and juice,  30g\/1oz fresh coriander leaves,  4-5 bay leaves,  20g\/¾oz cinnamon sticks,  2 tsp mixed peppercorns,  ½ nutmeg, freshly grated,  5 cloves,  300g\/10½oz basmati rice,  salt and freshly ground black pepper,  4 tbsp fresh flatleaf parsley, roughly chopped,  4 tbsp fresh chives, roughly chopped,  4 tbsp fresh coriander, roughly chopped,  400g\/14oz spring greens, roughly chopped,  50g\/2oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkcookedwithmilkci_90605"}