{"recipe_name":"Pork escalopes with lemon butter sauce","author":"Mike Robinson","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"If using pork loin on the bone, carefully cut the meat from the bone with a sharp knife and trim away any excess fat and sinew. Cut the loin into pieces weighing about 75g\/2½oz each. If using a single piece of pork loin, cut the loin into thick slices about 75g\/2½oz each and trim away any excess fat and sinew. If using ready-sliced pork loin, trim off any excess fat or sinew. Once the pork loin pieces are cut to the correct size, lay the slices between two pieces of cling film. Using a meat mallet or a rolling pin, bash them out to a thickness of about 5mm\/¼in. Place the breadcrumbs in a shallow bowl. Grate the lemon zest into the bowl with the breadcrumbs (keep the lemons for the sauce). Add the chopped rosemary to the bowl with the breadcrumbs and lemon zest. Season, to taste, with salt and freshly ground black pepper. Mix well. Place the flour in another shallow bowl. Mix the milk and eggs together in a bowl. Dredge one of the pork escalopes in the flour, then dip it in the egg wash, then coat in the breadcrumbs. Dip and coat the pork a second time, so that it's well coated with seasoned crumbs. Put on a plate while you prepare the other escalopes. Repeat the dredging, dipping and coating process with the remaining pork pieces until all are well coated. Heat a large frying pan over a medium heat and melt half the butter and add a drizzle of olive oil. When the butter is foaming, add the escalopes and fry them until golden-brown, then turn them over and cook on the other side. When they're cooked through, remove from the pan, drain on kitchen paper and keep warm. To make the sauce, add the rest of the butter to the pan with the juice of the lemons and the wine. Turn up the heat to reduce the sauce by half. Serve the pork escalopes with the lemon and butter sauce poured over and a green salad on the side. ","ingredients":" 4 pieces of pork loin 75g\/2½oz each OR one piece of pork loin, sliced into 75g\/2½oz slices OR one loin of pork on the bone,  100g\/3½oz fresh breadcrumbs,  2 unwaxed lemons, zest only,  1 sprig fresh rosemary, leaves finely chopped,  salt and freshly ground black pepper,  1 heaped tsp wholegrain mustard,  50g\/2oz plain flour,  100ml\/3½fl oz milk,  2 free-range eggs,  100g\/3½oz butter,  drizzle light olive oil,  2 lemons, juice only,  125ml\/4½fl oz white wine","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkescalopeswithlem_90244"}