{"recipe_name":"Beef flank steaks with crisp shallots and wild mushroom and watercress salad","author":"Mark Hix","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Half-fill a deep heavy-based pan with vegetable oil and heat until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Season the flour with salt and freshly ground black pepper. Dredge the shallot rings in the seasoned flour to coat, shaking off any excess. Dip into the milk and then dredge in the flour again, shaking off any excess. Deep-fry the shallot rings in the hot oil in batches for 3-4 minutes, until crisp and golden-brown, then carefully remove with a slotted spoon and drain on kitchen paper. Heat a griddle pan (or, ideally, a barbecue). Season the steaks with salt and freshly ground black pepper and place onto the griddle pan. Cook for 3-4 minutes on each side for rare, or until cooked to your liking. Remove from the heat and allow to rest for five minutes. Heat a frying pan until hot, add the olive oil and mushrooms and sauté for 2-3 minutes, until softened and turning golden-brown. Meanwhile, for the watercress salad, whisk the cider vinegar, rapeseed oil and mustard together in a bowl and season, to taste, with salt and freshly ground black pepper. Drizzle the dressing over the watercress in a bowl and mix well. To serve, place equal portions of the watercress salad onto four plates. Slice the steaks and place an equal number of slices onto each of the four portions of watercress. Arrange the wild mushrooms and crisp shallots on top of each and serve. ","ingredients":" vegetable oil, for deep frying,  110g\/4oz plain flour, for dusting,  salt and freshly ground black pepper ,  5-6 shallots, peeled and sliced into thin rings,  110ml\/4fl oz milk,  2 x 300g\/10oz beef flank steaks,  2 tbsp olive oil,  150g\/5oz mixed wild mushrooms, cleaned,  1 tbsp good quality cider vinegar,  3 tbsp rapeseed oil,  1 tsp English mustard,  salt and freshly ground black pepper ,  110g-150g\/4oz-5oz watercress, washed, thick stalks removed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefflankwithcrispsh_89942"}