{"recipe_name":"Pork fillet with apple, wine and chervil sauce and rosemary sweet potatoes","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the sweet potato, heat the butter in an ovenproof frying pan and gently fry the garlic, rosemary and sweet potato for 3-4 minutes, until beginning to colour. Transfer to the oven and cook for 6-8 minutes, or until the sweet potato is tender. Season with salt and freshly ground black pepper and discard the rosemary and garlic. For the pork, season the pork slices with salt and freshly ground black pepper. Heat the oil and butter in a frying pan and fry the pork and apple slices for 3-4 minutes on each side, or until golden-brown and cooked through. Remove from the pan and set aside to keep warm. Add the crushed garlic to the pan and cook for one minute. Add the wine and simmer until reduced by half, then add the chicken stock, double cream and raisins, season with salt and freshly ground black pepper and simmer until the sauce thickens slightly. To serve, place the pork and apple slices onto a plate with the sweet potato and drizzle over the sauce. ","ingredients":" 1 tbsp butter,  1 garlic clove, lightly crushed,  1 sprig fresh rosemary ,  ½ sweet potato, peeled and cut into cubes,  salt and freshly ground black pepper ,  2 slices pork fillet, about 1cm\/½in thick,  salt and freshly ground black pepper,  1 tsp vegetable oil,  1 tsp butter,  ½ apple, peeled, cored and thinly sliced,  1 garlic clove, crushed,  150ml\/¼ pint white wine,  4 tbsp hot chicken stock,  2 tbsp double cream,  2 tbsp raisins,  2 sprigs fresh chervil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkfilletwithapplew_85397"}