{"recipe_name":"Pork fillet with sautéed potatoes, Sao Jorge cheese and gherkin and dill sauce","author":"Martin Blunos","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sautéed potatoes, heat the oil in a frying pan over a medium heat. Add the bacon and fry gently for 4-5 minutes, until the fat is rendered and the bacon turns lightly golden-brown. Add the sliced potatoes and fry for 4-5 minutes, turning the potatoes occasionally, until the potatoes turn golden-brown. Add the spring onions to the pan and stir into the other ingredients. Sprinkle the cheese over the ingredients in the pan, remove the pan from the heat and set aside so the cheese melts slightly in the residual heat. Season with freshly ground black pepper and taste for salt (you may not need to add any salt because of the saltiness of the bacon).  For the pork, gently flatten each pork slice with the palm of your hand. Rub each slice with olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until hot, add the pork slices and cook for 2-3 minutes on both sides, or until just cooked (you may need to do this in batches to avoid overcrowding the pan). Remove the slices from the pan and set aside to rest for a few minutes.  For the gherkin and dill sauce, place the gherkin and dill in a bowl and mix well. Add just enough olive oil to bind the ingredients together. To serve, spoon the sautéed potatoes onto four serving plates. Top with slices of the pork and finish with a spoonful of the sauce. Dust with a little paprika. and serve. ","ingredients":" 1 tbsp vegetable oil,  50g\/2oz smoked streaky bacon, cut into 0.5cm\/&frac14in strips,  600g\/1 lb 5oz Jersey new potatoes, skin on, cooked, cooled, cut into slices,  1 small bunch spring onions, sliced finely on the diagonal,  40g\/1½oz Sao Jorge cheese (or other semi-hard cows' milk cheese), grated,  salt and freshly ground black pepper,  2 small pork fillets, each weighing about 300g\/10oz, trimmed of sinew and cut into 2.5cm\/1in-thick slices,  1-2 tbsp extra virgin olive oil,  1 large gherkin, finely chopped,  1 sprig dill, roughly chopped,  drizzle olive oil,  1 tsp paprika, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkfilletwithsautee_89185"}