{"recipe_name":"Pork meatballs with curry sauce","author":"Bill Granger","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7.   For the meatballs, place all the meatball ingredients except the oil into a large mixing bowl and mix together well with your hands. With wet hands, shape the mixture into small balls and place into a large roasting tin. Drizzle over the oil and stir gently to coat. Transfer the tin to the oven and bake for 15-20 minutes, or until the meatballs are golden-brown. Meanwhile, for the curry sauce, heat a large frying pan over a medium heat. Place the curry paste and ginger into the pan and cook, stirring, for one minute. Add the tomatoes and cook, stirring occasionally, for another 2-3 minutes. Add the coconut milk and stock and bring to the boil. Reduce the heat and simmer gently for five minutes. Add the meatballs to the sauce, stir carefully to coat and simmer in the sauce for 20 minutes. Gently stir in the lemon juice and brown sugar. Serve the meatballs in curry sauce over steamed rice, garnished with the cashew nuts and coriander. ","ingredients":" 600g\/1lb 5oz minced pork,  1 medium onion, grated,  1 free-range egg, lightly beaten,  50g\/2oz fresh white breadcrumbs,  1 long red chilli, deseeded and finely chopped,  2 tsp grated fresh ginger,  1 tsp garam masala,  2 tbsp chopped fresh coriander ,  pinch sea salt,  freshly ground black pepper,  1 tbsp grapeseed oil ,  3 tbsp ready-made massaman curry paste (available in Thai markets and in some supermarkets),  2 tsp grated fresh ginger,  4 tomatoes, chopped,  200ml\/7fl oz coconut milk,  200ml\/7fl oz chicken stock,  1 tbsp lemon juice,  2 tsp brown sugar,  3-4 tbsp cashew nuts, lightly toasted and finely chopped,  2 tbsp chopped fresh coriander,  steamed basmati rice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkmeatballswithcur_87389"}