{"recipe_name":"Pork shoulder steaks and beetroot 'pilau'","author":"Martin Blunos","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/300F\/Gas 2. For the pork steaks, season the steaks with salt and freshly ground black pepper. Dip into the flour and shake off the excess.  Heat the olive oil in a large frying pan and sear the steaks until golden brown on both sides. Remove from pan and transfer into an ovenproof casserole.  Return the frying pan to the heat and add the caraway seeds, taking care as they may pop. Cook for one minute then add the cider and boil for two minutes. Add the chicken stock and bay leaf, bring back to the boil then pour the mixture over the pork steaks in the casserole. Cover the casserole with a lid and place in the oven for about one hour or until the steaks are tender. When cooked, remove the steaks from the cooking liquor and keep the steaks warm. Transfer the cooking liquor to a clean saucepan and reduce by half over a high heat, until thickened. Take off the heat and whisk in the butter, adjusting the seasoning as necessary.  For the beetroot 'pilau', place the beetroot, shallot and garlic into a mincer and mince (alternatively use a food processor although the result won't be quite the same). Take care as the liquid from the beetroot can splatter and may stain. Transfer the beetroot mixture into an ovenproof pan. Coarsely crush the peppercorns and add these to the pan then pour over the stock and stir well. Bring to boil then cover and place in the preheated oven for approximately 40 minutes. When cooked, remove from oven and take off the cover.  Place over a medium heat and reduce for a few minutes until any excess liquid has evaporated and the mixture is sticky. Season with the salt and sugar and mix in the butter using a fork. To serve, mix together the sour cream and dill. Place a pork steak on a plate, top with a spoonful of the dill sour cream and add a spoonful of 'pilau'. Pour over some of the cider sauce and serve at once. ","ingredients":" 4 thick cut pork shoulder steaks,  salt and freshly ground black pepper,  plain flour,  1 tbsp olive oil,  2 tsp caraway seeds,  350ml\/12fl oz chicken stock,  250ml\/9fl oz cider or white wine,  1 bay leaf,  1 tbsp unsalted butter,  500g\/1lb beetroot, peeled and roughly chopped,  1 medium shallot, peeled and roughly chopped,  1 clove garlic, peeled and roughly chopped,  500ml\/1pt chicken or vegetable stock,  10-12 black peppercorns,  1 tsp caster sugar,  salt ,  25g\/1oz unsalted butter,  100g\/3½oz soured cream ,  2 sprigs fresh dill, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkshouldersteaksan_79741"}