{"recipe_name":"Beef in oyster sauce","author":"Ching-He Huang","programme":"Chinese Food Made Easy","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/beefinoystersauce_89263_16x9.jpg","method":"For the beef, place the fillet in between two sheets of cling film and bash with a meat mallet or rolling pin until half as thin. Slice the beef into thin pieces and place into a bowl, then season with the light soy sauce, oyster sauce, sugar and salt and freshly ground black pepper. Set aside.  Heat a wok until smoking and add one tablespoon of the groundnut oil, then add the garlic and chilli. Stir-fry for a few seconds, then add the spinach leaves and toss for a few seconds, until warmed through. Pile onto a large serving plate.  Place the wok back on the heat and add the remaining oil, then add the beef slices and stir fry for 2-3 minutes, or until the beef is cooked to your liking. Pour in the Shaoxing rice wine and sprinkle over the dried chilli flakes. Pile the beef over the spinach leaves.  For the oyster mushrooms, heat the oil in the wok and add the oyster mushrooms, stir frying for one minute. Add a small splash of water to create some steam to help the mushrooms cook, then season, to taste, with the black rice vinegar and light soy sauce.  Spoon the oyster mushrooms over the beef and serve. ","ingredients":" 350g\/12oz beef fillet,  1 tsp light soy sauce,  1½ tbsp oyster sauce ,  pinch sugar,  salt and freshly ground black pepper,  2 tbsp groundnut oil ,  3 cloves garlic, finely chopped,  1 chilli, de-seeded, finely chopped,  200g\/7oz baby spinach leaves,  1 tbsp Shaoxing rice wine or dry sherry,  pinch dried chilli flakes ,  1 tsp groundnut oil ,  100g\/3½oz oyster mushrooms,  dash Chinese black rice vinegar or balsamic vinegar,  dash light soy sauce","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefinoystersauce_89263"}