{"recipe_name":"Pork vindaloo","author":"Anjum Anand","programme":"Indian Food Made Easy","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/porkvindaloo_89999_16x9.jpg","method":"Using a spice grinder, grind the cumin seeds, coriander seeds, peppercorns, cardamom seeds, cloves and cinnamon to a fine powder. In a food processor, blend the ginger, garlic, chillies and white wine vinegar to a paste.  Mix the ground spice mixture with the paste until well combined and season with a pinch of salt. Rub the mixture all over the pork using your fingers, then set the pork aside, covered, to marinate for 1½-2 hours.  Heat four tablespoons of the oil in a non-stick pan. When the oil is hot, add the onion and fry for 3-4 minutes, or until golden-brown.  Add the marinated pork pieces and fry for 6-7 minutes, turning once, until golden-brown on all sides. Reduce the heat to low, cover the pan with a lid and cook for 35-40 minutes, stirring occasionally, or until the pork is tender. Add small splashes of boiling water to the pan as necessary if the juices in the pan dry out. Add as little water as possible as the resulting sauce should be quite thick.  Heat the remaining teaspoon of oil in a separate pan over a medium heat. When the oil is hot, add the mustard seeds. (CAUTION: the mustard seeds will start to pop. Keep the pan well away from your face and eyes.)  Once the mustard seeds start to pop, add the cashew nuts and fry for 2-3 minutes, stirring occasionally, until the nuts are golden-brown.  To serve, either divide the rice among four serving plates, spoon the vindaloo alongside and pour the fried cashew nuts and mustard seeds over the vindaloo, or alternatively spoon the vindaloo into the centre of four wheat tortillas, sprinkle with chopped lettuce and soured cream and roll up into parcels. ","ingredients":" 1 tsp cumin seeds,  1 tsp coriander seeds,  5 black peppercorns, left whole ,  2 green cardamom pods, seeds only,  2 cloves,  1cm\/½in piece cinnamon,  1cm\/½in piece ginger, peeled and chopped,  7 garlic cloves, peeled and left whole,  3 fresh red chillies,  3 tbsp white wine vinegar ,  pinch salt,  350g\/12oz pork shoulder, flesh cut into 2.5cm\/1in cubes,  100g\/3½oz pork belly, cut into 2.5cm\/1in pieces,  65ml\/2½fl oz vegetable oil,  1 small onion, finely chopped,  ¾ tsp mustard seeds,  handful cashew nuts,  220g\/8oz basmati rice, cooked according to packet instructions,  4 wheat tortillas,  2 handfuls chopped lettuce,  4 tbsp soured cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porkvindaloo_89999"}