{"recipe_name":"Porridge of grains from Jämtland","author":"Magnus Nilsson","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the grains in a pan and just cover them with water. Leave for an hour or two to soak. After soaking, cook the grains in the pan over medium heat. Cook for five minutes from the first boil. Finish by adding the butter and grating the cheese into the pan. Stir until smooth and season to taste with salt. While the porridge is cooking, heat the broth in a saucepan and place the moss and leaves in a small teapot, preferably made from glass. When the broth is hot pour it over the moss and leave to macerate for a while. Place some of the porridge in a small, heated bowl and tap the bottom so that the surface of the porridge becomes flat.  Add one teaspoon of chive oil and sprinkle, chopped carrots, dried chives and puffed grains over the surface until covered. To serve pour broth into the bowl, the broth should completely cover the porridge so that all the garnishes float around in it. ","ingredients":" 1 tbsp crushed barley,  1 tbsp flax seeds, whole,  1 tbsp rolled oats,  1 tbsp sunflower seeds,  1 tbsp pumpkin seeds,  1 tbsp crushed rye,  50g\/1¾oz salty, cultured butter,  50g\/1¾oz mature cows’ milk cheese,  salt, to taste,  200ml\/7fl oz light, clear beef broth, such as consommé,  10g\/¼oz birch leaves decomposed under the snow for one winter (optional),  tuft of moss big enough to fit snuggly inside the vessel you are going to pour the hot broth from.,  1 tsp chive oil,  100g\/3½oz pickled carrots (lacto-fermented in 2.5% salinity brine),  1 tbsp dried chives, finely chopped,  6 tbsp puffed grains of barley, rye and oats","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/porridge_of_grains_from_59307"}