{"recipe_name":"Beef kebabs with harissa and lemon rice","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the harissa, place all of the harissa ingredients into a food processor and blend to make a smooth paste. Set aside. For the kebabs, heat a griddle pan until hot. Place the steak cubes in a bowl and add the olive oil and salt and freshly ground black pepper, to taste. Mix to coat the steak in the seasoning and oil.   Thread the meat onto metal skewers, alternating with the wedges of red onion. Place the skewers onto the griddle and cook on each side for 1-2 minutes, or until cooked to your liking. Baste with a little of the harissa every 30 seconds or so. Once the meat is cooked, squeeze over the lemon juice. For the lemon rice, heat a lidded sauté pan over a medium heat, add the butter, olive oil, onion and garlic and sauté for two minutes until the onion and garlic are just softened, but not browned. Add the rice, lemon zest and juice to the pan and mix well. Add the chicken stock and bring to a simmer.  Cover, reduce the heat and simmer for 12-15 minutes until the rice is tender and all the liquid has been absorbed. Season with salt and freshly ground black pepper, to taste, then stir in the coriander. Serve the skewers with the rice alongside and with a dollop of harissa. ","ingredients":" 15g\/½oz dried red chillies, soaked in cold water, drained and roughly chopped,  50g\/2oz fresh red chillies, seeds removed, roughly chopped,  2 tsp ground cumin,  2 tsp ground caraway seeds,  1 tbsp smoked sweet paprika,  2 garlic cloves,  2 tbsp tomato purée,  3 tbsp red wine vinegar,  4 tbsp olive oil,  800g\/1lb 12oz rump steak, cut into large cubes,  1 tbsp olive oil,  salt and freshly ground black pepper ,  2 red onions, cut into wedges,  1 lemon, juice only,  50g\/2oz butter,  2 tbsp olive oil,  1 onion, finely chopped,  1 garlic clove, finely chopped,  275g\/10oz basmati rice,  1 lemon, zest and juice,  450ml\/16fl oz chicken stock,  salt and freshly ground black pepper ,  3 tbsp coriander leaves, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefkebabswithhariss_90875"}