{"recipe_name":"Posh duck pie ","author":"John Torode","programme":"Great British Food Revival","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the flaky pastry, pulse the lard, salt and the flour in a food processor until the mixture resembles breadcrumbs. Gradually add 180ml\/6fl oz cold water,  pulsing gently until the mixture just comes together as a dough. Turn the dough out onto a lightly floured work surface, wrap in cling film and chill in the fridge for 20 minutes. Meanwhile, for the stuffing, heat the oil over a low heat in a large, heavy-based frying pan. Add the shallots and fry for 6-8 minutes, or until softened but not coloured. Add the butter and chicken livers and fry until the livers have browned a little. Season, to taste, with salt and freshly ground black pepper. Add the chopped sage and garlic and continue to fry for 4-5 minutes, or until the garlic has softened and the chicken livers have cooked through. Set the mixture aside on a plate until completely cooled. In a large bowl, mix together the duck mince and chicken mince using your hands, until well combined. Using a wooden spoon, beat in 50ml\/2fl oz cold water, a little at a time, then roughly chop the cooled chicken livers and fold them gently into the mixture. Stir in the parsley and season to taste with salt and freshly ground black pepper. Tip the stuffing mixture out onto a large chopping board and form it into a sausage shape using your hands. Preheat the oven to 170C\/325F\/Gas 4. For the duck ballotine, lay the whole boned duck out onto a clean work surface, skin-side down. Place the rolled stuffing mixture on top of the duck, then roll the edges of the duck meat around the stuffing to form a long roll of stuffed duck. Bring the edges of each side of the duck together and secure using metal skewers. (Alternatively, truss the duck in several places with cooking string.) Place the stuffed duck into a roasting tray and rub all over with a little oil. Roast in the oven for 18-20 minutes, then remove the roasting tray from the oven, drain any excess oil or fat into a jug and baste the stuffed duck all over with it. Return the stuffed duck to the oven and roast for a further 12-15 minutes. Drain off the cooking juices again, reserving them in a jug to use in the blackberry sauce. Set the stuffed duck aside, covered. Increase the oven temperature to 200C\/400F\/Gas 6. To assemble the pie, on a lightly floured work surface roll out the chilled flaky pastry until it is large enough to wrap around the stuffed duck. (Alternatively, use 1kg\/2lb 3oz of shop-bought puff pastry at this stage.)  Mix the beaten egg with a little water and brush the pastry all over with the egg wash. Carefully remove the string or skewers from the stuffed duck. Transfer the stuffed duck to the pastry, rolling the pastry around the meat to cover the meat completely. Dampen the edges of the pastry with more egg wash and crimp to secure using your fingers or a fork. Lightly grease a baking tray with oil and line with a sheet of baking paper. Place the pastry-covered duck onto the prepared baking tray and bake in the oven for 30 minutes, or until the pastry has risen and is golden-brown. Meanwhile, for the blackberry sauce, pour or skim the layer of fat from the top of the reserved cooking juices. (The duck fat can be kept in an airtight container in the fridge for up to four weeks, and can be used to roast potatoes.) You should be left with approximately 200ml\/7fl oz of meat juices (top up with a little boiling water if you are short). In a saucepan bring the port, wine, roasting juices and the shallot to the boil. Reduce the heat and simmer gently until the sauce has thickened and its volume has reduced by about half.  Add three-quarters of the blackberries to the pan and return to the boil. Continue to boil until the volume of liquid has reduced by half again and the fruit has started to break down. Meanwhile, cut the remaining 100g\/3½oz of blackberries in half lengthways. Stir them into the thickened sauce just before serving. To serve, carve the posh duck pie into thick slices and arrange two slices onto each of four serving plates. Drizzle over the blackberry sauce. Serve with steamed green vegetables. ","ingredients":" 200g\/7oz lard, at room temperature,  pinch salt,  400g\/14oz self-raising flour, sifted, plus extra for dusting,  1 free-range egg, beaten with a little milk, for the egg wash (NB: the egg wash is also needed if you use shop-bought puff pastry),  60ml\/2½fl oz vegetable oil, plus extra for greasing,  100g\/3½oz shallots, peeled, diced,  50g\/2oz butter,  100g\/3½oz chicken livers,  handful fresh sage leaves, roughly chopped,  2 garlic cloves, finely sliced,  200g\/7oz duck mince,  200g\/7oz chicken mince,  handful fresh parsley, chopped,  salt and freshly ground black pepper,  I x 2.8kg\/6lb 2oz duck, boned from the backbone (ask your butcher to do this for you),  200ml\/7fl oz roasting juices (drained from the roasting tray as the duck is cooking, see method),  200ml\/7fl oz ruby port,  200ml\/7fl oz red wine,  1 shallot, peeled, chopped,  400g\/14oz blackberries","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/posh_duck_pie_27124"}