{"recipe_name":"Pot-roasted chicken with tarragon, Madeira and mash","author":"James Martin","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, heat a large casserole or heavy-based pan until hot, then add two tablespoons of oil. Fry the lardons until crisp, then add the halved shallots and garlic and cook until lightly coloured.  Meanwhile, season the chicken pieces with salt and pepper. Add the remaining oil to a large hot frying pan, then fry the chicken pieces until deep-golden brown on both sides.Transfer the chicken to the casserole. remove any excess oil from the pan. In the same frying pan, fry the mushrooms in the butter for 3-4 minutes, or until softened. Add the Madeira, chicken stock, cream and tarragon. Season to taste with salt and freshly ground black pepper. Pour the sauce over the chicken, cover and simmer for 15-20 minutes, or until the chicken is cooked through. For the mash, place the potatoes into a pan of salted water, bring to the boil and cook for 10-15 minutes, or until tender. Drain the potatoes, then return to the pan and gently heat to get rid of any excess moisture. Remove from the heat and mash with the butter and cream until smooth and creamy. Season, to taste, with salt and freshly ground black pepper. Set aside and keep warm. To serve, pile the chicken in a serving bowl, cover in sauce and shave over the truffle, if using. Spoon the mash alongside. ","ingredients":" 100ml\/3½fl oz rapeseed oil,  200g\/7oz bacon lardons,  200g\/7oz shallots, cut in half lengthways,  1 garlic bulb, cut in half horizontally,  1 large chicken, jointed into 8 pieces,  salt and black pepper,  500g\/1lb 2oz mixed wild mushrooms (such as chanterelles, girolles, ceps, and morels), cleaned,  50g\/1¾oz butter,  50ml\/2fl oz Madeira,  500ml\/18fl oz dark chicken stock,  200ml\/7fl oz double cream,  1 bunch fresh tarragon,  1 small truffle (optional),  300g\/11oz King Edward potatoes, peeled and cut into chunks,  50g\/2oz butter,  110ml\/3¾fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pot-roasted_chicken_with_19595"}