{"recipe_name":"Pot roast beef brisket ","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 5-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p017xzcs.jpg","method":"For the beef, season the beef all over with the salt and lots of freshly ground black pepper. Heat two tablespoons of the oil in a large flameproof casserole and brown the beef over a fairly high heat for 8-10 minutes, turning every couple of minutes. Preheat the oven to 160C\/325F\/Gas 3. While the beef is frying, thinly slice two of the onions. Remove the beef from the casserole and put it to one side. Add the onions to the casserole and fry for five minutes or until nicely browned, stirring regularly. Add a little more oil if the onions begin to stick. Stir in the thyme and bay leaf and cook for 20-30 seconds more, stirring. Return the beef to the casserole. Stir the tomato purée into the hot beef stock and pour around the beef. Add the wine and bring to a gentle simmer on the hob. Cover with a lid and place in the oven. Cook for three hours. After about 1½ hours, take out of the oven and turn the beef. If you press it with a fork, the meat will feel very firm. While the beef is cooking, prepare the vegetables. Cut the remaining onions into half from root to tip and then cut each half into four. Peel the carrots and cut into 3cm\/1¼in chunks, trim the celery and cut into 4cm\/1½in lengths.  Heat another tablespoon of oil in a large non-stick frying pan. Fry the onions for five minutes, stirring occasionally. Add the carrots and celery and cook for a further five minutes over a medium heat until the onions are softened and all the vegetables are lightly browned, stirring regularly. Remove the beef from the oven and take off the lid. Press the beef with a fork. You should be able to feel it becoming much softer. (If not, return to the oven for a further 30 minutes before adding the vegetables.) Turn the beef over and nestle all the sautéed vegetables around it. Cover with the lid again and return to the oven for a further 1-2 hours, or until the beef is very tender and yields completely to the pressure of a spoon. For the potato latkes, whisk the egg and egg yolk together in a small bowl. Peel the onion and coarsely grate on a board. Place in a large colander. Peel all the potatoes and coarsely grate. Add to the onions and mix well. Take the colander to the sink and using your hands, squeeze out as much excess liquid as possible from the onion and potatoes. Do this in 4-5 batches and put the squeezed vegetables in a large clean bowl as you go. Add the beaten eggs, flour, salt and parsley or chives (if using) to the onion and potatoes. Season with lots of ground black pepper and mix well. Pour two tablespoons of the oil into a large non-stick frying pan and place over a low-medium heat. Take a handful of the potato mixture and form into a loose ball. Place in the pan and flatten with a spatula until around 1.5cm\/½in thick. Repeat with three more balls of the potato until you have four latkes cooking at the same time. Cook the latkes for 6-8 minutes on each side until golden-brown and cooked through. Don’t be tempted to increase the heat or the latkes with be burnt on the outside before they are ready in the middle. Put on a baking tray and set aside while you cook the remaining eight latkes in exactly the same way. Add an extra two tablespoons of sunflower oil to the pan between batches. Preheat the oven to 200C\/400F\/Gas 6. When you are almost ready to serve the latkes, reheat on the baking tray in the oven for 10-15 minutes, or until hot and crisp.  To serve the beef, lift the beef out of the casserole with a couple of forks and place on a board or serving platter. Cut off the string and carve into slices. Serve with the poached vegetables, latkes and the rich cooking liquor for gravy.  ","ingredients":" 1.2kg\/2lb 12oz well-marbled beef brisket, rolled and tied ,  1 tsp flaked sea salt, plus extra to season,  freshly ground black pepper,  4-5 tbsp sunflower oil,  4 onions,  3 sprigs bushy thyme,  1 large bay leaf,  2 tbsp tomato purée,  500ml\/18fl oz hot beef stock, made with 1 beef stock cube,  200ml\/7fl oz red wine,  4 large carrots, cut into 3cm\/1¼in chunks,  6 celery sticks, trimmed and cut into 4cm\/1½in lengths,  1 medium free-range egg,  1 medium free-range egg yolk,  1 large onion,  1.2kg\/2lb 12oz potatoes, preferably Maris Piper,  25g\/1oz plain flour,  1 tsp flaked sea salt,  2 tbsp finely chopped fresh parsley leaves or chives (optional),  6 tbsp sunflower oil, for frying,  freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pot_roast_beef_brisket_18421"}