{"recipe_name":"Potato-wrapped halibut ","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the butter and oil in a frying pan and fry the potato slices for 4-5 minutes, or until softened, but not browned.  Remove from the pan and set aside to drain on kitchen paper.  Lay the potato slices, in four piles, on a work surface, overlapping slightly. Place the halibut fillets onto the potato slices. Wrap the potato slices around the halibut fillets to from parcels. Transfer to a baking tray and leave to chill in the fridge for 30 minutes. Meanwhile, for the cauliflower purée, heat the oil in a frying pan and fry the onion for 4-5 minutes, or until softened. Add the cauliflower florets and cook for 7-8 minutes, then add the curry powder and cook for a further minute.  Pour in the wine and continue to cook until the volume of the liquid has reduced by half. Add the cream and cook for five minutes, leave to cool slightly and then purée the mixture with a hand-held blender until smooth.  Fold in the capers then season, to taste, with salt and freshly ground black pepper. Brush the potato-wrapped halibut with a little more butter. Heat a frying pan until hot and fry for 3-4 minutes on each side, or until cooked through. Remove from the pan and set aside to drain on kitchen paper.  Serve the potato-wrapped parcels on the cauliflower purée. ","ingredients":" 200g\/7oz clarified butter, plus extra for baking ,  1 tbsp olive oil,  3 potatoes, peeled, sliced into rectangles,  4 x 150g\/5¼oz halibut fillets,  1 tbsp olive oil,  salt and freshly ground black pepper,  ½ onion, chopped,  250g\/9oz cauliflower, cut into florets,  2 tsp curry powder,  75ml\/2¾fl oz white wine,  200ml\/7fl oz double cream,  2 tbsp capers, drained","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/potato-wrapped_halibut_16505"}