{"recipe_name":"Potato risotto with braised North Sea squid","author":"Tom Kitchin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat oven to 180C\/160C Fan\/Gas 4.  Clean the squid keeping the tubes for garnish and the wings and tentacles for braising. Heat a lidded heavy-bottom pan, add the olive oil and the squid wings and tentacles. Season with salt and pepper and cover. Cook for 1-2 minutes until all the liquid comes out of the squid, then strain and set aside. Using a heavy knife, chop the wings and tentacles in to small dice. Heat a heavy-bottomed pan and gently cook the shallots, fennel and garlic for 1-2 minutes before adding the chopped squid, spices, and tomato purée. Add the white wine and heat until reduced in volume by half then cover with fish stock and add the bouquet garni. Braise in the oven for 1½-2 hours until the squid is tender. Check during cooking and top up with stock if needed. When done remove from the oven and set aside. Meanwhile, for the risotto, blanch the chopped potatoes in vinegar water (1 tbsp vinegar to 300ml\/10fl oz water) for 2-3 minutes.  Gently cook the onion and half the garlic in 2 tsp olive oil until translucent. Add the blanched potatoes and salt and cook for 1 minute. Add the rice flour, stir and then add the white wine. Cook untilthe liquid has gone and the mixture is dry. Gradually add the chicken stock and cook until the potato is cooked, about 7-8 minutes. Meanwhile, heat a little of the butter in a large frying pan and add the mushrooms. Sauté for a few minutes.  Once the potato is cooked add the braised squid, Parmesan, mushrooms, remaining butter, dill and chives.  Meanwhile, chop the squid tubes into triangles and sauté quickly in a hot pan with a 1 tbsp olive oil. Finish with parsley and the remaining garlic.  Serve the potato risotto in a bowl and garnish with the sautéed squid tubes and sea purslane leaves.  ","ingredients":" 3 whole squid, tubes removed, wings and tentacles removed and reserved,  2 tbsp olive oil,  3 tbsp finely chopped shallots,  3 tbsp finely diced fennel,  2 garlic cloves, chopped,  1 tsp curry powder,  1 tsp cumin powder,  1 tbsp tomato purée,  50ml\/2fl oz white wine,  500ml\/18fl oz fish stock,  1 bouquet garni,  salt and freshly ground black pepper,  ½ onion, chopped,  1 garlic clove, chopped,  olive oil,  200g\/7oz potatoes cut in to small rice size dice,  200g\/7oz risotto rice flour,  50ml\/2fl oz white wine,  1 litre\/1¾ pints chicken stock,  20g\/¾oz butter, diced,  100g\/3½oz black trumpet mushrooms,  2 tbsp Parmesan cheese, grated,  1 tbsp chopped dill,  1 tbsp chopped chives,  1 tsp chopped parsley,  2 tbsp sea purslane, leaves picked","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/potato_risotto_with_51961"}