{"recipe_name":"Potato salad with fresh salmon and tiger prawns","author":"Mary Berry","programme":"Mary Berry's Absolute Favourites","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. Line a baking tray with aluminium foil. For the salad, put the potatoes in a pan of salted water and bring to the boil. Boil for 15 minutes, or until tender. Drain and slice each potato into quarters. Meanwhile, arrange the salmon fillets, skin-side down, on the prepared baking tray, squeeze over half the lemon juice and season with salt and pepper. Cover with another sheet of foil, seal to make a parcel, and bake for 15 minutes, or until just cooked. Remove and set aside to cool, then remove the skin. For the salad, mix the oil, mustard, sugar and vinegar together in a large bowl. Add the hot potatoes and season with salt and pepper. Stir to combine and set aside to cool.  Add the mayonnaise, spring onions, radishes and celery, mix together well and check the seasoning. Stir in the remaining lemon juice. Add half the chopped parsley to the potato salad, stirring to combine, and spoon the salad on to a large platter. Flake the salmon into large pieces and arrange on top, then sprinkle with the remaining parsley. Peel the shells from the tails of the prawns, leaving the heads on, and arrange in a line on top. ","ingredients":" 3 x 125g\/4½oz middle-cut salmon fillets, skin on,  1 lemon, juice only,  16 cooked tiger prawns in their shells,  500g\/1lb 2oz baby new potatoes,  4 tbsp olive oil,  3 tbsp Dijon mustard,  1 tbsp caster sugar,  3 tbsp white wine vinegar,  6 tbsp mayonnaise,  1 bunch of spring onions, thinly sliced,  150g\/5½oz radishes, thinly sliced,  4 celery sticks, finely diced,  1 small bunch of parsley, chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/potato_salad_with_fresh_94349"}