{"recipe_name":"Potato tart with mustard, leeks and mushrooms","author":"Ainsley Harriott","programme":"Great British Food Revival","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p0105r5f.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6.  For the potato pastry, sift the flour into a bowl and season well with salt and freshly ground black pepper. Stir in the mustard powder. Add the diced butter and, using your fingertips, rub the butter into the flour mixture until it resembles fine breadcrumbs.  Add the leftover mashed potato and pull the mixture together using your hands to form a soft dough. If necessary, add a little iced water to the mixture to loosen it, but take care not to make the dough too sticky.  Turn out the dough onto a lightly floured work surface and knead lightly for 2-3 minutes. Roll the dough into a ball, wrap in cling film, and chill in the fridge for at least 10 minutes (or for up to 24 hours, if time allows). Meanwhile, for the filling, heat the oil in a frying pan over a medium heat. Add the leeks and fry gently for 5-7 minutes, or until softened but not browned.  Add the mushrooms, season to taste with salt and freshly ground black pepper, and continue to fry with the leeks for 4-5 minutes, stirring occasionally, until just softened. Set aside to cool. When the leek-and-mushroom mixture has cooled, stir in the mascarpone and mustard until well combined. Season, to taste, with salt and freshly ground black pepper.  When the pastry has rested, roll it out onto a lightly floured work surface to a thickness of a pound coin.  Line a baking tray with baking paper, then transfer the rolled-out pastry to the lined baking tray. Pinch the edges of the pastry to make a rough tart case with a rim.  Pour the filling mixture into the tart case, then sprinkle over the cheese and the crushed chillies (if using).  Bake the tart in the oven for 25-30 minutes, or until the rim of the tart case is golden-brown and the filling has set. To serve, cut the tart into slices and place one slice onto each plate. Serve the green salad alongside. ","ingredients":" 100g\/4oz plain flour, plus extra for dusting,  salt and freshly ground black pepper,  1 tsp English mustard powder,  75g\/3oz chilled unsalted butter, diced,  100g\/4oz leftover mashed potato,  ½-1 tbsp iced water (optional),  2 tbsp olive oil,  400g\/14oz leeks, trimmed and thinly sliced (225g\/8oz trimmed weight),  100g\/4oz chestnut mushrooms, brushed to remove any grit, sliced,  salt and freshly ground black pepper,  75g\/3oz mascarpone,  1 tbsp wholegrain or Dijon mustard,  50g\/2oz Cornish blue, Stilton or Gorgonzola (or a similar vegetarian blue cheese), diced,  pinch crushed dried chillies (optional),  lightly dressed fresh green salad, to serve (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/potato_tart_with_mustard_36933"}