{"recipe_name":"Easy potato and pea samosas","author":"Anjum Anand","programme":"Indian Food Made Easy","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 20","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/potatoandpeasamosas_86618_16x9.jpg","method":"Heat the oil in a small non-stick pan and fry the mustard seeds for about ten seconds, or until they begin to splutter. Add the onion and ginger and cook for 2-3 minutes over a high heat. Add the peas, stir well and add the spices, mango powder, salt and a splash of water. (If using lemon juice, add this instead of the water.) Cook for 1-2 minutes, then add the potatoes and coriander and cook for 2-3 minutes. Taste and adjust the seasoning. Preheat the oven to 200C\/400F\/Gas 6. Unroll the pastry and cover with cling film and a damp tea towel. Peel off one piece and keep the rest covered so that it doesn't dry out. Lay the pastry sheet flat on a clean surface and brush with melted butter. Fold in one third of the pastry lengthways towards the middle. Brush again with the butter and fold in the other side to make a long triple-layered strip. Place one rounded teaspoon of the filling mixture at one end of the strip, leaving a 2cm\/1in border. Take the right corner and fold diagonally to the left, enclosing the filling and forming a triangle. Fold again along the upper crease of the triangle. Keep folding in this way until you reach the end of the strip. Brush the outer surface with more butter. Place onto a baking sheet and cover while you make the rest of the samosas. Sprinkle over a few sesame seeds, if using. Bake in the centre of the oven for 30-35 minutes, or until golden and crisp, turning halfway through the cooking time. To serve, place the samosas onto a large serving plate with a bowlful of chutney. ","ingredients":" 3 tbsp vegetable oil,  ½ tsp mustard seeds,  60g\/2½oz chopped onion,  1 tsp finely chopped ginger,  60g\/2½oz frozen peas,  1 tbsp ground coriander,  1 tsp ground cumin ,  ¼ tsp red chilli powder,  ½-¾ tsp garam masala,  1-2 tsp dried mango powder, to taste (alternatively, use juice of 1\/2 a lemon),  salt, to taste,  splash water,  600g\/1lb 5oz potatoes, peeled, boiled until soft and crushed into large lumps,  4 tbsp chopped fresh coriander leaves,  packet ready-made filo pastry,  5 tbsp melted butter, for brushing,  2 tbsp sesame seeds (optional) (you can also use poppy or nigella seeds)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/potatoandpeasamosas_86618"}