{"recipe_name":"Potato cakes with spicy coleslaw","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the coleslaw, place the cabbage, onion and carrots into a large bowl and season, to taste, with salt and freshly ground black pepper. Add the mayonnaise, wasabi paste and lime leaves and stir well. For the potato cakes, place the mashed potato, grated raw potato and mashed sweet potato into a large bowl. Add the mayonnaise, spring onions, chillies, coriander, garlic, lemon grass, lime leaves, ginger, cinnamon, shallots and season, to taste, with salt and freshly ground black pepper. Mix together with clean hands, until thoroughly combined. Mould the mixture into eight 7cm\/3inch rounds, about 3cm\/1in thick (or make sixteen mini-cakes half the size), place them onto a baking sheet, then transfer to the fridge to chill for 1 hour. Set up three plates or bowls, one containing the flour, one for the beaten eggs and one for the breadcrumbs. Dredge each potato cake in flour, dusting off any excess, then dip into the egg to coat, then dip into the breadcrumbs to completely cover the potato cake. Place the oil into a deep heavy-bottomed saucepan, so that it is no more than half-full, and heat until a breadcrumb sizzles and turns brown in it. (CAUTION: hot oil can be dangerous - do not leave unattended!) Carefully place the potato cakes into the oil and deep-fry in batches for 4-5 minutes, or until crisp and golden. Carefully remove with a slotted spoon and drain on kitchen paper. To serve, place a spoonful of coleslaw onto a plate and arrange two potato cakes on top. Sprinkle some chopped fresh coriander over and place a wedge of lime alongside. ","ingredients":" 100g\/3½oz red cabbage, finely sliced,  ½ red onion, finely sliced,  2 carrots, grated,  salt and freshly ground black pepper,  50g\/2oz ready-made mayonnaise,  1 tbsp wasabi paste,  3 lime leaves, shredded,  2 large Maris Piper potatoes, peeled, cooked and mashed,  1 sweet potato, peeled, cooked and mashed,  3 tbsp mayonnaise,  1 bunch spring onions, finely chopped,  2 small red chillies, deseeded and chopped,  3 tbsp chopped fresh coriander leaves,  2 garlic cloves, crushed,  2 stalks of lemon grass, finely chopped,  4 kaffir lime leaves, finely chopped ,  2cm\/1in piece fresh ginger, finely chopped,  1 tsp cinnamon,  2 shallots, finely chopped,  salt and freshly ground black pepper,  50g\/2oz plain flour,  2 free-range eggs, beaten,  150g\/5oz fresh breadcrumbs,  vegetable oil, for deep frying,  chopped fresh coriander leaves,  1 lime, cut into wedges","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/potatocakeswithspicy_84276"}