{"recipe_name":"Beef rendang with lemongrass and ginger, Thai herb salad and sticky rice","author":"John Torode","programme":"Saturday Kitchen Best Bites","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the beef rending, pound the lemongrass to a pulp using a pestle and mortar. Tip the lemongrass into a small bowl.  Heat the frying pan over a medium heat. Add the coriander, cumin seeds and turmeric and dry fry until fragrant. Tip the spices into a spice grinder or the pestle and mortar. Grind the spices to a powder if using a grinder, or pound in a pestle and mortar until the spices are as smooth as possible. Set aside. In a wide pan or cast-iron wok, heat the block of coconut cream until it melts, keeping the heat low so that it does not burn.  Add the onions, garlic, chillies, ginger and pounded lemongrass to the pan and cook gently until the onions have softened and the mixture is fragrant.  Add the reserved ground spices and the bay leaf and fry for a few minutes more. Add the meat and increase the heat so that it browns on all sides. Stir until the meat is completely coated with the spices - this will take a few minutes.  Add the coconut milk, bring to the boil, then add the hot stock.  Turn the heat up to high and continue cooking for at least 1- 1½ hours, stirring occasionally until the sauce becomes thick and coats the meat well. For the salad, combine all the salad ingredients in a salad bowl and mix well. Set aside. For the dressing, whisk together all the dressing ingredients in a bowl. Set aside. For the sticky rice, tip the rice into a sieve and wash the two varieties of rice three times, draining each time.  Place the rice into a saucepan and cover with water to leave 1cm\/½in water above the level of the rice. Add the salt and cover with a lid. Place over a high heat and bring to the boil. Boil the rice for five minutes, then, without removing the lid, turn the heat off and leave to steam for 20 minutes. To serve, pour the dressing into the salad and mix to combine. Pile the rice onto four plates and spoon the beef rending alongside. Serve the salad separately. ","ingredients":" 1 lemongrass stalks, roughly chopped,  20g\/¾oz coriander seeds,  ½tsp cumin seeds,  ½tsp turmeric powder,  50g\/2oz block coconut cream,  1½ large onions, sliced,  3 garlic cloves, chopped,  3 red chillies, seeds removed, chopped,  1 thumb-sized piece ginger, peeled and chopped,  1 bay leaf,  750g\/1lb 10oz boneless beef shin, cut into 2.5cm\/1in cubes,  400g\/14oz canned coconut milk,  250ml\/8¾fl oz strong veal or beef stock, heated,  110g\/4oz Chinese cabbage, shredded,  2 lime leaves, sliced into thin strips,  2 red chillies, seeds removed, sliced into thin strips,  25g\/1oz pea shoots,  50g\/2oz mizuna leaves,  small handful mint leaves,  1 spring onion, sliced diagonally,  50g\/2oz green beans, cut into 2cm\/1in pieces,  small handful fresh coriander leaves,  small handfulfresh Thai basil leaves (or normal basil leaves),  small handful bean sprouts,  1 lime, juice only,  1 tsp sunflower oil,  1 tsp fish sauce,  1 red chilli, finely diced,  1 garlic clove, finely sliced,  200g\/7oz Thai jasmine rice,  200g\/7oz Thai sticky rice,  1 tsp salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefrendangwithlemon_90061"}