{"recipe_name":"Poulet sauté au vinaigre","author":"Henry Harris","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/poulet_saut_au_vinaigre_50938_16x9.jpg","method":"Remove the legs from the chicken and separate the thighs from the drumsticks. Using poultry shears or heavy scissors, cut the breasts from the carcass, keeping the breast meat attached to the breast bone. Then separate the breasts. Cut each chicken breast into two or three, depending on the size.  One piece of each breast will have the wing attached - keep this, but remove the wing tip. Preheat the oven to 180C\/350C\/Gas 4. Heat a splash of oil in a large, wide, lidded, oven-proof pan. Season the chicken and fry until golden-brown and crisp. Meanwhile, quarter the skinned tomatoes and scoop out the seeds. Keep the pulp.  Dice the tomato flesh into a small dice and put to one side.  Remove the chicken from the pan and set to one side.  Tip out the fat and add the butter. Stir in the tomato purée and cook for two minutes to cook out the purée. Add the garlic and tomato pulp and cook for a further minute to dry out the pulp.  Add the vinegar and reduce until it has all but disappeared. Add the wine and reduce in volume by a third. Then add the chicken stock and bring up to a simmer.  Taste to check the seasoning, and add salt and freshly ground black pepper as necessary.  Return the chicken to the pan, cover with a lid and transfer to the oven.  Bake for a further 20 minutes or until the chicken is cooked through. Lift the chicken from the pan and set aside and keep warm.  Strain the sauce through a sieve into a clean pan and bring back to a boil.  Whisk in the mustard and stir in the cream, then simmer and reduce to thicken slightly.  Check the seasoning a final time and then add the diced tomato and tarragon.  To serve, pour the sauce over the chicken and serve. This is particularly good with buttery mashed potato. ","ingredients":" 1.5kg\/3lb 5oz free-range chicken,  1 tbsp vegetable oil,  salt and freshly ground black pepper,  2 tomatoes, blanched and skinned,  knob of butter,  1 tsp tomato purée,  2 garlic cloves, finely chopped,  50ml\/2fl oz red wine vinegar ,  125ml\/4fl oz white wine,  500ml\/18fl oz chicken stock,  1 heaped tsp Dijon mustard,  250ml\/9fl oz whipping cream,  1 tbsp chopped fresh tarragon","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/poulet_saut_au_vinaigre_50938"}