{"recipe_name":"Poussin scented with ginger and lemongrass","author":"Michel Roux","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put 1.5 litres\/2½ pints of water into a steamer pan, salt very lightly, cover and bring to the boil. Meanwhile, mix the ginger with the lemongrass and place inside the poussins (they don’t need trussing). Put them in the top of the steamer, cover and steam for 15-20 minutes. Scatter over the broccoli florets, and cook for another two minutes. Transfer the broccoli to a bowl, cover with cling film and keep warm.  Cut off the legs and breasts from the poussins. Wrap the breasts in foil and leave to rest in a warm place. Reserve the legs.  Break up the carcasses and put them in the cooking water in the base of the steamer, together with the ginger and lemongrass mixture (from inside the poussins). Simmer for five minutes, add the blended cornflour and cook, stirring, for one minute, then strain through a fine sieve into a saucepan. Adjust the seasoning if necessary. Keep the sauce warm.  Heat the grapeseed oil in a frying pan. Add the poussin legs, skin-side down, and fry over a medium heat until the skin is slightly crunchy and a beautiful light golden-brown.  Heat the oil for deep-frying in a suitable pan to about 160C\/320F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Make sure the rocket (or parsley) is completely dry. Put it into the hot oil and deep-fry until very crisp, stirring with a slotted spoon and drain on kitchen paper. If the rocket isn’t as crisp as it should be, reheat the oil and fry it for another 2-3 minutes. Drain on kitchen paper and salt lightly.  Steam the rice according to packet instructions. To serve, pile the hot rice on a serving platter and arrange the poussin breasts and legs on top. Scatter on little heaps of broccoli and rocket, and serve at once, handing the sauce around separately.  ","ingredients":" 20g\/¾oz fresh root ginger, peeled and thinly sliced,  2 stalks lemongrass, cut lengthways into thick julienne strips,  2 poussins, 350\/12oz each, wishbones removed,  200g\/7oz broccoli florets ,  1 tbsp cornflour, mixed with 2 tbsp cold water,  salt and freshly ground pepper,  2 tbsp grapeseed oil,  vegetable oil, to deep-fry ,  110g\/4oz rocket leaves or flat-leaf parsley,  200g\/7oz fragrant Thai long-grain rice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/poussin_scented_with_31952"}