{"recipe_name":"Prawn and langoustine cocktail","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01sv008.jpg","method":"Put the prawns in a steamer and over a pan of boiling water. Cover and cook the prawns for 1½ minutes, then add the langoustines and cook for a further 1½ minutes, or until the prawns and langoustines turn pink and are just cooked through. Remove and allow to cool on a plate for 10 minutes before peeling. Meanwhile, blend the egg yolks and mustard in a food processor until pale and creamy.  With the motor running, pour in enough oil, in a steady stream, until the mayonnaise is thick. Put the mayonnaise into a bowl, then add the Worcestershire sauce, Tabasco, brandy and tomato ketchup. Taste and season with salt and pepper as needed, add a squeeze of lemon juice and mix well.  Cut the remaining lemon into four wedges. In a bowl toss the Little Gem leaves with the French dressing. To serve layer some dressed Little Gem leaves into the bottom of each of four cocktail glasses. Lay the peeled prawns and crayfish over the top then spoon over the sauce. Finish with a scattering of mustard cress, pinch of cayenne pepper and wedge of lemon. Serve with the buttered bread. ","ingredients":" 600g\/1lb 5oz raw tiger prawns, shell on ,  600g\/1lb 5oz raw langoustines, shell on,  2 free-range egg yolks,  1 tsp Dijon mustard,  300ml\/10fl oz vegetable oil ,  1 tsp Worcestershire sauce,  4 dashes Tabasco sauce,  25ml\/1fl oz brandy,  50ml\/2fl oz tomato ketchup,  salt and freshly ground black pepper,  1 lemon,  3 heads Little Gem lettuce, leaves separated,  2 tbsp French dressing,  ½ tsp cayenne pepper,  2 tbsp mustard cress,  8 slices buttered brown bread","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prawn_and_langostine_72760"}