{"recipe_name":"Prawn and smoked haddock omelette","author":"Brian Turner","programme":"Christmas Kitchen","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to its highest setting. Melt half of the butter in a saucepan over a medium heat. Remove the pan from the heat and whisk in the flour to form a smooth paste (a roux). In a separate saucepan, warm the cream and milk over a low heat. Gradually add the milk-and-cream mixture to the roux, whisking after each addition and waiting for the mixture to thicken slightly. When all of the liquid has been incorporated into the roux, remove the pan from the heat and set aside to cool slightly. Melt the remaining butter in a non-stick frying pan over a medium heat. Flake in the cooked haddock and fry until heated through but not coloured.  Season the beaten eggs with salt and freshly ground black pepper. Pour them over the fish, stir carefully, then add the cooked prawns and stir carefully once again, so that the eggs set but not too firmly.  Add half of the parmesan and the whole egg yolk to the roux sauce, stirring well to combine. Season, to taste, with salt and freshly ground black pepper.  Gently spread the cheese sauce on top of the smoked haddock and prawn omelette in an even layer. Sprinkle over the remaining parmesan. Transfer the pan to the grill and grill for about 30 seconds, or until the cheese has melted and started to blister, making sure the omelette is not sticking to the bottom of the pan.  To serve, slide the omelette onto a serving plate and cut into slices. Serve with a green salad. ","ingredients":" 50g\/2oz butter,  25g\/1oz flour,  125ml\/4½fl oz double cream,  125ml\/4½fl oz milk,  100g\/3½oz cooked smoked haddock,  6 free-range eggs, beaten,  salt and freshly ground black pepper,  large handful cooked prawns,  100g\/3½oz parmesan, grated,  1 free-range egg yolk","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prawn_and_smoked_haddock_29781"}