{"recipe_name":"Prawn and tamarind curry (Chemmeen vevichathu)","author":"Atul Kochhar","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Soak the tamarind in 200ml\/7fl oz water for 15-20 minutes.  For the spice paste, put all of the ingredients in a blender with 4-5 tablespoons of water. Blend to a paste.  For the curry, heat the oil in a large pan over a medium heat. Add the mustard seeds and cook until you hear them pop, then add the fenugreek seeds and shallots. Cook until the shallots are light brown in colour.  Add the green chillies, ginger and curry leaves. Season with salt. Cook over a medium heat for 3–5 minutes.  Mix in the spice paste, cook for 5 minutes or until light brown in colour. Stir in the prawns and palm sugar.  Add the tamarind and its soaking liquid. Cook for 10–12 minutes, or until the prawns are cooked. If the sauce is too thick for your liking, stir in 100ml\/3½fl oz fish stock or hot water.   Spoon the curry into bowls and serve with the rice alongside. ","ingredients":" 1 seedless dried tamarind (about the size of a walnut),  1 tbsp rapeseed oil,  1 tsp black mustard seeds ,  1 tsp fenugreek seeds,  2 shallots, chopped,  2 green chillies, finely chopped,  1 tbsp chopped fresh ginger, peeled,  15–20 curry leaves,  20–24 medium prawns, head and shell removed, deveined,  ½ tsp palm sugar (optional), also known as jaggery,  100ml\/3½fl oz warm fish stock or water (optional),  salt,  2 garlic cloves, chopped,  1 cinnamon stick (approximately 5cm\/2in),  2 cloves,  ½ tsp fennel seeds,  1 small dried red chilli,  2 tsp ground coriander ,  1 tsp ground turmeric ,  ¼ tsp black pepper,  steamed basmati rice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prawn_and_tamarind_curry_30910"}