{"recipe_name":"Prawn cocktail","author":"Trish Deseine","programme":"Trish Deseine's Christmas Dishes","prep_time":"less than 30 mins","cooking_time":"no cooking required","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p04jydrp.jpg","method":"Begin with the mayonnaise. Put the eggs into a roomy bowl and mix in the mustard and a little seasoning.  Whisk together, while very slowly trickling in the sunflower oil. Once the mixture is becoming very thick, add a little lemon juice.  Continue beating, add the oil a little faster and increasing the beating speed. Once the oil has been incorporated, add some more lemon juice and then begin whisking in the olive oil until you are happy with the taste. Add salt and white pepper, to taste, and set aside in the fridge until ready to use.  Put the lettuce into a small bowl, cover with cold water and a few cubes of ice; this will crisp the lettuce. In another bowl mix together the mayonnaise, ketchup, Tabasco and cognac; the sauce should be pink. Fold in the cucumber. Set aside. Drain the lettuce and either spin-dry or pat dry with a tea towel. Divide the lettuce into the bottom of four big glasses, top with the prawns, dividing them equally between each glass, then spoon over the cocktail sauce, allowing it to completely cover the prawns. Garnish with paprika and a lemon wedge. ","ingredients":" 2 free-range egg yolks,  2 tsp Dijon mustard,  300ml\/½ pt sunflower oil ,  ½ large lemon, juice only,  150ml\/5fl oz extra virgin oil,  salt and freshly ground white pepper,  2 Little Gem lettuce hearts, finely shredded,  5 tbsp of the mayonnaise (from above),  1-2 tbsp tomato ketchup, or to taste,  3-4 shakes Tabasco sauce,  splash cognac,  ¼ small cucumber, peeled, seeds removed and finely diced,  400g\/14fl oz cooked prawns, peeled,  6 small lemon wedges,  pinch paprika","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prawn_cocktail_29769"}