{"recipe_name":"Prawn, prosciutto and rosemary skewers ","author":"Lorraine Pascale","programme":"Lorraine Pascale: How to be a Better Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/prawn_prosciutto_and_90203_16x9.jpg","method":"For the salsa, toss the avocado slices gently in a bowl with the lime juice. Add the tomatoes, spring onions, chillies, ginger and olive oil. Reserve a small handful of coriander (or basil) leaves for garnishing, tear up the remainder and add to the bowl with salt and pepper to taste. Stir everything gently together to keep the avocadoes from going too mushy. Cover with cling film and place in the fridge while you get on with the skewers.  For the prawn skewers, cut each prosciutto slice across the width to give four even-sized strips and then in half lengthways to give eight pieces each and 16 in total, one for each prawn. Wrap each piece of prosciutto around the centre of each prawn like a blanket. Make a prawn into a C shape and push the bottom end of a rosemary stick in through the top of the ‘C’ right through to the bottom of the ‘C’. Push the prawn about halfway up the stick and then add another prawn in the same way. Repeat to make eight skewers in total. If the rosemary stick is not easy to push through, then just get a skewer and push that through first to make the holes, then pull it out and push the prawns on. Get a griddle pan hot. Brush the prawns with a little oil, season with salt and pepper and then, working in batches if necessary, griddle them for about 1-2 minutes each side depending on their size, until cooked through. Keep each batch on a warm plate covered with foil as you cook the next. Once all the prawns are cooked, divide the salsa between four serving plates. Sit two prawn skewers on top and add a lime wedge for squeezing onto each one. Garnish with the reserved coriander (or basil) leaves and serve. ","ingredients":" 2 ripe avocados, halved, stoned, peeled and sliced,  2 limes, 1 quartered, 1 juiced,  2 large tomatoes, seeds removed, diced into 1cm\/½in pieces,  5 spring onions, finely sliced,  1-2 red chillies, seeds removed (for less heat if preferred), very finely diced,  3cm\/1¼in piece fresh root ginger, peeled and finely chopped,  1 tbsp olive oil ,  1 small bunch either coriander or basil, roughly chopped (about 2 tbsp each),  flaked sea salt and freshly ground black pepper,  2 slices prosciutto,  16 raw, peeled, jumbo prawns, deveined,  8 sticks rosemary, leaves removed from all but the top of each stalk,  1 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prawn_prosciutto_and_90203"}