{"recipe_name":"Prawn paella","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the olive oil in a large paella pan or frying pan until hot and add the chorizo. Cook for 2-3 minutes, or until the chorizo starts to release its oils. Add the onion and pepper and cook for 1-2 minutes until just beginning to soften. Add the garlic, chilli flakes, hot and sweet paprika and thyme and fry for one minute. Add the paella rice and fry for two minutes until coated in oil. Add the white wine and simmer until reduced by half. Add the fish stock, saffron and tomatoes and bring to a simmer, then reduce the heat and cook for 10-15 minutes, or until the rice is tender and the liquid nearly absorbed. Add all the seafood and cook for 3-4 minutes until cooked through. Add the peas and lemon juice and season, to taste, with salt and freshly ground black pepper. To serve, stir in the flatleaf parsley and drizzle with the extra virgin olive oil. ","ingredients":" 50ml\/2fl oz olive oil,  150g\/5oz chorizo, cut into small chunks,  1 onion, finely chopped,  1 red pepper, roughly chopped,  2 garlic cloves, finely chopped ,  ½ tsp dried chilli flakes ,  ½ tsp smoked hot paprika,  ½ tsp smoked sweet paprika,  2 sprigs fresh thyme, leaves only,  500g\/1lb 2oz paella rice, such as Calasparra ,  175ml\/6fl oz dry white wine ,  1.5 litres\/2½ pints hot fish stock,  1 tsp saffron threads,  4 large tomatoes, seeds removed, chopped ,  12 raw king prawns, shells on,  300g\/11oz raw tiger prawns, peeled and cleaned,  150g\/5oz baby squid, cleaned, trimmed and cut in half ,  400g\/14oz mussels, cleaned and debearded (discard any that don't close when gently tapped),  300g\/11oz clams (discard any that don't close when gently tapped),  110g\/4oz frozen peas, defrosted,  1 lemon, juice only,  salt and freshly ground black pepper ,  handful flatleaf parsley, roughly chopped,  4 tbsp extra virgin olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prawnpaella_86606"}