{"recipe_name":"Prawns in chupe sauce with spicy mash","author":"Martin Morales","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the prawns, heat the oil in a frying pan. Gently fry the onions and garlic, until softened. Add the chilli paste and tomato purée to the pan. Simmer for 5 minutes then add the stock. Simmer and reduce for 15 minutes then add the evaporated milk. Season with salt and pepper and then add the prawns and the broad beans. Simmer for 5 minutes then add the oregano to season.  Meanwhile, for the spicy mash, boil the potatoes in a pan of water with a pinch of salt for 10-15 minutes until cooked. Drain and return to the empty pan to let the steam escape. Mash while still hot.  Cook the garlic and onions in a large saucepan with a dash of olive oil until soft and golden-brown, then add the chilli paste. Add the evaporated milk and simmer for 1 minute and then add the mashed potatoes. Stir to ensure the mixture doesn’t stick to the pan. Serve the mash in a large bowl and lay the creamy spicy prawns and sauce on top. Garnish with cubes of cheese and chopped mint. ","ingredients":" 1 tbsp olive oil,  4 white onions, finely chopped,  8 garlic cloves, finely chopped,  8 tsp panca chilli paste, or any smoked chilli paste ,  100g\/3½oz tomato purée,  500ml\/18fl oz prawn or seafood stock ,  1 x 410g tin evaporated milk ,  20 fresh giant king prawns, heads on, shell removed from tails,  40g\/1½oz fresh broad beans, cooked in boiling water until tender,  pinch dried oregano,  1kg\/2lb 4oz potatoes, peeled,  4 garlic cloves, finely chopped,  1 white onion, finely chopped,  3 tbsp Amarillo chilli paste ,  3 tbsp evaporated milk,  200g\/7oz queso fresco or feta cheese, cubed,  2 tbsp chopped mint","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prawns_in_chupe_sauce_78364"}