{"recipe_name":"Mayan stew","author":"The Hairy Bikers","programme":"The Hairy Bikers","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the pork, water or stock, onion, garlic, bay leaves and seasoning in a large pot and bring to the boil. Simmer for about an hour or until the pork is falling apart. Preheat the oven to 200C\/400F\/Gas 6. Meanwhile for the tomato and chilli sauce, toast the chillies on both sides in a dry frying pan until blistered. Be careful as the fumes that are given off are an irritant, so make sure the kitchen is well ventilated.  Place the chillies in a bowl with the hot water to soften. Soak for 20 minutes.  Place the tomatoes and the garlic in a roasting tray and roast in the oven until soft. Set aside.  Toast the cloves and peppercorns in a dry frying pan and set aside.  Place the chillies, tomatoes, garlic and spices and a little of the chilli soaking water in a blender and blend until it is the consistency of brown sauce. Pass through a sieve using a wooden spoon.  For the pork, toast the pumpkin seeds in a dry frying pan, then place in a food processor and grind to a powder.  If using dried corn, toast in the same way until the kernels start to go brown. Set aside to cool, then coarsely grind in a food processor. If using chickpeas, see step 11. Heat the sunflower oil in a frying pan and fry the tomato and chilli mixture for about 15 minutes. Add the tomato and chilli mixture to the stew, then stir in the toasted corn or the soaked chickpeas, along with the ground pumpkin seeds. Add the yerba santa or ground fennel seeds and the pork. Cook until thickened and reduced, about 45 minutes. Add salt to taste.  Serve with tortillas, green rice and a spicy cooked salsa. ","ingredients":" 1kg\/2¼lb pork shoulder,  1.75 litres\/3 pints water or light chicken stock,  1 medium onion, sliced,  1 head garlic, chopped,  5 bay leaves,  salt and freshly ground black pepper,  4 chilcostle rojo chillies (available in some speciality food shops and online),  4 guajillo chillies (available in some speciality food shops and online),  290ml\/½ pint hot water,  500g\/1lb 2oz plum tomatoes,  4 cloves garlic,  2 cloves,  4 black peppercorns,  250g\/9oz pumpkin seeds,  250g\/9oz dried corn (or substitute 300g\/10½oz dried chickpeas, soaked overnight),  sunflower oil,  2 yerba santa leaves or 1 tsp ground fennel seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prehispanicstew_81426"}