{"recipe_name":"Profiteroles with cheat’s custard ","author":"Nigel Slater","programme":"Nigel Slater: Eating Together","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/profiteroles_with_cheats_58794_16x9.jpg","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. Grease a baking tray with a little butter and line with baking parchment. For the profiteroles, in a large saucepan, heat 250ml\/9fl oz water with the butter, flour and salt over a medium heat, beating well until combined. Whisk the eggs in a separate bowl. Using an electric whisk, whisk the contents of the saucepan while gradually pouring in the beaten eggs. Continue to whisk until the mixture is smooth and glossy and all of the eggs have been incorporated. Dot tablespoons of the mixture onto the prepared baking tray, setting them a good 2-3cm\/1-1½in apart. Bake the profiteroles in the oven for 20-25 minutes, or until puffed up and golden-brown. Pierce the bottom of each cooked profiterole with a sharp knife to allow the steam to escape, then place onto a wire rack to cool.  Meanwhile, for the cheat’s custard, whisk the egg yolks with the caster sugar and vanilla seeds until fluffly. Gently fold in the Marsala wine and mascarpone. Stuff each profiterole with the cheat's custard through the steam holes, using either a teaspoon or a piping bag (you may need to enlarge each hole using a sharp knife).  Arrange the stuffed profiteroles in a tall pile on a large serving plate or cake stand. Place two heatproof bowls over two saucepans filled with a little boiling water (do not allow the bottom of the bowls to touch the water). Heat over a medium heat until each pan of water is simmering. Add the plain chocolate to one bowl and the white chocolate to the other and stir until melted.  Trickle the melted plain and white chocolate over the profiteroles, then scatter the pile with the chopped pistachios and crystallised roses and violets to decorate.  ","ingredients":" 100g\/3½oz butter, plus extra for greasing,  150g\/5oz plain flour,  pinch salt,  4 free-range eggs,  4 free-range egg yolks,  4 tbsp caster sugar,  1 vanilla pod, seeds only,  2 tbsp Marsala wine,  300g\/10½oz mascarpone ,  100g\/3½oz plain chocolate, minimum 75 per cent cocoa solids,  100g\/3½oz white chocolate,  60g\/2¼oz pistachios, coarsely chopped,  30g\/1¼oz crystallised rose petals,  30g\/1¼oz crystallised violets","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/profiteroles_with_cheats_58794"}