{"recipe_name":"Proper baked beans with soda bread toast","author":"Tom Kerridge","programme":"Tom Kerridge's Proper Pub Food","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/proper_baked_beans_with_36013_16x9.jpg","method":"Drain the white beans and put them in a large pan. Cover with water and bring to the boil. Drain again and return to the pan. Cover with water and cook for approximately one hour, or until just soft. Remove from the heat and drain. In a large saucepan, heat the rapeseed oil over a medium heat. Add the streaky bacon and fry until crisp. Add the onion and garlic to the pan and cook until the onion is soft. Add the tinned tomatoes, tomato purée, sugar, vinegar and 500ml\/18fl oz water. Bring to the boil and then add the soaked beans. Reduce the heat to low and cook for 1½-2 hours, or until you have a thick sauce with soft tender beans Meanwhile, make the soda bread. Preheat the oven to 200C\/400F\/Gas 6. Mix all the ingredients together and form into a loaf shape of your choice.  Place on a baking tray, dust with flour and bake in the oven for 45-50 minutes, or until the loaf is golden-brown and sounds hollow when tapped.  Remove from the oven and leave to cool. Slice and toast when needed. Season the beans with salt and pepper and serve with slices of toasted soda bread. ","ingredients":" 400g\/14oz dried white beans (such as haricot blanc), soaked overnight in cold water,  75ml\/2½oz rapeseed oil,  200g\/7oz smoked streaky bacon, chopped,  200g\/7oz onion, finely chopped,  2 garlic cloves, grated,  2 x 400g\/14oz chopped tinned tomatoes,  2 tbsp tomato purée,  150g\/5½oz soft dark brown sugar,  200ml\/7fl oz red wine vinegar,  salt and freshly ground black pepper,  340g\/11¾oz wholemeal flour,  340g\/11¾oz strong white flour, plus extra for dusting ,  2 tsp bicarbonate of soda,  1½ tsp salt,  1 tsp cracked black pepper,  85g\/3oz butter, softened, plus extra to serve,  625ml\/21fl oz buttermilk","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/proper_baked_beans_with_36013"}