{"recipe_name":"Prosciutto-wrapped guinea fowl with wild mushroom risotto and roasted Brussels sprouts","author":"Richard Phillips","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the risotto, heat half of the olive oil and the butter together in a pan and gently fry the onion for 2-3 minutes, or until softened. Stir in the rice, coating in the oil, until the rice turns translucent. Pour in the wine and cook until the wine has been absorbed, then gradually add a ladle of the stock at a time, allowing the liquid to be absorbed by the rice each time before adding more.  Just before the risotto is finished cooking and is creamy but still al dente, heat the remaining olive oil in a clean pan and fry the mushrooms for 4-5 minutes, or until softened. Stir the mushrooms into the risotto. Meanwhile, for the guinea fowl, wrap the prosciutto around the guinea fowl breast. Heat the oil in an ovenproof frying pan and fry the wrapped guinea fowl along with the garlic and thyme for 2-3 minutes on both sides, or until golden-brown. Add the butter to the pan, then transfer to the oven to cook through for 5-6 minutes, or until the guinea fowl is cooked through. (The juices will run clear when the meat is pierced in the thickest part with a skewer.) Remove from the pan and allow to rest on a warm plate. For the sprouts, heat the butter in the pan used to cook the mushrooms and, when foaming, gently fry the sprout halves together with the sage for 3-4 minutes, or until the sprouts are golden-brown all over. Season with salt and freshly ground black pepper, then transfer to the oven to roast for 7-8 minutes, or until the sprouts are tender.  For the jus, return the pan used to cook the guinea fowl to the heat and deglaze with the wine. Simmer for 3-4 minutes, or until the liquid has reduced by a third, then pour in the stock and simmer for a further 2-3 minutes. To serve, spoon the risotto onto the centre of a serving plate. Thickly slice the guinea fowl and arrange on top of the risotto, then place the sprouts alongside. Drizzle the jus around the edges of the plate and serve. ","ingredients":" 2 tbsp olive oil,  25g\/1oz butter,  ½ onion, finely chopped,  150g\/5½oz Arborio rice,  75ml\/2½fl oz white wine,  400ml\/14fl oz hot chicken stock,  55g\/2oz wild mushrooms, trimmed and wiped clean,  1 slice prosciutto,  1 guinea fowl breast,  1 tbsp olive oil,  2 garlic cloves, skin-on, crushed,  2 fresh thyme sprigs,  15g\/½oz butter,  15g\/½oz butter,  4 Brussels sprouts, halved,  2 tbsp chopped fresh sage,  salt and freshly ground black pepper,  75ml\/2½fl oz red wine,  75ml\/2½fl oz chicken stock","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/prosciuttowrappedgui_90737"}