{"recipe_name":"Provence-style spelt with squash soup and black truffle from the Valensole plateau","author":"La Bastide de Moustiers restaurant","programme":"Eating in the Sun","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Drizzle two tablespoons of olive oil over the spaghetti squash halves, then season with salt and freshly ground black pepper.  Wrap each piece in a piece of aluminium foil and place the wrapped squash, cut-sides down, onto a baking tray. Bake in the oven for 25-30 minutes, or until tender.  Unwrap the spaghetti squash halves and remove the seeds using a spoon. Scoop the cooked flesh from the squash and shred using a fork so that it falls apart in strands. Set aside. Heat two more tablespoons of olive oil in a frying pan over a medium heat. Add the chopped nutmeg squash, thyme leaves and garlic and fry for 4-5 minutes, or until softened. Transfer the mixture to a food processor and blend until smooth. Set aside. In a separate frying pan, heat another tablespoon of olive oil over a medium heat. Add the half moons of nutmeg squash and fry for 2-3 minutes, or until golden-brown. Add 3-4 tablespoons of the chicken or vegetable stock and bring the mixture to a simmer. Continue to simmer for 2-3 minutes, or until most of the liquid has evaporated and the nutmeg squash is tender. Set aside. Heat half of the butter in a casserole over a medium heat. When the butter is foaming, add the onion, season with salt, and fry for 2-3 minutes. Add the spelt and stir well to combine. Continue to cook for a further 2-3 minutes, stirring continuously, or until transluscent.  Add the white wine and stir well, then simmer for 4-5 minutes, stirring regularly, until most of the liquid has evaporated.  Add a ladleful of the remaining hot chicken  or vegetable stock and continue to simmer, stirring regularly, until most of the liquid has evaporated. Repeat the process with the remaining chicken  or vegetable stock for a further 20-25 minutes, or until the spelt is almost tender and has absorbed all of the chicken or vegetable stock. When the spelt is almost cooked through but still retains a slight bite, add the crushed truffle, truffle peelings and butternut squash. Continue to cook for 4-5 minutes, or until the butternut squash is cooked through and the spelt is just tender (if the spelt is still not cooked through, add two tablespoons of some of the nutmeg squash purée and simmer until reduced). Remove the casserole from the heat, add the remaining butter and the parmesan and stir until well combined. Season, to taste, with salt and freshly ground black pepper. Just before serving, gently reheat the spaghetti squash and the Nice squash half-moons in a frying pan. To serve, spoon the spelt and squash soup into four serving bowls. Spoon some of the spaghetti and Nice squash on top of each. Place a handful of purslane leaves alongside. Garnish with the pepper pecorino slices. ","ingredients":" 5 tbsp olive oil,  salt and freshly ground black pepper ,  1 small spaghetti squash, cut in half lengthways,  300g\/10½oz nutmeg squash, peeled, roughly chopped,  1 sprig fresh thyme, leaves only,  1 garlic clove, crushed,  300g\/10½oz Rond de Nice or simple round green squash, peeled, sliced into 1cm\/½in half-moon shapes,  2 litres\/3½ pints hot chicken or vegetable stock,  40g\/1½oz butter,  1 white onion,  400g\/14oz fine Provence spelt,  50ml\/2fl oz dry white wine,  1 x 50g\/2oz truffle, preferably from the Valensole plateau, peeled, cut in half, peelings and flesh crushed with a fork and reserved,  300g\/10½oz butternut squash, peeled, cut in half lengthways, seeds scooped out with a spoon, flesh chopped,  40g\/1½oz parmesan, or similar vegetarian hard cheese,  4 small handfuls purslane leaves, washed and drained,  40g\/1½oz pecorino with black peppercorns, thinly sliced","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/provencespeltwithsqu_91349"}