{"recipe_name":"Pulled pork Goan-style with oriental coleslaw","author":"Cyrus Todiwala","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make a masala paste. In a pestle and mortar, coarsely crush the cassia bark (or cinnamon), peppercorns and cloves.  Gently toast the mixture in a dry frying pan over a low heat and add the torn red chilies. Toast until aromatic, but do not burn. Set aside to cool. In a blender, combine the ginger, garlic, onion, green chilli, turmeric and the cooled spice blend. Add the tamarind pulp, vinegar, half the oil, sugar and salt. Blend it all to a relatively fine paste. Taste and season with salt and pepper, if desired. Take some of the masala paste and rub it into the pork (if using collar of pork you might have smaller pieces, in which case marinate individually and proceed as normal). Set it aside in the fridge for a few hours. Keep the rest of the masala for later. Preheat the oven to 170C\/340F\/Gas 3½. Mix the pumpkin, the potatoes and onions (if using) into the rest of the masala paste. Heat a deep-sided roasting tray on the hob and add the remaining oil spreading it to cover the entire base of the tray.  Scrape the excess masala from the marinated pork. Add the pork to the roasting tray and brown on all sides. Keeping the pork in the center of the tray, spread the marinated vegetables all around. Cover with foil, taking care to ensure there are no gaps, so the moisture can't escape and the meat won't dry out. Place in the oven. After about thirty minutes reduce the oven temperature to 130C\/275F\/Gas 1 and continue cooking for another 3-4 hours, if using a rolled joint. Smaller pieces or individual chops will take less time and are ready when the meat is meltingly tender. The vegetables will cook much more quickly, so remove them as soon as they are cooked. When cooked, check the seasoning and add salt and pepper accordingly. For the oriental coleslaw, place all vegetables apart from the beetroot in a large bowl of water to soak. Soak the beetroot separately to prevent it discolouring the other vegetables. Make a mustard dressing. In a separate bowl, mix the garlic, mayonnaise, mustard, chilli and coriander. Season with salt and pepper. Drain all the vegetables and mix together. Dress the coleslaw, just before serving, with the mustard dressing. Serve slices of pork surrounded with the vegetables, and serve with the oriental coleslaw. For pulled pork, shred the meat with a fork, as it should be tender and easy to tear apart. ","ingredients":" 10cm\/4in piece cassia bark or cinnamon stick, broken into small pieces,  1 heaped tbsp black peppercorns,  5-6 cloves,  4-5 large, dried red chillies, torn into pieces,  10cm\/4in piece fresh root ginger,  6-8 garlic cloves,  3-4 small red onions coarsely cut,  2 longish green chillies,  1 heaped tsp ground turmeric ,  100ml\/3½fl oz tamarind pulp,  200ml\/7fl oz palm vinegar (alternatively use cider vinegar),  100ml\/3½fl oz sunflower or rapeseed oil,  1 tbsp brown sugar,  1 tbsp salt,  2kg\/4lb 8oz rolled pork loin, shoulder or collar,  300-400g\/11-14oz pumpkin, seeds removed, cut into chunks,  8 medium to small potatoes, peeled and cut into chunks,  3-4 small red onions, cut into chunks (optional),  3 tbsp chopped fresh coriander,  1 carrot, coarsley grated,  ¼ cabbage, shredded,  ¼ white radish, coarsley grated,  1\/3 of a bunch of breakfast radishes, coarsley grated,  ¼ celeriac, coarsley grated,  1 red onion, thinly sliced,  2 small beetroots, peeled and coarsley grated,  2 garlic cloves, finely chopped,  150g\/5½oz mayonnaise,  1 tbsp wholegrain mustard,  1 green chilli, finely chopped,  4 tbsp finely chopped fresh coriander,  salt and pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pulled_pork_goan-style_86037"}