{"recipe_name":"Pumpkin fritters","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 15-20","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Lightly grease a plate with oil. Bring a small amount of water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a steaming basket over the water (do not allow the base of the steaming basket to touch the water). Place the oiled plate into the basket.  Place the pumpkin slices onto the oiled plate, in batches if necessary. Cover the steaming basket with a lid and steam the pumpkin for 15 minutes, or until tender. Remove the pumpkin from the steaming basket and set aside to cool slightly, draining off any liquid in the basket. Repeat the process, if necessary, with the remaining pumpkin slices. Mash the steamed pumpkin in a bowl using a fork. Add the flour and ginger and mix until well combined.  Using your hands, mould the pumpkin mixture into 15-20 small patties.  Sprinkle a plate with flour and dredge the pumpkin patties in the flour until completely coated. Set aside. For the batter, in a bowl, mix together the lager and flour until it forms a smooth paste. Add the ice cubes and stir until just combined. Set aside until the ice starts to melt. Meanwhile, heat the oil in a heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Alternatively, heat a deep-fat fryer to 180C. When the ice has half melted, dip the pumpkin cakes into it.  Carefully lower the pumpkin fritters into the hot oil, in batches, and fry for 2-3 minutes, or until crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining pumpkin fritters.  To serve, mix together the chopped spring onions, chopped chilli and soy sauce until well combined.  Serve the pumpkin fritters with small bowls of the soy dipping sauce and sweet chilli sauce. ","ingredients":" 1 tsp vegetable oil, for greasing,  1kg\/2lb 4oz pumpkin, peeled, thinly sliced,  30g\/1¼oz plain flour, plus extra for dusting,  5cm\/2in piece fresh root ginger, peeled, grated,  200ml\/7fl oz light lager,  100g\/3½oz flour,  175g\/2¾oz ice cubes,  vegetable oil, for deep frying,  4 spring onions, trimmed, finely chopped,  1 red chilli, finely chopped,  2 tbsp soy sauce,  sweet chilli sauce","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/pumpkinfritters_92525"}