{"recipe_name":"Punjabi samosas","author":"Vivek Singh","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 24 samosas","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the green coriander chutney, put the herbs, garlic, and chillies in a blender and pulse until you have a soft, spoonable consistency. Transfer to an airtight container, cover with the oil and store in the fridge until required. (It will keep in the fridge for 2-3 days).  When ready to serve, mix with the salt, sugar and lemon juice. For the tamarind chutney, put all the ingredients and 200ml\/7fl oz water in a saucepan. Bring to the boil, then lower the heat to a simmer. Skim the surface intermittently to remove any scum that rises to the top. Cook until the sauce is thick and glossy. Then set aside to cool. For the yoghurt dressing, mix all the ingredients with 5 tablespoons water, to thin the yoghurt. Store in the fridge until ready to use. For the filling, heat the oil in a large saucepan over medium heat. Once hot, add onions and gently fry them until light golden-brown. Add the lamb mince and cook over a high heat for 2-3 minutes, stirring continuously. Stir in the ground cumin, turmeric, red chilli powder and salt and cook for a minute or so. Next add the sugar, raisins and cashew nuts and cook for a minute. Stir in the grated potato, peas, chillies, ginger. Cook over a medium heat for 3-4 minutes, stirring continuously until well mixed.  Sprinkle with chopped mint and lemon juice. Turn off the heat and set aside until the mixture is cool enough to handle. Divide into 24 equal portions and set aside to cool completely. For the pastry, mix the flour, spices and salt in a bowl. Using your fingertips, rub in the oil until the mixture resembles breadcrumbs. Add a tablespoon of cold water at a time, kneading between each addition, until you have a smooth dough (you will need approximately 4 tablespoons water). Apply a little oil to the surface of the dough ball and cover it with cling film. Set it aside for 10 minutes. Roll the dough into a long cylinder and cut the dough into 12 equal parts. Roll each portion between your palm and press into a circle. Using a rolling pin, roll it out gently to a circle about 7.5-10cm\/3-4in in diameter. (Do not use any flour for rolling. If dough sticks use some oil to grease the work surface.) Cut each circle of dough into two equal parts to make semi-circles. Brush a little water on the straight edge and make a cone shape by joining that edge with a slight overlap. Press the join together to seal. Fill each pastry cone approximately three-quarters full with the filling then brush a little water to the outer edge of the pastry and seal it to enclose the filling. Repeat the same process with the remaining samosas. Preheat a deep-fat fryer to 180C, or alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: do not leave unattended. Hot oil can be dangerous.) Once the oil is hot, cook the samosas in small batches until golden-brown. Don’t let the oil get too hot or the pastry shell won’t cook through and will be doughy inside. Drain the samosas on kitchen paper. To serve, place the samosas on a serving plate with the chutneys and dressing alongside. ","ingredients":" 200g\/7oz coriander leaves and stalks, washed thoroughly to remove any grit ,  40g\/1½oz mint leaves (optional),  6 garlic cloves, peeled,  4 Thai green chillies, stalks removed,  5 tbsp vegetable oil,  2 tsp salt,  1 tsp sugar,  1 lemon, juice only,  350ml\/12fl oz tamarind pulp,  1½ tsp red chilli powder,  ½ tsp salt,  100g\/3½oz jaggery or brown sugar,  50g\/1¾oz pitted dates, chopped (optional),  ½ tsp dried ginger powder,  250g\/9oz thin natural yoghurt,  1 tsp sugar,  ½ tsp salt,  2 tbsp vegetable oil,  ½ medium onion, finely chopped,  200g\/7oz lamb mince,  1 tsp ground cumin,  ½ tsp ground turmeric,  ½ tsp red chilli powder,  1 tsp salt ,  1 tsp sugar,  1 tbsp raisins,  2 tbsp cashew nuts, chopped,  1 medium potato, boiled until just tender and grated,  55g\/2oz peas or petit pois,  2 green chillies, finely chopped,  ½ inch piece of fresh root ginger, peeled and finely chopped,  2 tbsp chopped mint leaves ,  ½ lemon, juice only ,  vegetable oil, for deep frying,  130g\/4½oz plain flour,  ½ tsp ajwain seeds (also known as carom seeds),  ½ tsp nigella seeds,  salt, to taste,  2 tbsp vegetable oil, plus extra for greasing ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/punjabi_samosas_52840"}