{"recipe_name":"Purple forest cake","author":"Stu Henshall","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes 1 large 3-tiered cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sponge, preheat the oven to 180C\/170C Fan\/Gas 4. Grease three 18cm\/7in springform cake tins with butter. Line the base with baking parchment and dust the sides with flour.  Sift the flour, cocoa powder and bicarbonate of soda into a bowl and stir in the salt. In a separate large bowl, cream the sugar and butter together until pale and fluffy (this is best done using an electric mixer).  Add the egg yolks to the mixture and stir to combine. Mix in the beetroot and vanilla seeds. Add half the flour mixture and mix until combined. Add the hot water and the remaining flour mixture and beat until smooth. In a separate bowl, beat the egg white until stiff peaks form when the whisk is removed. Fold into the cake batter and divide the mixture between the prepared tins. Bake for 25-30 minutes (you may need to move the tins around the oven after 15 minutes to ensure they cook evenly). When the cakes are cooked, set them aside to cool in their tins for 10 minutes, before turning them out onto wire racks. For the cream, mix the mascarpone and icing sugar together until well combined. Add the cream and beat until thick. Keep in the fridge until needed. For the jam, set aside 200g\/7oz of the cherries for decoration. Pit the remaining cherries and place them in a large saucepan. Add the Kirsch and sugar and gently bring to the boil. Cook for 10 minutes, until the cherries are soft. Strain the jam keeping both the juice and fruit. For the truffles, put the chocolate in a bowl. Heat the cream until almost boiling then pour over the chocolate. Set aside, stirring occasionally, until the chocolate has melted and is combined with the cream. Set aside to cool completely (you may need to use a refrigerator if your kitchen is warm). When the mixture is set, roll teaspoonfuls into balls using your hands. Work quickly and keep your hands cool to prevent the truffles melting. Place on a tray and refrigerate. For the Italian meringue frosting, in a freestanding mixer whisk the egg whites and cream of tartar until stiff peaks form when the whisk is removed.  In a saucepan, heat the sugar and 6 tablespoons water over a medium heat. Use a pastry brush to brush any sugar crystals from the side of the pan. When the sugar is dissolved, increase the heat and bring to the boil. Boil for about 10 minutes until the syrup reaches 115C on a sugar thermometer, then slowly pour the syrup into the egg whites in a thin stream, beating all the time on a slow speed (take care to avoid the beaters as it might splash). Continue to beat for about 15 minutes, or until the frosting is cool.  To decorate the cake, put one of the cakes on a serving plate or cake board and brush with the syrup from the jam. Spread half the mascarpone cream over the top and add half of the jammy cherries.  Repeat with the next layer of cake and top with the third cake. Smooth the Italian meringue all over the cake. Use a chef’s blowtorch to brown the meringue. Arrange the reserved cherries on top and around the base. Dust the truffles with cocoa powder and arrange them around the base. ","ingredients":" 250g\/9oz plain flour, plus extra for dusting,  50g\/1¾oz cocoa powder, plus extra for dusting,  1 tsp bicarbonate of soda,  1 tsp fine flaked sea salt,  400g\/14oz caster sugar,  170g\/6oz salted butter, plus extra for greasing ,  2 large free-range eggs, separated ,  250g\/9oz cooked beetroot (natural, not in vinegar), grated,  1 vanilla pod, split in half lengthways and seeds scraped out,  300ml\/10floz hot water,  250g\/9oz mascarpone ,  50g\/1¾oz icing sugar,  150ml\/5½oz double cream,  600g\/1lb 5oz large fresh cherries ,  4 tbsp Kirsch (cherry liqueur) ,  100g\/3½oz caster sugar,  100g\/3½oz dark chocolate (minimum  70% cocoa solids),  75ml\/2½fl oz double cream,  3 egg whites ,  ½ tsp cream of tartar,  175g\/6oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/purple_forest_cake_90366"}