{"recipe_name":"Vegetarian Puy lentil lasagne","author":"Cheryl Ferguson","programme":"The Hairy Bikers' Cook Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/puy_lentil_lasagne_23244_16x9.jpg","method":"Preheat the oven to 180C\/350F\/gas 4. Generously grease a baking dish with butter. For the lentil ragù, cover the lentils with cold water and bring to the boil. Crumble in the vegetable stock cube and cook for 15-20 minutes, or until the lentils are tender, then drain. Add a little more water if the mixture looks dry.  Heat the garlic infused olive oil and butter in a lidded frying pan over a medium heat. Add the onion, garlic, mushrooms and leek and fry for about five minutes, or until softened. Stir in the cooked lentils and simmer gently for five minutes, then stir in the tomatoes. Cover with a lid and simmer on a low heat for 10-15 minutes. Season, to taste, with sea salt and freshly ground black pepper. Meanwhile, for the cheese sauce, melt the butter in a medium saucepan over a medium-high heat then mix in the flour and stir until bubbling. Gradually add the milk and cream, whisking constantly, until the mixture is smooth. Simmer gently, stirring constantly, until the sauce starts to thicken, then stir in the cheese and season with sea salt and freshly ground black pepper and remove from heat.   To assemble the lasagne, spread a quarter of the lentil ragù over the base of the greased baking dish, cover this with a quarter of the cheese sauce, then arrange a third of the lasagne sheets over the top. Repeat, finishing with a layer of cheese sauce. Sprinkle over the parmesan cheese and bake in the oven for 30-40 minutes, or until bubbling and golden-brown. Serve with a green salad. ","ingredients":" knob of butter, for greasing and frying,  200g\/7oz Puy lentils,  1 vegetable stock cube,  1 tbsp garlic infused olive oil, or olive oil, for frying,  1 onion, chopped,  1 garlic clove, chopped,  110g\/4oz mushrooms, finely diced,  110g\/4oz leek, finely sliced,  1 x 400g\/14oz can chopped tomatoes,  sea salt and freshly ground black pepper,  6-9 sheets lasagne,  handful grated Parmesan (or vegetarian alternative),  green salad, to serve,  110g\/4oz butter,  85g\/3½ oz plain flour,  850ml\/1½ pints milk,  6 tbsp double cream,  110g\/4oz grated cheddar ,  sea salt and freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/puy_lentil_lasagne_23244"}