{"recipe_name":"Quail salad with celery, grapes and shallot purée","author":"Daniel Clifford","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Prepare the quail by removing the wishbone and legs so you are left with two crowns and four legs. Place the legs into a bowl and sprinkle all over with the salt. Cover and chill in the fridge for 12 hours. When ready to cook, wipe the salt off the quail with kitchen roll. Preheat the oven 130C\/275F\/Gas 1. Melt the duck fat in a roasting tray and add one garlic clove and one sprig of thyme. Place the legs in the duck fat in the oven for two hours or until the meat is very tender. Remove from the oven and allow to cool slightly. Pick the meat off the confit legs and shred. (This will be served on the sourdough toast.) Place the chicken stock, bay leaf and remaining sprig of thyme and garlic clove into a large saucepan and bring to a simmer. Place the quail crowns into the simmering stock and poach for three minutes. Once poached, remove the quail from the pan. Season with salt.  Heat a frying pan over a medium-high heat and add a knob of butter. Gently fry the quail in the butter until golden-brown all over. Remove from the pan and set aside to rest. For the chicken liver parfait, place the port, madeira, shallots, garlic and thyme in a large saucepan and bring to the boil. Reduce the heat and simmer until the volume of the liquid is reduced to a thick syrup. Place the chicken livers, butter and eggs into a glass bowl set over a pan of gently simmering water without letting the bowl touch the water. Heat until the mixture is 62C when measured with a thermometer. Place the chicken liver mixture and the port and madeira reduction into a blender and blend until smooth. Pass the parfait through a fine sieve, season with salt and freshly ground black pepper and transfer into a piping bag with a plain nozzle. Keep in the fridge until needed. For the shallot and raisin purées, melt the butter in a heavy-based pan and add the shallots, thyme and bay leaf. Cook for four minutes, stirring constantly until softened.  Remove the thyme sprig and bay leaf and transfer the shallots to a blender. Blend until smooth. Put the raisins, white wine and 250ml\/9fl oz water into a pan. Bring to the boil, reduce the heat and simmer for five minutes.  Transfer the mixture to a blender, and blend until smooth.  Pass the raisin purée through a fine sieve into a bowl and set aside to chill in the fridge. For the white wine shallots, place the shallot rings into a small saucepan with the wine. Bring to the boil, reduce the heat and simmer until the wine has completely evaporated. Set aside. Cut four fingers from a slice of the sourdough and cut the rest into small dice. Heat a medium frying pan and add the butter. Once melted and hot add the fingers and diced croûtons. Fry until golden-brown. Heat a separate small frying pan and add the oil and cook the celery and grape slices to gently warm them. When you are ready to serve, carve the quail breast from the bone. To serve, for each person, place the finger of bread on one side of a shallow bowl and place the raisin purée on top then pipe the parfait on top of that. Place the picked leg meat on top and add some of the green and black grape slices in a line and garnish with micro herbs. Place a spoonful of shallot purée on the plate and top it with the diced croûtons. Place the quail breast on the plate next to the shallot purée and top with the remaining grapes and celery.  ","ingredients":" 2 extra-large quails ,  50g sea salt,  200g\/7oz duck fat ,  2 litres\/3½ pints chicken stock ,  1 bay leaf ,  2 garlic cloves, peeled ,  2 sprigs thyme ,  knob of butter,  ½ bottle port ,  ½ bottle madeira ,  3 shallots, finely chopped,  1 garlic clove ,  1 sprig thyme ,  500g\/1lb 2oz chicken livers ,  500g\/1lb 2oz butter ,  1 free-range egg, plus1 egg yolk ,  500g\/1lb 2oz banana shallots finely sliced ,  150g\/5½oz butter ,  sprig thyme,  1 bay leaf,  150g\/5½oz raisins ,  100ml\/3½fl oz white wine ,  100g\/3½oz banana shallots, cut into rings ,  100ml\/3½fl oz white wine ,  1 loaf sourdough bread,  50g\/1¾oz butter,  1 tbsp olive oil,  100g\/3½oz green grapes, finely sliced,  100g\/3½oz black grapes, finely sliced,  1 stalk celery, finely sliced,  1 tbsp micro herbs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/quail_salad_with_celery_46424"}