{"recipe_name":"Quiche Lorraine with a fennel and orange salad","author":"Matt Tebbutt","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. Sieve the flour into a large bowl, then mix in a pinch of salt. Rub in the butter until the mixture resembles breadcrumbs. Add enough cold water to bring everything together into a ball. Wrap in cling film and refrigerate for 30 minutes. Remove the pastry from the fridge and roll it out into a circle on a lightly floured surface to line a 22cm\/8½in loose-bottomed flan tin. Line the tin with the pastry, then line the pastry with greaseproof paper and fill with uncooked rice or baking beans. Bake for 20 minutes. Remove the rice or beans and brush the tart with egg yolk, then bake for another 5-10 minutes. Leave to cool, then trim the edges. Meanwhile, for the filling, heat a frying pan over a medium heat. Fry the pancetta until crispy, then drain on kitchen paper. Melt the butter in another frying pan, then gently fry the onion until soft. Put the eggs, yolks and cream in a large bowl, season with salt and pepper and whisk. Put half the pancetta, onions and Gruyère in the pastry case, then pour over the cream mixture. Top with the remaining pancetta, onions and cheese and bake for 30-40 minutes, or until set in the centre. For the salad, put the fennel and orange segments into a large bowl. Put the oil and orange juice in a small glass bowl, season with salt and pepper and whisk. Pour the dressing over the salad just before serving with the quiche.  ","ingredients":" 200g\/7oz plain flour,  100g\/3½oz unsalted butter, cold and diced,  1 free-range egg yolk,  pinch of salt,  175g\/6oz pancetta, diced,  50g\/1¾oz unsalted butter,  1 large onion, thinly sliced ,  4 free-range eggs,  2 free-range egg yolks,  350ml\/12fl oz double cream,  175g\/6oz Gruyère cheese, grated,  salt and freshly ground black pepper,  1 fennel bulb, thinly sliced and put in ice water,  1 orange, segmented (keep the juice for the dressing),  1 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/quiche_lorraine_with_a_57594"}