{"recipe_name":"Quiche Lorraine","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/quichelorraine_71987_16x9.jpg","method":"To make the pastry, sift the flour together with a pinch of salt in a large bowl. Rub in the butter until you have a soft breadcrumb texture. Add enough cold water to make the crumb mixture come together to form a firm dough, and then rest it in the fridge for 30 minutes. Roll out the pastry on a light floured surface and line a 22cm\/8½inch well-buttered flan dish. Don't cut off the edges of the pastry yet. Chill again. Preheat the oven to 190C\/375F\/Gas 5. Remove the pastry case from the fridge and line the base of the pastry with baking parchment and then fill it with baking beans. Place on a baking tray and bake blind for 20 minutes. Remove the beans and parchment and return to the oven for another five minutes to cook the base Reduce the temperature of the oven to 160C\/325F\/Gas 3. Sprinkle the cheese into the pastry base and add the sliced tomatoes if you are using them. Fry the bacon pieces until crisp and sprinkle over them over the top. Combine the eggs with the milk and cream in a bowl and season well. Pour over the bacon and cheese. Sprinkle the thyme over the top and trim the edges of the pastry.  Bake for 30-40 minutes or until set. Remove from the oven and allow to cool and set further.  Trim the pastry edges to get a perfect edge and then serve in wedges. ","ingredients":" 175g\/6oz plain flour, plus extra for dusting,  salt,  75g\/2¾oz butter, plus extra for greasing,  (alternatively use ready made pastry),  250g\/9oz English cheddar, grated ,  4 tomatoes, sliced (optional),  200g\/7oz bacon, chopped,  5 eggs, beaten,  100ml\/3½fl oz milk,  200ml\/7fl oz double cream,  salt,  freshly ground black pepper,  2 sprigs of fresh thyme","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/quichelorraine_71987"}