{"recipe_name":"Individual beef Wellington","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the pastry, place the flour and butter in a food processor and pulse until the mix resembles breadcrumbs. Add the egg and enough water to bind and pulse until just coming together as a dough. Turn out onto a floured work surface and knead gently to bring the pastry together. Wrap in cling film and place in the fridge until needed. For the filling, heat one tablespoon of the olive oil in a frying pan. Add the steak and fry for one minute on each side, then remove from the heat and set aside. Heat the remaining olive oil in the same pan and fry the garlic and mushrooms for 3-4 minutes. Take the pastry out of the fridge and roll out into a thin oblong shape. Place the slice of Parma ham onto one side of the pastry. Place the seared steak onto the centre of the ham, then spread over the mushrooms and garlic mixture. Finally add the slice of Gorgonzola. Bring the sides of the ham up together and wrap around the steak, cheese and mushrooms. Fold over the pastry and brush the edges with the beaten egg. Press down the edges to seal and trim the edges. Brush the top of the pastry with more beaten egg, then place onto a baking sheet and place into the oven to cook for 12-15 minutes, or until the pastry is golden-brown. For the red wine sauce, heat the butter in a small pan and add the shallot, garlic and thyme. Fry for 3-4 minutes, then add the red wine and bring to the boil. Cook for 4-5 minutes to reduce the liquid. To serve, place the beef Wellington onto a plate and cut open to show the filling. Spoon the red wine sauce around and serve. ","ingredients":" 200g\/7oz plain flour, plus extra for dusting,  100g\/3½oz butter,  1 free-range egg, beaten,  1-2 tbsp cold water, to bind,  3 tbsp olive oil,  150g\/5½oz fillet steak,  4 garlic cloves, crushed ,  85g\/3oz chestnut mushrooms,  25g\/1oz slice Gorgonzola cheese,  1 slice Parma ham,  1 free-range egg, beaten,  25g\/1oz butter,  1 banana shallot, finely chopped,  1 garlic clove, crushed,  1 tbsp fresh thyme, chopped,  175ml\/6fl oz red wine","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefwellington_88902"}