{"recipe_name":"Quick korma","author":"Nigel Slater","programme":"Nigel Slater's Simple Suppers","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/quick_korma_75721_16x9.jpg","method":"Peel and slice the onions and garlic. Melt most of the thick slice of butter in a deep-sided pan, reserving a little. Peel and grate the ginger and add to the pan with the onions and garlic.  Break open the cardamom pods, discard the green shells and lightly crush the black seeds within. A pestle and mortar is good for this but any heavy weight will do. Add the crushed seeds to the pan with the cumin, turmeric, ground cinnamon, cinnamon stick, chilli and the bay leaves.  Cut the mushrooms into large pieces and add to the pan together with the remaining butter (you will find the mushrooms tend to soak it up).  Let the mushrooms cook for a couple of minutes, then stir and cover with a lid.  When the mushrooms have softened and darkened a little, add 200ml\/7fl oz water. Stir, cover and simmer for 15 minutes.  Meanwhile, wash the spinach carefully. Cook briefly in a separate pan until the leaves have wilted but are still bright, about a minute or two. Remove the spinach and cool under running water to keep the colour bright then squeeze dry and add to the pan with the mushrooms.  Stir in the skinned hazelnuts and the raisins or sultanas. Gently stir in the yoghurt and crème fraîche. Warm through gently and serve, with rice or bread if you wish. ","ingredients":" 3 medium onions,  3 cloves of garlic,  a thick slice of butter,  a thumb-sized piece of ginger,  10 green cardamom pods,  a tsp ground cumin,  ½ tsp ground turmeric,  a couple of pinches of ground cinnamon ,  a cinnamon stick,  a good pinch of ground chilli ,  3 bay leaves,  650g\/1lb 7oz assorted mushrooms,  250g\/9oz spinach,  handful skinned hazelnuts,  a generous handful of raisins or golden sultanas,  200g\/7oz plain yoghurt,  150g\/5oz crème fraîche ,  rice or bread, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/quick_korma_75721"}