{"recipe_name":"An authentic ragù bolognese","author":"Delia Smith","programme":null,"prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Makes 8 x 225g\/8oz portions","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 140C\/275F\/Gas 1. First take a large frying pan, the largest you have, heat 3 tbsp of the oil and gently fry the onion and garlic over a medium heat for about 10 minutes, moving it around from time to time. While the onion is softening, chop the pancetta: the best way to do this after opening the pack is to roll the contents into a sausage shape, then using a sharp knife slice it lengthways into four, then slice the lengths across as finely as possible. After 10 minutes, add this to the pan to join the onions and garlic and continue cooking them all for another 5 minutes.  Now transfer this mixture to the casserole. Add another tbsp of oil to the pan, turn the heat up to its highest then add the minced beef and brown it, breaking it up and moving it round in the pan. When the beef is browned tip it into the casserole. Heat another tbsp of the oil and do exactly the same with the minced pork. While the pork is browning, trim the chicken livers, rinse them under cold running water, dry them thoroughly with kitchen paper and chop them minutely small. When the pork is browned, transfer it to the casserole, then heat the remaining tbsp of oil and brown the pieces of chicken liver. Add these to the casserole. Now you've finished with the frying pan, so get rid of that and place the casserole over the direct heat, give everything a good stir together, then add the contents of the tins of tomatoes, the tomato purée, red wine and a really good seasoning of salt, pepper and nutmeg. Allow this to come up to simmering point. Then strip the leaves from half the basil, chop them very finely and add them to the pot. As soon as everything is simmering, place the casserole on the centre shelf of the oven and leave it to cook slowly, without a lid, for 4 hours.  It's a good idea to have a look after 3 hours to make sure all is well, but what you should end up with is a thick, concentrated sauce with only a trace of liquid left in it, then remove it from the oven, taste to check the seasoning, strip the leaves off the remainng basil, chop them small and stir them in. Then when the sauce is absolutely cold, divide it, using scales, by spooning 225g\/8oz into polythene freezer bags. Seal them leaving a little bit of air at the top to allow room for expansion. Each 225g\/8oz pack, thoroughly defrosted and re-heated, will provide enough ragù for 225g\/8oz pasta, which will serve 2 people. ","ingredients":" 450g\/1lb lean minced beef,  450g\/1lb minced pork,  6 tbsp extra virgin olive oil,  1x225g\/8oz tub chicken livers,  2 medium onion, finely chopped,  4 fat garlic cloves, chopped,  2 x 70g packs (or 140g\/5oz) pancetta or streaky bacon, finely chopped,  2 x 400g\/14oz tins Italian chopped tomatoes,  2 x 200g\/7oz tubes double concentrate tomato purée,  1 x 37.5cl half bottle red wine (or 400ml\/14fl oz),  2 x 15g packs or 30g\/1oz fresh basil,  ½ whole nutmeg, grated,  salt and freshly milled black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/anauthenticragubolog_66229"}