{"recipe_name":"Quinoa burger, cassava chips and ocopa dip","author":"Martin Morales","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the amarillo paste heat the oil in a saucepan and fry the chilli, onion and garlic gently, without colouring them, until soft. Blend to a paste in a blender or a pestle and mortar. For the quinoa burger, heat the vegetable oil in a saucepan then add the garlic, onions and amarillo paste until very hot. Add the maca (you can use plain flour as a substitute), quinoas and cheeses. Remove from the heat. Mix and season with salt and cumin to taste. Shape the quinoa into burger patties 90g\/3¼oz each. Put the flour, beaten egg and breadcrumbs into three separate bowls. Coat each burger in flour, then beaten egg and finally coat in breadcrumbs. Place in the fridge for 45 minutes while you prepare the rest of the meal.  For the cassava chips, preheat a deep fat fryer to 120C\/250F. (Caution, hot oil can be dangerous. Do not leave unattended.) Boil the cassava chips in water for 25 minutes, or until soft. Drain, pat dry and leave to go cold. Deep fry the chips in batches for five minutes. Then increase the temperature to 180C\/350F and cook for them again for another three minutes until crisp.  For the yoghurt dressing, mix together the yoghurt, kiwi, papaya and chopped mint. For the salsa criolla, place the plum tomato and red onion in a bowl and season with lime juice, salt and pepper. Add the finely chopped coriander and mix. For the ocopa dip, heat a drop of the olive oil in a saucepan, add the onion, garlic and chilli and fry until golden-brown. Add the toasted peanuts and put it all in a blender.  Blend for 10 seconds then add the rest of ingredients and blend until smooth. To cook the quinoa burgers heat a deep fat fryer to 120C\/250F. (Caution, hot oil can be dangerous. Do not leave unattended.)  Fry the burgers for five minutes, or until golden-brown. To serve, put the burger in a poppy seed bun with lettuce leaves, yoghurt dressing and salsa criolla. Serve the cassava chips on a plate with the ocopa dip alongside in a bowl. ","ingredients":" 1 tbsp vegetable oil,  1 amarillo chilli, finely chopped,  1 onion, finely chopped,  1 garlic clove, crushed,  2 tbsp vegetable oil,  1 tsp mashed garlic,  80g\/3oz red onion, finely chopped,  80g\/3oz amarillo paste (from above),  20g\/¾oz maca powder (alternatively use plain flour),  120g\/4oz pre-cooked white quinoa,  120g\/4oz pre-cooked red quinoa,  120g\/4oz pre-cooked black quinoa,  60g\/2¼oz parmesan or feta cheese ,  30g\/1oz fresco cheese,  pinch salt,  pinch cumin powder,  100g\/3½oz plain flour,  2 free-range eggs, beaten,  80g\/3oz Japanese panko breadcrumbs,  vegetable oil, for frying,  1 cassava, peeled and cut into chip shapes,  vegetable oil for deep frying,  125ml\/4fl oz Greek yoghurt,  1 kiwi, peeled and diced,  1 papaya, peeled, seeds removed, diced ,  1 tbsp chopped fresh mint,  2 plum tomatoes, thinly sliced,  1 red onion, thinly sliced,  1 lime, juice only,  2 tbsp coriander, chopped,  250ml\/9fl oz olive oil,  ½ red onion, finely chopped,  20g\/¾oz garlic, peeled and mash,  1 aji panca chilli, dried,  15g\/½oz toasted peanuts,  2 tbsp uchucuta sauce (mix of basil, tarragon, coriander, mint, 1 tbsp white vinegar, 3 tbsp olive oil),  200ml\/7fl oz evaporated milk or single cream,  2 cream crackers,  25g\/1oz queso fresco cheese,  15g\/½oz pecans,  4 poppy seeds buns,  2 Little Gem lettuce, leaves separated","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/quinoa_burger_cassava_43753"}