{"recipe_name":"Quinoa goji tabbouleh ","author":"Hemsley + Hemsley","programme":null,"prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/quinoa_goji_tabbouleh_96233_16x9.jpg","method":"Put the quinoa in a bowl and cover with approximately 700ml\/1¼ pints cold water. Add a pinch of salt. Set aside to soak overnight (or for at least 8 hours). Drain and rinse the quinoa well. Put the quinoa in a saucepan, cover with water and bring to the boil. Reduce the heat and simmer for 10-12 minutes, or until tender. Remove from the heat and set aside to cool slightly for 5 minutes. Fluff with a fork to separate the grains.  Meanwhile, for the dressing, in a large bowl, whisk together all of the dressing ingredients until well combined.  Add the tomatoes to the dressing, then stir in the herbs, spring onions and quinoa. Season with salt and pepper.  Just before serving, heat a frying pan over a medium heat. Add the sesame seeds and dry-fry for 1-2 minutes, or until toasted and golden-brown, shaking the pan occasionally to prevent the seeds from burning. Remove from the pan and set aside. To serve, pile the tabbouleh on a platter, then sprinkle over the toasted sesame seeds and goji berries. ","ingredients":" 350g\/12oz quinoa,  400g\/14oz tomatoes, halved, deseeded, diced ,  300g\/10½oz fresh flatleaf parsley, leaves finely chopped,  60g\/2¼oz fresh mint leaves, finely chopped,  4 spring onions, trimmed, finely chopped,  salt and freshly ground black pepper ,  8 tbsp extra virgin olive oil,  4 tbsp lemon juice,  1 garlic clove, crushed,  1 tsp honey, preferably raw honey (available from health food stores),  sea salt and freshly ground black pepper,  3 tbsp black or white sesame seeds ,  handful goji berries","vegetarian":true,"calories":312.0,"protein":9.0,"carbs":31.0,"sugars":10.0,"total_fat":17.0,"saturated_fat":3.0,"fiber":4.0,"salt":0.2,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/quinoa_goji_tabbouleh_96233"}