{"recipe_name":"Rabbit and butter bean stew with courgette and sorrel","author":"Tom Kerridge","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/325F\/Gas 3. Heat a tablespoon of oil in a large ovenproof pan with a lid. Fry the chorizo until the oils come out. Add the onion, celery, carrot, garlic and chillies and fry gently for a few minutes. Add the sugar, wine and vinegar and cook until reduced in volume to a glaze.  Add the butter beans, bay leaves and stock. Meanwhile, dust the rabbit shoulders and legs in flour. Heat a tablespoon of oil in a clean pan and fry the shoulders and legs, turning, until golden-brown. Season with salt and pepper and add them to the pan containing the stock and beans. Bring it to the boil. Turn down the heat to a simmer and put the lid on. Bake for 30 minutes then remove the lid and cook for a further 30 minutes, checking the liquid doesn't dry out. Cook until the rabbit is cooked through. Remove the pan from the oven. Take out the rabbit pieces and keep to one side. Place the pan on the hob and bring to the boil. Reduce the liquid down in volume a little, then add the courgette and cook for 1-2 minutes.  Fry the rabbit loins in a clean pan with a little butter for 2-3 minutes on each side, or until cooked. Remove them from the heat, slice them and stir them and the sorrel into the beans. Place the legs and shoulders back on top.  To serve, grate on the lemon zest and manchego cheese. Sprinkle on some cracked black pepper and serve. ","ingredients":" 2 tbsp vegetable oil ,  250g\/9oz spicy chorizo, diced,  1 onion, diced,  1 celery stick, diced,  1 carrot, diced,  2 garlic cloves, grated,  2 red chillies, roughly chopped,  50g\/1¾oz caster sugar,  100ml\/3½fl oz red wine,  100ml\/3½fl oz red wine vinegar,  2 x 400g can butter beans, drained,  2 bay leaves,  300ml\/½ pint chicken stock,  2 wild rabbits, jointed,  plain white flour, for dusting,  salt and freshly ground black pepper,  1 large courgette, diced,  knob of butter, for frying,  2 large handfuls fresh sorrel, chopped,  1 unwaxed lemon, zest only,  100g\/3½oz manchego cheese,  2 tsp cracked black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rabbit_and_butter_bean_89059"}