{"recipe_name":"Chicken and butterbean pie","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat one tablespoon of oil in a frying pan over a medium heat. Fry the bacon lardons until crisp. Remove with a slotted spoon and set aside.  Season the flour with salt and black pepper and dust the chicken pieces in some of the seasoned flour, shaking off the excess. Fry the chicken pieces for about three minutes to brown. Remove from the pan and set aside.  Heat the rest of the oil in the same pan and fry the onions for 4-5 minutes. Using a wooden spoon, scrape the meat residue from the bottom of the pan and mix it in with the onions.  Add the bacon lardons and chicken back into the pan along with any leftover flour and cook for 4-5 minutes.  Add the wine and turn the heat up. Add the stock, thyme and seasoning and then reduce to a simmer for 40 minutes. Stir in the butter beans 10 minutes before the end of the cooking. Allow the mix to cool completely. Pick the meat from the bones and remove the bones from the mix. Spoon the mix into a 25x20cm \/10x8in baking dish. Dot the top of the stew with butter.     Preheat the oven to 200C\/400F\/Gas 6. For the crust, roll out the pastry large enough to cover the dish. Place on top and press around the dish. Trim the pastry and crimp the edges. Brush the top of the pie with the beaten egg. Cut a small hole in the top of the pie to allow steam to escape.    Place in the preheated oven for about 20-25 minutes until crisp and golden-brown. ","ingredients":" 2 tbsp vegetable oil ,  150g\/5½oz smoked bacon lardons,  1kg\/2lb 4oz mixed chicken leg and thigh pieces,  50g\/2oz flour,  salt and freshly ground black pepper,  1 onion, sliced,  100ml\/3½fl oz white wine,  200ml\/7fl oz chicken stock,  1 tbsp picked thyme leaves ,  salt and freshly ground black pepper ,  1 x 400g\/14oz tin butter beans, rinsed and drained ,  1 tbsp unsalted butter,  200g\/7oz ready-made shortcrust pastry,  1 free-range egg, beaten, for glazing","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rabbit_pie_63302"}