{"recipe_name":"Rabbit and walnut linguine","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Dredge the rabbit pieces in the flour to coat thoroughly. Shake off any excess. Season well with salt and freshly ground black pepper. Heat the oil in a frying pan over a medium heat. Add the rabbit pieces (in batches if necessary), and fry for 4-5 minutes, turning occasionally, until golden-brown all over. Remove the rabbit pieces from the pan (reserve the pan for later cooking) and place onto a baking sheet. Place into the oven to cook for six minutes, or until cooked through. Add the onions to the same pan you cooked the rabbit in and fry for 4-5 minutes, making sure you scrape up any brown bits from the bottom of the pan. Add the sherry, scraping the bottom to release all of the flavours. Bring to the boil, then reduce the heat to a simmer and reduce the volume by two thirds. Add the garlic, capers and stock and bring to the boil. Reduce the heat and simmer to reduce the liquid by a third. Return the rabbit pieces to the pan and add the walnuts, olive oil and lemon juice.  Season, to taste, with salt and freshly ground black pepper. To serve, arrange a large spoonful of the cooked linguine onto each of four plates and top with rabbit stew. Garnish with chopped parsley and serve. ","ingredients":" 1 rabbit, jointed into six portions (you can ask your butcher to do this),  100g\/3½oz plain flour,  salt and freshly ground black pepper,  2 tbsp vegetable oil,  1 red onion, sliced,  100ml\/3½fl oz dry sherry,  1 garlic clove, crushed,  1 tbsp capers,  100ml\/3½fl oz chicken stock,  1 tbsp walnuts,  100ml\/3½fl oz extra virgin olive oil,  1 lemon, juice only,  400g\/14oz linguine, cooked according to packet instructions,  handful chopped fresh parsley, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rabbitandwalnutlingu_89304"}