{"recipe_name":"Rack of lamb, gnocchi and Provençal vegetables","author":"Frederick Forster","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the gnocchi, pass the potato through a fine sieve and mix with all the other ingredients. Season with salt and pepper and then knead into a smooth ball using the extra flour. Roll into a long sausage shape and then cut into small pillow shapes. Heat some water until it is gently simmering. Add the gnocchi, and a bit of olive oil. Once the gnocchi have risen to the surface of the water, put them into some cold water to refresh. Drain on a cloth and set aside. For the pesto, blanch the basil in boiling water, pat dry, then blend with all of the other ingredients, except the lemon zest, for 30-45 seconds. Season with salt and pepper and add the lemon zest, if using.  For the lamb, preheat the oven to 170C\/150C Fan\/Gas 3½. Put the lamb in a large ovenproof pan with the oil and heat to render down the fat. Colour nicely all over and add the butter, thyme and garlic. Put in the oven for 6-8 minutes and then remove and leave to rest. Reheat in the oven for 3 minutes and then slice into chops. For the vegetables, score the aubergine with a knife and sprinkle with a little salt and leave for 3-4 minutes to remove the moisture.  Heat a pan, add the olive oil and fry the aubergines until soft, add the courgettes and let them colour a little. Add a drizzle of sherry vinegar. Finally add the tomatoes, wild garlic leaves and some pesto. Add a little water and season. All vegetables should have a slight bite to them and be well coated in the pesto. To serve, put the vegetables and gnocchi in the centre of a large serving plate and top with the lamb and  a little more pesto. ","ingredients":" 250g\/9oz baked potato, warm,  50g\/1¾oz plain flour, sieved, plus extra for rolling out,  10g\/¼oz finely grated Parmesan cheese,  ½ free-range egg yolk,  salt and freshly ground black pepper,  1 tbsp chopped chives,  1tbsp chopped flatleaf parsley,  olive oil,  ¼ bunch basil ,  150g\/5½oz baby spinach,  ¼ garlic clove, finely chopped,  15g\/½oz pine nuts, lightly toasted,  5 tbsp olive oil,  pinch grated lemon zest (optional),  4 x 3-bone rack of lamb (about 300g\/10½oz each),  1 tsp olive oil,  10g\/¼oz unsalted butter,  1 sprig thyme,  1 garlic clove,  2 baby aubergines, halved lengthways,  1 yellow courgette, chopped into medium sized discs,  250g\/9oz cherry tomatoes, skinned,  150g\/5½oz wild garlic leaves,  sherry vinegar, to taste,  3 tsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rack_of_lamb_gnocchi_and_95283"}