{"recipe_name":"Beef with roasted celeriac and orange sauce","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the roasted celeriac, place the celeriac cubes into a bowl, season generously with salt and freshly ground black pepper and sprinkle over the chilli powder. Stir well to coat the celeriac.  Pour the oil into an ovenproof dish and either place on the hob or into the oven until very hot. Add the cubed celeriac to the hot oil, then transfer to the oven and roast for 20 minutes, or until golden-brown and tender. For the beef, season the beef all over with salt and freshly ground black pepper and rub with the oil. Heat a frying pan or griddle and cook the steak for 2-3 minutes on each side, or until cooked to your liking. For the orange sauce, heat the butter in a pan and fry the shallots, mushrooms and garlic until soft.  Add the tomato purée and cook, stirring, for 3-4 minutes, then pour in the wine and simmer until reduced by a third.  Add the orange zest and juice, tarragon and stock and bring to the boil. Simmer until reduced by two thirds. Just before serving, stir in the orange liqueur. To serve, place the steak onto serving plates with the roasted celeriac and spoon over the sauce. ","ingredients":" 1 celeriac, peeled and cut into cubes,  salt and freshly ground black pepper,  1 tbsp chilli powder,  2 tbsp olive oil,  4 x 225g\/8oz rump steaks,  salt and freshly ground black pepper,  3 tbsp vegetable oil,  1 tbsp unsalted butter,  8 shallots, chopped,  100g\/3½oz fresh shiitake mushrooms, sliced,  1 garlic clove, sliced,  2 tbsp tomato purée,  50ml\/2fl oz white wine,  1 orange, zest and juice,  1 tbsp chopped fresh tarragon,  150ml\/5¼fl oz fresh beef stock,  splash orange liqueur","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefwithroastedceler_87491"}