{"recipe_name":"Raspberry genoise mousse cake","author":"Joanne Wheatley","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 10-12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Line three 23cm\/9in springform cake tins with greaseproof paper, brush with a little melted butter and dust with flour, shaking out any excess flour. Place the eggs and sugar in large bowl and set it over a bowl of barely simmering water, making sure the bottom of the bowl does not touch the water. Beat with an electric whisk until the mixture is thick and fluffy then remove the bowl from the pan and continue beating for three minutes. Stir in the melted butter then fold in the sifted flour using a large metal spoon. Divide the mixture between two cake tins and bake for 25 minutes. Let the sponges cool for five minutes then remove from the cake tins and sprinkle with the raspberry liqueur.  Meanwhile, make the mousse. Place one and a half punnets of the raspberries in a bowl with the raspberry liqueur and icing sugar. Stir gently until the sugar has dissolved then set aside. Pulse the remaining raspberries in a food processor, or mash with a fork, until they are pulpy but not completely smooth. Place the crushed raspberries in a small saucepan with the caster sugar, heat gently until the sugar has dissolved then remove the pan from the heat. Squeeze the water from the gelatine and add it to the pan, stirring until it has completely dissolved, then mix in the whole raspberries. Transfer the mixture to a bowl and set aside to cool. (You could place the bowl over iced water to speed up the cooling process.) When the raspberry mixture is cold and starting to set, whisk the cream until it forms soft peaks then gently fold it into the raspberries. Place one of the cooked sponges in the bottom of the third cake tin. Spoon over three-quarters of the mousse then place the second sponge on top and add the remaining mousse. Arrange the sliced strawberries and mint leaves over the top of the cake, leave in fridge until set then carefully remove the cake from the tin and serve. ","ingredients":" 100g\/3½oz butter, melted, plus extra melted butter for the cake tins,  8 free-range eggs ,  200g\/7oz caster sugar ,  280g\/10oz plain flour, sifted 3 times ,  2 tbsp raspberry liqueur,  2 x 125g\/4½oz punnets raspberries ,  3 tbsp raspberry liqueur ,  2 tbsp icing sugar ,  2 tbsp caster sugar,  2½ sheets leaf gelatine, soaked in cold water for 5 minutes,  150ml\/½ pint double cream ,  fresh strawberries, sliced, to decorate,  mint leaves, to decorate","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberry__strawberry_18175"}