{"recipe_name":"Beef wraps with mozzarella, chilli and herbs with mash and grilled onions","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the beef wraps, slice the sirloin steak in half lengthways and flatten each strip with a meat mallet or rolling pin. Divide the chopped mozzarella, chopped herbs, chilli, salt and freshly ground black pepper between the middle of each steak. Roll each piece up and secure with a cocktail stick. Drizzle with olive oil. Heat an ovenproof frying pan, add the beef wraps and fry on all sides until golden-brown. Place the pan in the oven and roast for five minutes. Remove from the oven and leave to rest for five minutes.   For the mash, place the chopped potato into a pan of boiling salted water and boil for five minutes, or until tender. Drain well, then return to the pan. Add the butter, salt and freshly ground black pepper, cream and chives. Mash with a potato masher until smooth. For the grilled onions, heat the olive oil in a wok, add the onion wedges and fry for 3-4 minutes. To serve, pile the sliced mozzarella and tomato onto a serving plate. Top with the chive mash and place the beef wraps on top. Garnish with the grilled onions. ","ingredients":" 200g\/7oz sirloin steak,  100g\/3½oz buffalo mozzarella, chopped,  small handful fresh parsley and rosemary, chopped,  ½ red chilli, finely chopped,  salt and freshly ground black pepper,  drizzle olive oil,  ½ large potato, chopped,  30g\/1oz butter,  salt and freshly ground black pepper,  2 tbsp double cream,  1 tbsp chopped fresh chives ,  1 tbsp olive oil,  ¼ onion, cut into wedges,  100g\/3½oz buffalo mozzarella, sliced,  1 beef tomato, sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beefwrapswithmozzare_87992"}