{"recipe_name":"Raspberry and ricotta and mincemeat ravioli","author":"Chris Evans","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pasta, mix the flour and caster sugar together on a clean work surface or in a large bowl. Make a well in the centre and break in the eggs. With a fork or with your hands, gradually mix the flour with the eggs to form a soft dough.  Knead the dough for five minutes, or until smooth. Shape the dough into a ball, wrap in cling film and leave to chill in the fridge for at least 30 minutes.  Divide the pasta into four equal pieces. Flour the pasta machine. Starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. Repeat this process 3-4 more times, flouring the machine and changing the setting down each time. It helps to cut the pasta into smaller squares as this will mean the pasta is less likely to dry out (any pasta you are not working on should be covered with cling film).  Cut the pasta sheets into 5cm\/2in squares. Meanwhile, for the filling, beat the ricotta and icing sugar together in a mixing bowl. Carefully stir in the raspberries.  Place a spoonful of the ricotta mixture in the centre of one-quarter of the squares. Top with a second square of pasta and press down gently, squeezing the edges together.  Repeat step 7 with the mincemeat and remaining pasta squares. Fill a large, heavy-based saucepan with vegetable oil to depth of 4cm\/1½in. Heat the oil to 180C\/350F. (CAUTION: Hot oil can be very dangerous. Do not leave unattended.) Deep-fry the ravioli for 1-2 minutes, or until golden-brown. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Dust with icing sugar. For the chocolate sauce, bring the sugar and 110ml\/4fl oz water in a saucepan to a simmer. Cook for 1-2 minutes, or until all the sugar has dissolved then add the chocolate. Whisk the mixture until smooth, then remove from the heat. To serve, arrange the ravioli on serving plates with some raspberries, a scoop of ice cream and a drizzle of chocolate sauce. Finish with a sprig of mint. ","ingredients":" 200g\/7oz 00 flour,  1 tbsp caster sugar,  2 free-range eggs,  250g\/9oz ricotta,  3 tbsp icing sugar, sieved, plus extra for dusting,  200g\/7oz raspberries ,  200g\/7oz good-quality vegetarian mincemeat,  vegetable oil, for frying ,  icing sugar, for dusting,  75g\/3oz caster sugar,  200g\/7oz dark chocolate, roughly chopped,  200g\/7oz raspberries,  500ml\/18fl oz vanilla ice cream,  bunch fresh mint","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberry_and_ricotta_35530"}