{"recipe_name":"Raspberry chocolate cake","author":"Robert Smart","programme":"The Great British Bake Off","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 10-12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 150C\/170C (fan)\/Gas 3. Grease and line the bottom and sides of 2 x 23cm\/9in cake tins, with butter and baking parchment. Ensure the lining paper on the sides comes to 3cm\/1½in above the rim of the tin. For the cake, place the chopped chocolate into a large heatproof bowl. Melt the chocolate by suspending the bowl over a pan of simmering water (do not let the bottom of the bowl touch the water). When melted, remove from the heat and add the butter. Stir until the butter is melted and completely incorporated. Set aside to cool slightly. Meanwhile whisk the sugar and eggs in a large mixing bowl until foamy and well combined. Sift the self-raising flour over the eggs and fold to combine, then fold in the ground almonds. When the chocolate mixture is slightly cooled, fold into the cake batter until well combined. Divide the mixture equally between the prepared cake tins. Bake for 25-30 minutes, or until springy to the touch. Cool the cakes in the tins for five minutes, before turning out onto wire racks to cool completely. For the chocolate glaze, chop the chocolate into small pieces and place in a heatproof bowl. Heat the cream in a small saucepan until just before the boiling point. Pour the cream over the chocolate and stir until completely melted. Add the butter and stir until completely melted and incorporated. For the syrup, place 100ml\/3½fl oz of water, the caster sugar and glucose syrup into a small saucepan and heat gently, stirring to dissolve the sugar. Remove from the heat and allow cool slightly. Before the syrup is completely cold, add the liqueur. For the filling, warm the raspberry conserve in a small saucepan, stirring constantly. When it becomes runny, pass it through a sieve into a heatproof bowl. Set aside. For the chocolate decorations, ensure all your equipment is out and prepared before you start. Inflate a small balloon to a 15cm\/6in diameter and rub it all over with a balm-infused tissue. This will act as a mould to create a chocolate bowl, so adjust the size as you like. Have a completely flat baking tray to hand (you can use your worktop if it is completely flat and not wooden) for spreading the chocolate to make curls. Place 150g\/5½oz of the chopped dark chocolate into a heatproof bowl and set this above a pan of gently simmering water (ensure the bottom of the bowl does not touch the water). Melt, stirring occasionally, until the temperature is 46-48C\/115-118F. You can check this using a confectionary thermometer.  Remove from the heat and add another 150g\/5½oz chopped dark chocolate, stirring occasionally until melted.  Dip the round end of the balloon into the melted, tempered chocolate to create a bowl shape. Set aside to cool on a piece of baking parchment, with the bottom of the chocolate bowl down, until set. Gently deflate the balloon to remove, teasing the rubber from the inside as necessary. Spread some more tempered chocolate on the flat work surface or upturned flat baking tray. Allow to cool until the chocolate no longer leaves a mark on your finger when gently pressed.  Using a plastic scraper, push through the chocolate, scraping up a tight curl. Repeat until the chocolate is used up, then set aside to set completely. To make the chocolate chards, cut some acetate sheets to the height of the cake plus a bit. Cut it with a wavy edge.  Chill one large or two small heavy-based baking trays. Place a quarter of the remaining chopped dark chocolate into a heatproof bowl and set this above a pan of gently simmering water (ensure the bottom of the bowl does not touch the water). Melt, stirring occasionally, until the temperature is 46-48C\/115-118F.  Remove from the heat and add another 150g\/5½oz chopped dark chocolate, stirring occasionally until melted.  Place the acetate sheet onto a cold marble slab. Pour the dark chocolate onto the acetate sheet and spread it with a palate knife so that the chocolate overlaps the edges. When doing so, make sure to introduce some weak lines across the chocolate so that it will break where required – do this with a knife to get a natural cutting point. Transfer the acetate to the chilled heavy, baking trays and allow to cool completely. Refrigerate it if the workspace is too warm. When cooled, break along the lines.  Melt the white chocolate separately in the same way and make white chocolate shards in the same way. To assemble the cake, drizzle both cakes with a little of the syrup. Place one cake layer onto the serving board. Spread with raspberry preserve, then a layer of whipped cream and half of the fresh raspberries. Top with the second cake layer. Pour the glaze over the cake. Smooth the sides of the cake with a palate knife and allow to set.  Whip the remaining cream until stiff and spread around the sides of the cake. Stick the shards to the whipped cream to form an alternating white and dark chocolate vertical stripe pattern. The shards should overlap slightly so that the cream doesn't show when assembly is complete. Place the chocolate bowl on top of the cake and fill it with fresh raspberries and with a few chocolate curls sticking out.  ","ingredients":" 500g\/1lb 2oz dark chocolate, (around 60% cocoa solids), chopped,  500g\/1lb 2oz unsalted butter, softened,  100g\/3½oz  golden caster sugar ,  10 medium free-range eggs,  250g\/9oz self-raising flour,  150g\/5½oz ground almonds,  1 tsp vanilla extract,  150g\/5½oz dark chocolate (at least 70% cocoa solids), chopped,  150g\/5½oz double cream ,  50g\/1¾oz unsalted butter,  80g\/3oz caster sugar,  50g\/1¾oz glucose syrup,  60g\/2¼oz black raspberry liqueur, such as Chambord,  250g\/9oz raspberry conserve,  600ml\/20fl oz double cream, whipped until firm peaks form when the whisk is removed,  500g\/1lb 2oz fresh raspberries,  600g\/1lb 5oz dark chocolate (around 40% cocoa solids), chopped finely,  600g\/1lb 5oz white chocolate (around 40% cocoa solids), chopped finely","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberry_chocolate_cake_25972"}