{"recipe_name":"Raspberry millefeuille","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the puff pastry, place the flour and salt in a large mixing bowl. Add 200ml\/7fl oz of cold water. Mix to combine and then tip out onto a floured work surface. Briefly knead to form a rough, but evenly combined, dough. Wrap in cling film and place the pastry in the fridge to rest for 1-2 hours. On a lightly floured work surface, roll the pastry out into a rectangle approximately 50x30cm\/20x12in. Slice the butter and lay this over two-thirds of the dough. Fold the unbuttered dough third over the buttered one, then flip that over the remaining buttered third so that the butter is wrapped inside the dough. Take a rolling pin and lightly roll the upper surface of the dough to press out any air bubbles. Seal the edges with a sharp whack of the rolling pin. Give the pastry what is known as one single turn – fold the bottom third of the pastry up, then the top third down. Roll the pastry out towards the folded edges until it measures roughly 60x25cm\/23x10in, then fold the pastry in by thirds again.  Give the pastry a further two turns, without resting in between. Place the pastry on a plate, cover with cling film and transfer to the fridge to chill for 30 minutes. Roll the pastry out to 8mm\/1\/3in thick and cut into two 28x10cm\/11x4in rectangles. Place the pastry rectangles on a baking tray and dust with icing sugar.  Bake the pastry in the oven for 15 minutes, or until golden-brown and well risen. Remove from the oven and set aside to cool.  For the crème pâtissière, put the milk and vanilla pods and seeds in a pan and warm over a low heat.  In a mixing bowl, whisk together the egg yolks and cornflour. Stir in a little of the warm milk, then pour the mixture back into the pan. Cook, stirring, over a gentle heat until thickened. Remove from the heat and leave to cool. Remove the vanilla pods. Whisk the double cream in a large bowl until soft peaks form when the whisk is removed. Add the remaining vanilla seeds and caster sugar and whisk until stiff peaks form when the whisk is removed. Mix with the crème pâtissière and place in a piping bag. For the raspberry sauce, place the raspberries and lemon juice into a food processor and blend to a smooth purée. Taste the mixture and add icing sugar, to taste. Pass the mixture through a fine sieve into a bowl. To serve, split both pieces of pastry in half widthways to make four pieces of pastry. Place one piece in the centre of a serving plate and pipe over a third of the cream mixture, smoothing out the top. Arrange a quarter of the fresh raspberries on top, then place another sheet of pastry on top. Repeat the layering process by topping the second sheet of pastry with half of the remaining crème pat and some more raspberries. For the final layer, top the last piece of pastry with the remaining raspberries and dust with icing sugar. Serve with the raspberry sauce. ","ingredients":" 550g\/1lb 4oz plain flour, plus extra for dusting ,  ¾ tsp salt,  550g\/1lb 4oz unsalted butter, soft enough to be pliable,  icing sugar, for dusting  ,  570ml\/1 pint milk ,  2 vanilla pods, split lengthways ,  3 free-range egg yolks ,  2 tbsp cornflour,  300ml\/10fl oz double cream,  ½ vanilla pod, seeds scraped out,  2 tbsp caster sugar,  500g\/1lb 2oz raspberries,  400g\/14oz raspberries,  1 tsp lemon juice,  1-2 tbsp icing sugar, to taste","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberry_millefeuille_16777"}