{"recipe_name":"Raspberry plate, posset, raspberry and vanilla condé with rhubarb and lime syrup","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tuile biscuits, preheat the oven to 180C\/350F\/Gas 4. Mix all of the tuile biscuits ingredients to form a smooth paste Spread the paste onto a piece of baking parchment in small flat oval shapes – leave a space between each one.  Bake in the oven for five minutes, or until golden-brown. Carefully remove each wafer from the baking tray while still warm and press against a rolling pin to shape. Don't force them if they're getting too crisp, simply return them to the oven for a few seconds and try again. For the lemon and raspberry posset, put the cream and sugar in a pan and bring to the boil, then reduce to a simmer.  Add the lemon juice and raspberries and boil for a further 3-4 minutes. Squeeze any excess water from the gelatine and stir it into the mixture.  Pour the mixture into four dishes and refrigerate until set. For the shortcake biscuits, combine the butter, flour and salt in a large bowl and rub together using your hands until the mixture resembles breadcrumbs. Add the sugar. Beat the whole egg with the egg yolk in a small bowl, mix it in and stir to form a dough. Roll into a ball, wrap with cling film and leave to rest in the fridge for 30 minutes. Remove the pastry from the fridge and roll out on a floured work surface. Using a round pastry cutter, cut into small biscuits. Place the biscuits on a baking tray lined with greaseproof paper and bake for 10 minutes, or until golden-brown. For the raspberry and vanilla condé, put the milk and butter in a heavy-based saucepan on a medium heat and add the rice, sugar and scraped vanilla pod. Once the rice is tender, remove the vanilla pod and stir in the double cream. Squeeze the gelatine leaf to remove any excess water and add the soaked gelatine leaf and raspberries to the rice. Divide the mixture between four individual ramekins and leave to cool and set.  For the rhubarb and lime syrup, dissolve the sugar with 50ml\/2fl oz water in a pan over a medium heat. Add the lime juice and rhubarb. When rhubarb is softened, strain the syrup. Serve each component on a plate and drizzle with syrup. ","ingredients":" 2 free-range egg whites,  85g\/3oz plain flour,  100g\/3½oz caster sugar,  500ml\/18fl oz double cream,  125g\/4½oz sugar,  3 lemons, juice only,  80g\/3oz raspberries,  ¼ leaf gelatine, soaked in water,  150g\/5½oz unsalted butter, diced,  250g\/9oz plain flour,  small pinch salt,  80g\/3oz caster sugar,  1 egg, plus 1 egg yolk,  50ml\/2fl oz milk,  25g\/1oz unsalted butter,  50g\/1¾oz short-grain rice,  30g\/1oz caster sugar,  1 vanilla pod, seeds removed,  75ml\/2½fl oz double cream,  ½ leaf gelatine, soaked in a bowl of water,  100g\/3½oz raspberries,  100g\/3½oz sugar,  1 lime, juice only,  100g\/3½oz rhubarb, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberry_plate_posset_06209"}