{"recipe_name":"Raspberry rose Danishes, praline spirals and Alsatian plaited Danish pastries","author":"Mary-Anne Boermans","programme":"The Great British Bake Off","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Makes 12 pastries","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the dough, place the flour, water, yeast, cream, salt and sugar in a bowl and mix until well combined. Tip the dough out onto a floured work surface and knead for 10 minutes, or until smooth. Return the dough to the bowl, cover with clingfilm and chill in the fridge for 30 minutes. Place the butter between two large pieces of cling film and beat with a rolling pin into a 20cm\/8in square.  Remove the dough from the fridge, place it on a lightly floured work surface and roll it into a 23cm x 46cm\/9in x 18in rectangle with the short side closest to you. Place the square of butter on the bottom half of the rectangle and fold the top half over, pressing the edges together to enclose the butter. Gently roll the dough to a 23cm x 46cm\/9in x 18in rectangle, fold it into thirds then turn it 90 degrees and repeat the rolling and folding once more. Wrap in cling film and return to the fridge for at least 30 minutes. Repeat the rolling, folding and turning twice more then wrap the dough in cling film, return to the fridge and chill overnight. Cut the dough into thirds and use one third for each of the fillings. For the raspberry rose Danishes, beat together the cream cheese, sugar, egg yolk and one tablespoon of the rosewater. Roll out the dough and cut into four 13cm\/5in squares. Turn each pastry square 45 degrees to form a diamond and fold the bottom half up to make a triangle. Cut two slits in the dough, parallel to the diagonal edges, about two thirds of the way to the centre of the triangle.  Unfold the dough square, place a tablespoon of filling in the centre and press four fresh raspberries into the mixture. Fold in the inner triangles of dough then tuck the bottom point through the gap in the top and fold the top point over the middle of the pastry. Place the pastries on a greased baking tray, cover them with cling film and set them aside to prove for one hour. Preheat the oven to 200C\/425F\/Gas 7. Whisk the egg and cream together in a bowl and brush it over the pastries. Bake for 18-20 minutes, or until puffed and golden-brown. Remove from the oven and set aside to cool slightly. Spoon a little raspberry jam over the centre of the pastries. Mix together the food colouring, the remaining rosewater and enough icing sugar to make a thin, smooth mixture and brush this over the pastries. Sprinkle the dried raspberry powder over the pastries and set aside until the glaze has set. For the praline spirals, preheat the oven to 200C\/400F\/Gas 6. Mix the seeds of the vanilla pod with the milk in a medium saucepan,bring to the boil, whisking from time to time, then remove the pan from the heat. Whisk 55g\/2oz of the sugar and the egg yolks in a bowl for 3-4 minutes, or until a thick ribbon falls from the whisk. Gradually whisk in the cornflour, making sure it is thoroughly combined, then whisk in the hot milk in a steady stream.  Pour the mixture back into the saucepan and gently bring to the boil, whisking all the time. Boil for one minute then pour the mixture into a clean bowl, cover the surface with cling film to prevent a skin forming and set aside to cool for 10 minutes. Chill in the fridge. Meanwhile, roast the almonds on a baking tray in the oven for five minutes or until golden-brown. Mix in the chopped hazelnuts and spread onto a silicon mat. Place the remaining sugar and glucose in a small pan and heat until golden-brown. Pour the mixture over the nuts and set aside to cool. When cooled, break up the praline and pulse in a food processor to make a fine powder. Roll the dough out  on a lightly floured work surface into a long rectangle about 3mm\/⅛in thick. Spread with the custard mixture and sprinkle with powdered praline, reserving a little to decorate. Roll up the dough from the short end, wrap in baking parchment and chill in the freezer for 15 minutes. Cut the dough roll into four 2cm\/¾in slices and place them on a greased baking tray. Set aside to prove for one hour. Increase the oven to 220C\/425F\/Gas 7. Whisk the egg in a bowl and brush it onto the pastries. Sprinkle over the remaining praline and bake in the oven for 8-10 minutes, or until pale golden-brown. Remove from the oven and set aside to cool slightly. Mix the lemon juice with enough icing sugar to form a thin, smooth mixture and drizzle it over the cooked pastries. For the Alsatian plaited Danish pastries, heat the vegetable oil in a frying pan over a low heat and cook the onions in the vegetable oil for 5-10 minutes, or until softened but not browned. Add the bacon and cook for a further 3-4 minutes. Remove the bacon and onion from the pan and set aside to drain on kitchen paper. Roll out the dough on a floured work surface and cut into four 13cm\/5in squares. Make diagonal cuts about 1cm\/½in apart along two parallel edges of the squares.  Spread one tablespoon of crème fraîche down the centre of each dough square. Sprinkle over the onion and bacon and lay thin slices of goats' cheese on top. Plait the sides of the dough loosely over the filling and set aside to prove for 30 minutes to 1 hour. Preheat the oven to 220C\/425F\/Gas 7. Whisk the egg and cream together in a bowl and brush it over the pastries. Bake for 18-20 minutes, or until puffed and golden-brown. Remove from the oven and set aside to cool slightly. ","ingredients":" 450g\/1lb white bread flour,  250ml\/9fl oz warm water,  1 x 7g\/¼oz sachet fast-action dried yeast,  5 tbsp extra thick double cream,  1 tsp salt,  1 tsp sugar,  400g\/14oz cold unsalted butter,  225g\/8oz cream cheese,  55g\/2oz sugar,  1 free-range egg, plus 1 free-range egg yolk,  2 tbsp rosewater,  250g\/9oz fresh raspberries,  1 tbsp double cream,  raspberry jam,  few drops red food colouring,  icing sugar,  1 tbsp dried raspberry powder,  1 vanilla pod, split lengthways,  250ml\/9fl oz milk,  250g\/9oz caster sugar,  1 free-range egg, plus 3 free-range eggs yolks,  4 tsp cornflour, mixed to a paste with a little cold water,  100g\/3½oz flaked almonds,  100g\/3½oz roasted hazelnuts, chopped,  50ml\/1¾fl oz liquid glucose,  1 free-range egg,  icing sugar,  1 lemon, juice only,  3 tbsp vegetable oil,  2 medium red onions, thinly sliced,  100g\/3½oz smoked back bacon, chopped ,  100ml\/3½fl oz low fat crème fraîche,  200g\/7oz goats’ cheese, thinly sliced,  1 free-range egg,  1 tbsp double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberry_rose_danishes_36300"}