{"recipe_name":"Raspberry Swiss roll","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6 - 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sponge, preheat the oven to 190C\/375F\/Gas 5 and line a 23x33cm\/9x13in Swiss roll tin with baking parchment. Place the eggs, sugar and vanilla seeds into a bowl and whisk until very light, fluffy and thickened. Sift the flour over the mixture and fold in carefully. Pour the mixture into the lined tin and smooth it out with a spatula until evenly spread. Bake the sponge for 10-12 minutes, or until just firm to the touch. Place a sheet of baking parchment that is slightly bigger than the tray onto the work surface and dust with some caster sugar. Turn the sponge out onto the parchment paper, then peel off the parchment on the bottom of the sponge. Set aside to cool slightly. Whip the double cream to soft peaks with the vanilla extract. For the raspberry jam, heat a frying pan until hot, then add the sugar, lemon zest and juice and cook for 3-4 minutes until the sugar has dissolved and thickened slightly. Add the raspberries to the pan, mix well and cook the jam for a further 3-5 minutes until thick. Remove the pan from the heat and set aside to cool.  To assemble the roll, spread the raspberry jam over the cooled sponge, leaving a 2cm\/1in gap around the edge. Spread the whipped cream over the top then sprinkle over the whole raspberries. Take the longest edge, then using the parchment paper underneath, roll up the sponge quite tightly, making sure the filling stays inside. Roll the sponge off the parchment, dust with extra caster sugar and cut into slices to serve. ","ingredients":" 4 free-range eggs,  115g\/4oz caster sugar, plus extra to dust,  1 vanilla pod, seeds only,  75g\/3oz self-raising flour,  200ml\/7fl oz double cream,  1 tsp vanilla extract,  200g\/7oz raspberries,  150g\/5½oz caster sugar,  ½ lemon, zest and juice,  350g\/12oz raspberries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberry_swiss_roll_08757"}