{"recipe_name":"Raspberry topped sponge cakes","author":"Galton Blackiston","programme":"Country Show Cook Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes 12 mini cakes or 1 large cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. In a bowl, cream together the butter and sugar until pale.   Beat in the eggs one at a time, then fold in the orange zest and juice. Add the vanilla paste and flour. Mix well and spoon or pipe the mixture into mini sandwich tins. Bake in the oven for 15-20 minutes. When golden-brown and cooked through, set aside to cool on a wire cooling rack. For the praline, in a heavy-based saucepan set over a low heat, add the sugar and a tablespoon of water and heat until the sugar has dissolved. Once dissolved, increase the temperature and bring to a gentle boil until it reaches 160-175C\/320-350F (use a sugar thermometer for this). Take off the heat and plunge the base of the pan into a basin of cool water to prevent the caramel burning.  For the decoration, set aside 8-12 hazelnuts (depending on how many mini cakes you are making – you need one per cake). Stick each nut onto a cocktail stick and dip them into the caramel to coat. Set aside on a baking tray to cool. Add the remaining hazelnuts to the caramel and pour an even layer onto a sheet of non-stick parchment or silicone sheet.  Set aside to cool completely then break into chunks. Transfer to a blender and pulse to form a coarse powder. Meanwhile make the ganache. Melt the chocolate and butter together in a microwave or a heatproof bowl set over a pan of simmering water (Without letting the base of the bowl touch the water). When the chocolate has melted and the butter is fully incorporated, add the cream.  Mix well and at this point you can refrigerate it until needed. For the sponges, when the mini cakes are cool, cut them in half horizontally and fill with a little whipped cream. Then coat all over with the chocolate ganache, reserving some for the topping (if the ganache is too thick, warm it a little to loosen). Coat the mini cakes in the crushed praline and then pipe the remaining ganache on top in a neat mound.  Decorate the tops of the cakes with raspberries and the caramel-coated hazelnuts. ","ingredients":" 250g\/9oz soft unsalted butter,  250g\/9oz caster sugar,  4 free-range eggs,  1 orange, zest and juice ,  1 drop vanilla paste,  250g\/9oz self-raising flour, sifted,  ½ pint double cream, whipped,  250g\/9oz caster sugar,  150g\/5½oz whole roasted hazelnuts ,  250g\/9oz good-quality chocolate (minimum 70% cocoa solids),  125g\/4½oz butter,  250ml\/9fl oz double cream, whipped until stiff,  ½ punnet raspberries","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberry_topped_sponge_70133"}