{"recipe_name":"Raspberry mousse with hazelnut biscotti","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the biscotti, mix together the flour, sugar, vanilla seeds and hazelnuts in a bowl.   In another bowl, beat the eggs and butter together until pale and fluffy, then add to the flour mixture, mixing to form a dough. Shape the dough into a ball.  Flour a work surface with the flour and icing sugar mixture. Turn the dough out onto the work surface, halve it and roll each half into a 24cm\/10in long rectangle 1cm\/½in thick.  Place the rectangles of dough onto a baking sheet and bake for 20 minutes, or until lightly golden. Remove from the oven and leave to cool for 10-15 minutes, then cut 12 biscuits out from each sheet with a biscuit cutter. Return the biscuits to the oven to bake for 15 more minutes, or until golden-brown and crisp.  Remove from the oven and leave to cool for 20-30 minutes, then dust with icing sugar.  Meanwhile, for the raspberry mousse, soak the gelatine leaves in a bowl of cold water for 15 minutes, or until softened.  Place half of the raspberries in a bowl and stir in the icing sugar and raspberry liqueur. Set aside and leave to macerate.   Place the remaining raspberries in a pan with the caster sugar and gently heat for 2-3 minutes, or until the sugar has dissolved. Squeeze out the excess water from the gelatine leaves and add to the pan, stirring until the gelatine has dissolved.  Leave to cool slightly then, using a hand blender, blend the mixture to a smooth purée. Leave to cool for 10-15 minutes.  When cooled, fold in the lemon zest and cream.  To serve, spoon the raspberries in liqueur into the bottom of four serving glasses, followed by the raspberry mousse. Spoon over another layer of raspberries, then top with a final layer of mousse. Decorate with the biscotti. ","ingredients":" 225g\/8oz self-raising flour,  100g\/3½oz caster sugar,  1 vanilla pod, split, seeds scraped out ,  100g\/3½oz hazelnuts, shells removed, chopped ,  2 free-range eggs,  50g\/2oz butter, melted,  25g\/1oz flour mixed with 25g\/1oz icing sugar, for dusting,  icing sugar, for dusting,  3 gelatine leaves ,  500g\/1lb 2oz raspberries,  50g\/2oz icing sugar,  50ml\/2fl oz raspberry liqueur,  2 tbsp caster sugar,  ½ lemon, zest only,  175ml\/6fl oz double cream, whipped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberrymousse_89893"}