{"recipe_name":"Raspberry shortbread stack","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"no cooking required","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the raspberries and the icing sugar into a food processor and blend to a smooth purée. Pass the raspberry sauce through a sieve into a bowl and check the sweetness. Add more icing sugar to sweeten the sauce to your taste. Place the double cream into a bowl and whisk until soft peaks form when the whisk is removed. Add the crème fraîche and the seeds from the vanilla pod and gently fold together to combine. Place the caster sugar into a saucepan and heat until it has melted and formed a golden-brown caramel. Remove from the heat and allow to cool slightly. Dip a spoon into the caramel and rapidly drizzle the caramel across a clean knife steel or the long handle of a wooden or metal spoon. The caramel will cool quickly and form thin strands. Pinch the caramel strands together and set aside. To serve, place a spoonful of the raspberry sauce onto each of four plates. Place a shortbread thin into the centre of the pools of sauce. Top each shortbread with a spoonful of the vanilla cream mixture. Top each vanilla cream layer with another shortbread thin, then add another spoonful of vanilla cream and finish each with a final shortbread thin. Dust with icing sugar. Holding one end with oven gloves, place the other end of a metal skewer into a gas flame and heat until glowing. Place the skewer across the icing sugar-dusted top of each stack twice to mark a cross. The sugar will caramelise with the heat of the skewer. Top each stack with spun sugar strands and serve. ","ingredients":" 350g\/12oz raspberries,  2 tbsp icing sugar, plus extra to taste,  200ml\/7fl oz double cream,  200ml\/7fl oz crème fraîche,  1 vanilla pod, split, seeds scraped out,  12 ready-made shortbread thin rounds,  200g\/7oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberryshortbreads_88437"}