{"recipe_name":"Raspberry sponge with black olive and honey purée, fresh raspberries and goats' milk ice cream","author":"Sat Bains","programme":"Great British Menu","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the ice cream, heat the milk in a large pan and add the well-washed hay, if using. Remove from the heat and leave to cool at room temperature for one hour.  Whisk the egg yolks and liquid glucose in a bowl until the mixture leaves a ribbon trail when you lift the beaters. Strain in the infused milk, whisking it into the egg yolks, then pour into a saucepan. Heat slowly, stirring all the time and without allowing it to boil, to 86C\/187F (check with a digital thermometer). The custard will be smooth and thickly coat the back of a wooden spoon. Strain into a bowl and chill in the fridge, covered with cling film. When cold, churn in an ice cream machine to the soft-scoop stage. Transfer to a freezer container and freeze overnight. To make the raspberry vinegar purée, soak the agar-agar in the raspberry vinegar in a small pan for one minute. Place over a high heat and boil for 1-2 minutes, stirring. Strain through a fine sieve into a bowl and set aside. Cool until set for about 20 minutes, then purée until smooth in a small blender and set aside.  Meanwhile, to make the raspberry oil, blend the olive oil and raspberries in a blender to extract the maximum flavour, then strain through a sieve and set aside. (The raspberry oil can be made a week ahead.) Preheat the oven to 190C\/285F\/Gas 5.  To make the sponge, whisk the eggs and sugar with an electric mixer until the mixture leaves a ribbon trail when you lift the beaters. With the machine running, pour in the milk, then add the sifted flour, baking powder and ground almonds. Slowly pour in the raspberry oil. The mixture will be like a soft batter. Pour the mixture into a 20cm\/8in square cake tin that is 4cm\/1½in deep (it's only necessary to line the tin if it isn't non-stick). Bake for 35-40 minutes or until firm to the touch. Cool for a few minutes in the tin, then turn out onto a wire rack to cool completely. While the cake is still warm, drizzle all over with about two tablespoons of raspberry vinegar (or spray using an atomiser spray).  While the cake cools, make the black olive purée. Blend the olives and honey in a small blender. Set aside.  To serve, cut the sponge into eight squares. Spread some of the olive purée onto serving plates by dipping a damp pastry brush into the purée, then dragging it once across the plates. Sit a cake square on top of each. Using a piping bag, pipe some of the raspberry vinegar purée into half of the fresh raspberries (you may have some purée left over), then equally dot all the raspberries around each plate. Tear up the sprigs of mint and scatter them over. Add scoops of the ice cream on the side. ","ingredients":" 500ml\/18fl oz goats' milk,  100g\/4oz clean, fresh hay, well washed (optional),  5 free-range egg yolks ,  40g\/1¾oz liquid glucose, warmed (available from specialist baking suppliers and online),  2 tsp agar-agar,  100ml\/3½fl oz raspberry vinegar,  150ml\/¼ pint light olive oil,  50g\/2oz freeze-dried raspberries (available in health food shops),  3 organic free-range eggs ,  160g\/5¾oz golden caster sugar,  125ml\/4fl oz semi-skimmed milk,  160g\/5¾oz plain flour, sifted,  20g\/¾oz baking powder,  60g\/2½oz ground almonds,  2 tbsp raspberry vinegar,  50g\/2oz black olives, pitted weight,  3 tbsp clear honey, warmed,  100-150g\/4-5oz fresh raspberries,  3-4 sprigs mint","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raspberryspongewithb_85945"}