{"recipe_name":"Lobster ravioli with a rich lobster cream","author":"John Burton Race","programme":"Put Your Money Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 4 large ravioli","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pasta, place all of the pasta ingredients into a food processor. Pulse until the mixture resembles fine breadcrumbs. Tip onto a floured work surface and knead for about five minutes, or until the mixture comes together to form a smooth dough. Roll into a ball, wrap in cling film and chill in the fridge for 15 minutes. Unwrap the dough ball and cut in half. Feed the each piece of dough through a pasta machine, starting at the lowest (thickest) setting, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. Repeat this process 3-4 more times, flouring the machine and changing the setting down each time. The pasta should be quite thin, but still easy to handle without tearing. Don't be tempted to skip settings or the dough may tear. Once the pasta sheet has reached the ideal thickness, trim the edges slightly. Lay out on a floured tray and set aside. Repeat with the other piece of dough. You should have two equal-sized rectangles. For the lobster filling, place all of the lobster claw meat plus the meat from one of the tails into a food processor. Blend to a paste, then scrape into a bowl, cover and chill the mixture in the fridge for ten minutes.  Place the lobster mixture back into the processor. While blending the mixture, slowly pour in the double cream in a continuous stream, followed by the stock, and blend until smooth.  Scrape out the mixture into a clean bowl. Mix in the remaining lobster filling ingredients (reserving the remaining lobster tail, left whole) until smooth and well combined, then spoon the mixture into a piping bag and chill in the fridge until needed.  To make the ravioli, pipe four small mounds of the lobster filling onto one of the pasta sheets at equal distances apart and not too close to the edge of the pasta sheet. Cut the reserved lobster tail into four equal pieces and place each piece on top of the filling. Pipe the remaining filling over the lobster tail meat.  Using a pastry brush, moisten the edges around each individual pile of lobster filling with water, leaving a 3cm\/1in gap. Lay the second sheet of pasta over the first. Cut through both pasta sheets between the piles of lobster mousse to form four ravioli. Carefully press down the moistened edges around the filling, ensuring there is no air trapped between the pasta, and pinch the edges to seal. Bring a large pan of water to the boil. Add the ravioli and cook for 3-5 minutes, or until the ravioli is al dente. Remove with a slotted spoon and set aside.  For the lobster cream, heat the butter and oil together in a large pan until foaming, then add the reserved lobster shells. Cook over a high heat for about 2-3 minutes, or until golden, then add the vegetables and garlic and fry for a further 4-5 minutes. Stir in the tomato purée and fry for another 4-5 minutes.  Deglaze the pan with brandy, scraping up any browned bits from the bottom with a wooden spoon. Cook for 3-4 minutes, or until most of the liquid has evaporated. Add the chicken stock, stirring well, and simmer for 10-12 minutes, or until the liquid has reduced by half.  Strain the mixture through a fine sieve into a clean pan, discarding the shells and vegetables. Bring the sauce to the boil, then stir in the cream until well combined. Warm through for 1-2 minutes over a medium heat.  To serve, pour a ladleful of the rich cream into each of four serving bowls, then top each bowl with a raviolo. ","ingredients":" 250g\/9oz '00' pasta flour, plus extra for dusting,  1 free-range egg yolk,  3 free-range eggs,  2 tbsp water,  2 tbsp olive oil,  400g\/14oz blanched lobster flesh, made up of 4 claws and 2 tails,  100ml\/3½fl oz double cream,  100ml\/3½fl oz concentrated lobster consommé or fish stock,  1 tsp finely chopped fresh tarragon,  1 free-range egg,  1 free-range egg yolk,  pinch cayenne pepper,  squeeze lemon juice,  knob butter,  2 tbsp olive oil,  lobster shells (from lobster claws and tails above),  1 onion, peeled, chopped,  1 carrot, chopped,  2 cloves garlic, peeled and left whole,  1 tbsp tomato purée,  75ml\/2½fl oz brandy,  500ml\/18fl oz chicken stock,  150ml\/5½fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/raviolioflocallobste_91305"}