{"recipe_name":"Red fruit tarts and Chocolate cherry tarts","author":"Janet Basu","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Makes 24","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, place the flour and salt in a large mixing bowl and rub in the butter until the mixture resembles breadcrumbs. Stir in the sugar then make a well in the centre and add the egg yolks.  Mix in the eggs yolks with your fingers to make a soft dough, adding a little cold water if necessary. Divide the dough into two equal portions and gently knead the orange zest into one of them. Wrap the two doughs separately in cling film and chill for about 30 minutes. Meanwhile, make the filling for the red fruit tarts. Place the mascarpone, lemon juice, icing sugar and cream in a bowl and beat until thick and smooth. Place the bowl in the fridge for the filling to thicken. To make the filling for the chocolate cherry tarts, set aside 12 cherries for the garnish and stone the remainder. Place these in a small pan with the sugar and kirsch, simmer gently until the fruit is tender then set aside to cool. Preheat the oven to 190C\/375F\/Gas 5. Roll each portion of pastry out on a floured board and cut 12 circles from each to line two greased 12-hole tart tins. Prick the bases with a fork and bake in the oven until pale and golden.   To finish the chocolate cherry filling, melt the chocolate in a bowl set over a pan of barely simmering water. Dip the bases of the reserved whole cherries into the chocolate and place on a sheet of greaseproof paper to set. Heat the cream in a small pan until almost boiling then pour onto the remaining melted chocolate and beat until smooth and glossy. To assemble the chocolate cherry tarts, place a spoon of the cooked cherries in the bottom of each of the plain pastry tart cases. Top with the chocolate ganache and garnish with the whole cherries dipped in chocolate. To assemble the red fruit tarts, pipe the mascarpone into the base of the orange pastry tart cases. Arrange the strawberries, raspberries and redcurrants on top and dust with icing sugar. ","ingredients":" 175g\/6oz plain flour, sifted,  pinch salt,  85g\/3oz chilled butter, diced,  85g\/3oz caster sugar,  3 free-range eggs, yolks only,  1 orange, zest only,  225g\/8oz mascarpone,  2 lemons, juice only,  2 tbsp icing sugar, sifted,  225ml\/8fl oz double cream,  12 strawberries, sliced,  175g\/6oz fresh raspberries,  175g\/6oz fresh redcurrants,  icing sugar, for dusting,  350g\/12oz fresh cherries,  3 tbsp sugar,  1 tbsp kirsch,  250g\/9oz good quality dark chocolate,  225g\/8fl oz whipping cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/red_fruit_tarts_and_29983"}