{"recipe_name":"Red king crab with polenta and wild garlic","author":"Pascal Proyart","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 140C\/275F\/Gas 1. Line a baking tray with parchment. For the candied tomatoes, place the tomatoes onto the lined tray and scatter over the garlic, thyme, wild garlic, sugar and olive oil. Bake for two hours – checking occasionally that they have not dried out too much. Remove from the oven and set aside – they can be stored in jar topped up with olive oil for two weeks in the fridge. For the bisque, heat a frying pan until hot, add the olive oil and the crab shell and sauté for a few minutes until golden, then add a knob of butter and the onion, carrot, celery, garlic stems, tarragon and pinch of cayenne and sauté for two minutes. Add the brandy and flambé (CAUTION: Keep hair and face well away from the flames. Do not leave unattended.).  Add the tomato paste and seeds and cook for two minutes. Add the wine and cook until the volume of the liquid is reduced by three-quarters and just coating the bottom of the pan. Add the water and bring to a gentle simmer for 25 minutes. Add the double cream and cook for another 10 minutes. Strain into a clean saucepan then place back on the heat, stirring in the crème fraîche. Return to a simmer and cook until thick enough to coat the back of a spoon. Finish with a squeeze of lemon and season to taste. Set aside. Meanwhile for the galette, line a shallow tray with cling film. Gently fry the butter, olive oil, shallots and wild garlic in a saucepan over a medium heat for one minute until the shallots are just softened. Add the milk and water and bring to a simmer then add the polenta and whisk constantly for 1½-2 minutes, until thickened. Pour onto the lined tray and allow to cool. Then place in the fridge for 10 minutes or until set.  When set, remove from the cling film and cut the polenta into 3cm x 10cm\/1¼in x 4in fingers. Heat a frying pan until medium hot, add the olive oil and fry the polenta fingers on each side until golden brown and slightly crisp. Set aside to drain on kitchen paper. For the garnish and the crab, brush the wild garlic leaves with a little olive oil on each side. Cover a microwaveable plate with heatproof cling film then lay the wild garlic leaves on top and cover with more cling film. Place in the microwave and cook on high for two minutes. Remove and allow to cool for one minute, then peel off the cling film and remove the leaf – it will be crisp. Place some parchment paper onto a microwaveable plate and pile the parmesan into four lines across the plate.Place in the microwave and cook on high for 30 seconds until the cheese has melted and turned slightly crispy – return to the microwave and cook for another 10 seconds if it’s not melted. Allow the parmesan crisp to cool for one minute then peel off of the paper. Toss the rocket in a bowl with the pine nuts, a little lemon juice and olive oil. Season the crab with salt and black pepper. Heat a frying pan until hot, add the butter and olive oil and the crab, presentation side down, and fry for 1½ minutes on each side. Baste with the butter and a squeeze of lemon juice. To serve, divide the polenta equally among four plates, placing in the centre. Place two pieces of tomato below the polenta. Cut four of the crab loins into three pieces each and place above the polenta. Cut the remaining four loins lengthways nearly through and place on top of the polenta.Spoon the rocket along the length of the crab then place the parmesan crisp on top. Carefully lay a crisp wild garlic leaf on top of the crab and garnish with a few wild garlic flowers. Spoon the bisque around the plates and serve. ","ingredients":" 4 plum tomatoes, skins removed, halved, seeds scooped out and reserved,  1 garlic clove, finely sliced,  2 sprigs thyme leaves, leaves picked,  1 tbsp wild garlic leaves, finely chopped,  1 pinch caster sugar,  1 tbsp olive oil,  1 tbsp olive oil ,  150g\/5oz king crab shells, chopped,  25g\/1oz butter ,  30g\/1¼oz onions, finely chopped,  30g\/1¼oz carrots, finely chopped,  30g\/1¼oz celery, finely chopped,  2 tbsp wild garlic stems, roughly chopped,  sprig tarragon ,  pinch cayenne pepper ,  50ml\/2fl oz brandy or cognac,  50g\/2oz tomato paste,  50g\/2oz tomato seeds (reserved from the candied tomatoes),  110ml\/4fl oz white wine,  600ml\/1pt 1floz water or crab cooking water,  60ml\/2½fl oz double cream,  2 tbsp crème fraîche,  squeeze lemon juice,  25g\/1oz butter,  2 tbsp olive oil ,  25g\/1oz shallot, finely chopped,  1 small handful wild garlic, finely sliced,  50g\/2oz instant polenta,  125ml\/4½fl oz milk,  110ml\/4fl oz water,  4 wild garlic leaves and flowers,  40g\/1½ oz parmesan, grated,  2 small handfuls rocket leaves, very finely sliced ,  2 tbsp pine nuts, toasted,  1 lemon, juice only,  2 tbsp olive oil,  8 x 60g\/2½ oz king crab loin, cleaned,  2 tbsp olive oil,  25g\/1oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/red_king_crab_with_37681"}