{"recipe_name":"Red mullet with ceps and goats’ cheese","author":"Glynn Purnell","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Place the pumpkin on a baking tray and cook for 30-40 minutes, or until tender. Melt a knob of butter in a pan and cook the ceps in the butter for a couple of minutes. Heat a small frying pan and add a little oil, once hot add the pumpkin seeds and cook for a few minutes. Bring a large pan of salted water to the boil and blanch two cabbage leaves for a minute. Remove the leaves from the pan and refresh in a bowl of ice-cold water. Drain once cool. Cut away the bottom of the stem from the leaves, ensuring the leaves remain whole. Spread the yeast extract over one side of the cabbage leaves. Place the ceps on top to one side of the leaves. Sprinkle the ceps with goats’ cheese and pumpkin seeds.  Fold the leaf over to wrap up the filling and brush the outer side with butter. Heat a frying pan and add a knob of butter. Once hot, add the parcel and cook for three minutes until golden-brown and crisp. Heat an ovenproof frying pan and rub the mullet fillets with oil, fry the fish skin-side down for two minutes and then bake in the oven for 4-6 minutes. To serve, place a stuffed cabbage on each plate. Dice the roast pumpkin and dress with balsamic vinegar and oil and add to the plate. Season the fish with salt and pepper and place alongside. ","ingredients":" ½ small pumpkin, skin on, cut into chunks,  50g\/1¾oz butter,  3 large ceps, sliced ,  3 large savoy cabbage leaves ,  2 tbsp yeast extract, such as Marmite,  100g\/3½oz goats’ cheese,  60g\/2¼oz toasted pumpkin seeds,  vegetable oil, for deep frying,  salt and black pepper ,  1 medium red mullet, filleted and pin boned,  splash of rapeseed oil,  1 tbsp balsamic vinegar,  1 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/red_mullet_with_ceps_and_93065"}