{"recipe_name":"Red mullet with hazelnut crust, leek and potato ‘risotto’, and red wine jus","author":"Jun Tanaka","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"no cooking required","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place 60g\/2½oz hazelnuts in a food processor and blend until finely ground.  Mix with the dried breadcrumbs until well combined and pour onto a baking tray.  Brush egg white onto the skin of the fish, then dip into the hazelnut mixture until covered. Season with salt and freshly ground black pepper. Heat one tablespoon olive oil in a non-stick frying pan and add the fish, skin-side down. Cook for 3-4 minutes, then add the butter. Turn the fish over and cook for a further 2-3 minutes. Meanwhile, for the 'risotto', bring a large pan of salted water to the boil and add the shredded green part of the leek. Cook for 3-4 minutes, or until soft. Plunge the leeks into iced water, drain and blend in a food processor until smooth. Heat a frying pan until hot. Add the butter and shallots and fry for 1 minute. Add the remaining leek and potatoes, and cook for 1 minute. Add the hot chicken stock and simmer for 5-6minutes, or until the potatoes are tender.  Stir in the leek purée, mascarpone and parmesan. Season to taste with salt and freshly ground black pepper. For the red wine jus, pour the wine and port into a saucepan. Add the rosemary and heat until the mixture has reduced by half.  Pour in the fish stock and heat until the mixture has reduced by three-quarters.  Stir in the butter. Season to taste with salt and freshly ground black pepper. And a squeeze of lemon juice. To serve, spoon the 'risotto' into the centre of a plate. Place two fish fillets on top, drizzle around the red wine jus, and finish with a scattering of the reserved hazelnuts. ","ingredients":" 75g\/3oz hazelnuts, toasted ,  25g\/1oz dried breadcrumbs,  4 x 250g\/9oz red mullet, filleted, tail left on,  2 free-range egg whites,  50g\/2oz butter,  1 leek, finely chopped, white and green parts separated,  25g\/1oz unsalted butter,  1 banana shallot, finely chopped,  2 Agata potatoes, cut into 0.25\/¼in cubes,  250ml\/9fl oz chicken stock,  25g\/1oz mascarpone,  25g\/1oz grated fresh parmesan,  200ml\/7fl oz red wine,  50ml\/2fl oz ruby port,  1 sprig fresh rosemary,  250ml\/9fl oz fish stock,  25g\/1oz unsalted butter,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/red_mullet_with_hazelnut_93738"}