{"recipe_name":"Red mullet with Thai purée, fennel, dill and lime salad with tomato ketchup sauce","author":"Michael Caines","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Thai purée, heat the butter in a pan and gently fry the lemongrass, garlic and ginger without colouring them.  Add the curry powder, saffron and lime and cook for a minute.  Now add the onion and fry for a further five minutes.  Add 50ml\/2fl oz water and the fish stock and cook slowly for two hours. Strain through a colander. Then blend the vegetables for 5-10 minutes until smooth. Pass the purée through a fine sieve and hang in a muslin cloth suspended over a pan and leave overnight.  Keep the cooking juices that drip into the pan. You can use these to thin the purée when it is reheated if necessary. To make the lime oil, heat the oil with the chopped citrus peel to 80C\/176F, then blend in a blender for five minutes. Pass through a damp piece of muslin cloth and leave to cool. Set aside in a plastic container or plastic bottle. To make the basil oil, heat the basil leaves and the olive oil in a saucepan. Heat to 80C\/176F and then pour into a blender. Blend for three minutes. Pass through a sieve lined with muslin cloth and leave to drain. Reserve the oil. For the ketchup sauce, in a small saucepan melt the butter and heat until nutty brown in colour (beurre noisette). Pass the browned butter through a sieve into a clean pan and add the chopped fennel seeds, shallot and tomato ketchup. Cook gently for 20 minutes, stirring from time to time, until thick and then set aside in a warm place. The sauce will look split (the oil will separate out) which is fine. To make the lime vinaigrette, whisk all ingredients together in a small bowl. For the fennel salad slice the fennel thinly using a mandoline and place into iced water for an hour. Strain the fennel and put it in a bowl, add the chopped dill and mix well.  Now season the lime vinaigrette with salt and pepper. Mix well.   For the fried red mullet, heat the oil in a non-stick pan. Season the fillets on the flesh side with salt and pepper and place into the hot pan skin-side down.   Press down using a fish slice and leave to fry for three minutes, then turn it over and fry on the other side for two minutes. Transfer the fillets onto a baking tray lined with kitchen roll and season with a squeeze of lime juice. To serve, place some Thai purée onto the serving plates and then swipe it down the middle of the plate. Spoon on the tomato sauce, taking both the sauce and oil. Place the fennel salad on top and place the fillet in the middle of the salad.  Garnish the plate with the micro basil leaves and drizzle some basil oil around the edge. Finish with a sprinkling of toasted fennel seeds. ","ingredients":" 60g\/2¼oz butter,  7g\/¼oz lemongrass, finely chopped ,  4g garlic, crushed,  4g ginger, peeled and chopped,  2g madras curry powder ,  7g\/¼oz saffron,  1 lime, juice only,  1 white onion finely chopped,  150ml\/5fl oz fish stock,  30g\/1oz lime peel, chopped ,  150g\/5½oz olive oil,  30g\/1oz basil leaves ,  300ml\/10½fl oz extra virgin olive oil,  60g\/2¼oz unsalted butter,  3g fennel seeds, toasted then chopped,  3g finely chopped shallot,  50g\/1¾oz tomato ketchup,  150ml\/5fl oz lime oil ,  50ml\/2fl oz lime juice,  pinch salt ,  pinch ground white pepper ,  1 sprig fresh lemon thyme,  2 fennel bulbs, thinly sliced,  iced water,  1 tsp chopped dill,  salt and freshly ground black pepper,  2 tbsp olive oil,  4 x red mullet fillets, 80-90g\/3oz each, pin boned,  salt and freshly ground black pepper,  1 lime, juice only,  micro basil leaves ,  1 tsp finely chopped fennel seeds, toasted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/red_mullet_with_thai_05964"}