{"recipe_name":"Red snapper a la talla with pineapple pico de gallo","author":"Fernando Stovell","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To grill the fish, preheat an outdoor grill with citrus wood and highly grease the rack. Position the rack about 20cm\/8in over a charcoal fire. To bake the fish, preheat the oven to 180C\/160C Fan\/Gas 4. For the fish, combine the mayonnaise, lime juice, salt and pepper in a bowl. Rub the mixture into the fish and leave to marinate at room temperature for 20 minutes. To prepare the sauce, soak the chillies in hot water to cover for 10 minutes. Drain, put in a blender and purée with the tomatoes, garlic, vinegar, cloves, onion, oregano, thyme, marjoram, cumin and 250ml\/9fl oz water. Blend until smooth. Heat the butter and oil in a small pan and add the purée. When it comes to a boil lower the heat and cook gently for 20 minutes, or until the sauce thickens. Add salt and pepper to taste. Take it off the heat and set aside to cool to room temperature. To cook the fish on the grill, place the opened fish, skin side down, on the rack for 15-20 minutes, basting regularly with the sauce. Turn the fish over, baste with the melted butter and grill for 10-15 minutes, or until cooked. To bake the fish, put it on a baking tray and cook for 25-30 minutes, basting regularly with the sauce, then melted butter. For the salsa, heat a griddle pan and place the sliced pineapple and cook on each side for 1-2 minutes or until bar marks have appeared. Once cooled enough to handle cut into small dice. Mix with the rest of the salsa ingredients in a bowl. When the fish is done, place the fish on a serving plate or bowl. Put the salsa into a serving bowl and serve with some wedges of lime. ","ingredients":" 5 tbsp mayonnaise ,  2 tbsp lime juice,  1 tbsp sea salt flakes,  ¼ tsp freshly ground black pepper,  1 x 2.5kg red snapper, scaled, gills removed and gutted, sliced open into a butterfly cut,  125g\/4½oz unsalted butter, melted,  10 guajillo chillies (seeds and membranes removed),  5 ancho chillies (seeds and membranes removed),  4 tomatoes, peeled and seeds removed,  2 garlic clove, grated,  2 tbsp vinegar ,  4 cloves,  40g\/1½oz diced onion,  ½ tsp Mexican oregano,  ½ tsp chopped fresh thyme,  ½ tbsp fresh marjoram,  ½ tsp cumin,  30g\/1oz unsalted butter ,  2 tbsp sunflower oil,  salt and freshly ground black pepper,  half a pineapple, peeled and thickly sliced,  1 bird's-eye chilli, very finely chopped,  2 limes, juice only,  1 onion, finely chopped,  2 tbsp finely chopped fresh coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/red_snapper_a_la_talla_14871"}