{"recipe_name":"Red snapper en papillote with lemongrass, coriander and a mitzuna salad","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the red snapper, place four large pieces of aluminium foil on the work surface. Place an equal amount of lemongrass, spring onions, chilli, lime leaves and coriander on each piece of foil, then place the snapper fillets on top. Pour over the lime juice and fish sauce. Season with salt and pepper and drizzle with olive oil. Fold the aluminium foil over to encase the ingredients and seal (like a Cornish pasty). Make sure that the foil is sealed well and that there is room for steam to circulate in the package. Heat a large ovenproof frying pan (alternatively, preheat a roasting tray in the oven) and put the parcels in the pan. Place the pan in the oven for 6 minutes. For the mitzuna salad, place the mitzuna and rocket leaves in a bowl and add the strips of coconut. Place the remaining salad ingredients into a pestle and mortar and pound to a paste. Add the paste to the bowl of leaves and toss to coat. To serve, place the salad on serving plates with the snapper fillets. Garnish with chopped coriander. ","ingredients":" 2 sticks lemongrass, peeled and bruised,  4 spring onions,  1 red chilli, seeds removed, julienned,  4 lime leaves,  2 tbsp chopped fresh coriander,  4 150g\/5½oz fillets red snapper,  1 lime, juice only,  1 tbsp fish sauce,  salt and freshly ground black pepper,  2 tbsp olive oil,  50g\/1¾oz mitzuna leaves,  50g\/1¾oz rocket leaves,  ½ fresh coconut, flesh only, cut into strips,  4 tbsp palm sugar,  4 garlic cloves,  2 tbsp grated fresh root ginger,  3 red chillies, finely chopped,  1 bunch fresh coriander,  3 limes, juice only,  2 tbsp fish sauce,  2 tbsp chopped fresh coriander ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/red_snapper_en_papillote_50155"}