{"recipe_name":"Red velvet cake","author":"Mari Williams","programme":null,"prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes a 3-layer cake","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/red_velvet_cake_70743_16x9.jpg","method":"Pre heat the oven to 170C\/325F\/gas 3. Grease and line a deep, round 15cm\/6in tin. Beat the butter, sugar and vanilla together in a bowl until pale and fluffy. Add the eggs one at a time, beating after each addition (if the mixture looks curdled add a spoonful of the flour.)  Mix the yogurt with the food colouring - it should look very, very red since the mixture will fade once cooked.  Beat the yogurt into the cake mixture. Fold in the remaining flour and cocoa powder, followed by the milk until well combined.   Spoon the mixture into the cake tin and bake for 1 hour 20 minutes or until well risen and golden-brown and a skewer inserted into the middle comes out clean.   Remove the cake from the tin and leave to cool for five minutes, then place onto a cooling rack and set aside to cool completely. For the icing, mix the butter and cream cheese together in a bowl.  Then beat in the icing sugar a little at a time.  Once all the icing sugar has been added, add the lemon juice and beat the icing for five minutes or until paler in colour.  Slice the cake into three equal layers and sandwich them together with the icing. Finish with a layer of icing on top. ","ingredients":" 150g\/5½oz unsalted butter, softened ,  150g\/5½oz golden caster sugar ,  1 tsp vanilla extract,  3 free-range eggs , lightly beaten ,  4 tbsp Greek-style yoghurt ,  1-2 drops red food colouring ,  150g\/5½oz self-raising flour ,  50g\/1¾oz cocoa powder,  1 tbsp semi-skimmed milk,  100g\/3½oz butter,  200g\/7oz cream cheese,  500g\/1lb 2oz icing sugar,  1 tsp lemon juice","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/red_velvet_cake_70743"}