{"recipe_name":"Red mullet with spicy peppers, chorizo and black olives with candied aubergine","author":"Jason Atherton","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the candied aubergine, preheat the oven to 200C\/400F\/Gas 6 and line a baking tray with a large piece of foil. Cut off the tops and tails of the aubergines, then peel off the skins with a vegetable peeler. Chop the flesh into small cubes and place into a large bowl. Add the sugar, lemon juice, chopped garlic and thyme and mix well.   Spread the aubergine mixture out onto the prepared tray and cover with another piece of foil. Transfer to the oven and bake for 45-55 minutes (removing from the oven once or twice to stir the aubergines), until they are very soft and slightly caramelised.  While still hot, transfer the aubergines to a food processor and blend to a rough paste. With the food processor motor still running, slowly pour in the hazelnut oil and keep blending until smooth. Transfer the purée to a clean pan and cook over a high heat to dry it out a little. Season, to taste, with salt and freshly ground black pepper. Meanwhile, for the peppers, heat the olive oil in a frying pan over a medium heat. Add the red onion, chorizo and ras el hanout and fry for 3-4 minutes, stirring frequently. Drain the roasted red peppers, discard any seeds and cut into thin slices. Add to the pan and cook for another 3-4 minutes. Add the spicy tomato ketchup and olives and season, to taste, with salt and freshly ground black pepper. Add the chopped coriander and stir through. For the aubergine crisps, trim the aubergine and slice very thinly lengthways. Heat the groundnut oil in a deep-fat fryer to 190C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)   Add the aubergine slices to the hot oil in batches, to deep-fry until they are golden and crisp. Remove with a slotted spoon and drain on a tray lined with kitchen paper. Sprinkle with the salt while still warm. Trim the red mullet fillets to neaten and check them for pin bones, removing any you find with tweezers. Heat the olive oil in a frying pan until hot. Season the red mullet fillets with salt and freshly ground black pepper, then fry, skin-side down, for 2-3 minutes, until the skin is golden-brown and crisp. Turn the fillets over and fry on the other side for 30 seconds to one minute, or until the fish is just cooked through, then remove from the heat.   To serve, place a spoonful of candied aubergine in the centre of each plate. Top with the red mullet fillets and garnish with the aubergine crisps and coriander. Serve the spicy peppers in a bowl alongside. ","ingredients":" 500g\/1lb 2oz aubergines (about 1 large or 2 medium ones),  75g\/3oz caster sugar,  2 tbsp lemon juice,  1 garlic clove, finely chopped,  small bunch fresh thyme, leaves only,  4 tbsp hazelnut oil,  2 tbsp olive oil,  1 red onion, peeled and finely chopped,  110g\/4oz fresh chorizo sausage, finely chopped,  1 tsp ras el hanout (Moroccan spice mixture available in Middle Eastern stores),  425g\/15oz jar sweet roasted peppers,  2 tbsp spicy tomato ketchup,  10 black olives, halved, stones removed,  salt and freshly ground black pepper ,  few coriander sprigs, leaves only, chopped,  1 baby aubergine,  groundnut oil, for deep-frying,  fine sea salt, to sprinkle,  4 x 100-125g\/4 - 4½ oz red mullet fillets,  2 tbsp olive oil,  salt and freshly ground black pepper,  coriander shoots (or leaves), to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/redmulletwithspicype_88636"}