{"recipe_name":"Beer-battered fish","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the batter, mix the cornflour, plain flour and salt together in a large bowl. Make a well in the centre of the mixture and whisk in the ale and vinegar. Beat with a large metal whisk to make a smooth batter with the consistency of double cream. For the fish, heat a deep, heavy-bottomed saucepan half-full of the sunflower oil to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, use an electric deep fat fryer heated to 180C. Put the flour into a large, strong polythene food bag and season with the salt. Add the fish fillets, one at a time, and shake until coated in the seasoned flour. When the oil has reached the right temperature, stir the batter well. Dip one floured fish fillet into the batter until thoroughly coated. Lift the fish out with a pair of tongs and gently lower into the hot oil. Watch out for splashes as the oil will be extremely hot. Repeat the process with a second fish fillet and cook with the first for 5-6 minutes (depending on the thickness of the fillets) or until golden-brown and crisp. It's important that the batter doesn't brown too quickly before the fish is cooked. Remove from the pan using a slotted spoon and transfer to a plate lined with kitchen paper to absorb any excess oil. Reheat the oil and cook the remaining two pieces of fish in exactly the same way. Serve with freshly cooked chips. ","ingredients":" 75g\/2½oz cornflour,  200g\/7¼oz plain flour,  1 tsp fine sea salt,  330ml\/11½fl oz real ale,  2 tbsp white wine vinegar,  sunflower oil, for deep frying,  4 tbsp plain flour,  ½ tsp fine sea salt,  4 x 200g\/7¼oz thick white fish fillets, such as haddock or whiting,  chips, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beerbatteredfish_93119"}