{"recipe_name":"Red pepper and apple meatballs with sweet and sour sauce","author":"Tana Ramsay","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the meatballs, place the lamb and pork mince into a bowl and mix together well. Add the pepper, onion, apples, ginger, coriander and egg white to the mince mixture and mix well. Shape the mixture into small balls, about 2cm\/1in in diameter and place onto a plate. Dust with the flour, rolling the balls around to cover all over. Place into the fridge for 30 minutes to firm up. For the sauce, heat a frying pan until hot then add the olive oil and red onion. Cook for 2-3 minutes, until just softened. Add the leeks and courgette and fry until slightly browned. Add the tomatoes, sugar and vinegar and bring to the boil. Reduce the heat and simmer for 20 minutes. Allow the mixture to cool for a few minutes, then transfer to a food processor and blend to a smooth sauce. Return the sauce to the pan. Heat a frying pan until hot then add the olive oil and meatballs. Fry the meatballs, turning occasionally, until golden-brown all over. Add the tomato sauce and bring to the boil. Reduce the heat and simmer for 15 minutes. To serve, place the rice onto the plates. Top with a ladleful of meatballs and sauce, and garnish with a little basil. ","ingredients":" 450g\/1lb lean lamb mince,  450g\/1lb lean pork mince,  1 red pepper, deseeded and finely chopped,  1 small onion, finely chopped,  3 Cox's apples, peeled and finely grated,  1 tbsp fresh ginger, grated,  4 tsp coriander, chopped,  1 free-range egg white,  3 tbsp plain flour,  1 tbsp olive oil,  cooked basmati rice, to serve,  2 tsp olive oil,  1 red onion, finely chopped,  4 baby leeks, chopped,  1 courgette, sliced,  450g\/1lb cherry tomatoes, halved,  2 tsp brown sugar,  2 tsp malt vinegar,  6 basil leaves, torn","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/redpepperandapplemea_88173"}