{"recipe_name":"Red snapper with coconut and pineapple salsa","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6, or light the barbecue and let the initial flames die down. Slash the skin of the snapper on both sides with a sharp knife.  Season the snapper well with salt and freshly ground black pepper. Place a banana leaf or a large piece of kitchen foil onto a work surface. Place the lemongrass stalks, lime slices and ginger sticks onto the leaf or foil and place the snapper on top. Wrap up the fish into a parcel and secure with a cocktail stick that has been soaked in water for 10 minutes, if using a banana leaf, or fold to seal if using foil. Transfer to the oven or barbecue and cook for 15-20 minutes (depending on the size of the snapper), or until just cooked through. For the salsa, lightly toast the grated coconut in a dry frying pan for 1-2 minutes, or until golden-brown all over. Place the avocado oil and rice vinegar into a bowl and mix together well. Add the toasted coconut, brown shrimps, pineapple and thyme and mix together well. To serve, open the fish parcel at the table and serve portions onto plates. Place the salsa into a large serving bowl and let people help themselves. ","ingredients":" 1 whole red snapper, gutted and cleaned,  salt and freshly ground black pepper,  2 stalks lemongrass, bashed slightly with a rolling pin,  1 lime, sliced into rounds,  2.5cm\/1in piece ginger, peeled, cut into matchsticks,  1 banana leaf (if unavailable you can use kitchen foil),  2 tbsp grated fresh coconut,  3 tbsp avocado oil (or extra virgin olive oil),  75ml\/3fl oz rice vinegar,  100g\/3½oz ready-cooked brown shrimps,  ½ fresh pineapple, cut into small cubes,  ½ tsp fresh thyme leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/redsnapperwithcoconu_86477"}