{"recipe_name":"Beer-battered haddock with mushy peas, sweet potato chips and tartare sauce","author":"Alex Mackay","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring a pan of salted water to the boil. For the beer-battered haddock, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)  Sprinkle the plain flour onto a plate. Dredge the haddock fillet and the onion rings into the flour to coat. Set the flour plate aside. Place the self-raising flour into a large bowl and gradually whisk in beer as necessary to make a thick batter the consistency of double cream. Season with salt.  Dip the haddock fillet and onion rings into the batter and carefully lower them into the hot oil. Fry for 8-10 minutes, or until golden-brown and crisp. Remove with a slotted spoon and drain on kitchen paper. For the mushy peas, add the peas to the boiling, salted water and cook for 4-5 minutes, or until tender. Drain the peas and put them into a bowl. Add the rest of the mushy pea ingredients and mashwith a fork until well combined. For the sweet potato chips, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Press the sweet potato chips into the remaining plain flour to coat them, shake off any excess, then carefully lower the chips into the hot oil. Deep fry for 6-7 minutes or until golden-brown. Remove with a slotted spoon and drain on kitchen paper. For the tartare sauce, whisk the egg yolks in a bowl. Place the herbs, white wine vinegar, salt and freshly ground black pepper into a small microwave-safe bowl and warm in the microwave for 30 seconds on full power. Pour this warm mixture over the eggs and whisk until combined. Gradually add the vegetable oil in a thin stream and keep whisking until all the oil has been fully incorporated and the mixture has the consistency of mayonnaise. Stir in the chopped gherkins. To serve, place the haddock fillet onto a serving plate and arrange the sweet potato chips, onion rings and mushy peas alongside. Put the tartare sauce into a separate serving bowl on the side. Garnish with the lemon wedges. ","ingredients":" 300ml\/½ pint vegetable oil, for deep frying,  6-8 tbsp plain flour, for dredging,  1 haddock fillet,  ½ Spanish onion, peeled, cut into rings,  200g\/7oz self-raising flour,  200ml\/7fl oz bottled beer or ale,  pinch salt,  250g\/9oz fresh peas,  2 tbsp olive oil,  1 sprig fresh mint, leaves only, chopped,  salt and freshly ground black pepper,  300ml\/½ pint vegetable oil, for deep frying,  ½ sweet potato, peeled, cut into chips,  plain flour, for dusting,  pinch salt,  2 free-range egg yolks,  4 tbsp chopped fresh chervil,  4 tbsp chopped fresh parsley ,  1 tbsp white wine vinegar,  salt and freshly ground black pepper ,  150ml\/5fl oz vegetable oil,  2 tbsp chopped gherkins,  lemon wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beerbatteredhaddockw_89436"}