{"recipe_name":"Refried beans with cheesy tortilla chips","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to its highest setting. For the refried beans, heat the oil in a saucepan over a medium heat. Add the onion and cook for 3-4 minutes, or until softened, then add the garlic and cook for another minute. Add the kidney beans and cook for another 2-3 minutes to warm through. Transfer to a food processor and blend until smooth. Season, to taste, with salt and freshly ground black pepper and stir in the parsley. Spoon the bean mixture into a bowl and top with the Greek yoghurt and grated cheddar. For the tortilla chips, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the tortilla triangles and deep-fry for 2-3 minutes, or until crisp and golden. Carefully remove the tortilla chips with a slotted spoon and drain on kitchen paper. Place the cooked tortilla chips onto a baking sheet. Mix the Greek yoghurt and lemon juice together in a clean bowl, then spoon the yoghurt mixture over the tortilla chips. Cover the yoghurt mixture and tortilla chips with the grated cheese and place under the grill and cook until the cheese is beginning to melt and bubble. To serve, place the cheesy tortillas onto a serving plate with the bowl of refried beans alongside. ","ingredients":" 1 tbsp olive oil,  ½ onion, chopped,  2 garlic cloves, chopped,  400g\/14oz can kidney beans, rinsed and drained,  salt and freshly ground black pepper ,  handful flatleaf parsley, chopped,  2 tbsp Greek yoghurt,  2 tbsp grated cheddar,  400ml\/14fl oz vegetable oil, for deep frying,  2 ready-made tortillas, cut into triangles,  125g\/4½oz Greek yoghurt,  squeeze lemon juice,  50g\/1¾oz cheddar cheese, grated","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/refriedbeanswithchee_84658"}