{"recipe_name":"Beer-battered oysters with watercress and red onion salad","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the oysters, heat a deep fat fryer to 190C\/375F. Heat the vegetable oil in a deep heavy-based saucepan, until a breadcrumb sizzles and browns when dropped in it. (CAUTION: hot oil can be dangerous - do not leave unattended.) Place the yeast and beer into a bowl and whisk together. Add 200g\/7oz of the plain flour and whisk to a smooth batter. Set aside for five minutes. Meanwhile, shuck the oysters, retaining the juice in a bowl. Place the remaining plain flour onto a plate and dust the oysters in the flour. Dip each oyster into the beer batter and drop directly into the hot fat, in batches. Cook for about two minutes until golden-brown and crisp, a few at a time. Carefully remove the oysters with a slotted spoon and transfer to kitchen paper. For the salad, place the vinegar and sugar into a non-reactive saucepan and bring to the boil. Simmer until the sugar has dissolved.  Place the red onions and chilli into a bowl, then pour the hot vinegar over them and stir to combine. Set aside for five minutes. Strain off two tablespoons of the onion pickling liquid and place in a bowl with two tablespoons of the reserved oyster juices. Add the rapeseed oil and whisk to combine. Season with salt and freshly ground black pepper, to taste. Place the watercress in a bowl. Drain the red onions, add them to the bowl, and add the dressing. Mix to combine. To serve, divide the salad equally among four plates, top each serving with six oysters and a sprinkle of smoked sea salt. ","ingredients":" vegetable oil, for deep frying,  1 tsp dried yeast,  300ml\/11fl oz beer,  300g\/11oz plain flour,  24 oysters,  1 tsp smoked sea salt,  110ml\/4fl oz white wine vinegar,  110g\/4oz caster sugar,  1 red onion, finely sliced,  1 large red chilli, finely sliced,  4 tbsp rapeseed oil,  salt and freshly ground black pepper,  200g\/7oz watercress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beerbatteredoystersw_88731"}