{"recipe_name":"Rhubarb and ginger baked cheesecake ","author":"Janet Basu","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Grease and line a 25cm\/10in loose-bottomed cake tin.  Cut two thirds of the rhubarb into pieces about 5cm\/2in long, place in an ovenproof dish and sprinkle with 55g\/2oz of the caster sugar. Roast in the oven for 20 minutes or until tender. Meanwhile, cut the remaining rhubarb into pieces about 7.5cm\/3in long, place in another ovenproof dish with a tablespoon of the caster sugar and roast until just tender but still holding their shape. Set aside to decorate the cheesecake. To make the biscuit base, place the stem ginger biscuits in a plastic bag and crush with a rolling pin, leaving the mixture quite rough. Place the biscuit crumbs in a bowl, mix in the melted butter and press into the bottom of the prepared cake tin. Place in the fridge while you make the cheesecake mixture. Beat the cream cheese with the remaining 125g\/4½oz caster sugar and the lemon zest, then add the soured cream and egg yolks and beat until smooth. Spread the rhubarb onto the chilled biscuit base. Whisk the egg whites until they hold soft peaks then fold into the cheese mixture and pour on top of the rhubarb. Bake in the oven for about one hour, reducing the heat to 180C\/350F\/Gas 4 once the cheesecake has risen. The top should be firm to the touch but still slightly wobbly. Let the cheesecake to cool then remove it from the tin, arrange the reserved rhubarb on top and dust with the icing sugar. ","ingredients":" 1.5kg\/3lb 5oz rhubarb, trimmed,  175g\/6oz caster sugar,  300g\/10½oz stem ginger biscuits,  115g\/4oz unsalted butter, melted,  450g\/1lb full-fat cream cheese,  2 lemons, zest only ,  300ml\/½ pint soured cream,  6 free-range eggs, separated,  1 tbsp icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rhubarb_and_ginger_baked_08606"}