{"recipe_name":"Rhubarb and sultana chutney with mackerel, homemade blinis and pickled shallots","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pickled shallots, heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar has dissolved. Put the shallots in a bowl and pour over the hot vinegar mixture. Mix together, coating the shallots. Set aside to pickle for at least an hour, but preferably 24 hours. For the homemade blinis place the flour and salt into a bowl and crumble in the yeast. Put the milk in a pan over a low heat and warm through. Pour the warm milk into the flour, mixing thoroughly to form a thick batter. Set aside for one hour. For the rhubarb and sultana chutney, in a heavy-based pan melt the sugar until a golden-brown caramel forms. Remove from the heat and stir in the sultanas, rosemary sprigs, ginger, shallot and rhubarb. Stir in the cider vinegar and orange juice. Bring back to the boil and cook gently for 8-10 minutes. Season with salt and pepper and set aside to cool. To cook the blinis, whisk the egg whites until soft peaks form when the whisk is removed. Fold the egg whites into the batter mixture. Heat a small amount of the olive oil in a frying pan over a medium heat. Add a spoonful of the batter and fry for 45-60 seconds, until golden-brown underneath, then turn over and cook for 30 seconds on the other side. Remove the blini and place onto kitchen paper. Repeat this process with the remaining batter. Keep the blinis warm. For the mackerel, place the mackerel fillets skin-side up on a baking tray. Brush with rapeseed oil and use a blow torch to cook evenly. Turn over and repeat on the other side (alternatively cook the fillets under a hot grill). Season with salt and pepper. To serve place the blinis on the serving plate with some crème fraiche and sprinkle with the chives. Spoon some chutney and pickled shallots on the side and put the mackerel fillets on top. ","ingredients":" 200ml\/7fl oz white wine vinegar,  75g\/2½oz caster sugar,  1 tsp salt,  ½ tsp black peppercorns,  2 banana shallots, peeled and thinly sliced,  150g\/5½oz plain flour,  1 tsp salt,  14g fresh yeast,  150ml\/5fl oz milk,  2 free-range egg whites,  olive oil, for frying,  75g\/2½oz caster sugar,  25g\/1oz sultanas,  few sprigs fresh rosemary,  2cm\/¾in piece root ginger, peeled and finely chopped,  1 shallot, peeled and finely chopped,  3 sticks rhubarb, chopped,  5 tbsp cider vinegar,  1 orange, juice only,  salt and black pepper,  8 mackerel fillets,  rapeseed oil, for cooking,  200g\/7oz crème fraîche,  3 tbsp finely chopped fresh chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rhubarb_and_sultana_10821"}