{"recipe_name":"Rhubarb and suet pudding","author":"Nigel Slater","programme":"A Taste of My Life","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pastry, place the flour into a mixing bowl, add a pinch of salt and the suet, then mix in the water one tablespoon at a time until the mixture forms a soft dough. (You may not need all of the water.)   With floured hands, shape the pastry into a short, thick sausage shape. Cut thin slices from the dough and press them on to the bottom and sides of a buttered, one-litre pudding basin, until the entire surface area is covered. Leave enough dough to roll out for a lid. For the rhubarb, mix the rhubarb together with the caster sugar, then pile into the lined pudding basin and pour over the orange juice.  Roll or pat out the remaining dough into a circle large enough to fit over  the top of the pudding basin. Wet the edges of the pastry and press the edges together to seal. Cut a piece of greaseproof paper large enough to fit over the top of the basin and hang over the edge, and butter one side. Fold a pleat into the paper so that it will not tear when the dough expands. Lay the folded paper butter side down over the top of the pudding, then cover with tin foil or muslin and tie it securely with kitchen string.  Bring a large, deep pan of water to the boil and lower the pudding gently into it so that the water comes about a third of the way up the pudding basin.   Cover the pan tightly with a lid and leave the pudding to steam for two hours, until well risen. Top up the pan with more water if needed.  To serve, turn out the pudding onto a serving dish, or serve straight from the basin. ","ingredients":" 200g\/7oz self-raising flour, plus extra for dusting,  pinch salt,  100g\/3½oz shredded beef or vegetable suet,  6 tbsp water,  1kg\/2¼lb rhubarb, chopped,  8 tbsp caster sugar½ orange, juice only,  butter, for greasing","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rhubarbandsuetpuddin_89215"}