{"recipe_name":"Rhubarb charlotte with crème anglaise","author":"James Martin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the rhubarb charlotte, melt 25g\/1oz of the butter in a small saucepan over a medium heat. Add the rhubarb, sugar and ground ginger and cook gently for five minutes. Add the orange juice and cook for a further two minutes, or until the rhubarb has softened. Set aside to cool slightly. Using the 2in\/5cm chefs' ring, cut two of the bread slices into two circles, and, using a knife, cut the remaining three pieces of bread into three rectangles. Melt the remaining 50g\/2oz of butter in a frying pan over a medium heat. Dip the pieces of bread into the melted butter. Place a 2in\/5cm chefs' ring onto a baking sheet. Place one of the dipped bread circles at the bottom of chefs' ring. Then line the inside of the ring (overlapping with the circle of bread at the bottom) with the rectangular pieces of bread, ensuring it is well sealed.  Fill the bread case with the stewed rhubarb mixture and place the final bread circle onto the top. Place into the oven to bake for 8-10 minutes, or until golden. For the crème anglaise, place the milk, double cream, vanilla pod and seeds into a non-stick saucepan and heat until just boiling. Remove from the heat and set aside. Meanwhile, whisk together the egg yolks and caster sugar, until light and fluffy. Remove the vanilla pod from the warm milk and cream mixture and gradually add the milk to the beaten eggs and sugar, whisking continuously. Pour the mixture back into the saucepan and heat, whisking continuously, for a further two minutes, or until the custard has thickened slightly. Remove from the heat and stir in the orange zest. To make the spun sugar ball, place the sugar in a clean, heavy-based saucepan and add the warm water. Brush the sides of the saucepan with a pastry brush dipped in water to rinse away any sugar crystals that may have stuck to the sides. Heat the sugar and water over a low heat, stirring occasionally with a wooden spoon, until all the sugar has dissolved. Turn up the heat and boil for 3-4 minutes, until the sugar turns to caramel. Dip the base of the pan momentarily in cold water to halt the cooking process, then leave the caramel to stand for a few minutes. Hold two forks together back to back and dip the prongs into the sugar (or use a special sugar whisk). Shake the caramel-coated forks back and forth over a clean, lightly oiled sharpening steel or long metal skewer, so that long threads of spun sugar are formed. Gather the spun sugar into a ball and set aside. To serve, carefully turn out the rhubarb charlotte onto a small plate, drizzle around the crème anglaise and place the spun sugar ball on top. ","ingredients":" 75g\/3oz butter ,  2 sticks rhubarb, finely chopped ,  1 tbsp soft brown sugar,  ½ tsp ground ginger,  ½ orange, juice only,  5 slices white bread, crusts removed,  150ml\/5½oz whole milk,  150ml\/5½oz double cream,  1 vanilla pod, split lengthways, seeds scraped out,  2 large free-range egg yolks,  3 tbsp caster sugar,  1 orange, zest only,  150g\/5oz caster sugar,  290ml\/½ pint warm water","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rhubarbcharlottewith_80302"}