{"recipe_name":"Rhubarb compôte with Alfonso mango, vanilla ice cream and nutmeg","author":"Richard Corrigan","programme":"Great British Menu","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 120C\/225F\/Gas½.  First make the dough for the biscuits. Place the icing sugar, butter, vanilla seeds, flour and salt in a bowl and rub together using your fingers. Add the eggs and stir in the cream. Cover with cling film and chill. Meanwhile, make the vanilla ice cream. Put the cream and milk in a pan and scrape in the seeds from the vanilla pods; add the pods too. Bring to a gentle simmer.  In a bowl set over a pan of boiling water (but not touching the water), whisk the egg yolks with the sugar until pale and fluffy. Pour the hot cream mixture over the egg mixture, whisking constantly. Pass the mixture through a sieve into a bowl set over iced water to cool. Once cooled, add the grated nutmeg. Churn in an ice cream machine to make ice cream.  For the biscuits, roll out the biscuit dough on a floured surface and cut into 9-10cm\/3½-4in rounds using a metal chefs' ring. Place on a baking tray lined with non-stick silicone paper and bake for 12-14 minutes or until golden.  Remove and allow to cool on a wire rack. (You will make more biscuits than you need for four servings; the rest can be kept in an airtight tin for 2-3 days.) For the rhubarb, make a stock syrup by heating the sugar and water, stirring to dissolve the sugar. Add the rosemary and cook for 8-10 minutes or until syrupy.  Add the rhubarb pieces and grenadine and cook over a low heat for 5-6 minutes or until just tender. Remove from the heat and leave to cool.  To serve, place a sablé biscuit on each serving plate. Place the metal chefs'  ring used to cut the biscuits on top and spoon the drained rhubarb inside. Arrange the mango slices on the rhubarb in a circular pattern, then remove the chefs' ring and top with quenelles of ice cream. Dust with grated nutmeg. ","ingredients":" 125g\/4½oz icing sugar, sifted,  125g\/4½oz unsalted butter,  2 vanilla pods, split lengthways and seeds scraped out,  250g\/9oz plain flour, plus extra for dusting,  pinch salt ,  2 free-range eggs,  100ml\/3½fl oz double cream,  600ml\/1 pint 2fl oz double cream,  300ml\/10½fl oz milk,  2 vanilla pods, split lengthways and seeds scraped out,  4 free-range egg yolks,  175g\/6oz caster sugar,  pinch freshly grated nutmeg,  300g\/10½oz sugar ,  300ml\/10fl oz water,  sprig rosemary,  300g\/10½oz rhubarb, cut into batons,  splash grenadine,  3 Alfonso mangoes, peeled, stoned and sliced ,  freshly grated nutmeg, to finish","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rhubarbcompotewithal_82182"}