{"recipe_name":"Rib-eye steak with a parsnip and potato rosti, wild mushroom sauce and parsnip crisps","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rosti, wrap the potato in a clean tea towel and squeeze out as much liquid as you can. Transfer to a bowl and add the parsnip, crème fraîche and egg yolk. Season with salt and pepper and stir to combine. Heat the butter in a frying pan over a medium heat and place two 7.5cm\/3in chefs' rings into the pan. Spoon the potato mixture into the rings, press down well using a spoon and cook for 3-4 minutes, or until the base is golden-brown. Remove the rings and turn the rosti over. Cook for 3-4 minutes on the other side, or until cooked through.  For the mushroom sauce, heat the butter in a large frying pan until foaming. Fry the garlic for 2-3 minutes (do not burn the garlic or it will be bitter). Add the mushrooms and fry for 3-4 minutes, or until golden-brown and the liquid from the mushrooms has been released. Pour in the Madeira and cook until the volume of liquid has reduced by half, then add the stock and reduce again by half. Stir in the cream, tarragon and chervil and simmer for 5-7 minutes. For the rib-eye steak, heat a large frying pan and add the oil, once hot, add the steaks and cook on each side for 2-3 minutes, or until cooked to your liking (you may need to do this in batches). Add the butter at the last minute and baste the meat. Allow the steak to rest for 10 minutes before serving.  For the parsnip crisps. heat a deep-fat fryer to 180C or half fill a deep heavy pan with oil and heat until a breadcrumb sizzles and turns brown when dropped in. (Caution: Hot oil can be dangerous. Do not leave unattended.) Carefully add the parsnip strips into the oil and fry until golden-brown. Remove using a slotted spoon and drain on kitchen paper. To serve, cut the steaks into slices and place on serving plates with the sauce, a rosti and some parsnip crisps. ","ingredients":" 1 potato, grated,  1 parsnip, grated (if using large parsnips remove the woody core),  2 tbsp crème fraîche,  1 free-range egg yolk ,  25g\/1oz butter, melted,  salt and freshly ground black pepper,  50g\/1¾oz unsalted butter,  1 garlic clove, chopped,  250g\/9oz wild mushrooms ,  3 tbsp Madeira,  300ml\/10fl oz dark chicken stock,  100ml\/3½oz double cream,  handful fresh tarragon leaves, chopped,  2 tbsp fresh chervil leaves, for garnish,  2 tbsp oil,  4 x 200g\/7oz rib-eye steaks,  50g\/1¾oz unsalted butter,  1 large parsnip, sliced into strips using a vegetable peeler","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rib-eye_steak_with_a_15551"}