{"recipe_name":"Rib-eye steak with deep fried onion rings and onion butter","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First, make a red wine reduction by bringing the red wine and beef stock to the boil, then reducing the heat to low and simmering until the volume of liquid has reduced to 50ml\/2floz. Heat a knob of the butter in a frying pan over a medium heat. Add the diced onion and fry for 1-2 minutes, or until just softened. Transfer to a bowl. Add the remaining butter, balsamic vinegar, red wine reduction and parsley to the bowl containing the diced onion and mix well. Season, to taste, with salt and freshly ground black pepper. Set aside. Season the steaks with salt and freshly ground black pepper, then rub with a little of the olive oil. Heat a griddle pan over a medium to high heat. When hot, add the steaks and cook for 2-3 minutes on each side (for medium), or until cooked to your liking. Remove from the pan and set aside on a plate to rest for 3-4 minutes. Place a spoonful of the onion butter on top of each steak while it rests. Meanwhile, heat the oil in a deep-fat fryer to 190C\/375F. Alternatively, half-fill a heavy-based saucepan with oil and heat until a breadcrumb sizzles and turns golden-brown in it. (Caution: hot oil can be dangerous. Do not leave unattended.) Sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Beat the eggs in a bowl.  Dredge the onion rings in the seasoned flour then dip in the beaten egg. Lower them carefully into the hot oil and fry for 1-2 minutes, or until golden-brown and crisp. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Sprinkle over a little salt. To serve, carve each steak into slices and place onto serving plates. Pile the onion rings alongside. Spoon another dollop of the onion butter on top of each steak. ","ingredients":" 110ml\/4fl oz red wine,  110ml\/4fl oz beef stock,  200g\/7oz butter, softened,  2 large onions (or 1 huge onion), half cut into thick rings, half finely diced,  2 tbsp balsamic vinegar,  2 tbsp fresh flatleaf parsley, leaves roughly chopped,  salt and freshly ground black pepper,  4 x 200g\/7oz rib-eye steaks, at room temperature,  1 tbsp olive oil,  110g\/4oz plain flour,  2 free-range eggs, beaten,  vegetable oil, for deep frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rib-eye_steak_with_deep_64911"}