{"recipe_name":"Rib of beef, pickled walnuts and horseradish cream","author":"Jeremy Lee","programme":"Great British Menu","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 10-12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"At least two hours prior to cooking, place the joint in a roasting tin and leave to come up to room temperature. Preheat the oven to 190C\/385F\/Gas 5. Weigh the joint and calculate th cooking time as follows: on the bone, 19 minutes for each 500g\/1lb 2oz; off the bone 15 minutes cooking time for every 500g\/1lb 2oz of beef. This will give a splendid outer crust and lovely rare meat within. Rub the beef all over with the salt and the black and white pepper mixture. For meat off the bone, cook fat-side down in a roasting tray. If the meat is on the bone, then simply sit it up on the bones in the roasting tray, fat side up. Place into the oven and roast for the calculated time, or until cooked to your liking.  Meanwhile, for the horseradish cream, peel the horseradish, then grate finely. The tears will flow, but grate fast, so it is done quickly. The heat of fresh horseradish is vital for this dish. Place the sugar and the vinegar into a bowl and stir until the sugar dissolves. Add the grated horseradish and allow to sit for 30 minutes or so. Whip the cream very lightly, then stir it into the horseradish mixture. Cover well and chill until ready to serve. (The sauce can be made a few hours ahead of serving, but not too far ahead or the flavour will fade dramatically.)   When the beef is cooked to your liking, leave it to rest for at least half an hour before carving, to allow the meat to relax. Sit the meat on a board or large plate and cover with foil while you prepare the vegetables for serving. To serve, place the vegetables into a large bowl and add a large knob of butter. Turn gently to coat the vegetables in the butter. Carve the meat, thick enough to afford two good slices per person. Place the slices onto each plate and sit a few halved pickled walnuts alongside. Place a spoonful of the horseradish cream alongside with a spoonful of the buttered peas, onions, asparagus and lettuce and new potatoes. ","ingredients":" rib of beef with 4 ribs ,  150g\/5½oz sea salt ,  3 tsp equally mixed freshly ground black and white pepper ,  24 pickled walnuts,  large piece fresh horseradish (3cm\/1in x 10cm\/4in),  4-6 tsp caster sugar,  4 tbsp white wine vinegar,  400ml\/14fl oz double cream,  fresh peas, cooked until tender,  baby onions, peeled, boiled,  asparagus, cooked until tender,  lettuce, shredded and blanched for 10-15 seconds,  large knob butter,  new potatoes, preferably Jersey Royals, boiled until tender","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/ribofbeefpickledwaln_86395"}