{"recipe_name":"Rich lamb stew with aubergine purée (Hunkar begendi)","author":"Rick Stein","programme":"Rick Stein: From Venice to Istanbul","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/200C Fan\/Gas 7.  For the red pepper paste, roast the peppers for 20-30 minutes until dark and softened. Transfer to a bowl and cover with cling film, then leave until cool enough to handle. Remove the charred skins, stalks and seeds. In a blender, blitz the red peppers with the remaining ingredients. Store for up to a week in a jar in the fridge.   Put the aubergines on a baking tray and bake whole for 25 minutes. When soft, remove from the oven and leave to cool. For the lamb stew, warm half the olive oil in a large flameproof casserole pan over a high heat and brown the lamb in batches. When browned, return all the lamb to the pan, add the red pepper and tomato pastes, the remaining olive oil, and the onion, garlic, chilli and green pepper. Reduce the heat to medium and cook until softened. Add the chopped tomatoes, oregano, salt and pepper, and finally the hot water. Bring to a simmer then turn down the heat, cover with the lid and allow to cook slowly for 1-1½ hours. When cool enough to handle, peel the aubergines and mash the flesh with a fork.  In a pan over a medium heat, make a roux; melt the butter, add the flour and cook, stirring, for 2 minutes, then add the milk to give a thick white sauce. Mix in the aubergine, the grated cheese and lemon juice, and season with salt and pepper. Keep warm. When the lamb is tender, check the sauce; it should be rich and thick. If it’s too runny, remove the lamb and reduce the liquid a little, then return the meat to the pan and warm through.  Serve the stew on top of the aubergine purée, scattered with parsley. ","ingredients":" 660g\/1lb 7oz red peppers,  50g\/1¾oz tomato purée,  ½ tsp salt,  1 tsp cayenne pepper,  2 tbsp olive oil,  4 medium aubergines,  30g\/1oz butter,  30g\/1oz plain flour,  380ml\/13fl oz full-fat milk,  75g\/2¾oz Parmesan cheese, grated,  1 lemon, juice only,  salt and freshly ground black pepper,  4 tbsp olive oil,  850g\/1lb 14oz boned lamb shoulder, cut into 3cm\/1¼in cubes,  1 tbsp red pepper paste,  2 tbsp tomato paste,  1 onion, chopped,  2 large garlic cloves, chopped,  1 green finger chilli, sliced,  1 green pepper, seeds removed and sliced,  3 tomatoes, peeled and chopped,  1 tsp dried oregano,  1 tsp salt,  freshly ground black pepper, to taste,  200ml\/7fl oz hot water,  chopped flatleaf parsley, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rich_lamb_stew_with_51065"}