{"recipe_name":"Beetroot soufflé with anchovy sauce","author":"Antonio Carluccio","programme":"Great British Food Revival","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Grease six individual ramekins with the butter and dust the insides with the breadcrumbs. Preheat the oven to 220C\/425F\/Gas 7.  Place the beetroot, half the grapefruit juice, horseradish, sea salt and freshly ground black pepper into a blender and pulse until smooth. Heat the remaining grapefruit juice in a small pan, mix in the flour to make a paste and add it to the blender. Add the egg yolks to the mixture one at a time and blend until everything is smooth. Pour the mixture from the blender into a large bowl. Whisk the egg whites until stiff in a clean bowl and then carefully fold into the beetroot mixture.  Place the prepared ramekins onto a baking tray, pour in the soufflé mixture and bake in the oven for 20 – 25 minutes. For the anchovy sauce, put the butter and garlic into a pan, fry for one minute then discard the garlic. Lower the heat and add the anchovy fillets. When they have completely dissolved, stir in the cream and remove the pan from the heat. When the soufflés are cooked, make a small hole in the middle of each one, pour in two tablespoons of the sauce and serve immediately. ","ingredients":" 20g\/¾oz butter, for greasing,  20g\/¾oz fine dry breadcrumbs, for dusting,  400g\/14oz cooked beetroot, peeled and diced,  150ml\/5fl oz pink grapefruit juice,  1 tsp hot horseradish,  sea salt and freshly ground black pepper,  3 tbsp plain flour,  4 free-range eggs, separated,  125g\/4½oz unsalted butter,  1 large garlic clove, cut into 3,  10 anchovy fillets in oil, drained,  100ml\/3½fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beetroot_souffl_with_45218"}