{"recipe_name":"Risotto of porcini, girolles and chanterelles","author":"Galton Blackiston","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6 and line a baking tray with greaseproof paper. For the risotto, place the stock in a large saucepan and put on low heat to warm through. Heat a large pan and add the oil and butter. Once hot, add the onion and cook for 2-3 minutes, or until softened but not browned. Add the garlic and cook for a further two minutes. Add the rice and cook for four minutes, or until the rice is fully coated with the oil, onion and garlic. Add the wine and cook until the volume of liquid has reduced by half. Slowly add the stock, a ladle at a time, and continually stir to a loose creamy constancy. For the parmesan crisps, place a 4cm\/1½in chefs’ ring on the baking tray and sprinkle in the grated cheese. Remove the ring and start again until all the cheese has been use. Put in the oven to bake for 5-10 minutes, or until golden-brown. Remove from the oven to cool. Once cool, they will crisp up. For the chive oil, put nearly all of the chives and oil in a blender and blend until smooth. Pour through a sieve into a bowl. Add more oil to taste. Add the cheese and butter to the risotto and stir. For the mushrooms, heat a large frying pan and add the oil and butter. Once hot, add the mushrooms and fry for 2-3 minutes. Heat a medium frying pan, add the prosciutto and cook on each side for 2-3 minutes. Drain on kitchen paper. To serve, place the risotto in the centre of each of four serving bowls. Top with the mushrooms and garnish with the chive oil, parmesan crisp, prosciutto and a sprinkle of chopped chives. ","ingredients":" 500ml\/18fl oz chicken stock,  2 tbsp olive oil,  1 tbsp butter,  1 onion, finely chopped,  2 garlic cloves, peeled and finely chopped,  200g\/7oz arborio rice,  75ml\/2½fl oz white wine,  50g\/1¾oz parmesan cheese, grated,  25g\/1oz unsalted butter,  4 slices prosciutto ,  100g\/3½oz parmesan cheese, grated,  1 bunch fresh chives, finely chopped,  100ml\/3½fl oz olive oil,  1 tbsp olive oil,  1 tbsp unsalted butter,  75g\/2½oz porcini mushrooms, sliced,  75g\/2½oz girolle mushrooms, sliced,  75g\/2½oz chanterelle mushrooms","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/risotto_of_porcini_63456"}