{"recipe_name":"Risotto of nettles and wild herbs","author":"Hugh Fearnley-Whittingstall","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Blanch the nettles in boiling water for two minutes, then drain, squeeze dry, and chop finely. Wash and finely chop the other hedgerow herbs.  Bring the stock to simmering point on a low heat. In a separate, fairly heavy-based saucepan sweat the onion or shallot in the butter for a few minutes until soft but not coloured. Add the rice and cook for a further few minutes.  Add a ladle of the hot stock and allow to come to a gentle simmer. Cook the rice until almost all the liquid has been absorbed, stirring occasionally to make sure the risotto does not catch on the bottom of the pan.  Continue to add the liquid by degrees, incorporating the wine towards the end of the cooking, until the liquid is all absorbed, the risotto is creamy, and the individual rice grains tender with just a hint of chalkiness in the middle.  Stir the chopped nettles and herbs into the risotto, which should become a beautiful pale green, flecked with tiny pieces of herb. Season to taste with salt and pepper.  The risotto should be served not piping hot, but tiede, with a sprinkling of chopped fresh herbs and a trickle of olive oil on each portion. parmesan cheese is not required. ","ingredients":" 30-40 nettle tops,  plus some of the following (or use garden herbs such as parsley, tarragon and chives):,  small bunch wild chervil,  small bunch wild chives,  small bunch yellow rocket leaves,  few wild garlic leaves,  1 small onion or 2 shallots, chopped very finely ,  50g\/2oz butter,  200g\/7oz arborio rice,  500ml\/17fl oz chicken, veal or vegetable stock,  1 wine glass white wine,  salt and black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/risottoofnettlesandw_13724"}