{"recipe_name":"Smoked trout and calamari with apple and kohlrabi slaw in ginger broth","author":"Ed Baines","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the broth, place the chilli, ginger, stock and coriander stalks into a large pan. Simmer for three hours.  For the slaw, grate the kohlrabi, celeriac, apple and ginger into a bowl. Add the mayonnaise and horseradish and stir to combine. For the fish, preheat the grill to hot and grill the river trout until cooked through, turning once. For the squid, heat the oil in a deep fat fryer until a bread cube sizzles and turns golden-brown when dropped in the oil. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Combine the jerk seasoning and cornflour on one plate, pour the milk into a shallow bowl and put the panko breadcrumbs onto another plate. Dip the squid rings in the seasoned cornflour mixture, then the milk and finally the panko breadcrumbs. Deep fry until golden-brown. Carefully remove from the deep fat fryer and drain on a plate lined with kitchen paper. Slice the grilled smoked trout. Place the slaw into small bowls, topped with the broth. Place the trout slices and the squid on top.  ","ingredients":" 1 whole chilli,  1 thumb-sized piece fresh ginger,  570ml\/1 pint vegetable stock,  bunch coriander stalks, roughly chopped,  1 kohlrabi,  ¼ celeriac,  1 apple,  1 thumb-sized piece fresh ginger,  3 tbsp mayonnaise,  1 tsp grated fresh horseradish,  1 fillet smoked tout (approximately 500g\/1lb 2oz),  vegetable oil, for deep fat frying,  2 tbsp  jerk seasoning ,  handful cornflour,  300ml\/½ pint milk,  handful panko (Japanese) breadcrumbs,  2 squid tubes, cleaned and cut into rings","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/river_trout_spiced_40559"}