{"recipe_name":"Roast breast of turkey with mincemeat and cinnamon apple","author":"Brian Turner","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. Release the skin from the breast of the turkey from one side, trying to keep the other side attached. Smear the breast meat evenly with mincemeat then pull the skin back over. Tie with string to hold it all together and rub the skin with 25g\/1oz of the butter. Put the carrots and onions into a roasting dish and lay the turkey on top, skin-side up. Add the wine and then stock to come halfway up the turkey breast. Roast for about 40-60 minutes depending on the size of the turkey breast, the breast is cooked when the juices run clear.  Meanwhile heat 25g\/1oz butter in roasting tray on the hob and fry the apples, cut side down, to colour them. Turn them over, sprinkle with cinnamon and roast in the oven with the turkey until soft. When cooked set aside and keep warm. When the turkey is cooked, remove it from the oven and leave to rest in a warm place. Pour the cooking liquor from the roasting try into a pan. Boil to reduce it in volume to a thick sauce. Season to taste with salt and pepper and then strain through a fine sieve. Beat in 50g\/1¾oz cold butter and add the parsley. To serve, remove the string from the turkey and carve into slices. Decorate with the apples and pour over the sauce. ","ingredients":" 1 turkey breast, skin on,  4 tbsp dried fruit mincemeat,  100g\/3½oz butter,  2 carrots, roughly chopped,  2 onions, roughly chopped,  125ml\/4fl oz dry white wine,  250ml\/9fl oz chicken stock,  4 apples, cut in half horizontally,  1 tsp ground cinnamon,  1 tbsp chopped parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_breast_of_turkey_74714"}