{"recipe_name":"Roast chicken croquettes with spicy tomato chutney","author":"Michel Roux Jr.","programme":"Food & Drink","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01q80qh.jpg","method":"For the croquettes, boil the potatoes until tender and then mash, using a ricer if you have one, to get the mash as fine as possible. Set aside to cool slightly. Lightly beat one of the eggs and add to the cooled mash along with the butter, tarragon, lemon zest, salt and pepper. Mix well. Add the leftover chicken and combine. Place the breadcrumbs in one bowl, the flour in another and beat the remaining two eggs in a third bowl. Take small handfuls of the potato mixture and shape into logs around 5cm\/2in long. Roll each one in flour, dip in egg and then coat in breadcrumbs. Place in the fridge to chill for 30 minutes. For deep frying, fill a heavy bottomed saucepan with about 8cm\/3in vegetable oil and set over a medium heat. (Caution: hot oil can be dangerous. Do not leave unattended.) To test if the oil is ready, drop in a pinch of breadcrumbs. They should immediately sizzle and rise to the surface. Fry the croquettes in batches, turning occasionally until golden-brown all over. They should only take 2-3 minutes per batch. Remove to a paper towel lined plate and keep them warm while you fry the rest. For the tomato chutney, heat the olive oil in a frying pan and gently fry the shallots and garlic until soft, without colouring them. Add the sugar, fennel seeds, chilli flakes, salt and pepper, followed by the vinegar. Bring to a boil and then add the tomatoes. Cook for a further 10-15 minutes until the tomatoes have softened. Serve the croquettes with the chutney. Any leftover chutney can be stored in an airtight container in the fridge for a few days. ","ingredients":" 500g\/1lb 2oz floury potatoes, peeled and cut into 2.5cm\/1in cubes ,  3 free-range eggs,  30g\/1oz unsalted butter,  5-6 tarragon leaves, finely chopped,  ½ lemon, zest only,  ½ tsp salt,  ¼ tsp freshly ground black pepper,  200g\/7oz leftover roast chicken,  100g\/3½oz breadcrumbs,  100g\/3½oz flour,  vegetable oil, for deep frying,  olive oil, for frying,  3 shallots, halved lengthwise and then sliced,  2 garlic cloves, finely chopped,  2 tbsp sugar,  1 tsp fennel seeds,  good pinch dried chilli flakes, to taste,  1 tsp sea salt,  1 tsp freshly ground black pepper,  50ml\/2fl oz red wine vinegar,  8-12 soft tomatoes, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_chicken_croquettes_49002"}