{"recipe_name":"Roast chicken thigh, cannelloni of chicken breast with buckwheat salad","author":"Colin McGurran","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken breast, preheat the oven to 110C\/225F\/Gas ¼.  Brush the chicken breast with the clarified butter, then rub on the Dijon mustard and dust evenly with the five spice. Place chicken breast on a baking tray and cook for 15 minutes, then remove from the oven and leave to cool. Once cool, slice lengthways on a meat slicer, or cut into thin strips by hand, to make long thin slices. Lay the slices overlapping onto a sheet of baking parchment. For the buckwheat salad, in a bowl mix the tomatoes, parsley, buckwheat and shallot. Season with salt and pepper and add lemon juice to taste. Stir in the mascarpone. Put the mixture in a pan and warm when ready to serve. For the chicken leg, preheat a pan on the hob. Season the leg with salt and pepper, then add it to the pan and cook for four minutes. Turn the leg over and add the butter, garlic and thyme and baste the leg until fully cooked. Allow to rest for five minutes before serving. To prepare the garnish, in a pan melt the butter with a tablespoon of water and gently fry the Little Gem, mushrooms and radishes until soft. Meanwhile, spoon the warm buckwheat salad mix onto the sliced chicken breast and carefully roll into a tube, like cannelloni, using the baking parchment to help you.  To serve, remove the buckwheat and chicken roll from the paper, cut into two and place half on each serving plate. Cut the chicken leg in half and place some on each plate. Place the mushrooms and radishes next to the chicken and lay the baby gem over the leg. Finish with chicken sauce and crushed cobnuts. ","ingredients":" 1 large chicken breast, skin removed,  50g\/1¾oz clarified butter, to baste,  20g\/¾oz Dijon mustard,  2 tbsp Chinese five-spice,  2 tomatoes, peeled, deseeded and chopped into small pieces,  50g\/1¾ fresh flatleaf parsley, chopped,  200g\/7oz roasted buckwheat, cooked according to packet instructions,  1 shallot, finely chopped,  salt and freshly ground black pepper,  squeeze lemon juice,  2 tbsp mascarpone cheese,  1 chicken leg, bone removed,  salt and freshly ground black pepper ,  50g\/1¾oz unsalted butter,  1 garlic clove, smashed and left whole,  2 sprigs fresh thyme, leaves picked,  30g\/1oz butter,  30g\/1oz oyster mushrooms, chopped,  1 Little Gem lettuce, leaves separated,  3 pickled radishes, cut into quarters,  50ml\/2fl oz chicken sauce ,  8 cobnuts, crushed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_chicken_thigh_41789"}