{"recipe_name":"Roast chicken vindaloo ","author":"Atul Kochhar","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the vindaloo spice mix, put all the ingredients in a container and mix to combine. For the chicken vindaloo, mix the garlic paste, palm vinegar, spice mix, oil and salt together to form a paste. Rub the paste on the chickens and carrots. Set aside to marinate for an hour. Preheat the oven to 200C\/400F\/Gas 6. For the vindaloo gravy, heat the oil in a wok or large frying pan. Add the cinnamon stick and garlic and gently fry until the garlic is translucent.  Add the chopped onions and cook until light-brown. Add the vindaloo spice mix and gently fry for 2-3 minutes, then stir in the tomatoes, vinegar and palm sugar and cook for 3-5 minutes. Pour in the chicken stock and simmer for 5-6 minutes. Season, to taste, with salt and stir through the chopped coriander leaves. Keep warm until ready to serve. For the chicken vindaloo, put the chickens and carrots on a roasting tray and cook for 15 minutes. Baste the chickens and cook for a further 15 minutes.  Remove the chickens from the oven and set aside to rest for 10-15 minutes. Meanwhile, make the masala corn. Melt the butter in a pan, then add the chilli powder, lime juice, chat masala and sugar and let it simmer for a few minutes.  Add the frozen sweetcorn kernels and cook until warm. Sprinkle with chopped coriander leaves and keep warm until ready to serve.  Joint the chicken and serve with the carrots, masala corn and vindaloo gravy. Garnish with watercress leaves. ","ingredients":" 1 tsp ground cumin ,  1 tbsp ground coriander ,  1 tsp turmeric ,  ½ tsp ground ginger,  1 tsp ground cinnamon,  ½ tsp ground cloves,  1 tsp ground black pepper ,  ½ tsp ground fenugreek seeds,  1 tsp mustard powder,  1 tsp red chili powder,  3 tbsp garlic paste,  3 tbsp palm vinegar or red wine vinegar,  2 tbsp vindaloo spice mix (from above),  2 tbsp oil ,  salt, to taste,  2 double (large) poussin or small chickens, oven-ready with skin on,  16-20 baby carrots ,  watercress leaves, to garnish,  2 tbsp sunflower oil,  1 cinnamon stick,  3 garlic cloves, sliced,  2 medium onions, finely chopped,  1 tbsp vindaloo spice mix,  2 medium tomatoes, pureed ,  2 tbsp palm vinegar or red wine vinegar,  1 tsp palm sugar,  100ml\/3½fl oz chicken stock,  salt, to taste,  1 tbsp chopped fresh coriander leaves,  70g\/2½oz butter,  ½ tsp red chilli powder,  2 tbsp lime juice,  1 tsp chaat masala,  1 tsp caster sugar,  300g\/10½oz frozen sweetcorn kernels ,  2 tbsp chopped fresh coriander leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_chicken_vindaloo_38973"}