{"recipe_name":"Beetroot and mascarpone risotto with crumbled Wensleydale cheese","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the risotto, blend the beetroot with half of the stock in a food processor until smooth. Transfer to a saucepan, bring the boil and reduce the heat so the liquid is at a simmer. Heat the butter in a large saucepan over a medium heat. Add the chopped shallots, garlic and thyme leaves.  Cook gently for 1-2 minutes until softened. Add the rice to the pan and stir to coat all the grains in the buttery mixture.  Cook, stirring, for another 1-2 minutes until the grains begin to look translucent. Add the wine to the pan and allow it to bubble up and reduce slightly. Add a ladleful of the simmering beetroot stock, and stir until all of the liquid has been absorbed. Continue adding the stock, a ladleful at a time, as the liquid is absorbed, stirring between each addition. When you have used all of the beetroot stock, heat the remaining vegetable stock and start adding that to the risotto in the same way (you may not need all of it).  Cook the rice until the grains are tender but retain some bite. This will take at least 20 minutes. When the rice is cooked, remove from the heat and stir in the mascarpone, parmesan, chopped parsley and season with salt and freshly ground black pepper. To serve, heat the olive oil and butter in a frying pan. Add beetroot slices and sauté for 3-4 minutes, until just tender. Serve the risotto topped with the beetroot slices and the crumbled Wensleydale cheese. ","ingredients":" 6 raw beetroot, peeled, roughly chopped,  750ml\/1¼ pints vegetable stock,  30g\/1oz butter,  2 shallots, peeled, finely chopped,  2 garlic cloves, peeled, finely chopped,  2 sprigs fresh thyme, leaves only,  250g\/9oz arborio rice,  100ml\/3½fl oz white wine,  3 tbsp mascarpone,  110g\/4oz parmesan, grated,  small handful fresh parsley, chopped,  salt and freshly ground black pepper,  2 tbsp olive oil,  1 tsp butter,  1 beetroot, finely sliced ,  200g\/7oz Wensleydale cheese, crumbled","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/beetrootandmascarpon_85258"}