{"recipe_name":"Roast daurade (gilt-head bream) with Parma ham and rosemary butter sauce","author":"Daniel Clifford","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the daurade, preheat the oven to 200C\/400F\/Gas 6. Grease four pieces of greaseproof paper, the same size as the daurade fillets, with olive oil. Sprinkle the lemon zest and rosemary leaves onto each piece of paper and lay a couple of slices of Parma ham on top. Place a daurade fillet onto each piece of paper. Place the fish onto a baking tray and roast in the oven for 4-6 minutes, or until cooked through. (Alternatively, you can cook the fish on a barbecue for 4-6 minutes.) For the vegetables, heat the olive oil in a frying pan and fry the peppers, red onion and courgette for 4-5 minutes, or until golden-brown and softened. Add the Little Gem lettuce leaves and cook for a few seconds, or until the leaves have wilted. For the rosemary butter sauce, heat the olive oil in a frying pan and sweat the shallots and garlic for 4-5 minutes, or until softened. Add half of the chopped rosemary, the white wine and the vinegar and cook until the volume of the liquid is about 50ml\/2fl oz.  Pass the sauce through a sieve into a clean saucepan. Add the cream and bring the sauce back to the boil, whisk in the butter until smooth and season with lemon juice and salt. Stir in the remaining chopped rosemary. To serve, place the fish onto serving plates, spoon over the rosemary butter sauce and spoon the vegetables alongside. ","ingredients":" olive oil, for greasing,  2 lemons, zest only,  bunch fresh rosemary, leaves picked,  8 slices Parma ham,  4 daurade (gilt-head bream) fillets, scaled and pin-boned (ask your fishmonger to do this for you),  2 tbsp olive oil,  2 red peppers, roasted, skinned, sliced into long strips,  2 green peppers, roasted, skinned, sliced into long strips,  2 red onions, roughly chopped,  1 courgette, roughly chopped,  1 Little Gem lettuce, leaves separated,  2 tbsp olive oil,  2 banana shallots,  4 garlic cloves,  ½ bunch rosemary, leaves picked, chopped,  500ml\/18fl oz dry white wine,  250ml\/9fl oz champagne vinegar,  4 tsp double cream,  250g\/9oz butter,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_daurade_gilthead_11728"}