{"recipe_name":"Halibut with langoustine, pickled cucumber salad, mint and yoghurt dressing","author":"Nick Nairn","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pickling mix, place all the ingredients with two tablespoons water in a sauce pan and bring to a simmer. Remove from the heat then pour into a bowl and chill. For the pickle, place the cucumber in a sieve over a bowl, and sprinkle with half the salt and leave for two minutes. Then add the shallot and radishes and sprinkle over the remaining salt and leave for a further three minutes.  Rinse under cold water and pat dry. Add the cucumber, shallots and radishes to the pickling mix, along with the ginger. For the roast halibut and langoustine, plunge the langoustine tails in boiling salted water for 40 seconds, then remove and allow to cool before peeling the shell off, retaining the meat. Meanwhile heat a large frying pan and add the oil, once hot add the halibut, skin side down, and cook for two minutes. Turn the fish over, add the butter and cook for a further two minutes. Then add the langoustine tails to the pan to warm through. For the dressing, place the yoghurt, coriander, mint, garlic and fish sauce in a jug blender and blend until smooth. To serve, spoon the yoghurt dressing onto the centre of each serving plate and place the halibut in the centre skin side up. Top with the pickle, a couple of langoustine tails and the two cresses. Arrange the remaining langoustine tails around the plate. ","ingredients":" 4 tbsp rice wine vinegar,  3 black peppercorns,  3 coriander seeds,  1 star anise,  1½ tsp caster sugar,  ½ bay leaf,  12 raw langoustines, tails only,  2 tbsp sunflower oil,  4 x 150g\/5oz halibut fillets,  50g\/2oz unsalted butter,  1 cucumber, sliced 4mm\/¼in thick,  50g\/2oz table salt,  1 banana shallot, finely sliced,  8 radishes, thinly sliced,  20g\/¾oz pickled ginger,  80ml\/6 tbsp natural yoghurt,  14g\/½oz fresh coriander,  14g\/½oz fresh mint,  1 garlic clove ,  splash Thai fish sauce ,  small handful coriander cress,  small handful amaranth cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_halibut_with_77149"}