{"recipe_name":"Roast marinated pork loin, rosemary potatoes and garlic scented mushrooms","author":"Richard Phillips","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the salts, garlic and herbs in a food processor and blend. Spread over the skin of the pork loin and chill in the fridge for two hours. Preheat the oven to 200C\/400F\/Gas 6. Wash the salt and herb rub off the pork and cut the meat into chops. Place a large ovenproof frying pan on the heat and add the oil. Once hot, add the pork and cook on both sides for 5-6 minutes. Roast the pork for 20 minutes, then reduce the oven temperature to 180C\/350F\/Gas 4 and cook for a further 1½ hours. Remove the pork from the oven and set aside to rest for 20 minutes before serving. For the potatoes, heat a large frying pan and add the oil. Once hot, add the potatoes and cook until browned all over and cooked through. Add the rosemary, season with salt and pepper, and cook for a further 3-5 minutes, or until tender. For the sauce, in a large frying pan heat the butter until melted and foaming. Add the shallots and fry for 2-3 minutes. Add the chestnut mushrooms and gently fry for 2-3 minutes, then remove them from the pan and set aside for later. Pour in the Madeira and scrape the bottom of the pan with a wooden spoon to deglaze and add flavour to the sauce. Add the porcini and their soaking liquid to the pan, then pour in the double cream and simmer until the volume of liquid has reduced by a third. Strain the sauce through a fine sieve then set aside (discarding the porcini and shallots).  For the greens, heat a large frying pan. Once hot, add the chicory and spinach and cook until wilted. For the rocket, heat a deep-fat fryer to a medium heat. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Wash and dry the rocket thoroughly. Add to the hot oil in small batches and cook for a minute, then remove and place on kitchen paper to drain. To finish the mushrooms, heat a non-stick frying pan and once hot add the chopped garlic and a knob of butter. Season with salt and pepper and cook for 3-4 minutes. Add the reserved chestnut mushrooms and stir to coat in the garlic butter. To serve, place some chicory and spinach in the centre of each plate. Place the pork on top with the mushrooms and rocket. Pour the sauce over the meat and serve the potatoes on the side. ","ingredients":" 50g\/1¾oz fine salt,  50g\/1¾oz sea salt,  4 garlic cloves,  2 tbsp flatleaf parsley,  2 tbsp fresh coriander,  2 tbsp fresh sage,  4-bone pork loin, in one piece,  2 tbsp olive oil,  500g\/1lb 2oz Maris Piper potatoes, peeled and cut into 2cm\/1in cubes,  4 sprigs fresh rosemary, leaves only,  50g\/1¾oz unsalted butter,  2 shallots, peeled and finely sliced,  200g\/7oz chestnut mushrooms,  25g\/1oz dried porcini, soaked in 100ml\/3fl oz water for 30 minutes,  100ml\/3½fl oz Madeira,  400ml\/14fl oz double cream,  1 tbsp olive oil,  100g\/3½oz baby spinach, stalks removed,  2 heads chicory, leaves removed and cut into four,  1 bunch rocket,  1 garlic clove, finely chopped,  knob of butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_marinated_pork_55410"}