{"recipe_name":"Monkfish with Iberico ham, peas, broad beans, morels and English asparagus","author":"Clare Smyth","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the parsley butter, heat the olive oil in a pan and fry the shallot, mushrooms and garlic until they are softened. Set aside to cool.  Mix the shallot and mushroom mixture in a bowl with the butter and chopped parsley. Set aside. For the monkfish, preheat the oven to 230C\/450F\/Gas 6 and clean the morels thoroughly. Heat a dash of olive oil in a saucepan and fry the shallots and morels for 2-4 minutes. Add the white wine and chicken or fish stock and cook for about 6-8 minutes, or until the volume of liquid has significantly reduced. Add the broad beans and then the peas and stir through a little of the parsley butter. Place the asparagus in a pan with a little olive oil, salt and a splash of stock and put a lid on. Cook for 2-4 minutes – it will steam in its own juices.  Heat a dash of olive oil in an ovenproof pan and cook the monkfish until nicely browned all over. Transfer to the oven to cook for four minutes. Once out of the oven place a slice of ham on top of each portion of fish so that it starts to melt while resting. Leave to rest for at least four minutes. To serve, spoon the buttery peas and broad beans onto each plate, then the asparagus and morels. Place the monkfish on top. Save the juices from the morels and the asparagus pan. Add another splash of olive oil and lemon juice to the pan juices and use this as a sauce. Serve any remaining parsley butter on the side. ","ingredients":" 1 tbsp olive oil,  1 shallot, finely chopped,  100g\/3½oz button mushrooms, finely chopped,  1 garlic clove, finely chopped,  250g\/9oz butter, cut into cubes, at room temperature,  10g\/¼oz chopped flatleaf parsley,  1 shallot, finely chopped,  100g\/3½oz morel mushrooms,  olive oil, for frying,  2 shallots, finely chopped,  100ml\/3½fl oz white wine,  250ml\/9fl oz chicken or fish stock, plus splash of stock to cook the asparagus,  100g\/3½oz broad beans,  100g\/3½oz peas,  12 spears asparagus,  salt,  4 fillets monkfish (about 130-150g\/4½-5½oz each),  50g\/1¾oz Iberico ham, thinly sliced,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_monkfish_with_93596"}