{"recipe_name":"Roast pork belly with sour cabbage, apples and prunes","author":"Olia Hercules","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pork, mix all of the ingredients together and rub the meat with it. Leave to marinade, covered, for as long as you have the time - from 1 hour to one day (in the fridge). When ready to roast, preheat the oven 200C\/180C Fan\/Gas 6. Line a large baking tray with foil and place a rack on top of the tray.  Place the pork on the rack and cook for 15-20 minutes. Reduce the oven temperature to 160C\/140C Fan\/Gas 3 and cook for a further 2 hours Meanwhile for the cabbage heat a dry frying pan and add the caraway, coriander and fennel seeds. Cook for a minute until lightly toasted, then crush in a pestle and mortar. Heat the oil in a pan and cook the onions until starting to colour. Add the sour cabbage, dried fruit, caraway, coriander, fennel and cardamom and cook for 5 minutes. Finally stir through the apples. Remove the pork from the oven and lift the rack off the baking tray. Place the cabbage mix in the base of the tray and place the pork directly on top. Cover with tin foil and place back in the oven. Cook for a further 2 hours. For the last 15 minutes, turn up the heat to highest setting again and uncover the pork so that it crisps up. when done, take it out of the oven and let the pork rest for 10 minutes. Slice or pull the pork into shreds, and serve on top of the cabbage. If there are any leftovers, eat them stuffed inside a brioche bun with the cabbage, prunes and watercress. ","ingredients":" 4 garlic cloves, crushed,  20g\/¾oz ginger, peeled and finely grated,  1 tbsp Dijon mustard,  1 tbsp maple syrup,  1 tbsp soy sauce,  1 tbsp cider vinegar,  grated fresh nutmeg,  ¼ tsp cloves,  sea salt,  1.5kg\/3lb 5oz good quality belly pork,  1 onion, thinly sliced,  1 tbsp vegetable oil,  400g\/14oz home-made sour cabbage (or good-quality saurkraut),  100g\/3½oz prunes, pitted and roughly chopped,  50g\/1¾oz dried apricots, chopped,  2 tsp caraway seeds,  1 tbsp coriander seeds,  1 tsp fennel seeds,  4 cardamom pods, seeds crushed, pods discarded,  2 green apples, cored and thinly sliced,  6 brioche buns,  bunch watercress, washed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_pork_belly_with_58636"}