{"recipe_name":"Roast rump of beef, couscous, and red wine sauce","author":"Richard Phillips","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the beef, roll the beef rump in the Turkish spice mix. Wrap the beef in cling film and chill in the fridge for three hours.  When ready to cook, preheat the oven to180C\/350F\/Gas 4. Heat two tablespoons of oil in an ovenproof frying pan to a medium heat. Unwrap the beef rump and fry the for a few minutes on all sides to brown and seal the meat.  Place the pan with the beef in the oven for 7-8 minutes. Remove from the oven, wrap the beef in cling film and leave to rest for 30 minutes. For the beef blade, heat two tablespoons of oil in a hot pan, and fry the beef to seal on all sides. Remove the beef from the pan and set aside. Pour the red wine into the pan and bring to a boil, cook until it has reduced in volume by half. Put the beef back in the pan and add the thyme, onions, carrots, and beef stock (use enough liquid to cover the meat). Cook gently for 2½ hours, topping up with more stock if needed to keep the meat covered.  Remove the meat from the cooking liquor. Continue to heat the liquor to reduce until it is a sauce consistency. Add a little butter to thicken the sauce.  For the couscous, gently fry the shallots in the oil, without colouring, until they are tender. Add the couscous and stock and cook for 10 minutes. Once the couscous is cooked and the liquid has been absorbed, add the coriander and hazelnuts and mix together. For the garnish, fry the carrots and thyme in olive olive until tender. Season to taste with salt and freshly ground black pepper. Repeat for the mushrooms and shallots. To serve, slice the beef rump and blade and pile into the centre of each plate. Garnish with the vegetables and pour over the red wine sauce. Serve the couscous in a bowl and garnish with a little fresh coriander. ","ingredients":" 300-400g\/10-14oz beef rump, trimmed of any fat or sinew,  2 tbsp Turkish spice mix,  4 tbsp olive oil,  1kg\/2lb 4oz beef blade,  500ml\/18fl oz red wine,  2 sprigs fresh thyme,  1 large onion, cut into quarters,  2 large carrots, halved,  1-1.5 litres\/1¾-2½ pints beef stock (enough to cover the meat),  knob of butter,  3 shallots, finely chopped,  1 tbsp olive oil,  450g\/1lb couscous,  600-700ml\/1lb 5oz-1lb 9oz vegetable stock,  small bunch fresh coriander, chopped, plus extra to serve,  150g\/5½oz hazelnuts, roasted, skinned and chopped,  18 baby carrots,  3 pinches chopped thyme,  3 tbsp olive oil,  salt and freshly ground black pepper,  18-34 button mushrooms,  18 baby shallots","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_rump_of_beef_26421"}