{"recipe_name":"Roast smoked haddock, leek risotto with poached egg and mustard sauce","author":"James Tanner","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Remove the skin from the haddock and place the fish in a saucepan with the fish stock and bay leaf. Bring to a simmer. Meanwhile, heat a high-sided frying pan until hot and add 50g\/1¾oz of the butter and a tablespoon of olive oil. Add the shallots and garlic and gently fry for two minutes, or until just softened. Add the rice and cook for a minute. Add the vermouth and cook until evaporated. Add the hot fish stock (used to poach the haddock) a ladleful at a time, stirring constantly, until all but 200ml\/7fl oz of the fish stock is absorbed and the rice tender. Remove from the heat. Add 60g\/2½oz of the parmesan, 25g\/1oz of butter, salt and black pepper and stir to combine. Heat a separate frying pan until hot and add 50g\/1¾oz of the butter. When melted add the leeks. Gently fry for 1-2 minutes, or until just tender then fold them into the cooked risotto. Add half the remaining butter to the frying pan the leeks were cooked in, along with a tablespoon of olive oil. Add the smoked haddock and fry for 1-2 minutes on each side until golden-brown and hot through. Strain the remaining fish stock into a small saucepan and add the whipping cream and grainy mustard. Bring to a simmer. Bring a small pan of water to the boil and add the vinegar. Poach the eggs for around 3½ minutes, or until soft poached. To serve, place a spoonful of risotto into each serving bowl. Top with the haddock then place a poached egg on top of the haddock. Using a hand blender, froth the stock and mustard mixture and spoon around the haddock. Drizzle over the remaining olive oil and sprinkle with parmesan. ","ingredients":" 400g\/14oz natural smoked haddock fillet,  1 litre\/1¾ pint fish stock,  1 bay leaf,  150g\/5½oz unsalted butter,  4 tbsp olive oil,  3 shallots, chopped,  2 garlic cloves, finely chopped,  200g\/7oz arborio risotto rice,  6 tbsp dry vermouth,  75g\/2½oz parmesan,  1 leek, finely sliced,  110ml\/4fl oz whipping cream,  1 heaped tsp grainy mustard,  50ml\/2fl oz white wine vinegar,  2 free-range eggs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_smoked_haddock_95102"}