{"recipe_name":"Roast squash and tomato soup with chestnuts and bacon and croûtons","author":"Brian Turner","programme":"Christmas Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the soup, preheat the oven to 210C\/190C Fan\/Gas 6. Arrange the squash wedges and tomato halves on a baking tray. Sprinkle over the garlic and thyme, drizzle over 2 tablespoons of the oil, then season, to taste, with salt and freshly ground black pepper. Roast in the oven for 25-30 minutes, or until tender and golden-brown. Meanwhile, for the brie and mustard croûtons, preheat the grill to its highest setting. Place the baguette halves on a baking tray, cut sides facing upwards, and grill until toasted.  Mix the brie and mustard in a small bowl until well combined. Spoon the mixture onto the toast, then cut the toast into cubes. Set aside until needed (keep warm). Peel away the skins from the cooked butternut squash wedges, then transfer the flesh to a large saucepan, along with the cooked tomatoes and garlic. Discard the thyme.  Pour over the stock and bring the mixture to the boil. Continue to boil for 2-3 minutes, then set aside to cool slightly. Using a hand-held blender, blend the soup to a smooth purée.  Heat the remaining oil in a frying pan over a medium heat. Add the diced bacon and fry for 3-4 minutes, or until light golden-brown. Stir the cooked bacon into the soup, along with the chestnuts. Sprinkle over the parsley, season again if necessary, and serve in bowls with the croûtons alongside. ","ingredients":" 1 butternut squash, cut into wedges, seeds removed,  8 tomatoes, skins removed, de-seeded, cut in half,  4 garlic cloves, roughly chopped,  small sprig fresh thyme,  3 tbsp rapeseed oil,  1 litre\/1¾ pints chicken stock,  4 rashers bacon, diced,  8 pre-cooked chestnuts (you can buy vacuum-packed chestnuts from larger supermarkets or delicatessens), diced,  salt and freshly ground black pepper,  2 tbsp chopped fresh parsley, to garnish,  2 small baguettes, cut in half lengthways,  175g\/6oz brie, diced,  1 tsp Dijon mustard","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_squash_and_tomato_02436"}