{"recipe_name":"Roast turkey breast with black pudding and thyme baked potatoes","author":"Brian Turner","programme":"Christmas Kitchen with James Martin","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Lift the skin of the turkey and lay slices of black pudding under the skin to cover (you will not use all the black pudding for this).  Fold the skin back to its original place and secure with cook's string. Place in a buttered roasting tin. Smear the turkey skin with half the butter and roast for 35-45 minutes, or until cooked through. Set aside in a warm place to rest for at least 15 minutes. Meanwhile, in a frying pan, heat the oil then add the bacon and fry until golden-brown and crisp. Remove with a slotted spoon and set aside to drain on kitchen paper. Using the same oil, fry the bread croûtons until crisp and golden brown on all sides. Set aside to drain on kitchen paper. Put the bacon and croûtons in a bowl. Chop the remaining black pudding into 5mm\/¼in cubes and add to the bowl. Beat the eggs in a small bowl and add the cream. Season with salt and black pepper and pour over the black pudding mixture. Stir in the parsley. Grease six dariole moulds with butter. Pack the black pudding mixture well in the moulds. Place the moulds into a roasting tin and pour boiling water around until it comes halfway up the sides of the moulds. Bake for about 30 minutes, or until set. Remove from the oven and set aside in a warm place. Meanwhile, in a roasting tin over a medium heat, melt the butter and fry the potatoes on one end until golden-brown. Turn them over and add the stock to the pan so that it comes halfway up the sides of the potatoes. Add the thyme. Season with salt and freshly ground black pepper and bake at 180C\/350F\/Gas 4 for 30-40 minutes, or until tender, brushing regularly with melted butter. When everything is ready, remove the string from the turkey and carve into slices. Serve with the black pudding stuffing and potatoes alongside. ","ingredients":" 1 x 1.1kg\/2lb 7oz turkey breast, bones removed, skin on ,  110g\/4oz butter, plus extra for greasing,  675g\/1lb 8oz black pudding, sliced into 1cm\/½in rounds,  2 tbsp oil,  2 rashers back bacon, chopped,  4 slices white bread, crusts removed, cut into 5mm\/¼in cubes,  2 free-range eggs,  4 tbsp double cream,  salt and freshly ground black pepper,  1 tbsp chopped parsley,  55g\/2oz melted butter, plus extra for brushing,  1.5kg\/3lb 5oz floury potatoes, cut into 5cm\/2in long cylinders,  300ml\/½pt chicken stock,  1 bunch of thyme","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roast_turkey_breast_with_14428"}