{"recipe_name":"Roast baby chicken with chicken livers and chickpea salad","author":"Richard Phillips","programme":"Put Your Money Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, preheat the oven to 180C\/350F\/Gas 4. Place the chickens on a roasting tray, brush them with olive oil and then rub with the ground ginger and cumin. Season well with salt and freshly ground black pepper and roast for 35 minutes, or until the juices run clear when a skewer is inserted into the leg joint. Remove from the oven, cover with foil and allow to rest. Meanwhile, for the chickpea salad, combine the chickpeas, parsley, lemon zest and olive oil in a large mixing bowl. Preheat the grill to high and place the sausage on a tray under the grill to cook for three minutes on each side. Remove from the heat, slice into short lengths and add to the chickpeas. Mix well and season, to taste, with salt, pepper and the lemon juice. Set aside. For the chicken livers, heat the olive oil and butter in a frying pan until foaming. Season the chicken livers with salt and freshly ground black pepper and fry over a high heat for two minutes, turning once, until browned on the outside but still slightly pink in the centre. Remove from the heat and leave to rest in a warm place. For the molasses dressing, pour all of the ingredients for the dressing into a jar with a screw-top lid. Shake vigorously and taste, adding more salt and freshly ground black pepper if necessary.  To serve, combine the rocket and half of the dressing in a bowl and mix well. Carve the breasts and legs from the chickens. Serve a breast and leg for each person, accompanied by the livers, chickpea salad, dressed rocket and a sprinkling of pomegranate seeds. Drizzle over any remaining dressing. ","ingredients":" 2 whole baby chickens (poussins),  2 tbsp olive oil,  1 tsp ground ginger,  1 tsp ground cumin,  salt and freshly ground black pepper,  200g\/7¼oz canned chickpeas, drained,  small bunch flatleaf parsley, chopped,  1 lemon, zest and juice,  1 tbsp olive oil,  1 merguez sausage,  salt and freshly ground black pepper,  dash olive oil,  knob of butter,  100g\/3½oz chicken livers, trimmed,  salt and freshly ground black pepper ,  1 tbsp pomegranate molasses (available from Middle Eastern grocers and some supermarkets),  90ml\/3fl oz olive oil,  1 tbsp white wine vinegar,  salt and freshly ground black pepper,  handful rocket leaves,  1 pomegranate, seeds only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastbabychickenwith_91388"}