{"recipe_name":"How to cook roast beef with Yorkshire puddings","author":"Mike Robinson","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/roastbeefwithyorkshi_90258_16x9.jpg","method":"For the beef, preheat the oven to 190C\/375F\/Gas 5. Take the beef out of the fridge and allow it to get to room temperature. Mix the mustard powder with a bit of water to make a paste. Rub the beef all over with the mustard paste. Heat the duck fat or vegetable oil in a large, heavy-bottomed frying pan. When hot, add the beef and sear on all sides, until it is nicely brown all over. Season with salt and freshly ground black pepper. Place the beef in a roasting tin and roast in the oven for one hour (this will give you rare meat). Cook for a further 15 minutes for medium-rare or a further half an hour for well-done. Make the Yorkshire pudding batter. Mix together the flour, eggs milk and salt, whisking if necessary to remove any lumps. The batter should just coat the back of the spoon. Allow the batter to rest for at least an hour, preferably overnight. While the beef is cooking, prepare the potatoes. Peel the potatoes and parboil them until almost cooked (they will still feel firm when pierced with a knife). Drain thoroughly, shaking them in the colander until the outsides are fluffy. When the beef is cooked to your liking, remove the beef from the oven, cover with foil and allow it to rest in a warm place for 30 minutes. Turn up the oven to 200C\/400F\/Gas 6. While the beef is resting, finish the roast potatoes. Heat the duck fat in a large frying pan or roasting tin. Toss the potatoes in the pan or tin to coat with the duck fat. Crush the garlic cloves with the heel of your hand and add to the pan. Strip the leaves from the thyme and add to the tin. Season with salt and brown the potatoes lightly. When browned, place the potatoes in a tin large enough to accommodate and roast for 30-35 minutes or so, until golden and crunchy. Next make the Yorkshire puddings. Pour 5mm\/½inch of vegetable oil or beef dripping into each well of a Yorkshire pudding tin. Place the tin in the oven to heat for a few minutes. When the oil or dripping is hot, remove from the oven. Give the Yorkshire batter a stir and carefully pour it into the tin. Take care, as the oil may splatter. Fill each well up to about halfway. Place the tin back in the oven for about 25-30 minutes, until risen and golden. While the potatoes and Yorkshire puddings are in the oven, make the gravy. Remove the beef from its roasting tin and pour the pan juices into a large saucepan. Place the tin with its browned bits on the hob over a medium heat. Stir in the salt, flour and the red wine. Scrape well and get all the bits into the gravy from the bottom of the tin. Pour the liquid into the saucepan and cook for about ten minutes. Adjust the seasoning if necessary. To serve, carve the beef into thick pieces and pile on plates with the Yorkshire puddings and potatoes. Pour lashings of gravy over the top. ","ingredients":" 2.5kg\/5½lb rib eye of beef, on the bone,  1 tbsp English mustard powder,  2 tbsp duck fat or a drizzle of vegetable oil,  salt and freshly ground black pepper,  250g\/9oz plain flour,  3 large or 4 medium free-range eggs,  300ml\/½ pint milk,  pinch salt,  vegetable oil or beef dripping, melted,  12 medium Maris Piper or King Edward potatoes,  4 tbsp duck fat,  6 garlic cloves,  6 sprigs fresh thyme,  sea salt,  pan-roasting juices,  1 tbsp flour,  250ml\/9fl oz red wine,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastbeefwithyorkshi_90258"}