{"recipe_name":"Roast belly of pork with root vegetables","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"The night before, boil a kettle and pour the boiling water over the pork skin. Pour the cider vinegar onto the meat and rub all over thoroughly. Place the joint on a plate covered with kitchen paper, in the bottom of the fridge, overnight.  Preheat the oven to 200C\/400F\/Gas 6.   Rub the dripping or butter, crushed bay leaves and garlic all over the pork. Season with black pepper and sea salt and set aside. Place the pork skin-side up on a wire rack that fits over an empty roasting tray. Place the pork into the oven and roast for one hour and then reduce the oven temperature to 180C\/350F\/Gas 4.   Meanwhile, for the root vegetables, place the prepared vegetables into a  clean, sturdy roasting tray and add the thyme, olive oil and a glass of water. Mix all the ingredients well in the tray. Remove the empty tray underneath the pork and carefully spoon over any fat that has gathered in the bottom of the tray over the vegetables. Place the pork on the wire rack over the vegetable tray and transfer back into the oven.   Roast the pork and vegetables for a further hour, basting the vegetables with the juices from the pork in the bottom of the pan from time to time. Remove the pork and vegetables from the oven. Place the pork on a carving board and allow to rest for 15 minutes in a warm place. Remove the vegetables from the tray and transfer them into a serving bowl. Place the spinach leaves into the bowl, mix into the vegetables and also keep warm. Spoon off any fat in the vegetable tray leaving the cooking juices behind. Place onto a hob on a medium to high heat and add the pre-made red wine gravy, mixing the juices and the gravy together and bring up to the boil. Carve off the crackling in one piece and, using a sharp knife, cut into portions. Carve the pork belly into slices.  Serve the sliced pork with the roasted root vegetables and gravy. ","ingredients":" 1.8kg\/3lb 12oz belly pork, skin on,  4 tbsp cider vinegar,  3 tbsp pork dripping or butter,  8 bay leaves, crushed,  8 garlic cloves, finely chopped,  1 tbsp crushed black peppercorns,  2 tbsp sea salt,  4 parsnips, cut into quarters,  6 whole, peeled shallots,  1 whole head of garlic, peeled and sliced in half,  400g\/14oz carrots, cut into quarters,  3 sprigs fresh thyme,  1 tbsp olive oil,  250g\/9oz baby leaf spinach,  400ml\/14fl oz pre-made red wine gravy","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastbellyofporkwith_84057"}