{"recipe_name":"Roast chicken stuffed with sun-dried tomato butter, white beans and chorizo","author":"Jun Tanaka","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, preheat the oven to 200C\/400F\/Gas 6. Blend the tomatoes and garlic together in a food processor to make a smooth paste.  Add the breadcrumbs, parmesan and butter to the tomato and garlic paste and stir to combine to make tomato butter. Put the tomato butter into a piping bag. Using your fingers, lift the skin off the breast very gently from the neck end, pushing down towards the base to make a pocket and leaving the sides intact.  Pipe the butter under the skin and all over the breasts. Spread gently with your fingers, making sure that the skin doesn't break.  Brush the chicken lightly with the olive oil and season with salt and freshly ground black pepper, to taste. Place on a baking tray and roast in the oven for 20-25 minutes, or until the chicken is cooked all the way through - you can check if the chicken is cooked by piercing the thickest part of the meat with a skewer, if the juices run clear the chicken is cooked. (Stuffing the chicken breasts under the skin with tomato butter will keep the breast really moist so there's no need to baste it while cooking.) Remove the chicken from the oven, cover with foil and rest for 10 minutes in a warm place. For the chorizo and peppers, heat a frying pan until hot, add the oil, chorizo, peppers and onion and cook for five minutes.  Season with salt and freshly ground black pepper, add the garlic and chilli, cook for another minute and then stir in the sherry vinegar and basil.   Add the drained beans and allow to warm through. To serve, remove the chicken breasts using a sharp knife and serve the chicken on top of the chorizo, peppers and beans. ","ingredients":" 50g\/2oz sun-dried tomatoes in olive oil,  1 garlic clove, roughly chopped,  40g\/1½ oz dried breadcrumbs,  2 tbsp freshly grated parmesan,  75g\/3oz unsalted butter, softened ,  2 free-range chicken crowns (the whole chicken without the legs),  50ml\/2fl oz olive oil,  salt and freshly ground black pepper,  50ml\/2fl oz olive oil,  200g\/7oz cooking chorizo, sliced,  1 red pepper, seeds removed, sliced,  1 yellow pepper, seeds removed, sliced,  1 red onion, sliced,  salt and freshly ground black pepper,  1 garlic clove, crushed to a paste,  ½ red chilli, finely chopped,  1 tbsp sherry vinegar,  ½ bunch fresh basil, roughly chopped,  1 x 400g\/14oz can butter beans, drained and rinsed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastchickenstuffedw_91366"}