{"recipe_name":"Roast poussin with roast potatoes, herb stuffing and sautéed spinach","author":"Tony Tobin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the roast chicken, rub the chicken with olive oil, salt and freshly ground black pepper. Heat an ovenproof frying pan, place the chicken into the pan skin-side down and fry for five minutes, or until golden-brown. Turn over the chicken, then place the pan into the oven and roast for ten minutes, or until the chicken is cooked through - check that the juices run clear when pierced with a skewer. Remove from the oven and keep warm. For the gravy, place the baby chicken carcass into a hot ovenproof frying pan with a drizzle of olive oil and fry on all sides until browned. Place the frying pan into the oven and roast the carcass for ten minutes. Remove the pan from the oven and discard the carcass. Add the red wine to the pan and place over a high heat. Stir well with a wooden spoon to scrape up the bits from the bottom of the pan. Add the balsamic vinegar and water and simmer for 6-7 minutes, or until the gravy has reduced by half. Season well with salt and freshly ground black pepper, add the butter and stir. For the roast potatoes, boil the new potatoes in salted water for ten minutes. Drain well, then grate the skin of the potatoes slightly to make rough edges. Heat the butter and olive oil in an ovenproof frying pan. Add the potatoes, season well with salt and freshly ground black pepper and fry on all sides until turning golden-brown. Place in the oven and roast for five minutes. Remove from the oven and keep warm. For the stuffing, mix the breadcrumbs, herbs and salt and freshly ground black pepper together in a bowl. Add the egg white and stir to combine. Roll the mixture into balls. Heat the butter in a frying pan, add the stuffing balls and fry over a gentle heat until golden-brown on all sides. For the sautéed spinach, heat the butter in a frying pan, add the spinach and a splash of boiling water and stir for one minute. Season well with salt and freshly ground black pepper and stir. Drain off the excess water. To serve, pile the spinach onto a serving plate and top with the roast chicken. Place the roast potatoes and stuffing balls alongside and pour over the gravy. ","ingredients":" 1 poussin (baby chicken) supreme,  1 tbsp olive oil,  salt and freshly ground black pepper,  1 poussin (baby chicken) carcass,  olive oil, for drizzling,  175ml\/6fl oz red wine,  2 tsp balsamic vinegar,  75ml\/2½fl oz boiling water,  salt and freshly ground black pepper ,  30g\/1oz butter,  200g\/7oz new potatoes,  1 tbsp olive oil,  30g\/1oz butter,  salt and freshly ground black pepper,  55g\/2oz breadcrumbs,  1 tbsp chopped fresh coriander ,  2 tsp chopped fresh thyme ,  1 tbsp chopped fresh parsley ,  salt and freshly ground black pepper,  1 free-range egg white,  30g\/1oz butter,  1 tbsp butter,  125g\/4½oz baby spinach,  splash boiling water,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastchickenwithroas_87958"}