{"recipe_name":"Roast chicken with sage and goats' cheese gnocchi","author":"Tony Tobin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the gnocchi, place the whole potatoes into a saucepan with plenty of water and bring to the boil. Simmer for 20-25 minutes or until tender. Remove from the water and peel the skins off while still warm. Place the potato flesh into a bowl and mash until smooth. Add half of the flour and gently work into the potato. Add the goats' cheese and gently mix then add the remaining flour and gently mix to form a dough. Roll out the dough onto a clean, floured surface to form a sausage-shape with a diameter of about 2cm\/0.5inch and cut into 2cm\/0.5inch pieces. Bring a large pan of salted water to the boil and drop in the gnocchi. Remove the gnocchi with a slotted spoon when they float to the surface.  Refresh in a bowl of iced water, drain well and place onto abaking tray to dry. Meanwhile, preheat the oven to 200C\/390F\/Gas 6. For the chicken, gently lift up the skin of each chicken breast, leaving it attached to the flesh, and place three sage leaves under the skin of each. Lay the skin back over the sage leaves and rub butter on top of the skin. Season with salt and freshly ground black pepper. Place the chicken in a heavy-based, ovenproof pan and roast in the oven for 10 minutes. Reduce the oven temperature to 150C\/300F\/Gas 2 and roast for a further 15 minutes. Remove the chicken breasts from the pan and keep warm. Add the stock to the pan and place over a high heat. Boil until reduced in volume by half. Add the gnocchi and cream to the stock, return to the boil and allow to thicken slightly. Season to taste with salt and freshly ground pepper. Heat a frying pan until hot then and add the olive oil and the spinach. Cook for 1-2 minutes until wilted. Serve the chicken with the wilted spinach, gnocchi and creamy sauce. ","ingredients":" 2 large potatoes, skin on,  200g\/7oz plain flour, plus extra for dusting,  150g\/5oz strong goats' cheese,  4 x 200-225g\/7-8oz chicken breasts, skin on,  12 sage leaves,  50g\/2oz butter, softened,  200ml\/7fl oz fresh chicken stock,  150ml\/5fl oz double cream,  1 tbsp olive oil,  1 bag washed spinach,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastchickenwithsage_84325"}