{"recipe_name":"Roast chicken with savoury bread pudding and tarragon","author":"Richard Corrigan","programme":"MasterChef","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the bread pudding: put the milk, bay leaf, thyme, garlic, cloves, lemon zest and a little nutmeg in a saucepan and heat until bubbles form around the edge of the pan. Remove from the heat and set aside to infuse for 20 minutes. Meanwhile prepare the moulds. Brush all over the inside of four chilled dariole moulds with a thin layer of melted butter, then return to the fridge or freezer to chill until the butter has set. Brush with another layer of melted butter and chill again. Put the bread in a bowl, strain over the flavoured milk and leave to soak for 20 minutes. Preheat the oven to 180C\/350F\/Gas4. To prepare the chicken for roasting: set it in a small roasting tin or dish. Squeeze the juice from one lemon half over the bird and put the squeezed half inside the body cavity with some thyme. Truss the bird by tying up the wingtips to the knuckle joints on the legs. Spread softened butter all over the bird, then sprinkle with more thyme (leaves and\/or flowertips). Put the chicken into the oven and roast for 1½-1¾ hours, basting with the juices in the tin from time to time. To test if the chicken is cooked pierce the meaty part of the thigh with the tip of a sharp knife, the juices that run out should be clear. Meanwhile, finish the bread pudding. Melt a small knob of butter in a pan and sweat the onion until very soft but not coloured. Add to the soaked bread. Lightly beat the egg with the egg whites and add to the bowl. Mix together thoroughly and season. Spoon into the buttered dariole moulds. Set the moulds on a layer of folded newspaper in a small roasting tin and pour hot water into the tin to come half way up the sides of the moulds.  Put into the oven with the chicken to bake for 1 hour. When the chicken has finished cooking, put it on a carving board and set aside in a warm place to rest for 15 minutes. Skim off some of the fat from the juices in the tin. Set the tin over a moderate heat, add the wine and bring to the boil. Check the seasoning, then add a squeeze of lemon juice and the tarragon. Keep hot. Carve the chicken and divide among the hot plates. Turn out the bread puddings and put one on each plate. Moisten the chicken and puddings with the sauce and serve. ","ingredients":" 1 organic free-range chicken (about 1.5kg\/3lb50z),  1 lemon, halved,  fresh thyme,  softened, unsalted butter,  1 glass white wine,  1 tbsp fresh tarragon, chopped,  450ml\/16fl oz milk,  1 small bay leaf,  1 sprig fresh thyme,  1 garlic clove, peeled and crushed,  2 whole cloves,  grated zest ½ lemon,  freshly grated nutmeg,  unsalted butter,  150g\/5oz white bread, crust removed and broken up,  1 small onion, peeled and very finely chopped,  1 egg and 2 egg whites,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastchickenwithsavo_6594"}