{"recipe_name":"Roast citrus chicken with spiced potatoes, herby Yorkshire puddings and sesame broccoli","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the citrus chicken, season the chicken with salt and freshly ground black pepper and wrap in the streaky bacon. Heat an ovenproof frying pan and fry the chicken until golden-brown on all sides. Add the halved garlic bulb, orange and lemon wedges, squeezing the juice of a couple of the wedges into the pan, along with the red wine and cook for 3-4 minutes. Place the pan into the oven and roast for 12 minutes, or until the chicken is completely cooked through - you will know the chicken is cooked through as the juices will run clear when the meat is pierced with a skewer. For the Yorkshire puddings, place the flour and salt into a large bowl. Make a well in the middle of the flour and place the beaten eggs and two tablespoons of water into the well. Using a wooden spoon, stir until you have a smooth thick batter. Gradually add the rest of the water and milk, stirring continuously until all the liquid has been incorporated. Stir in the chives. Cover with cling film and leave to rest for ten minutes. Divide the oil among the wells of a muffin tray, place in the oven and heat for five minutes, or until very hot. Carefully remove the muffin tray from the oven and pour the batter into the holes. Place in the oven and bake for 15 minutes, or until well risen and golden-brown. Do not open the oven during this time or the Yorkshire puddings will not rise. Remove from the oven and serve hot. For the spiced potatoes, place the potato cubes into a pan of boiling salted water and boil for six minutes, or until just tender. Drain well. Heat the olive oil and butter in a frying pan, add the cooked potatoes, turmeric and paprika and toss well. Fry over a medium heat for ten minutes, or until golden-brown on all sides. For the sesame broccoli, heat a wok and add the broccoli florets, a splash of water, the orange juice, sesame oil and soy sauce. Cover with a circle of greaseproof paper and cook for 4-5 minutes. Remove the paper, season well with salt and freshly ground black pepper and sprinkle with toasted sesame seeds. To serve, pile the spiced potatoes onto a serving plate. Top with the citrus roast chicken and serve with the herby Yorkshire puddings and sesame broccoli. ","ingredients":" 1 chicken supreme or breast,  salt and freshly ground black pepper,  3 rashers streaky bacon,  1 bulb garlic, cut in half through the middle,  1 orange, cut into wedges,  1 lemon, cut into wedges,  100ml\/3½fl oz  red wine,  110g\/4oz plain flour,  pinch salt,  2 medium free-range eggs, beaten,  100ml\/3½fl oz water,  200ml\/7fl oz milk,  2 tbsp chopped fresh chives ,  3 tbsp vegetable oil,  1 large potato, cut into large cubes,  1 tbsp olive oil,  25g\/1oz butter,  1 tsp ground turmeric,  1 tsp ground paprika,  salt and freshly ground black pepper,  1 head broccoli, cut into florets,  splash water,  ½ orange, juice only,  2 tbsp soy sauce,  1 tsp sesame oil,  salt and freshly ground black pepper,  1 tbsp sesame seeds, toasted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastcitruschickenwi_88032"}