{"recipe_name":"Roast duck breast with cherry sauce","author":"Antony Worrall Thompson","programme":"Saturday Brunch","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First, prepare the duck. Score the skin a couple of times with a sharp knife. Season well. Heat a frying pan with a little olive oil. When hot, sear the duck, skin side down, until golden brown. Remove from the heat and put the duck breasts into a baking dish. Cook in a hot oven for four minutes (rare); seven minutes (medium); 10 minutes (well done). Remove the duck from the oven to rest. Meanwhile, make the cherry sauce. Sauté the shallot over a gentle heat until transparent. Now add the jam, wine and raspberry vinegar. Let the mixture bubble gently until it reduces to a syrup. Remove from the heat and stir in the orange juice. Serve immediately or keep warm in a bain marie. To make the lettuce and peas, slice the shallots and sauté gently in the butter. When soft, add the Little Gem lettuces cut side down. Allow to gently brown and soften. Now add the peas and the stock. Cover the pan and simmer for 10 mins until the peas and lettuce are cooked. Take the pan off the heat and stir in the remaining butter. Add the parsley and season.   Serve immediately with the duck sliced into three, placed on top of the braised lettuce. Drizzle over the cherry sauce. ","ingredients":" 4 duck breasts,  sea salt and freshly ground black pepper,  olive oil,  1 shallot, finely chopped,  75g\/2½oz cherry jam,  1 tbsp red wine,  1 tbsp raspberry vinegar,  1 orange, juice only,  4 shallots,  50g\/1¾oz butter ,  3 Little Gem lettuce hearts,  100g\/3½oz frozen peas,  100g\/3½oz chicken stock ,  2 small knobs of butter,  small bunch of flatleaf parsley,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastduckbreastwithc_72370"}