{"recipe_name":"Roast duck rolled in liquorice charcoal with tamarind and lime","author":"Glynn Purnell","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the roast duck, mix the roasted liquorice roots with the liquorice powder in a bowl and set aside. Preheat the oven to 220C\/425F\/Gas 7. Heat an ovenproof frying pan until hot and fry the duck breast, skin-side down, for 4-5 minutes, or until the skin is crisp and golden-brown. Drain off the fat, turn the duck breast over and roast in the oven for 8-10 minutes (for medium), or until cooked to your liking. Remove the duck from the oven, sprinkle over one tablespoon of the liquorice powder and roll the duck so that it is evenly covered. Set aside to rest in a warm place. For the tamarind purée, place the tamarind fruit into a medium non-reactive pan, add the lime juice and enough water to cover the tamarinds and simmer for 10-15 minutes, or until softened. Drain, pass through a sieve to remove the stones and then blend with a hand blender until smooth. Set aside and keep warm.  For the licorice purée, place the licorice into a small pan, add a little water and place over a low heat until melted. Blend with a hand blender until smooth, pass through a sieve and keep warm.  For the beans and rocket, drop the green beans into a large pan of salted water and blanch for 2-3 minutes. Drain and refresh in iced water. Chop half of the rocket and heat in a frying pan with the chicken stock. Stir in the butter, remaining rocket and blanched beans. To serve, trim the liquorice sticks until they resemble cocktail sticks. Carve the duck breast and stick the cocktail sticks into the centre of each piece of duck breast. Smear a spoonful of liquorice purée onto each of 4 serving plates and place the pieces of duck breast on top. Place the beans in a line next to the duck and drizzle over some of the tamarind purée. Scatter over some rocket leaves. ","ingredients":" 100g\/3½oz liquorice sticks, roasted until blackened, blended into a powder,  2 tbsp liquorice powder,  4 Gressingham duck breasts, trimmed, fat scored,  100g\/3½oz liquorice sticks,  15 tamarind fruit, pods removed,  ½ lime, juice only,  20 pieces black licorice,  100ml\/3½fl oz water,  100g\/3½oz green beans, finely diced,  100g\/3½oz rocket, plus extra, to serve,  25g\/1oz butter,  200ml\/7¼fl oz chicken stock,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastduckrolledinliq_93904"}