{"recipe_name":"Roasted breast of Gressingham duck with baby vegetables and griottine cherries","author":"Mark Jordan","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the duck jus, preheat the oven to 180C\/350F\/Gas 4. Put the duck bones, onion, carrot, leek and garlic into a roasting tray and cook in the oven for 30-40 minutes or until they are golden-brown. Remove from the oven and place into a large deep saucepan.  Pour over the veal jus, add the thyme and star anise and top up with water if needed. Bring to the boil, skimming off any impurities that foam on the top.  Simmer the stock for around four hours then pass through a fine cloth.  Place the port and vanilla pod into a saucepan and simmer until reduced in volume and the consistency of a thick syrup. Add the duck stock and reduce again to a gravy-like consistency. Set aside until ready to serve. For the potatoes,  preheat the oven to 180C\/350F\/Gas 4. Cut the large potatoes in half widthways. Using a 3cm\/1in diameter pastry cutter, cut two cylinders out of each potato.  Heat a deep, ovenproof saucepan and add a little vegetable oil. Place the potatoes in the pan standing on end and fry gently until golden-brown at the base.  Add the chicken stock to the pan and bring it up to the boil. Then add the garlic, thyme and butter and place into the oven for approximately 20 minutes, or until the potatoes are tender.  For the duck and vegetables, preheat the oven to 180C\/350F\/Gas 4. Heat a dry frying pan over a gentle heat and add the duck breasts skin-side down. Cook for a few minutes, or until the fat has rendered out of the breast and the meat has started to cook. When the skin is golden-brown turn the breasts over. This will take around five minutes. Place the duck in the oven for four minutes for medium-rare.  Remove from the oven and set aside to rest for at least five minutes. Heat a large pan of boiling water and cook the carrots, leeks and beans for a couple of minutes, until just tender. Refresh in ice-cold water.  In a saucepan, add a small knob of butter and gently fry the blanched baby vegetables without colouring them. Season with salt. Heat a frying pan and add the butter. Once melted, add the spinach, season with salt and pepper and cook for a few minutes. If the spinach catches on the pan add a little water. Heat up the duck jus in a small pan and add a few griottine cherries. To serve, place a small amount of the wilted spinach in the centre of each plate. Place one fondant potato on top.  Using a sharp knife, cut the duck breast in half lengthways then cut each half into three across the fillet to form duck nuggets. Arrange the duck around the fondant potato, then arrange the baby vegetables around and on the duck nuggets. Finally, spoon the cherry jus around the dish and garnish with baby beetroot cress. ","ingredients":" 2kg\/4lb 8oz duck bones,  1 onion, roughly chopped ,  1 carrot, roughly chopped,  1 leek, roughly chopped,  1 garlic clove, left whole,  475ml\/17fl oz veal jus,  1 sprig thyme,  star anise,  75ml\/2½fl oz port,  1 vanilla pod, seeds removed ,  2 large potatoes,  25ml\/1fl oz vegetable oil,  300ml\/10½fl oz chicken stock,  1 garlic clove, left whole,  1 sprig of thyme ,  50g\/1¾oz butter,  2 Gressingham duck breasts, fat trimmed,  1 bunch baby carrots, peeled and trimmed ,  1 bunch baby leeks, trimmed ,  150g\/5½oz fine green beans, trimmed,  50g\/1¾oz butter, plus extra for frying,  50g\/1¾oz baby spinach,  salt and freshly ground black pepper,  20 griottine cherries (morello cherries soaked in kirsh),  2 tbsp baby beetroot cress, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_breast_of_46928"}