{"recipe_name":"Roasted cod, peas, broad beans, Morteau sausage and chanterelles ","author":"Jason Atherton","programme":"Spring Kitchen with Tom Kerridge","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pea purée, bring a pan of water to the boil and cook the peas until tender (about 3-4 minutes). Drain the peas, reserving a little of the cooking water, and transfer to a blender. Blend to a smooth purée, adding a little of the reserved cooking water to loosen the purée, if required. Add a little olive oil, to taste, and season with salt and pepper. Pass the purée through a sieve and set aside. For the Morteau sausage, poach the Morteau sausage in simmering water for nine minutes. Remove from the heat, remove and discard the skin. Set aside to chill.  Once cool, cut the sausage into small cubes. Heat the butter in a frying pan. When foaming, add the diced sausage and cook until coloured and the fat has started to render. Set aside until ready to serve. For the vegetables, bring two pans of water to the boil and cook the beans and peas separately for a minute each.  Drain and place in a bowl of ice water to chill. Once chilled, drain again and remove the outer skins from the peas and broadbeans. Set aside until ready to serve.  Thoroughly wash the monk’s beard to remove any dirt or grit, then pick green plushes and discard the roots. Blanch in boiling water then refresh in iced water. Once cool, remove from the iced water and set aside. Heat a knob of butter in a frying pan until foaming. Fry the mushrooms in the butter for 5-6 minutes, or until golden-brown. Season, to taste, with salt and pepper. Set aside until ready to serve. For the cod, preheat the oven to 180C\/350F\/Gas 4. Place a non-stick ovenproof frying pan over a medium to high heat and add a little extra virgin olive oil. Season the fish with salt then add to the pan, skin-side down, and cook until golden-brown. Turn the fish over and place in the oven for 3-6 minutes (depending on the thickness of the fillets). To check the fish is cooked, insert a skewer into the thickest part of the fish, then touch it to your lip, when the skewer is warm the fish is ready. Meanwhile, reheat the cooked peas, broad beans, Morteau sausage and mushrooms. When hot, add the marjoram and season to taste with salt and pepper. In a separate pan, reheat the monk’s beard. Gently reheat the purée. Divide the pea and broad bean mixture between four large dinner bowls. Drizzle a few spoonfuls of the purée on top. Place the fish on top of the vegetables. Dress the peashoots with a little olive oil and salt, then place them on top of the fish with the warmed monks beard. Drizzle with olive oil and serve. ","ingredients":" 500g\/1lb 2oz frozen petit pois,  extra virgin olive oil,  salt and pepper,  1 punnet living pea shoots, leaves picked,  1 Morteau sausage,  knob of butter,  1kg\/2lb 4oz peas in pods (pre-shelled weight), shelled,  1kg\/2lb 4oz broad beans (pre-shelled weight), shelled,  ice cubes, for blanching ,  1 bunch monk’s beard ,  250g\/9oz chanterelle mushrooms, stems trimmed, washed and dried,  knob of butter,  1 bunch fresh marjoram, leaves picked and finely chopped,  4 x 170g\/6oz fillets cod ,  extra virgin olive oil,  salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_cornish_cod_peas_88438"}