{"recipe_name":"Roasted crown of grouse with pâté and red cabbage","author":"Matt Tebbutt","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the red cabbage and apples, heat the butter in a pan, add the onions and cook until soft. Add the red cabbage and apples and cook for a couple of minutes. Stir in the sugar and vinegar and cook for 40-50 minutes.  For the pâté, heat a large frying pan or sauté pan and add the butter. Once melted, add the livers and cook for 1-2 minutes and then add the garlic and cook for a further minute or until the livers are just cooked through. To test, remove a piece of liver from the pan and cut it open; it should be moist but no longer bloody (a little tinge of pink is fine). Add the Madeira and deglaze the pan. Place the liver mixture into a food processor and blend. Add the cold butter a little at a time as you blend, until you have a smooth rich pâté. Heat a frying pan and add the oil, once hot add the bread and cook on both sides.  To cook the grouse, preheat the oven to 200C\/180C Fan\/Gas 6. Heat a large frying pan and add the butter. Once melted, add the grouse crowns and cook on each side until golden-brown. Don’t wash the pan, as you’ll need it to make the Madeira reduction. Put the fried bread in a deep roasting tray and sit the crowns on top. Roast for 10-15 minutes. Remove the crowns from the bread and allow to rest. Spread the pâté onto the bread and set aside. For the Madeira reduction, heat the grouse frying pan and add the Madeira. Cook until reduced in volume by half then add the stock, or jus, and cook until reduced by half again. To serve, place the roasted crowns on serving plates with the pâté, cabbage and Madeira reduction. ","ingredients":" 75g\/2½oz unsalted butter,  2 onions, finely sliced,  ½ red cabbage, finely chopped,  2 green apples, peeled, cored and chopped,  150g\/5½oz brown sugar,  150ml\/5fl oz red wine vinegar,  25g\/1oz unsalted butter,  100g\/3½oz grouse livers and hearts, cleaned,  1 garlic clove, chopped,  splash Madeira,  125g\/4½oz unsalted butter, cold, cut into cubes,  2 tbsp olive oil,  4 slices white bread, cut into circles,  4 grouse crowns, feet on, cleaned and gutted,  100g\/3½oz unsalted butter,  2 tbsp Madeira,  300ml\/10fl oz beef stock or jus","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_crown_of_grouse_17430"}