{"recipe_name":"Roasted duck breast in aji amarillo, white miso, lime and marjoram with pickled daikon and cucumber","author":"Nic Watt","programme":"2007-16","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the duck, score the skin of the duck breast with a sharp knife. Combine the aji amarillo paste, white miso, sake, lime zest and juice, ginger juice and marjoram and whisk together to form marinade. Set aside a small amount of the marinade for the dipping sauce. Use the rest of the marinade to coat the duck breasts and set aside for four hours. Preheat the oven to 180C\/350F\/Gas 4. Pan fry the duck breasts skin side down in an ovenproof pan over a medium heat and allow the skin to crisp and the fat to render out. Flip the duck over and seal the meat side. You may need to do this in batches if all four duck breasts don't fit comfortably in the pan. Spoon some of the marinade onto the hoba leaf. Place the duck breasts on top, and bake all in the oven for five minutes. Remove the duck and hoba leaf from the oven and allow to rest for three minutes. For the salad, sprinkle the daikon and cucumber with the salt and set aside for about five minutes. Wash off the salt and squeeze out the liquid. Cover the daikon with the rice vinegar and set aside until ready to use. To serve, garnish the top of the duck with the pickled daikon, pickled cucumber and coriander. Serve with the reserved dipping sauce. ","ingredients":" 4 duck breasts,  125g\/4½oz aji amarillo paste,  300g\/10½oz white miso,  5 tbsp sake,  1 lime, zest and juice,  2.5cm\/1in fresh root ginger, grated then squeezed, juice only,  1 tbsp chopped marjoram,  1 hoba leaf,  sprigs micro coriander,  24 daikon batons, 4mm\/⅛in thick x 3cm\/1¼in long,  24-32 cucumber pearls (tiny balls made with very small melon baller),  2 large pinches sea salt,  125ml\/4fl oz rice vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_duck_breast_in_82088"}