{"recipe_name":"Roasted loin of lamb rolled in a sweet chilli jam served with pickled vegetables","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 7. For the chilli jam, blend all the ingredients, except the caster sugar, to a smooth purée in a food processor. Heat the sugar in a heavy-based saucepan over a low-medium heat until it melts and forms a golden-brown caramel. Do not stir and keep an eye on it so that it doesn’t burn. Once the sugar has caramelised, pour in the puréed chilli jam mixture and stir well. Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool slightly. For the roasted loin of lamb, heat a large oven-proof frying pan and add the oil. Once hot, add the loin, season with salt and pepper and cook until coloured on all sides. Place in the oven for 10 minutes (or longer if you prefer your meat well-cooked). Add a couple of tablespoons of the jam to the pan and baste the meat with it. Remove from the oven, cover and leave in a warm place to rest for at least five minutes. Meanwhile, for the pickled vegetables, place the white wine vinegar, sugar and salt, along with 110ml\/3½fl oz water in a small saucepan and heat until the sugar and salt have dissolved. Place the vegetables in a bowl and pour over the pickling liquor. Set aside for 10 minutes and then drain. To serve, slice the lamb and place on serving plates. Add the pickled vegetables, then garnish with the mint and coriander cress. Drizzle over the chilli jam. ","ingredients":" 2 red chillies, roughly chopped,  3 plum tomatoes, roughly chopped,  8 lime leaves,  2 lemongrass stalks, tough outer leaves removed, finely chopped,  25g\/1oz fresh root ginger, roughly chopped,  2 garlic cloves, peeled, left whole,  2 small shallots, roughly chopped,  4 tbsp Thai fish sauce,  3 tbsp sesame oil,  50ml\/2fl oz dark soy sauce,  2 tbsp clear honey,  3 limes, juice and zest,  150g\/5½oz caster sugar,  2 whole lamb loins, trimmed,  2 tbsp oil,  salt and freshly ground black pepper,  110ml\/3¾fl oz white wine vinegar,  1 tsp sugar,  1 tsp salt,  ½ cucumber, made into balls with a parisienne scoop,  1 bunch baby turnips, trimmed and thinly sliced,  1 bunch fresh radishes, trimmed and thinly sliced,  1 shallot, thinly sliced,  ¼ bunch fresh mint, leaves picked,  4 tbsp coriander cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_loin_of_lamb_05345"}