{"recipe_name":"Belgian chocolate truffle cheesecake","author":"The Hairy Bikers","programme":"Hairy Bikers' Bakeation","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Lightly oil a 23cm loose-based spring-clip cake tin and line the base with baking parchment. Put the chocolate for the filling in a heatproof bowl and place it over a pan of simmering water. Check that the bottom of the bowl isn’t touching the water. When the chocolate has melted, remove it from the heat and stir until smooth, then set aside to cool for a few minutes. To make the crust, break up the biscuits roughly, then put them in a food processor and blitz them into crumbs.  Add the melted butter and blend until mixed.  Tip the mixture into the tin and press it firmly and evenly over the base.  Pop the tin into the freezer to harden. Preheat the oven to 180°C\/Fan 160°C\/Gas 4.  Bring a kettle of water to the boil.  Put the cheese, soured cream, sugar and eggs in a food processor and blend until smooth. With the motor running, slowly add the melted chocolate and blend until thoroughly combined. Remove the biscuit base from the freezer. Take 2 large sheets of foil and place them on the work surface, one across the other. Take the cake tin out of the freezer and place it in the centre of the foil and bring the foil up around it to create a bowl shape. Place the whole thing in a roasting tin. Pour the chocolate mixture on to the biscuit base. Then carefully pour hot water from the kettle into the roasting tin until it rises almost halfway up the sides of the cheesecake. Bake the cheesecake in the centre of the oven for 35–45 minutes. It’s ready when the chocolate mixture is almost firm but retains a slight wobble.  Turn the oven off, but wedge a folded tea towel in the door and leave the cake to cool in the oven with the door ajar for at least 1 hour. Remove, cover with cling film and chill for at least 4 hours or overnight before serving.  To serve, loosen the sides of the tin with a knife and release the spring clip. Slide the dessert off the base of the tin on to a plate.  Decorate with the chocolate truffles and dust with grated white chocolate or icing sugar. For utter luxury, serve with some cream. Yum, yum! ","ingredients":" 200g\/7oz dark Belgian chocolate, broken into pieces,  500g\/1lb 2oz full-fat soft cheese,  200ml\/⅓ pint soured cream,  150g\/5½oz caster sugar,  3 large eggs,  sunflower oil, for greasing,  300g\/10½oz chocolate oat biscuits,  50g\/2oz butter, melted,  Belgian chocolate truffles,  100g\/4oz white cooking chocolate, for grating, or icing sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/belgian_chocolate_02043"}