{"recipe_name":"Roasted quail with parsnip purée, pomegranate and parsnip chips","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the roasted quail and parsnip purée, preheat the oven to 200C\/400F\/Gas 6. Heat a large frying pan and add the oil. Once hot, add the quail and brown on each side of the breast. Add half the butter and transfer to the oven for 6-10 minutes, or until cooked through. Check that the juices run clear and there’s no pink flesh when the meat is pierced with a skewer. Set aside to rest for 5-10 minutes, then cut the legs and breasts off the quail. In a large saucepan, add the parsnips, shallot, garlic, the remaining butter and 350ml\/12fl oz water. Cook for 5-6 minutes, or until the parsnip is cooked through and the volume of liquid has reduced by two-thirds. Cool slightly and then transfer the mixture to a blender or food processor. Blend to a smooth purée, stir in the cream and season, to taste, with salt and black pepper. For the parsnip chips, preheat a deep-fat fryer to 180C\/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Using a potato peeler, peel long strips off the parsnips. Carefully add the parsnips strips to the oil and fry until golden-brown. Remove with a slotted spoon and drain on kitchen paper. To serve, place a spoonful of purée on each serving plate and top with some roasted quail pieces. Garnish with the pomegranate seeds, parsnip chips and clover leaves, if using. Serve with jus or gravy.  ","ingredients":" 2 tbsp olive oil,  2 ready-to-roast quail,  100g\/3½oz unsalted butter,  250g\/9oz parsnips, chopped,  1 banana shallot, chopped,  ½ garlic clove,  100ml\/3½fl oz double cream,  salt and freshly ground black pepper,  vegetable oil, for deep-frying,  1 parsnip, peeled,  1 pomegranate, seeds removed,  6 clover leaves (optional), to garnish,  200ml\/7fl oz chicken jus or gravy ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_quail_with_56730"}