{"recipe_name":"Roasted quail with wild mushrooms, kale, fondant potatoes and a tarragon and Madeira sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fondant potatoes,  preheat an oven to 180C\/350F\/Gas 5. Cut the large potatoes in half widthways. Using a 3cm\/1in diameter pastry cutter, cut two cylinders out of each potato.  Heat a deep, ovenproof saucepan and add a little vegetable oil. Place the potatoes in the pan standing on end and fry gently until golden-brown at the base.  Add the chicken stock to the pan and bring it up to the boil. Add the garlic, thyme and butter. Place in the oven for 20-30 minutes, or until the potatoes are tender.  For the roasted quail, heat a large frying pan and add the oil, once hot add the quail and brown on each side of the breast. Add the butter and transfer to the oven for the final 10 minutes or so of the potato cooking time. Cook the quail at the top of the oven for 6-10 minutes, or until cooked through. Check that the juices run clear when the meat is pierced with a skewer. For the wild mushrooms and kale, heat half the butter in a frying pan and once hot add the mushrooms and cook for 2-3 minutes. Heat the rest of the butter in a separate frying pan and add the kale. Add two tablespoons of water and cook until wilted. For the tarragon and Madeira sauce, heat a frying pan over a medium heat and add the butter. When the butter is foaming, add the shallot. Fry for 3-4 minutes, or until the shallots are golden-brown.  Add the Madeira and carefully tip the pan towards the flame of the hob, so that the alcohol catches alight. (CAUTION: keep your face and hair away from the flames. Do not leave unattended.) When the flame has gone out, cook until the liquid has reduced in volume by three-quarters. Add the beef stock, stirring well, and cook for 3-4 minutes, or until reduced in volume by half. Then season, to taste, with salt and freshly ground black pepper. Stir in the tarragon. To serve, remove the breasts from the quails and place in the centre of two serving plates. Place the fondant potato next to the quail with the quail egg on top. Scatter the mushrooms and kale around the plate. Dot the purée around the plate and finish with the tarragon and Madeira sauce. ","ingredients":" 4 large potatoes, peeled,  2 tbsp vegetable oil,  300ml\/10½fl oz chicken stock,  1 garlic clove, left whole,  2 sprigs fresh thyme,  50g\/1¾oz butter,  2 tbsp olive oil,  2 quail, ready to roast,  50g\/1¾oz unsalted butter,  50g\/1¾oz unsalted butter,  200g\/7oz wild mushrooms (such as chanterelle, ceps, trompette or girolles),  ½ head kale, leaves removed, stem discarded and leaves chopped,  50g\/1¾oz butter,  1 banana shallot, thinly sliced,  110ml\/4fl oz Madeira wine,  175ml\/6fl oz beef stock,  salt and freshly ground black pepper,  2 tbsp tarragon leaves,  200g\/7oz parsnip or cauliflower purée,  2 soft-boiled quails' eggs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_quail_with_wild_87205"}