{"recipe_name":"Roasted red pepper soup with almond potato croquette","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the red pepper soup, heat the oil and butter in a saucepan and once melted add the shallots, garlic, paprika and thyme and cook for 1-2 minutes. Add the tomato purée and cook for 1 minute. Add the peppers and stock and cook for 5-6 minutes, finish with the cream. Place in a blender and blend until smooth. For the almond potato croquette, heat the oil in a deep-fat fryer or heavy-based deep pan to 180C. (Caution: Hot oil can be dangerous. Do not leave unattended.) Mix the flatleaf parsley into the mashed potato. Roll the mash into small sausage shapes.  Put the flour, beaten egg and almonds onto three separate plates. Roll the potato sausages in the flour, then the eggs and then the flaked almonds. Carefully lower the croquettes into the hot oil and deep-fry for 2-3 minutes, until golden-brown, crisp and hot through. Remove using a slotted spoon onto a plate lined with kitchen paper. Ladle the soup into serving bowls, drop a few almond croquettes in the centre and garnish with the basil and olive oil. ","ingredients":" 2 tbsp olive oil, plus extra to serve,  25g\/1oz butter,  1 banana shallots, halved,  2 garlic cloves,  1 tbsp smoked paprika,  2 sprigs fresh thyme,  2 tbsp tomato purée,  400g\/14oz roasted red peppers from a jar, drained,  400ml\/14fl oz chicken stock, hot,  100ml\/3½fl oz double cream,  vegetable oil, for deep frying,  500g\/1lb 2oz mashed potatoes,  1 tbsp finely chopped flatleaf parsley,  50g\/1¾oz plain flour,  1 free-range egg, beaten,  75g\/2½oz flaked almonds,  basil leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_red_pepper_soup_31772"}