{"recipe_name":"Roasted scallops, wasabi sauce, fregola, sea vegetables","author":"Aggi Sverrisson","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the wasabi sauce, heat a frying pan until warm, add the olive oil, shallots and a pinch of salt, cover with a lid and gently fry on a low heat for 10 minutes. The shallots should be soft and tender. Add the sliced mushrooms, lemongrass, dry vermouth and white wine and bring up to the boil. Boil the wine for 2-3 minutes then add the milk. Return to the boil then reduce the heat and simmer for 2-3 minutes. Take the sauce off the heat, cover with a lid and allow to infuse for two minutes. Strain the sauce through a fine sieve into a clean pan.  Using a stick blender slowly incorporate a pinch more salt, the wasabi paste, lemon juice and xanthan gum or arrowroot to the sauce. For the fregola, bring a large pan of heavily salted water to the boil, add the fregola and cook for 4-5 minutes. The texture is similar to pasta and will have a slight bite. Drain the fregola and return to the saucepan. Add the lemon juice, olive oil, chopped scallops, herbs and half the sea vegetables to the fregola and mix together. Cover with cling film to keep warm until ready to serve.  For the scallops, heat a little olive oil in a non-stick pan over a medium heat. Season the scallops with salt before placing into the pan and cook until golden-brown, about 1-2 minutes. Turn the scallops over and turn off the heat. Allow to rest in the pan for a further minute or so, depending on their size, until just cooked. Place onto a tray lined with kitchen paper then squeeze over the lemon juice. To serve, place 2-3 tablespoons of fregola in the bottom of each of four serving bowls. Place three roasted scallops on top of the fregola. Arrange the sea vegetables and the fresh dulse (söl) around the scallops. Pour over the hot wasabi sauce and sprinkle over dried dulse (söl) powder. ","ingredients":" 1 tbsp olive oil,  115g\/4oz banana shallots, thinly sliced,  pinch salt,  115g\/4oz button mushrooms, sliced,  125ml\/4fl oz dry vermouth, such as Noilly Prat,  150ml\/5fl oz white wine,  125ml\/4fl oz milk,  5 sticks lemongrass, bruised and chopped,  9g\/¼oz wasabi paste,  50ml\/2fl oz lemon juice,  2g xanthan gum or arrowroot,  115g\/4oz fregola,  2 lemons, juice only,  50ml\/2fl oz olive oil,  4 scallops, roughly chopped,  10g\/¼oz flatleaf parsley, finely chopped ,  10g\/¼oz chives, finely chopped,  10g\/¼oz chervil, finely chopped,  50g\/2oz monk's beard,  50g\/2oz sea beet,  50g\/2oz sea fennel,  1 tbsp olive oil,  12 scallops, cleaned, coral removed,  salt,  1 lemon, juice only,  20g fresh dulse seaweed (known as söl in Iceland),  pinch dried dulse seaweed powder (available on the internet)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_scallops_wasabi_92677"}