{"recipe_name":"Roasted vegetable couscous and slipcote cheese strudel","author":"Cathryn Dresser","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the filling, preheat the oven to 220C\/425F\/Gas 7. In a roasting tray, coat the peppers, courgettes, aubergines and tomatoes in olive oil.  Sprinkle with oregano, chilli flakes and salt and pepper then toss. Roast in the oven for 25 minutes. In a frying pan, add a drizzle of oil and fry the onions on a low heat. When the onions are soft and translucent stir in the sugar. Continue to cook until soft, sticky and caramelised, then set aside. For the filo pastry, sieve the flour and salt into a bowl. In a separate bowl, mix the oil with 175ml\/6fl oz of lukewarm water and the cider vinegar. Add the egg to the flour, then stir in enough of the water and oil mix to form a soft, slightly sticky dough (flours vary so you may have some water left over). Knead the dough for approximately 15 minutes, or until you have a smooth elastic dough. Place the dough in a lightly oiled bowl, cover with cling film and leave in a warm place to rest for 30 minutes. For the filling, when the vegetables are cooked remove from the oven and place into a large bowl, along with any cooking oil. Add the lemon juice and zest, the parsley and the basil, then stir. In a heat-proof bowl, mix the couscous and the bouillon, then pour over 150ml\/5fl oz of boiling water. Cover with cling film and set aside for five minutes.  Break up the couscous with a fork, drizzle over a little olive oil and season to taste with salt and freshly ground black pepper. Mix in the roasted vegetables, cover and set aside. For the filo pastry, lightly grease a large baking tray. Lay a clean tablecloth out on a large surface and sprinkle generously with flour. Place the dough in the middle and use a rolling pin to roll it out gently into a rectangle. Keep rolling out the dough until you have as large a rectangle as you can achieve without tearing the dough – the pastry needs to be very thin. Flour your hands and gently begin to manipulate and stretch the dough until it is paper thin. Trim the thick edges so the pastry is a large, neat, narrow rectangle. Melt the salted butter in a small pan and brush all over the dough, taking care not to tear it. Cover one third of the pastry with the filling, crumble half the cheese over, then add the couscous before sprinkling over the remaining cheese. With the narrow end of the pastry facing you, start to roll up the strudel. Use the tablecloth to help you by lifting it and gently pushing the pastry into a roll (you are more likely to tear the delicate pastry if you use your hands). When all the pastry has been rolled up, press down the edges, cut off any excess and tuck the ends under. Place the strudel on the greased baking tray in an ‘S’ shape and brush generously with the melted unsalted butter and transfer to the oven. After 10 minutes reduce the oven temperature to 200C\/400F\/Gas 6 and bake for a further 50 minutes, brushing the strudel with melted butter at 10 minute intervals. When the pastry is lightly browned, remove from the oven and serve while hot. ","ingredients":" 2 romano peppers, chopped into 2.5cm\/1in pieces,  2 courgettes, chopped into 2.5cm\/1in pieces,  1 small aubergine, chopped into 2.5cm\/1in pieces,  100g\/3½oz cherry tomatoes, on the vine,  olive oil, for roasting, frying, drizzling and oiling a bowl,  1 tbsp dried oregano,  1 tbsp dried chilli flakes,  salt and freshly ground black pepper ,  2 red onions, finely chopped,  100g\/3½oz sugar,  1 lemon, zest and juice,  handful chopped fresh flat leaf parsley,  handful chopped fresh basil,  125g\/4½oz couscous,  1 tbsp vegetable bouillon,  400g\/14oz slipcote cheese (a soft sheep's milk cheese available from delis and large supermarkets),  350g\/12oz strong white flour,  pinch salt,  2 tbsp groundnut oil,  1 large free-range egg, beaten,  ½ tsp cider vinegar,  50g\/1¾oz salted butter, melted ,  50g\/1¾oz unsalted butter, melted ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasted_vegetable_83727"}