{"recipe_name":"Roasted belly of Norfolk pork with apple and cider sauce, buttered spring cabbage and lentils","author":"John Burton Race","programme":"Put Your Money Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 1-2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/355F\/Gas 4. For the pork and sauce, heat a drizzle of olive oil in a large ovenproof frying pan and sear the pork belly, skin-side down, for 3-4 minutes, or until the skin is golden-brown. Turn the pork belly over, add the pork belly bones to the pan and place into the oven for 45 minutes, or until the pork belly is cooked through. Remove the pork and bones from the oven. Reserve the meat in a warm place.  Add the pork bones and stock to a pan and bring to the boil. Cook for 25-30 minutes, or until the liquid has reduced to a sauce consistency. Strain through a fine sieve and discard the bones. Set aside. For the lentils, bring the chicken stock to the boil in a pan and add the lentils and vegetables. Simmer for 20-30mins, or until the lentils are tender. Strain the cooking liquid through a fine sieve into a clean pan, reserving the lentils and vegetables.  Bring the cooking liquid to the boil and simmer for 10-12 minutes, or until reduced to a sticky consistency. Set aside.  Finely chop the vegetables and mix into the lentils again. Stir in the reduced lentil and vegetable stock.  For the apple purée, place the chopped apples and cider into a pan and bring to the boil. Simmer for 10-12 minutes, or until the apples have broken down. Transfer to a food processor and blend until smooth. Add sugar, to taste.  For the cabbage, heat the butter in a large pan until foaming, then add the cabbage and cook for 1-2 minutes, or until warmed through.  To serve, spoon the lentils and vegetables in the centre of a serving plate and top with the cabbage. Thickly slice the pork belly and arrange on top. Pour the sauce around and serve with a spoonful of the apple purée. ","ingredients":" drizzle olive oil,  500g\/1lb 2oz Norfolk pork belly, bones removed and reserved,  1 litre\/1 pint 15fl oz pork stock,  500ml\/18fl oz chicken stock,  200g\/7oz Puy lentils,  4 carrots, peeled, chopped into 2cm\/1in pieces,  4 sticks celery, chopped into 2cm\/1in pieces ,  1 onion, peeled, finely chopped,  2 cloves garlic, peeled, finely chopped,  2 Bramley apples, peeled, cored, chopped,  100ml\/3½fl oz cider,  50g\/2oz sugar,  2 tbsp butter,  1 spring cabbage, shredded, blanched and refreshed in cold water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedbellyofnorfol_91306"}