{"recipe_name":"Roasted carrot and beetroot with potato cakes","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Divide the oil between two small roasting trays, then add the beetroot and one garlic clove to one tray and the carrot and another garlic clove to the other. Place the beetroot and carrot into the oven and roast for 20 minutes, or until the beetroot and carrots are cooked through and golden-brown. Remove from the oven and drizzle the contents of each tray with equal amounts of the sherry vinegar and sprinkle over the thyme. Season, to taste, with salt and freshly ground black pepper. For the potato cakes, heat one tablespoon of the oil in a frying pan over a medium heat. Fry the onion for 4-5 minutes, until soft. Sift the flour and baking powder into a bowl. Add the fried onion and mix well. Add the butter, eggs, milk, mashed potato and parmesan and season, to taste, with salt and freshly ground black pepper. Mix the ingredients until combined as a dough. Place the potato mixture onto a floured work surface. Roll out the mixture to about 2.5cm\/1in thick. Cut out six 7.5cm\/3in diameter circles from the dough. Heat the remaining oil in a large frying pan over a medium heat. Add the potato cakes and fry for 3-4 minutes on each side, or until golden-brown all over and cooked through. To serve, place a potato cake onto each plate with a roasted beetroot and two baby carrots placed alongside. Drizzle the vegetables with the juice from the roasting trays and garnish with a handful of watercress and a few pomegranate seeds. ","ingredients":" 2 tsp vegetable oil,  6 fresh beetroots, scrubbed,  2 garlic cloves ,  12 baby carrots,  1 tbsp fresh thyme, leaves only,  50ml\/2fl oz sherry vinegar,  salt and freshly ground black pepper,  2 tbsp vegetable oil,  ½ onion, finely chopped,  200g\/7oz plain flour, sifted, plus extra for dusting,  1 tsp baking powder,  50g\/2oz butter, softened,  2 free-range eggs,  3 tbsp milk,  250g\/9oz mashed potato,  75g\/2½oz parmesan, finely grated ,  salt and freshly ground black pepper,  watercress,  1 tbsp pomegranate seeds","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedcarrotandbeet_89801"}