{"recipe_name":"Roasted Celtic scallops, cauliflower, raisins and capers","author":"Andrew Turner","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 5","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Using a table knife prise the scallop open. Lift the scallop from its shell and remove the roe and beard (keep the beards for the sauce and the roes can be used in a salad). Keep the scallops on a cloth in the fridge until ready to cook (this keeps them dry for frying in oil). To make the cauliflower, cut the cauliflower into even sized florets. Break off 15 florets and set aside. Slice the remaining cauliflower, and cook in the milk, with enough salt to taste, until tender and remove from the milk. Purée in a liquidizer using 50ml\/2fl oz of the double cream until smooth, adjust seasoning where necessary. To make the sauce, gently fry the scallop beards in 30g\/1oz butter without any colour. Then add the shallots, mushrooms, bouquet garni and cook for a few more minutes. Pour in the wine and reduce by 9\/10ths. Add 50ml\/2oz of the double cream and bring to the boil. Remove to a low heat and stir in 120g\/4oz of butter. Adjust the seasoning and pass through a fine sieve onto the raisins and capers. Do not allow this sauce to get too hot or cold (store in a warm place). Cook the scallops in a non-stick pan to your liking. Season, to taste, with salt and freshly ground black pepper. Dust the cauliflower florets liberally with icing sugar and in the same pan fry them until golden. To serve, place the cauliflower florets neatly around the serving plate. Put some of the purée in the centre. Place the scallops on top and spoon around the caper and raisin sauce. Decorate the dish with chervil. ","ingredients":" scallops (hand-dived if possible),  1 medium cauliflower,  500ml\/16½fl oz full fat milk,  icing sugar,  150g\/5oz unsalted butter,  30g\/1oz chopped shallots,  30g\/1oz chopped button mushrooms,  1 bouquet garni,  100ml\/4oz dry white wine,  100ml\/4fl oz double cream,  50ml\/2fl oz virgin olive oil,  30g\/1¼oz water soaked raisins,  30g\/1¼oz washed salted button capers (baby capers have more flavour but others are fine),  15 leaves of fresh chervil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedcelticscallop_10352"}