{"recipe_name":"Roasted cod curry with rice and peas with mango salsa","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. To make the roasted cod curry, heat the oil in a medium frying pan. Add the cod and baby beetroot halves.  Pan fry for three minutes on each side. Roast in the oven for a further five minutes. To make the curry, heat the olive oil in a medium frying pan. Add the garlic, scotch bonnet, salad onions and cook until soft. Add the curry powder and cardamom pods and cook for a further two minutes.  Add the coconut milk and simmer until thick. To make the rice and peas, place the rice in a small saucepan with the boiling water. Simmer for eight minutes, drain and season. Add the peas to the rice and stir together. The peas will heat through with the rice. To make the mango salsa, place the lime juice and zest, honey, chilli and sesame oil in a large bowl and whisk together. Add the mango and herbs and toss together. To serve, pour the curry sauce on a warm plate and serve the cod and beetroot on top. Serve the rice and peas and mango salsa aside in separate bowls. ","ingredients":" 1 tbsp olive oil,  150g\/5½oz thick cod,  100g\/3½oz baby beetroot, peeled and chopped in half,  1 tbsp olive oil,  2 cloves garlic,  1 whole scotch bonnet, finely chopped,  3 salad onion whites, finely chopped,  pinch medium curry powder,  2 cardamom pods,  100ml\/3½floz coconut milk,  150g\/5½oz basmati rice,  300ml\/10fl oz boiling water,  50g\/1¾oz garden peas, cooked,  ½ lime, juice and zest only,  1 tsp runny honey,  pinch chilli flakes,  1 tbsp sesame oil,  50g\/1¾oz mango, diced,  1 tbsp chopped coriander,  1 tbsp chopped chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedcodcurrywithr_80087"}