{"recipe_name":"'Roasted' cod with Mediterranean spice rub","author":"Paul Merrett","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the spice rub, place all the ingredients together in a pestle and mortar and grind until fine (if using turmeric in place of saffron you can just mix the spices together in a bowl). You'll only need about a quarter of the rub for this recipe - the rest can be stored in an airtight jar in a cool, dark cupboard for up to a month. Heat one tablespoon of the olive oil in a frying pan. When hot add the Toulouse sausages and cook for about ten minutes, turning occasionally to ensure even cooking, until golden-brown all over. Add the remaining tablespoon of oil to the pan with the sausages. Add the potatoes to the same pan and cook on each side for 3-4 minutes, until lightly browned. If the cod has its skin on, remove it with a sharp knife and discard. When the sausages are cooked through, transfer them to a plate and keep warm. Add the chopped garlic to the potatoes and turn down the heat. Stir the garlic through the potatoes then transfer the potatoes to a warm plate. Remove any bits of garlic left in the pan with kitchen paper and return the pan to the heat. For the spice rub, place a quarter of the above quantity into a small bowl. Add a teaspoon of flour and mix together. Press the cod fillets in the spice rub until well coated on all sides. To cook the cod, heat the butter in the same pan used to cook the sausages and, when hot, add the cod fillets. Keep the heat quite low so as not to burn the butter, but high enough to colour the cod nicely. Pan-fry on all sides for about 4-5 minutes, or until golden and just cooked through. Transfer the still warm potatoes to a mixing bowl. Chop the parsley and add to the bowl with the potatoes. Cut the sausages into thick slices at an angle and add to the bowl with the potatoes. When the cod is cooked, remove it from the pan and allow it to rest for a few minutes on a plate. If making the balsamic reduction, pour away any excess oil from the pan and wipe clean with kitchen paper. Heat the pan and, when hot, pour the balsamic vinegar into the hot pan and reduce for a few minutes to form a thick glaze. To serve, using a pastry brush, 'paint' the balsamic glaze onto two serving plates. Place the potato and sausage mixture and the cod fillets alongside. Serve. ","ingredients":" 3 tsp saffron strands (or substitute ground turmeric) ,  3 tsp garlic powder ,  3 tsp smoked paprika ,  1½ tsp cracked black pepper ,  2 tbsp olive oil ,  2 Toulouse sausages or other good quality pork sausages ,  400g\/14oz new potatoes, boiled until tender, peeled and halved ,  1 garlic clove, finely chopped ,  fresh flatleaf parsley (about 1 tbsp when chopped) ,  25g\/1oz butter ,  2 x 150g\/10½oz thick cod fillets or other fish of your choice such as hoki, sea bass, herrings, sardines, halibut or turbot ,  1 tsp flour ,  6 tbsp balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedcodwithmedite_93876"}