{"recipe_name":"Roasted duck breast with red cabbage and homemade mustard fruits","author":"Angela Hartnett","programme":"Great British Menu","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the mustard fruits. Place the pears in a container, add the sugar and stir to mix. Cover and allow to sit at room temperature for 12 hours. The pears will have begun to release their juices. Drain the juice into a pan and bring to the boil. Simmer for five minutes. Cover the pears with this syrup and leave for another 12 hours. Once again, drain the syrup from the pears, bring it to the boil and simmer for five minutes. Pour back over the pears and leave for 12 hours. Repeat this procedure two more times, then drain the syrup into a pan, bring to the boil and reduce to one-third. Add the pears to the pan and caramelise for 20 minutes. Allow to cool. Add 10 drops of mustard essential oil to the pears, then seal in glass jars and allow to mature for 2-3 weeks before using. Next make the duck sauce. Preheat the oven to 180C\/350F\/Gas 4. Meanwhile, place the duck bones in a roasting tray and roast in the oven until well browned.  Heat the olive oil in a large pan and sauté the shallot and garlic until golden. Add the herbs and peppercorns, and pour in the Madeira. Bring to the boil and cook until the liquid is reduced to a glaze.  Drain all the fat from the duck bones, then add them to the pan. Add the stocks and bring to the boil. Simmer, skimming regularly, until reduced to about 100ml\/3½fl oz. Pass through a muslin cloth and allow to cool. Keep in the fridge until needed; reheat before using. For the red cabbage, first prepare the spice bag. Lightly toast the whole spices in a dry pan until fragrant. Allow to cool, then wrap in a piece of muslin.  Put the red cabbage in a container with the sugar, Port, wine and the spice bag. Cover with cling film and place a heavy weight on top. Leave to marinate in a cool place for 24 hours. Drain the cabbage in a sieve set over a bowl; reserve the liquid. Heat the duck fat in a large pan and sweat the onion and apples with the thyme and bay leaf until soft. Add the cabbage and sweat down until tender. Add the reserved liquid and continue to cook until it evaporates to a glaze. Check the seasoning, then finish with the redcurrant jelly. Keep to one side, and reheat for serving. Turn the oven up to 200C\/400F\/Gas 6. Divide the potatoes into four portions and lay the slices on top of each other, almost completely overlapping, so you end up with them resembling a deck of cards displayed in a cascade. Trim the edges of each cascade to make a neat rectangle roughly 15cm\/6in long, 7cm\/3in wide and 2cm\/1in thick. Season with salt and freshly ground black pepper on both sides.  Heat the olive oil in an ovenproof pan. Carefully add the potatoes and colour until golden brown on both sides. Just before serving, add the hot duck sauce, cover with a buttered paper and finish cooking in the oven for five minutes or until the potatoes are tender. For the duck, heat a frying pan over a low heat and add the duck breasts, skin-side down. Allow the fat to render down. Pour away the excess fat, then add the butter to the pan and cook for a further 3-4 minutes or until the duck is medium rare. Remove the duck breasts from the pan and allow to rest for 4-5 minutes. Transfer the duck breasts to the oven to finish cooking for five minutes. Spoon the cabbage onto warm plates, place the potato and sliced duck on top and finish with some mustard fruits, to serve. ","ingredients":" 2kg\/4½lb small, firm pears, peeled and cut in half lengthways, stalks and seeds left intact,  400g\/14oz sugar,  mustard essential oil, available in some specialist shops,  500g\/1lb 2oz duck bones, chopped,  1 tbsp olive oil,  1 shallot, sliced,  1 clove garlic, peeled,  sprigs of thyme,  1 bay leaf,  ½ tsp black peppercorns,  50ml\/2fl oz Madeira,  150ml\/5fl oz veal stock (substitute more chicken stock if unavailable),  150ml\/5fl oz brown rich chicken stock,  ½ cinnamon stick, broken,  3 juniper berries,  3 cloves,  2 star anise,  1 red cabbage, finely shredded,  100g\/3½oz brown sugar,  250ml\/9fl oz Port,  500ml\/17fl oz red wine,  1 tbsp duck fat,  1 onion, sliced,  2 apples, peeled, quartered and sliced crossways,  sprig of thyme,  1 bay leaf,  4 tbsp redcurrant jelly ,  2 large Desiree potatoes, peeled and very thinly sliced,  salt and freshly ground black pepper,  1 tbsp olive oil,  2-4 duck breasts, depending on size, skin scored,  knob of butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedduckbreastwit_82021"}