{"recipe_name":"Roasted halibut on a spring onion rosti with sorrel beurre blanc","author":"Rhubarb Food Design","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Season the fish. Heat one tablespoon olive oil and the butter in a medium frying pan.   Fry the fish skin-side down.  Do not move the fish about in the pan or it will break up - allow the skin to become a deep golden brown (about 3-4 minutes) before turning carefully.  Cook for a further two minutes to brown the other side, then remove from the pan and place on the lined baking sheet.    Allow the fillets to cool, then cover tightly with foil and refrigerate until 15 minutes before they are to be served. Prepare the rôsti by parboiling the potatoes in their skins (about 10 minutes in salted water).  Drain and allow to cool for five minutes. Peel the potatoes and grate using a coarse grater.  Place the grated potatoes into a large mixing bowl.  Add the sliced spring onions, and season well.  Mix using a fork.   Using a pastry ring or your hands, mould a large handful of the potato mixture into a neat round patty shape, about 3 cm thick.  Chill for at least 30 minutes. Shallow fry the rôsti until golden brown on each side.  Do not move them about in the pan or they will break up and cannot colour evenly.  Set aside until 15 minutes before they will be served.   When ready to serve, preheat oven to 200C\/400F\/Gas 6.  Cook the rôsti in the hot oven for 12 minutes until piping hot throughout.  Half way through the rôsti cooking time, add the halibut to the oven.   Roast for 6-8 minutes or until firm to the touch and the flesh is opaque throughout.   Meanwhile, prepare the sauce.  Put the shallot or onion, vinegar, and wine water into a small pan.  Boil over a medium high heat until reduced by half. Take the pan off the heat, add cream and gradually whisk in the pieces of butter, a few at a time, to build up a light emulsion.  Place a rôsti on each plate.  Top with the halibut.  Add the sorrel to the sauce then carefully pour it around each rôsti. ","ingredients":" 4 halibut fillets, each weighing 200g\/7oz,  olive oil, for frying,  55g\/2oz butter,  3-4 large Estima potatoes,  1 small bunch of spring onions, sliced,  3-4 tbsp sunflower or vegetable oil,  30g\/1oz shallot or onion, finely chopped,  2 tbsp white wine vinegar,  2 tbsp dry white wine,  1 tbsp double cream,  100g\/3½oz unsalted butter, cut into small pieces,  100g\/3½oz fresh sorrel leaves, finely shredded","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedhalibutonaspr_73393"}