{"recipe_name":"Roasted leg of lamb with minted new potatoes","author":"Michael Caines","programme":"Countryfile Summer Diaries","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Prepare the lamb by piercing the leg eight times using a small sharp knife. Into each hole push down a garlic clove, a sprig of rosemary and a sprig of thyme. Brush the basil pesto over the meat before seasoning with salt and freshly ground black pepper. Place into an oven tray and drizzle with olive oil. Place the tray into the oven for 45 minutes to an hour, or until cooked to your liking. Once cooked, remove from the oven and cover with aluminium foil. Leave to rest for 20 minutes. For the minted potatoes, bring a large pan of water to the boil. Place the potatoes into the water with the bouillon, a little salt, thyme, mint, bay leaves and garlic and bring back to the boil. Once the potatoes are cooked, drain and discard the cooking liquid, herbs and garlic. Return the potatoes to the pan, add the butter and chopped mint and season with salt and freshly ground black pepper. To serve, carve the lamb and place onto serving plates along with the minted new potatoes. ","ingredients":" 1 leg of lamb weighing about 1.2-1.4kg\/2lb 10oz-3lb 1oz,  8 garlic cloves,  8 fresh rosemary sprigs,  8 fresh thyme sprigs,  1 jar ready-made basil pesto,  salt and freshly ground black pepper ,  olive oil, for drizzling ,  2 litres\/3½ pints water, to cook,  600g\/1lb 5oz new potatoes, washed and scrubbed ,  1 tsp concentrated chicken bouillon,  1 fresh thyme sprig,  1 large fresh mint sprig,  2 large bay leaves,  2 heads garlic, cut in half,  100g\/3½oz unsalted butter,  50g\/1¾oz chopped fresh mint,  salt and freshly ground black pepper, to season","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedlegoflambwith_86553"}