{"recipe_name":"Roasted partridge with caramelised butternut squash and green herb sauce","author":"Brian Turner","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Heat a large ovenproof frying pan until hot and add the oil and partridges. Cook the partridges on all sides, until golden brown all over, then transfer to the oven to roast for about 20-25 minutes, or until completely cooked through. Pierce the thigh meat with a skewer - if the juices run clear the partridge is cooked. Remove the partridges from the oven and rest for ten minutes. For the butternut squash, cut the butternut squash in half lengthwise and remove the seeds. Cut each half lengthwise into four evenly sized pieces. Place the butter and honey into a small saucepan and heat until melted and combined. Brush the honey and butter mixture over the squash and then place onto a baking tray. Transfer to the oven to roast for 10-15 minutes, or until tender and golden brown. For the green herb sauce, crush the garlic and place into a bowl with the fresh herbs. Add the capers, gherkins and anchovies, then stir in the mustard, vinegar and olive oil. Stir well to combine and season, to taste, with salt and freshly ground black pepper. To serve, place a pile of roasted squash onto four plates then top each with a roasted partridge. Pour some green herb sauce over and serve the remaining sauce separately. ","ingredients":" 2 tbsp olive oil,  4 partridges,  2kg\/4lb 4oz butternut squash, peeled,  25g\/1oz butter,  1 tbsp clear honey,  1 garlic clove,  1 tbsp chopped fresh parsley,  1 tbsp chopped fresh chervil,  1 tsp chopped fresh tarragon,  1 tbsp chopped capers,  1 tbsp chopped gherkins,  2 anchovy fillets, chopped,  1 tsp Dijon mustard,  2 tbsp white wine vinegar,  8 tbsp olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedpartridgewith_84996"}