{"recipe_name":"Berry crumble traybake","author":"Emily Angle","programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 10-12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/berry_crumble_traybake_59984_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease and line a rectangular baking tin (approximately 26cm x 20cm\/10½in x 8in).  In a saucepan combine the fruit with 50ml\/2fl oz water. Bring the fruit just to the boil, reduce the heat and simmer for 2-3 minutes. In a mixing bowl combine the caster sugar with the cornflour.  Stir into the fruit and continue to cook for 2-3 minutes, stirring frequently, until the mixture is thick and jammy. Set aside to cool. For the crumble topping, add the flour to a mixing bowl and rub in the butter until the mixture resembles fine breadcrumbs and no large lumps of butter are left. Stir in the sugar and set aside. For the cake, in a large mixing bowl, sift together the flour, baking powder and cinnamon. Stir in the ground almonds until thoroughly combined. In another bowl beat together the sugar with the melted butter, eggs, yoghurt and milk mixture until thoroughly mixed.  Stir into the flour mixture just to combine. Don’t overmix it, but watch out for big lumps of unmixed flour. Spoon two-thirds of the mixture into the lined tin, gently spreading out evenly to the corners. Spoon the cooled fruit mixture evenly over the top. Using a teaspoon, dot the remaining cake batter evenly on top of the fruit.  This will not cover the entire cake, but make little hillocks with gaps in between. Sprinkle the crumble mixture over the top, filling in all the gaps to cover the fruit. Bake in the oven for 45-50 minutes, until the crumble topping is golden-brown. Allow to cool for ten minutes in the tin, then transfer the cake in its paper to a cooling rack. This is cake is beautiful eaten while still warm, with a dollop of crème fraîche or yoghurt – but is equally nice the next day with a cup of coffee. ","ingredients":" 200g\/7oz frozen berries (raspberries, blackberries, cherries, blueberries, blackcurrants all work well, or a mix),  50g\/2oz caster sugar,  2 tbsp cornflour,  110g\/4oz plain flour,  70g\/2½oz cold unsalted butter, cut into smallish cubes,  30g\/1oz caster sugar,  220g\/8oz plain flour,  ¾ tsp baking powder,  ½ tsp cinnamon,  50g\/2oz ground almonds,  200g\/7oz caster sugar,  80g\/3oz butter, melted,  2 free-range eggs,  40g\/1½oz yoghurt thinned with 2 tbsp milk","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/berry_crumble_traybake_59984"}