{"recipe_name":"Roasted pigeon with potato cakes and wild mushrooms","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pigeon, season the pigeon breasts well with salt and freshly ground black pepper.  Heat the oil and butter in a frying pan over a medium heat, add the pigeon breasts and fry for 2-3 minutes on each side, or until golden-brown on both sides and completely cooked through. Remove from the heat and set aside. For the potato cakes, peel the par-boiled potatoes, then grate them into a bowl. Season, to taste, with salt and freshly ground black pepper. Add the thyme and cranberries and mix together using your hands until well combined.  Divide the potato mixture in two and shape each portion into a thin patty 10cm\/4in in diameter. Heat the butter and oil in a frying pan over a medium heat, add the potato cakes and fry for 3-4 minutes on each side, or until crisp and golden-brown on both sides.  For the wild mushrooms, in a separate frying pan, heat the butter over a medium heat, add the mushrooms and the thyme and fry for 2-3 minutes, or until softened.  Add a spoonful of the light gravy and continue to fry for 2-3 minutes, or until the mushrooms have cooked through. Remove the pan from the heat, add the lemon juice and stir well.  To serve, place one of the potato cakes into the centre of each of two serving plates. Place two of the pigeon breasts on top of each potato cake. Spoon over the wild mushrooms. Drizzle the remaining gravy around the edge of the plate. ","ingredients":" 4 pigeon breasts ,  salt and freshly ground black pepper ,  2 tsp vegetable oil,  2 tbsp unsalted butter,  2 baking potatoes, boiled for 8-10 minutes in their skins, drained,  salt and freshly ground black pepper ,  1 tbsp chopped fresh thyme,  1 tbsp fresh cranberries, blanched ,  1 tbsp unsalted butter ,  1 tbsp vegetable oil ,  50g\/1¾ butter,  200g\/7oz horse, chestnut or shiitake mushrooms, cut in half,  1 tbsp chopped fresh thyme,  200ml\/7fl oz ready-made light gravy,  ½ lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedpigeonwithpot_90348"}