{"recipe_name":"Roasted salmon with salsa verde, new potatoes and warm green bean salad","author":"Rick Stein","programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7.  For the salsa verde, combine the parsley and mint leaves, capers, anchovy fillets and one garlic clove. Mash together with a pestle and mortar to form a coarse paste and season to taste with a little salt. Line the base of a large baking tray or roasting tin with a sheet of non-stick baking-paper and then lay the tomatoes in rows of four down the centre of the paper (diagonally if necessary so that your salmon will fit in the tin). Scatter over a tablespoon of capers, garlic slices, half of the chilli flakes and all but one large sprig of the thyme.  Drizzle over three tablespoons of the oil, the water, and some salt, to taste. This will prevent the salmon from sticking and produce a lovely sauce to serve with the salmon.  Brush the skin-side of one salmon fillet with oil, season lightly with salt and place skin-side down on top of the tomatoes.  Lightly season with salt and then cover with the salsa verde mixture. Lightly season the cut face of the second salmon fillet and place on top of the salsa verde covered salmon skin-side down.  Brush the skin with olive oil and scatter with the remaining chilli flakes and the leaves from the remaining thyme sprig. Season, to taste, with salt and freshly ground black pepper. Roast the fish for 25 minutes, until the skin is lightly browned and the flesh still slightly pink in the centre.  Remove the salmon from the oven and leave it to rest briefly. Using a small sharp kitchen knife, peel the potatoes from top to bottom, taking as wide a band of peel off each time as possible. Work around the potato to create a fairly uniform oval shape. Bring 2.5cm\/1in of water to the boil in a large pan, then reduce to a simmer. Lower a petal steamer into the pan (the boiling water should not reach the holes). Add the potatoes and sprinkle them liberally with salt.  Cover the pan with a tight-fitting lid and steam for about 20 minutes, checking the water level regularly, until tender when pierced with the tip of a small knife, but not falling apart.  Transfer the potatoes to a bowl, brush with a little melted butter and serve. For the bean salad, bring a pan of well-salted water (i.e. 1 teaspoon per 600ml\/1 pint) to the boil. Add the beans and boil rapidly for 4-4½ minutes until just tender. Meanwhile, whisk together the mustard and vinegar and then gradually whisk in the olive oil. Season to taste with salt and pepper.  Drain the beans well and return them to the pan. Toss with the spring onions and mustard dressing. Pile into a serving bowl and serve warm. To serve, cut the salmon across into portion-sized pieces. Serve with some of the cooking juices, spooned over, some of the roasted tomatoes, with bean salad and steamed potatoes to the side. ","ingredients":" 15g flatleaf parsley leaves, chopped,  5g mint leaves, chopped,  3 tbsp capers,  6 anchovy fillets in olive oil, drained,  1 clove garlic, crushed,  4 large vine-ripened tomatoes, each cut into 8 slices,  1 2.5kg\/5½lb to 2.75kg\/6lb salmon, scaled and filleted OR 2 1kg\/1¼lb salmon fillets,  1 tbsp capers,  2 garlic cloves, sliced,  ½ tsp dried chilli flakes,  1 large bunch fresh thyme,  3 tablespoons olive oil,  10 tablespoons water,  salt and freshly ground black pepper,  1.8kg\/4lb of uniform-sized slightly waxy potatoes, such as Charlotte,  20g\/¾oz butter, melted,  salt,  500g\/18oz fine green beans, stalk ends removed,  1 tbsp Dijon mustard,  1 tbsp white wine vinegar,  7 tbsp extra virgin olive oil,  1 bunch spring onions, trimmed and thinly sliced,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedsalmonwithsal_78565"}