{"recipe_name":"Roasted spiced lamb with coconut rice","author":"Glynn Purnell","programme":"Something for the Weekend","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the masala spice mixture, place all of the spice mixture ingredients into a food processor and blend until coarsely ground.  For the lamb, place the lamb into a deep roasting tray and spread the masala spice mixture all over. Drizzle with a bit of oil, then cover the tray with cling film and leave to marinate in the fridge for a couple of hours, ideally overnight.  Preheat the oven to 210C\/410F\/Gas 6. Remove the lamb from the fridge half an hour before cooking and remove the cling film. Cook the lamb in the oven for 15 minutes, then pour in the water, cover the tray with aluminium foil and cook for a further 40 minutes. Drain the liquid off, then return the tray to the oven and cook for a further 30-35 minutes (for medium rare meat; cook for two hours in total for well done). Add the tomatoes, onions, coriander, squeeze of lime, chopped chillies and spring onions to the tray with the lamb five minutes before the end of the cooking time. Remove the lamb from the oven and leave to rest before carving.  For the rice, wash and drain the rice.  Melt 40g\/1½oz butter in a pan until foaming, then fry the onion for 2-3 minutes, or until softened. Add the rice and stir using a wooden spoon until the rice is coated in the butter. Pour the rice and onions into a lidded ovenproof dish.  Bring the coconut milk and milk to the boil in a pan, then remove from the heat and pour over the rice. Stir well, then season with a pinch of salt. Cover with a lid and bake in the oven for 12-15 minutes, or until the rice has absorbed all of the liquid and is al dente. Cut up the remaining butter and dot over the rice, then cover with a lid and allow to melt for a few minutes before fluffing up the grains with a fork.  To serve, carve the lamb into thick slices. Spoon the rice onto the serving plates and spoon over some of the tomato and onion mixture from the tray of lamb. Lay the slices of lamb over the rice, then add a spoonful of natural yoghurt alongside and garnish with coriander shoots. ","ingredients":" 1 tsp black peppercorns,  1 tsp coriander seeds,  8.5cm\/3in stick cinnamon,  2 fresh bay leaves,  1 tsp cloves,  1 tsp ground ginger,  1 tsp cumin,  1 tsp black mustard seeds,  1 tsp fenugreek seeds,  1.5kg \/3½lb leg of lamb, (ask your butcher to remove the H bone and thigh bone, leaving the shin bone in for presentation),  vegetable oil, for drizzling,  250ml\/9fl oz water,  4 tomatoes, cut into eighths,  2 small onions, peeled, sliced,  ½ bunch fresh coriander,  squeeze lime juice,  2 green chillies,  3 spring onions,  200g\/7oz basmati rice,  70g\/2½oz butter,  50g\/2oz onion, finely chopped,  1 x 400ml\/13½fl oz can coconut milk,  200ml\/7fl oz milk,  pinch salt,  natural yoghurt,  coriander shoots","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedspicedlambwit_92365"}