{"recipe_name":"Roasted spiced pork fillet with turmeric rice and cashew stuffed pepper","author":"Brian Turner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the pork, place the spices and salt into a bowl and mix well. Roll the pork fillet in the spice mixture to coat all over. Heat the olive oil in an ovenproof pan and fry the pork until lightly golden-brown on all sides. Transfer to the oven and roast for 8-10 minutes, or until cooked through. For the stuffed pepper, place the pepper half on a baking sheet, cut-side up, and drizzle with one tablespoon of the olive oil. Roast in the oven for about ten minutes, or until softened. Heat the remaining tablespoon of oil in a pan and fry the onion and garlic for 3-4 minutes, until softened. Add the turmeric and rice and stir well. Pour in the stock and bring to a gentle simmer. Cover partially and simmer for 8-10 minutes, or until the rice is cooked. Drain off any excess liquid. Remove the pepper from the oven and fill with the rice. Scatter over the chopped cashews. To serve, carve the pork into thick slices and place onto a serving plate with the stuffed pepper on the side. Garnish with a sprig of dill and a drizzle of soy sauce. ","ingredients":" ½ tsp ground turmeric,  ½ tsp chilli powder,  ½ tsp cumin seeds,  ½ tsp ground coriander,  ½ tsp salt,  100g\/3½oz pork fillet,  1 tbsp olive oil,  ½ Romero pepper, seeds removed,  2 tbsp olive oil,  ½ onion, finely chopped,  1 garlic clove, finely chopped,  ½ tsp ground turmeric,  250g\/9oz basmati rice,  400ml\/14fl oz vegetable stock,  1 tbsp chopped unsalted cashew nuts,  sprig fresh dill,  soy sauce, to drizzle","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedspicedporkfil_88649"}