{"recipe_name":"Roasted tomato and thyme soup with double-baked cheese and chive potatoes","author":"Sophie Dahl","programme":"The Delicious Miss Dahl","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/roastedtomatoandthym_93625_16x9.jpg","method":"Preheat the oven to 190C\/375F\/Gas 5.  Bake the potatoes directly on the wire rack of the oven for 1½ -1¾hours, or until tender. Meanwhile, for the soup, place the tomatoes, garlic, onions and thyme into a large roasting tin and season, to taste, with salt and freshly ground black pepper. Drizzle with the oil, and roast in the oven for 40-50 minutes. Remove from the oven and set aside to cool slightly. Mash the garlic with the back of a fork, and discard the skin. Tip the roasted tomatoes and onions into a food processor along with the mashed garlic, and pulse until smooth. If the soup is too thick, pour into a large saucepan and loosen the mixture with either vegetable stock, or single cream. Add a little Worcestershire sauce or balsamic vinegar, to season, if you like.   Remove the potatoes from the oven and using a cloth to hold the hot potato, cut each one in half and scoop out the insides into a bowl. Mix in the butter, crème fraîche, chives and goats' cheese, and stir in the egg. Season, to taste, with salt and freshly ground black pepper, and spoon the potato mixture back into the skins. Place onto a baking tray in the oven for a further 15-20 minutes, or until golden-brown and crisp on top. To serve, reheat the soup and divide among four bowls, with two potato halves each on the side. ","ingredients":" 4 baking potatoes,  knob of butter,  2 tbsp crème fraîche,  small bunch fresh chives, finely chopped ,  200g\/7oz soft goats' cheese ,  1 free-range egg, beaten,  sea salt and freshly ground black pepper,  2kg\/4½lbs large ripe plum tomatoes, halved ,  1 garlic bulb, cut in half horizontally ,  2 large red onions, peeled, quartered,  few sprigs fresh thyme ,  1 tbsp golden caster sugar,  sea salt and freshly ground black pepper,  2 tbsp extra virgin olive oil ,  250ml\/9fl oz vegetable stock (optional),  100ml\/3½fl oz single cream (optional),  few drops Worcestershire sauce (optional),  few drops balsamic vinegar (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedtomatoandthym_93625"}