{"recipe_name":"Roasted venison and shallots with mustard and butternut squash mash and port sauce","author":"James Martin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the venison, heat the oil in a small ovenproof frying pan. Season the venison with sea salt and freshly ground black pepper and add to the pan. Fry quickly on all sides until lightly browned. Transfer to the oven to roast for 15 minutes, or until cooked to your liking. For the shallots, heat the butter and oil in a clean, small, ovenproof frying pan. Add the shallots, butternut squash and rosemary, stir well, then transfer to the oven and roast for 15 minutes, or until cooked and tender. For the mash, place the par-boiled butternut squash, mustard and cream into a food processor and season, to taste, with salt and freshly ground black pepper. Blend to a thick purée. For the sauce, place all of the ingredients into a pan and heat to boiling point. Reduce the heat and simmer for 4-5 minutes to reduce and thicken the sauce. To serve, place the mash onto a plate, top with the roasted shallots and butternut squash and the mangetout, drizzle the sauce around and top with the venison. ","ingredients":" 1 tbsp vegetable oil,  200g\/7oz venison loin steak,  knob of butter,  1 tbsp olive oil,  3 shallots, whole,  55g\/2oz butternut squash, peeled and chopped,  sprig fresh rosemary,  200g\/7oz butternut squash, peeled, chopped and par-boiled for 5 minutes,  1 tsp wholegrain mustard,  50ml\/2fl oz double cream,  salt and freshly ground black pepper ,  1 miniature port bottle,  110ml\/4fl oz red wine,  1 beef stock cube,  5 tbsp balsamic vinegar,  55g\/2oz mangetout, shredded and blanched","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastedvenisonandsha_84300"}