{"recipe_name":"Roast fillet of lamb with pan-fried tomatoes, aubergine and courgette and sauce vierge","author":"Daniel Galmiche","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 210C\/410F\/Gas 6. Season the lamb with salt and freshly ground black pepper and insert the rosemary sprigs into the pocket in the fillet. Heat an ovenproof frying pan until hot and add the olive oil, garlic and lamb. Fry the lamb on all sides, until golden-brown all over, then transfer to the oven to roast for 5-8 minutes, or until cooked through. Remove and rest for 3-4 minutes. Meanwhile, for the vegetables, slice the tomatoes, courgettes and aubergines into 5mm\/¼in thick rounds. Heat a frying pan until hot and add the olive oil. Add the tomatoes, courgettes and aubergines, season with salt and freshly ground black pepper, and fry for 3-4 minutes, until just tender and golden. For the sauce vierge, place the olive oil into a saucepan over a low heat and warm through. Add the lime juice, tomatoes and rosemary and season with salt and freshly ground black pepper. To serve, place thee slices of each vegetable (tomato, courgette and aubergine), just overlapping, into the centre of the serving plate. Carve the lamb into thick slices at an angle and place on top of the vegetables. Spoon the sauce vierge over the lamb and top with a small handful of rocket. ","ingredients":" 1 x 200g\/7oz lamb fillet, fully trimmed, a pocket cut into the side using a sharp knife,  salt and freshly ground black pepper,  2 sprigs fresh rosemary,  1 tbsp olive oil,  2 garlic cloves, skin on,  2 plum tomatoes, skinned,  2 courgettes,  1 small aubergine,  2-3 tbsp olive oil,  salt and freshly ground black pepper,  110ml\/4fl oz olive oil,  1 lime, juice only,  2 tomatoes, peeled, seeds removed, finely chopped,  1 small sprig fresh rosemary, roughly chopped,  salt and freshly ground black pepper ,  1 small bunch rocket, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastfilletoflambwit_84422"}