{"recipe_name":"Roast goose with chestnut stuffing","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Place the leek and onion into the goose cavity. Prick the skin of the goose all over with a fork and rub in the salt and freshly ground black pepper. Rub a little goose fat over the legs of the goose and cover them well with aluminium foil. Line a deep roasting dish with more aluminium foil, enough to make a parcel to enclose the goose. Sit the goose onto a wire rack in the roasting tin and cover with the aluminium foil. Transfer to the oven and roast for about 15 minutes per 450g\/16oz plus an extra 20 minutes. (This 6kg\/12lb goose will need about 3½ hours.) After an hour of roasting, remove the foil cover and baste the goose with the juices collected. Check that the legs aren't burning and baste them too. Drain off any excess fat into a separate roasting tray. Return the goose to the oven to cook, repeating the basting every 30 minutes. Return the goose to the oven uncovered for the last 45 minutes of roasting, or until completely cooked through. Test the goose is cooked by piercing the thigh meat with a metal skewer. If the juices run clear the goose is ready. Remove from the oven and leave to rest in a warm place for 20 minutes before serving. Place the roasting tray with the saved goose fat until smoking, then add the par-boiled potatoes. Gently stir the potatoes, season well with salt and freshly ground pepper and transfer to the oven to roast for 45 minutes, or until crisp and golden-brown all over.  For the gravy, place the goose giblets into a large saucepan filled with about 2.5litres\/4 pints of water. Bring to the boil and simmer for three hours, then strain. Return the liquid to the saucepan and simmer. Add the cornflour and stir well to thicken. For the stuffing, place the prunes and the port into a bowl to soak for about two hours. Melt the butter in a frying pan over a medium heat. Add the onion, celery and garlic and fry in the butter for 4-5 minutes, until softened. Remove the prunes from the port with a slotted spoon and finely chop. Add the chestnuts, cranberries and the prunes to the onion and celery mixture and fry for one minute. Add the port and bring to the boil, then reduce the heat to simmer for 30 minutes, or until all of the liquid has been reduced, then set aside until ready to serve. Before serving add the parsley and stir in. (You can make the stuffing in advance and reheat before serving, but only add the parsley at the end). To serve, carve the goose and place onto warmed plates. Serve the roast potatoes and stuffing alongside, with gravy poured over. ","ingredients":" 1 leek, sliced,  1 onion, quartered,  6kg\/12lb goose, with giblets,  salt and freshly ground pepper,  goose fat, for roasting,  1kg\/2lb potatoes, peeled and cut into large pieces, par-boiled.,  goose giblets,  1 tbsp cornflour,  450g\/14½oz prunes,  250ml\/8fl oz port,  30g\/1oz butter, for frying,  1 onion, finely chopped,  6 celery sticks, chopped,  2 garlic cloves, crushed,  1kg\/2lb vacuum-packed chestnuts, chopped,  150g\/5oz dried cranberries, chopped,  5 tbsp chopped flatleaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastgoosewithchestn_84779"}