{"recipe_name":"Roast Gressingham duck breast, braised red cabbage and champ with thyme sauce","author":"James Tanner","programme":"Put Your Money Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the braised red cabbage, place the cabbage, brown sugar, red wine vinegar and water into a non-reactive pan with a tight-fitting lid over a medium heat. Once the mixture has come to the boil, reduce the heat to low and place the lid on top. Cook for about 25 minutes, or until soft. Check periodically and add more water if needed. For the champ, place the potatoes into a large pan, cover with water and, over a high heat, bring to the boil. Once boiling, reduce the heat to a simmer and cook until tender. Drain in a colander and return to the pan to steam dry.  Meanwhile, place the butter and milk into a small pan and heat through until the butter is melted. Once the potatoes have dried, mash the potato with a potato masher or ricer. Add the spring onions, and butter-milk mixture to the potatoes. Mix thoroughly and set aside. For the thyme sauce, place the red wine, veal or beef stock, thyme and bay leaf into a pan and cook until the volume of liquid has reduced by two-thirds.  For the roast Gressingham duck breast, place the duck breasts, skin-side down into a large, dry frying pan. Place the pan onto a medium to hot heat. As the pan heats up it will render the fat from the duck breast. As more fat is produced, drain it off. Fry the duck on the skin side until golden-brown. This will take about eight minutes. Once the skin is golden-brown, place the breasts, flesh side down on to a baking tray and place in the preheated oven to cook for 7-8 minutes. Remove the duck from the oven and leave to rest, covered, in a warm place for at least five minutes. To serve, place a small mound of champ into the middle of each of four plates. Place a small amount of cabbage onto the mash, top with the duck breast and spoon over the thyme sauce. ","ingredients":" 4 Gressingham duck breasts,  1 red cabbage, core removed, finely chopped,  75g\/2½oz brown sugar,  50ml\/1¾fl oz red wine vinegar,  splash water,  4 Maris Piper potatoes, peeled and sliced into even-sized cubes,  large knob butter,  splash milk,  4 spring onions, finely sliced on the diagonal,  200ml\/7¼fl oz red wine ,  750ml\/1 pint 7fl oz veal or beef stock,  sprig fresh thyme,  1 bay leaf","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastgressinghamduck_90970"}