{"recipe_name":"Roast halibut with butter beans and chorizo","author":"John Torode","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. Place a heavy-based pan over a medium heat. When hot add the olive oil, shallots and onions and fry for 3-4 minutes, until softened. Add the carrot and cook for a further 4-5 minutes, until the onions are soft but not coloured.  Add the chorizo and cook for five minutes, stirring well (the oil from the chorizo should be released, colouring and flavouring the vegetables).  Add the butter beans and reduce the heat to very low, to just warm the beans through (you may need to add a little water or stock at this stage).  Finish with the chopped parsley and season, to taste, with salt and freshly ground black pepper. For the halibut, score the skin of the halibut steaks, then season all over with salt and freshly ground black pepper.  Rub the halibut with plenty of olive oil and place skin-side down into a hot ovenproof pan over a medium heat. Cook the halibut for three minutes and then transfer to the oven to roast for five minutes. Remove from the oven, turn the halibut steaks over and return to the oven to roast for another five minutes, or until cooked through. Remove from the oven and place onto warmed plates. Pour over the warmed beans and chorizo and garnish with a wedge of lemon. ","ingredients":" 100ml\/3½fl oz olive oil,  2 small shallots, finely chopped,  1 onion, finely sliced,  1 carrot, cut into small cubes,  100g\/3½oz cooking chorizo, diced,  200g\/7oz tinned butter beans, rinsed and drained,  50ml\/2fl oz water or vegetable stock (if required),  ½ bunch flatleaf parsley, roughly chopped,  salt and freshly ground black pepper,  4 halibut steaks, bone in and skin on,  100ml\/3½fl oz olive oil,  4 lemon wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasthalibutwithwhit_83700"}