{"recipe_name":"Roast Herefordshire beef rolls with homemade creamed horseradish","author":"The Hairy Bikers","programme":"The Hairy Bikers' Food Tour of Britain","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the roast beef, preheat the oven to 220C\/425F\/Gas 7. Heat the vegetable oil in a roasting tin set on the hob over a high heat, then add the sirloin and sear on all sides for 3-4 minutes, or until browned all over. Set aside.  Mix together the mustard powder, sea salt and cracked black pepper in a small bowl. Rub the mixture all over the sirloin.  Roast the beef in the oven for 30 minutes (for medium; reduce the time by ten minutes for rare, or increase by ten for well done). To test how done the meat is, pierce the centre of the sirloin with a meat thermometer and check the temperature. The temperature should be around 45C\/115F for rare, 60C\/140F for medium and 72C\/160F for well done. The beef will continue to cook after it's been taken out of the oven, so allow about 10C\/50F under the desired internal temperature before removing it. Remove the beef from the oven and set aside to rest somewhere warm for 15 minutes.  Meanwhile, heat the butter and the olive oil together in a large frying pan. Add the onions and fry for 8-10 minutes over a medium heat, or until the onions are golden-brown. Set aside.  For the creamed horseradish, mix all of the horseradish ingredients together in a bowl until well combined and slightly thickened.  To serve, thickly slice the beef. Dip the cut sides of the bread rolls into the pan juices, then arrange a few slices of beef on one half. Top with the fried onions and a few leaves of Little Gem lettuce. Spread the creamed horseradish over the other half of the bun, then sandwich the two halves together and serve. ","ingredients":" 1 tbsp vegetable oil,  1kg\/2lb 2oz sirloin of beef, on the bone,  2 tbsp English mustard powder,  1 tbsp ground sea salt,  1 tbsp cracked black pepper,  2 tbsp olive oil,  2 tbsp butter,  1kg\/2lb 2oz onions, peeled, sliced,  4 tbsp freshly grated horseradish ,  1 tbsp white wine vinegar,  pinch English mustard powder,  1 tsp caster sugar,  150ml\/5fl oz double cream,  12-16 bread rolls, split in half,  4 Little Gem lettuces, leaves separated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastherefordshirebe_92223"}