{"recipe_name":"Roast lamb with  redcurrant relish and vegetables","author":"Garrey Dawson","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the lamb, rub the lamb steaks all over with the oil. Season, to taste, with salt and freshly ground black pepper. Heat a chargrill pan and fry the lamb steak for 2-3 minutes on each side, transfer to an ovenproof dish and roast for 5-7 minutes (for medium), or until cooked to your liking. Once cooked, set the lamb aside on a warm plate to rest for 10 minutes.  Meanwhile, for the redcurrant relish, place all the redcurrant relish ingredients except the bone marrow into a small saucepan and gently heat until the redcurrants start to break down and the sauce is bubbling, then stir through the bone marrow, if using. For the vegetables, heat the oil in a pan and gently fry the swede and potato with the garlic and herbs for 8-10 minutes. Add the broccoli florets, season, to taste, with salt and freshly ground black pepper and continue to cook for a further 8-10 minutes, or until the vegetables are tender. To serve, spoon the vegetables onto a serving plate. Slice the lamb and place the slices on top of the vegetables. Spoon the reducrrant relish around the edge of the plate. ","ingredients":" ½ lamb leg steak,  salt and freshly ground black pepper,  1 tbsp olive oil,  55g\/2oz redcurrants,  15g\/½oz butter,  1 tbsp caster sugar,  1 tbsp red wine vinegar,  bone marrow from the lamb leg steak (optional),  2 tbsp olive oil,  ½ small swede, peeled and cut into small cubes,  ½ baking potato, peeled and cut into small cubes,  2 garlic cloves, peeled, chopped,  1 sprig  fresh rosemary,  3 sprigs fresh thyme,  handful broccoli florets,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastlambwitharedcur_92890"}