{"recipe_name":"Roast lamb with beetroot, couscous and red wine sauce","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat oven to 200C\/400F\/Gas 6. Rub the lamb with the olive oil and season well with salt and freshly ground black pepper.  Heat a small ovenproof frying pan until hot, then place the lamb, garlic and rosemary into the pan and sear for 2-3 minutes on each side. Add the beetroot to the pan, then transfer to the oven and cook for ten minutes, or until the lamb is cooked but slightly pink in the middle and the beetroot is slightly soft. Remove the pan from the oven, transfer the lamb and beetroot to a plate and leave to rest for five minutes in a warm place. Reserve the pan for later.  Meanwhile, place the cooked couscous into a bowl and stir in the walnuts, olive oil, lemon zest and juice and herbs, then season well with salt and freshly ground black pepper Place the couscous mixture into a 10cm\/4in ring mould on a serving plate. For the sauce, heat the frying pan used to cook the lamb and beetroot over a high heat, pour the red wine into the pan and simmer for 2-3 minutes. Add the red wine vinegar and sugar and cook for another 1-2 minutes, then add the butter, stir well and cook for another minute. To serve, slide the ring off the couscous, cut the lamb into four pieces and place on top of the couscous with the roasted beetroot alongside and the sauce drizzled over. ","ingredients":" 250g\/9oz lamb loin steak,  olive oil,  salt and freshly ground black pepper,  2 garlic cloves,unpeeled, lightly crushed,  2 sprigs rosemary,  2 raw beetroot, peeled and quartered,  100g\/3½oz couscous, cooked according to packet instructions,  75g\/3oz walnuts, finely chopped,  1 tbsp olive oil,  ½ lemon, zest and juice,  handful mixed fresh herbs (eg parsley, chives, basil), chopped,  50ml\/2fl oz red wine,  ½ tsp red wine vinegar,  ½ tsp sugar,  15g\/½oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastlambwithbeetroo_84698"}