{"recipe_name":"Best-ever spaghetti Bolognese","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the vegetable oil in a large pan over a medium heat. Add the mince and cook until golden-brown all over. Remove the mince from the pan with a slotted spoon and set aside. Add the chicken livers to the same pan and cook until browned all over. Remove the livers from the pan and chop into bite-sized pieces and set aside. Add the onion to the pan and fry for 4-5 minutes, to soften and colour. Add the garlic, red and green peppers and mushrooms and fry for 5-6 minutes, or until softened and lightly coloured. Add the cooked mince, the cooked livers, the tomato purée and bay leaves and continue to cook for eight minutes. Add the wine and tomatoes and bring to the boil. Reduce the heat and simmer for 30-45 minutes. Season, to taste, with salt and freshly ground white pepper. Add the thyme, parsley and oregano and stir well to combine. To serve, place equal portions of cooked spaghetti into four serving bowls. Spoon equal amounts of Bolognese sauce over each portion and sprinkle with finely grated parmesan. ","ingredients":" 2 tbsp vegetable oil,  450g\/1lb lean beef mince,  100g\/3½oz chicken livers, trimmed ,  1 onion, finely chopped ,  2 garlic cloves, chopped,  1 red pepper, finely chopped ,  1 green pepper, finely chopped ,  150g\/5oz button mushrooms, sliced ,  2 bay leaves,  200g\/7oz tomato purée,  100ml\/3½fl oz red wine,  1 x 400g\/14oz can chopped tomatoes,  salt and freshly ground white pepper,  1 tsp fresh thyme leaves,  1 tsp fresh parsley,  1 tsp fresh oregano (or half teaspoon dried oregano),  400g\/14oz spaghetti, cooked according to packet instructions,  parmesan, finely grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/besteverspaghettibol_89567"}