{"recipe_name":"Roast Norfolk duckling with orange served with bubble and squeak","author":"Galton Blackiston","programme":"Great British Menu","prep_time":"1-2 hours","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. To make the stock, cut the wings from the duck, and chop the giblets, heart and any other bits, except the liver (keep this to use later).  Heat a splash of oil in a large pan and fry the carrot, celery, garlic and sage until softened. Add the giblets, wings and other bits from the duck and lightly brown.  Add the sugar and red wine vinegar and deglaze the pan, then add the red wine and reduce a little. Cover with 600ml\/1 pint of water and simmer gently for about 1 hour.  Meanwhile, for the bubble and squeak, bake the potatoes in the oven for 45 minutes to 1 hour. Bring the swede to the boil in salted water, then cover and cook until very tender. Drain. Do the same with the parsnips.  For the cabbage, blanch the leaves in a pan of boiling water for about 5 minutes. Drain and refresh in cold water. Squeeze the cabbage to remove any liquid. Heat a frying pan until hot, then add 50g\/2oz of the butter and fry the onions until they start to colour. Add the garlic, blanched cabbage leaves and another 50g\/2oz of butter. Turn the heat down to very low and gently sauté the cabbage and the onions until soft. Lightly season with salt and freshly ground black pepper, then remove from the heat and set aside. Scoop the flesh from the baked potatoes and push through a sieve or potato ricer, adding a knob of the butter. Push the swede and parsnips through a sieve or ricer, keeping them separate. Add the remaining butter to them and season with salt and freshly ground black pepper. Set aside.  Set the duck on a trivet in a roasting tin and score the skin with a sharp knife. Season the skin well with salt and freshly ground black pepper. Place in the hot oven and roast for 45 minutes. Some fat will have run out of the bird and you can baste the duck with this.  Brush over the marmalade and return to the oven and continue roasting for a further 40 minutes, basting occasionally until cooked through. Remove from the oven and allow to rest for a few minutes, then take the legs off the duck. Return these to the oven to finish cooking for a further 15 minutes, if necessary. (The juices from the thigh will run clear when pierced with a skewer when cooked through.) Strain the stock into another pan and reduce by half over a high heat, skimming off any fatty scum that comes to the surface. Keep tasting and reducing the stock to achieve a gravy with the desired consistency and flavour. To finish the bubble and squeak, gently warm through all the vegetables in separate pans. Arrange them in layers on four warm plates using a chefs' ring, starting with the potato on the bottom, then the swede, then the onions and cabbage and finally the parsnips. Chop the duck liver and fry in a little butter. Carefully take the breasts off the bone, then add the liver to the gravy and warm through the gravy.  To serve, slice the duck breasts diagonally and arrange on four warmed plates with the meat from the legs alongside the vegetables. Add the orange segments to the gravy and spoon over the duck. ","ingredients":" 1 duckling, about 1.8kg\/4lb, with giblets ,  olive oil, for frying,  1 carrot, chopped,  1 celery stick,  3 cloves garlic, chopped,  2 sprigs sage,  1 tsp soft brown sugar,  1 tbsp red wine vinegar,  1 large glass red wine (about 175ml\/6fl oz),  salt and freshly ground black pepper,  2 tbsp runny marmalade,  a little butter,  1 orange, peeled and segmented,  3 large baking potatoes,  450g\/1lb swede, cubed ,  350g\/12oz parsnips, chopped,  1 Savoy cabbage, leaves separated and centre stalks removed,  225g\/8oz salted butter,  3 medium onions, thinly sliced,  1 clove garlic, chopped,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastnorfolkduckling_81746"}