{"recipe_name":"Roast pheasant breast with potato wedges and cranberry sauce","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. For the potato wedges, cut the potato into wedges and place in a baking dish. Drizzle over the olive oil and add the thyme and garlic. Season well with salt and freshly ground black pepper and toss together. Place in the oven and roast for 20 minutes, or until the wedges are cooked through and golden on the outsides. Meanwhile, to make the cranberry sauce, place the cranberries into a pan with the onion, orange juice and zest, honey, red wine vinegar and red wine. Bring to the boil, then reduce the heat, stir the sauce thoroughly and simmer gently, stirring occasionally, for ten minutes, or until the sauce has reduced to a pouring consistency.  Meanwhile, for the pheasant, heat a heavy-bottomed frying pan. Season the pheasant breast all over with salt and freshly ground black pepper. Add the olive oil and the butter to the pan, then add the pheasant breast, skin-side down, and cook for 2-3 minutes on each side, or until just cooked through and golden-brown. Place the pheasant on a warm serving plate with the crispy potato wedges and a spoonful of the cranberry sauce. Serve the remaining sauce on the side, or use for another recipe. ","ingredients":" 1 potato,  2 tbsp olive oil,  2 sprigs fresh thyme ,  2 garlic cloves, lightly crushed with a rolling pin or the flat of a large knife ,  salt and freshly ground black pepper,  200g\/7oz cranberries,  ½ onion, finely chopped,  1 orange, juice and finely grated zest only,  1 tbsp clear honey,  1 tbsp red wine vinegar,  100ml\/3½fl oz red wine,  1 tbsp olive oil,  knob of butter,  1 boneless pheasant breast, skin on","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastpheasantbreastw_87741"}