{"recipe_name":"Roast pheasant with petits pois, carrot game chips and red wine jus","author":"Tony Tobin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the roast pheasant, heat the butter in an ovenproof frying pan. Add the pheasant breast skin-side down and cook over a medium heat for 2-3 minutes until lightly browned. Turn over, then transfer the pan to the oven for 8-10 minutes, or until cooked through. Set aside to rest in a warm place. Place the pheasant legs into a saucepan with the red wine, onion, bay leaf and tomato purée. Bring to the boil, then reduce the heat and simmer for ten minutes, or until the pheasant is cooked through. Strain through a sieve, discarding the pheasant legs, onion and bay leaf but reserving the liquid. Set aside. For the carrot game chips, place the vegetable oil into a deep, heavy-based pan and heat until a small cube of bread dropped into it sizzles and turns golden-brown (CAUTION: Hot oil can be dangerous. Do not leave unattended). Carefully place the carrot batons into the hot oil and deep fry until lightly golden-brown and crisp. Remove from the oil with a slotted spoon and drain on kitchen paper. Sprinkle with salt. For the petits pois, heat the oil in a pan. Add the onion and carrot and fry gently for five minutes, or until the onion has softened. Add the stock and bring to the boil. Add the peas and simmer for a few minutes until tender. To serve, spoon the peas onto a serving plate. Place the pheasant breast on top and drizzle the red wine jus around the plate. ","ingredients":" 1 tbsp butter,  1 pheasant breast, skin on,  2 pheasant legs,  ½ x 75cl bottle red wine,  ½ onion, roughly chopped,  1 bay leaf,  1 tbsp tomato purée,  vegetables oil, for deep frying,  2 carrots, peeled and very thinly sliced,  salt, for sprinkling,  1 tbsp olive oil ,  ¼ onion, chopped,  1 carrot, peeled and cut into batons,  150ml\/¼ pint chicken stock,  100g\/3½oz fresh peas","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastpheasantwithpet_87695"}