{"recipe_name":"Roast pork with carrots cooked in toffee, cumin and passion fruit with smoked salt","author":"Glynn Purnell","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Pat the pork fillet dry with kitchen paper. Be sure not to season the pork with salt before cooking. Heat an ovenproof frying pan until hot, add the vegetable oil and pork and fry until golden-brown on all sides. Add the butter and trasnfer to the oven to roast for 6-8 minutes. The meat will still be quite pink on the inside, so you may wish to cook it for longer. When cooked to your liking, remove the pork from the oven and leave to rest in a warm place, covered.  For the carrots cooked in toffee, slice the large carrots on a mandoline (or with a potato peeler) into wide thin strips. Heat a frying pan until hot, add the sugar and cook for a couple of minutes until slightly brown. Whisk in the butter and cumin to make a light toffee. Add the carrot ribbons to the toffee, stirring constantly so they are completely covered. Remove the pan from the heat and set the pan aside for the carrots to continue cooking. Bring a pan of salted water to the boil, add the baby carrots and boil for 1-2 minutes until tender, but still with a little crunch. Drain and set aside. Stir the passion fruit seeds into the toffee, then add the baby carrots and mix to coat thoroughly. Season with salt and freshly ground black pepper. To serve, cut the meat in half lengthways and season with the smoked rock salt. Place the slices of pork onto each plate and spoon the carrots over the pork, spilling some of the juice onto the plate. Scatter the borage leaves on to the finish dish and serve. ","ingredients":" 2 x 350g\/12¼oz pork tenderloin, trimmed and cut in half,  1 tsp vegetable oil,  25g\/1oz butter,  ½-1 tsp smoked rock salt (available in specialist delicatessens and online),  2 large carrots, peeled,  50g\/2oz sugar,  1 large tsp ground cumin,  25g\/1oz butter,  20 baby carrots, trimmed,  1 large passion fruit, seeds only,  salt and freshly ground black pepper,  2 punnets borage shoots or mustard cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastporkwithcarrots_91061"}