{"recipe_name":"Roast rack of lamb in Irish stew consommé","author":"Kevin Dundon","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the consommé, place all the consommé ingredients into a large stockpot and cover with at least 1.75 litres\/3 pints of cold water.  Place over a medium heat and bring to the boil.  Skim off any scum or grease that rises to the surface with a slotted spoon. Lower the heat and simmer, uncovered, for about two hours until reduced by nearly two-thirds - you'll need 450 ml\/¾ pint of stock in total. Strain the stock through a fine sieve into a large jug and ideally leave to cool overnight so that you can scrape off any fat that settles on top. For the stew, preheat the oven to 200C\/400F\/Gas 6. Season the racks of lamb with salt and freshly ground black pepper and place in a small roasting tin. Roast in the oven for 20-25 minutes, or a little longer, depending on how pink you like your lamb. Remove from the oven and set aside in a warm place to rest for 10-15 minutes. Meanwhile, peel and shape the baby carrots and baby potatoes into neat barrels. Place them into a clean saucepan with the reduced lamb stock and diced onion.  Place on the heat and bring to a simmer. Cook the vegetables gently for 10-15 minutes, or until the potatoes are completely tender but are still holding their shape. Season with salt and freshly ground black pepper. Heat the olive oil in a frying pan, add the leek and sauté for 3-4 minutes until softened but not coloured. Season with salt and freshly ground black pepper. To serve, carve the rested racks of lamb into chops.  Put the leek julienne in the centre of each warmed wide-rimmed serving bowl and spoon around the Irish stew consommé. Arrange the lamb chops on top of the leeks and garnish with the rosemary sprigs. ","ingredients":" 1 kg\/2¼lb scrag end neck of lamb bones,  1 leek, roughly chopped,  2 carrots, roughly chopped,  ½ large onion, finely diced,  2 celery sticks, roughly chopped,  1 large bay leaf,  1 large fresh thyme sprig,  small handful fresh flatleaf parsley stalks,  few black peppercorns,  2 x 7-bone best ends of lamb (each about 275-350g\/10-12oz),  salt and freshly ground black pepper,  175g\/6oz baby carrots,  275g\/10oz baby new potatoes,  ½ large onion, finely diced,  1 tbsp olive oil,  1 leek, finely julienned,  fresh rosemary sprigs, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastrackoflambiniri_85164"}