{"recipe_name":"Roast rump of lamb with pan-fried courgettes and a borlotti bean, olive and confit tomato broth","author":"Bryn Williams","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the confit tomatoes, preheat the oven to 100C\/300F\/Gas 2. Place the tomatoes onto a baking tray and drizzle with the olive oil. Sprinkle over the thyme and rosemary leaves and season with salt and freshly ground black pepper, to taste. Place in the oven and roast for two hours until soft and slightly collapsed. For the lamb, increase the oven temperature to 170C\/340F\/Gas 3. Season the lamb with salt and freshly ground black pepper. Heat an ovenproof frying pan until hot, add one tablespoon of the olive oil and the lamb to the pan and cook on both sides until browned. Place in the oven and cook for 8-10 minutes. Remove from the oven, cover with aluminium foil and rest the meat in a warm place. Heat a separate frying pan until hot and add one tablespoon of the olive oil. Add the shallots to the pan and cook for two minutes until softened. Add the balsamic vinegar, borlotti beans and stock, bring to the boil, then turn down the heat and simmer for 2-3 minutes. Add the olives, mint and confit tomatoes. Heat a separate frying pan until hot, add the remaining olive oil and the grated courgettes. Fry for two minutes until just wilted. Season with salt and black pepper, to taste, and carefully tip out any excess liquid. To serve, slice the lamb thickly. Arrange the courgette in two serving bowls. Place the sliced lamb on top and finish by spooning the sauce around. ","ingredients":" 2 tomatoes, skinned, quartered and seeds removed,  3 tbsp olive oil,  2 sprigs thyme, leaves only,  1 sprig rosemary, leaves only,  salt and freshly ground black pepper,  2 x 175g\/6oz rumps of lamb,  salt and freshly ground black pepper,  3 tbsp olive oil,  2 shallots, finely chopped,  50ml\/2fl oz balsamic vinegar,  50g\/2oz canned borlotti beans, rinsed and drained,  200ml\/7fl oz lamb stock ,  12 Greek black olives, pits removed,  2 tbsp finely chopped fresh mint ,  2 courgettes, grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastrumpoflambwithp_87858"}