{"recipe_name":"Roast scallops and crayfish, smoked beetroot and asparagus salad","author":"John Campbell","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Wash the scallops well, then place them onto a plate lined with kitchen paper. Cover and chill in the fridge for two hours.  Meanwhile, place the smoking chips into a heavy-based pan over a low to medium heat (you will need to choose a pan that fits a smoking basket or metal colander inside). Heat the smoking chips until they begin to smoke. Place the whole beetroot into a colander or smoking basket and suspend it over the smoking chips in the pan. Cover the pan and colander or smoking basket with cling film, making sure that none of the smoke can escape. Remove the pan from the heat and set aside to smoke for 2-3 hours in a well-ventilated place, or preferably outside. (NB: Tea-smoking generates a lot of smoke. Be sure to open the windows and ventilate the room as much as possible.) When the scallops have chilled and the beetroot has been smoking for two and a half hours, bring a pan of salted water to the boil, add the asparagus and cook for 3-4 minutes, or until just tender. Drain well and set aside. Heat a large, non-stick frying pan over a medium heat. When the pan is hot, add 1-2 tablespoons of the olive oil. When the oil is smoking, add the chilled scallops and fry for 45-60 seconds. Turn the scallops over and squeeze over half of the lemon juice, then continue to fry for 45-60 seconds. Add the cooked crayfish to the pan and squeeze the remaining lemon juice over the scallops and crayfish. Remove the pan from the heat and set aside for 1-2 minutes to rest and absorb the pan juices. When the crayfish and scallops have cooled, transfer them to a mixing bowl (reserve the pan juices in a bowl and set aside to cool). Add the cooked asparagus, then pour over the remaining olive oil and all of the balsamic vinegar. Stir well to combine, then set aside. Mix the salad leaves and watercress together in a bowl. When the pan juices have cooled, drizzle them over the salad leaves and watercress, stirring well to coat.  When the beetroot has finished smoking, remove it from the pan in a well-ventilated area, or preferably outside (NB: The pan will release a lot of smoke). Slice the smoked beetroot into 0.5cm\/¼in pieces. To serve, arrange the smoked beetroot slices in the centre of four serving plates so that they overlap each other. Place five asparagus spears on top of the beetroot slices, then place three scallops around the edge of each plate. Place the crayfish on top of the asparagus. Pile the dressed salad alongside. Drizzle the remaining dressing around the edge of the plate and garnish with the mixed herbs. ","ingredients":" 12 large hand-dived scallops, cleaned, corals removed,  3 tbsp oak smoking chips,  4 medium-sized cooked beetroot (not in vinegar), peeled,  20 spears English asparagus,  110ml\/4fl oz good quality olive oil,  1 lemon, juice only,  20 crayfish (substitute tiger prawns if unavailable), cooked ,  50ml\/2fl oz aged balsamic vinegar,  4 large handfuls mixed salad leaves ,  4 handfuls watercress,  3 tbsp mixed fresh herbs (such as chives and chervil), roughly chopped, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roastscallopsandcray_91507"}