{"recipe_name":"Roast teal with game chips and marinated red cabbage","author":"Phil Vickery","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Season the teal with salt and freshly ground black pepper.  Place the butter into a small ovenproof frying pan over a medium heat and cook until the butter has melted.  Add the teal to the frying pan and cook on all sides, until the teal is golden-brown on all sides. Transfer the frying pan into the oven and cook for 8-10 minutes, or until completely cooked through. Remove from the oven and leave to rest for four minutes. For the game chips, pour the vegetable oil into a large heavy-bottomed saucepan or deep-fat fryer and heat until a breadcrumb sizzles and turns golden when added (CAUTION: Hot oil can be dangerous. Do not leave unattended).  Dry the moisture from the sweet potato slices with kitchen paper and place into the hot oil. Cook for six minutes or until slightly golden and crisp. Remove with a slotted spoon and drain on to kitchen paper. Season with salt. For the marinated red cabbage, place all the ingredients together in a large clean bowl and, if possible, leave overnight, or for at least fifteen minutes, to marinate. To serve, place the marinated red cabbage onto a clean plate.  Place the teal on top and place the game chips alongside. ","ingredients":" 1 teal, plucked and gutted,  salt and freshly ground black pepper,  1 tsp butter,  300ml\/10fl oz vegetable oil for deep frying,  1 small sweet potato, peeled and very finely sliced,  salt,  ½ red cabbage, finely sliced,  1 tbsp balsamic vinegar,  1 handful fresh parsley, chopped,  1 clove garlic, chopped,  1 tbsp olive oil,  2 tbsp red wine,  1 tsp calvados,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roasttealwithgamechi_84612"}