{"recipe_name":"Roe deer with blackcurrant sauce and cabbage slaw","author":"Nigel Haworth","programme":"2007-16","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dehydrated blackcurrants, place the blackcurrants onto a tray and dust well with icing sugar, place into the dehydrator and leave for a day at 90C\/195F. N.B. If you don’t have a dehydrator at home you can use your oven: after you have used your oven turn it off and place the blackcurrants inside and leave overnight. For the blackcurrant sauce, heat a medium saucepan until hot, add the olive oil, shallots, garlic, thyme and cook until caramelized. Add the vinegar and red wine and reduce until the liquid has almost disappeared. Add the stock and cook until reduced by half. Add the blackcurrants to the sauce and bring back to the boil then remove from the heat and leave to infuse for 10 – 15 minutes. Pour the sauce through a muslin cloth lined fine sieve, check the seasoning and whisk in the butter and blackcurrant compote and mix well. For the blackcurrant gel, add the blackcurrants, sugar, lime juice and water to a medium sized pan and bring to the boil. Boil for two minutes and then pass through a fine sieve. Place the blackcurrant liquid back into the pan, bring to the boil, whisk in the agar agar and return to the boil. Once boiled, pass through a sieve again and place into a tray and put in the fridge until the liquid has set to a gel. Once the gel has set, place into a blender and blend until smooth. Pour into a squeezy bottle and reserve. For the liquorice paint, place the Pontefract cakes and water into a saucepan and bring to the boil. Reduce to a simmer and cook until all the cakes have dissolved. Pass through a fine sieve and reserve. For the potato wrapped black pudding, heat a medium sized frying pan until hot, add a small chunk of the butter and the onions and sweat until soft. Mix the onion through the black pudding until well incorporated. Roll the mixture into 2cm\/¾in cylinders in cling film and chill until firm. Melt the remaining butter. Using the spaghetti machine, spin the potatoes to create long strands of potato. Submerge the potato strands into the melted butter. Take a cylinder of the black pudding and carefully wrap the potato around it, repeating the process on each side until the black pudding is completely covered. Wrap them in cling film and place in the fridge for an hour. Once they are set firm, cut them into 4cm\/1½in long pieces. Preheat the fat fryer to 180C\/350F. Place them into the fryer and cook for about 2-3 minutes until golden brown and crispy. Lift out and drain onto kitchen paper then season with salt. For the cabbage slaw, place all the ingredients, except the chives, into a medium sized saucepan on a medium heat, and cook for 2-3 minutes until the carrots and onions are just cooked and the chicken velouté is reduced and glazed around the vegetables. Check the seasoning then add the chives. For the venison, preheat the oven to 180C\/350F\/Gas 4. Lightly season the loins with salt and pepper. Heat a frying pan until very hot, add a touch of butter and the loins and seal on each side, until browned. Transfer the venison loins to the oven for 3-4 minutes, then remove and allow to rest for at least 10 minutes. To finish, dust the loin with icing sugar and licorice powder. Place back into a hot pan and caramelise on each side then remove from the pan and leave to rest for a few minutes. To serve, brush liquorice paint on to the centre of the plate. Put a spoon of slaw just to the left of the centre. Place on the potato wrapped black pudding to the right of the slaw, pipe three dots of blackcurrant gel next to the black pudding. Put a spoon full of sauce on to the centre of the plate. Slice the venison into two lengthways, place on to the pool of sauce, garnish with fennel cress. ","ingredients":" 115g\/4oz blackcurrants,  20g\/¾oz icing sugar,  1 tbsp olive oil,  200g\/7oz shallots, diced,  1 garlic clove, crushed,  1 sprig thyme,  125ml\/4fl oz red wine vinegar ,  200ml\/7fl oz red wine ,  500ml\/18fl oz venison stock,  115g\/4oz blackcurrants,  10g\/¼ oz butter ,  10g\/¼ oz blackcurrant compote,  400g\/14oz blackcurrants,  115g\/4oz caster sugar,  2 tsp lime juice,  200ml\/7fl oz water,  6g agar agar,  115g\/4oz Pontefract cakes,  125ml\/4fl oz water,  50g\/2oz butter ,  ½ onion, finely chopped,  250g\/9oz black pudding, crumbled,  2 large potatoes (Maris Piper are good), washed and peeled,  50g\/2oz carrot, finely sliced,  50g\/2oz onion, finely sliced,  50g\/2oz white cabbage, finely sliced,  300ml\/11fl oz chicken velouté,  3 tsp chopped chives,  4 x 125g\/4½oz roe deer (or venison) loin, fully trimmed,  50g\/2oz butter,  3 tsp icing sugar, in a shaker,  1 tsp liquorice powder,  sea salt and freshly ground black pepper, to taste,  fennel cress, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roe_deer_with_52237"}