{"recipe_name":"Roman-style saltimbocca with caramelized pear, fried sage and vignarola","author":"Eleonora Galasso","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. For the saltimbocca, melt half the butter in a small saucepan over a low heat. Sprinkle over the sugar, chopped sage and pear and cook for 10 minutes, or until the pear is tender, but still holds its shape. Remove from the heat and set aside. Bash the veal out as thinly and evenly as possible, then dust it with the flour and shake off the excess. Spoon a teaspoon of the pear mixture into the centre of each piece, then press a half-slice of prosciutto on top. Add a sage leaf, then skewer with a toothpick to hold everything in place.   Gently heat the remaining butter in a large frying pan. Add the veal, prosciutto-side down, and cook for 2 minutes, or until golden-brown. Turn carefully and cook for a further 2 minutes. Transfer the saltimbocca to a low oven to keep warm.  Pour the wine into the pan and bring to the boil over a high heat. Season with salt and pepper and cook until the volume of liquid is reduced to a syrupy consistency. For the fried sage, in a bowl, mix together the flour, water and a pinch of salt to form a batter. Heat the oil in a frying pan. Sandwich the anchovy pieces between the sage leaves, dip them in the batter and fry for about 1 minute on each side, or until golden brown. Drain on kitchen paper. For the vignarola, heat the oil and butter together in a large frying pan over medium heat. Add the pancetta and spring onions and cook, stirring, for 3–4 minutes, until translucent. Add the broad beans, peas, artichokes, lettuce and half the mint, then pour over the stock. Bring to a gentle simmer and cook for 15–20 minutes, or until the liquid has reduced by half. Season with salt.  Put two saltimboccas on each plate, drizzle with the syrup and garnish with the fried sage. Serve the vignarola alongside, scattered with the pecorino and remaining mint.  ","ingredients":" 100g\/3½oz unsalted butter,  1 tbsp caster sugar,  10 sage leaves, 2 finely chopped,  ½ pear (ideally Williams), peeled, cored and cut into small chunks ,  8 x 70g\/2½oz veal escalopes, trimmed,  30g\/1oz plain flour,  4 prosciutto slices, halved,  150ml\/¼ pint dry white wine,  salt and freshly ground black pepper,  1 tbsp plain flour,  50ml\/2fl oz sparkling water,  50ml\/2fl oz extra virgin olive oil,  3 salted anchovies, rinsed and cut into 1cm\/½in pieces,  25 sage leaves,  3 tbsp extra virgin olive oil,  10g unsalted butter,  100g\/3½oz pancetta or smoked bacon, cut into cubes,  2 spring onions, chopped,  200g\/7oz broad beans or edamame, defrosted if frozen,  100g\/3½oz peas, defrosted if frozen ,  3 large globe artichoke hearts, cut into 1cm\/½in slices and placed in acidulated water,  150g\/5½oz Romaine lettuce, chopped,  bunch fresh mint leaves, torn,  120ml\/4fl oz vegetable stock,  50g\/1¾oz pecorino, finely grated, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roman-style_saltimbocca_44940"}