{"recipe_name":"Roquefort and walnut loaf","author":"Paul Hollywood","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 1 loaf","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/roquefort_and_walnut_16074_16x9.jpg","method":"Mix the flours in a large bowl of a freestanding mixer and add the salt to one side of the bowl and the yeast to the other.  Add 250ml\/9fl oz water and mix with the fingers of one hand. Add up to 100ml\/3½fl oz more water, as required to form a soft dough; rye flour takes a lot of water so you should need most or all of it. Knead for 5-10 minutes on medium speed to a smooth dough. (You could also knead the bread by hand, but it may take a bit longer.) Add the chopped walnuts to the dough and gently knead until they are incorporated. Place the dough in a lightly oiled bowl, cover with cling film and leave to rise for 1-2 hours, until at least doubled in size.   Turn the dough out onto a lightly floured work surface, knock it back, then divide into four equal pieces.  Flatten each piece of dough into a 15x8cm\/6x3in rectangle. Place a quarter of the Roquefort along the long edge of one of the rectangles and roll up like a Swiss roll.  Using your hands, roll the dough into a 25cm\/10in sausage shape. Repeat with the remaining dough.   Lightly oil a 20cm\/8in springform cake tin. Carefully coil each sausage of dough into a spiral and place into the cake tin, when all four spirals are in the tin they should resemble a four-leaf clover. Cover with cling film and set aside to prove for a further hour.  Preheat the oven to 220C\/200C(fan)\/Gas 8.  Brush the top of the loaf with egg wash and bake in the oven for 45-50 minutes. Remove from the oven and leave to cool in the tin for 10 minutes, then turn out and transfer to a wire rack to cool completely.  ","ingredients":" 450g\/1lb strong white bread flour, plus extra for dusting,  50g\/1¾oz rye flour,  10g\/⅓oz salt,  8g fast-action dried yeast,  200g\/7oz walnuts, chopped,  200g\/7oz Roquefort, cut into 2cm\/¾in cubes,  1 free-range egg, beaten for egg wash","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roquefort_and_walnut_16074"}