{"recipe_name":"Rosemary and garlic pork with wilted greens and lemon gratin dauphinoise","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the dauphinoise, pour the milk and double cream into a clean saucepan along with the garlic and lemon zest and bring to the boil. Add the potato slices and cook over a medium heat for 4-5 minutes.  Pour the potato mixture into a buttered ovenproof dish, scatter the goats' cheese over the top and season well with salt and freshly ground black pepper. Place the dish in the oven and bake for 15 minutes, or until the potato is tender and the top is golden-brown and bubbling. For the pork, pierce the pork tenderloin all over with a sharp knife and stuff the rosemary and garlic into the incisions. Drizzle with olive oil and season with salt and freshly ground black pepper.  Heat an ovenproof frying pan, add the pork and sear on all sides until golden-brown all over. Place in the oven and roast for 6-8 minutes, or until the pork is cooked through. Remove from the oven, and transfer the pork to a warm plate, cover with aluminium foil and leave to rest for five minutes.  For the gravy, add the red wine to the pan used to cook the pork and deglaze. Bring to the boil, then turn down the heat and allow to simmer until the volume of liquid has reduced by two thirds. Stir in the butter and simmer until thickened slightly. For the wilted greens, add the sorrel to a saucepan with the butter and stir over a medium heat until wilted. Remove from the pan and set aside. To serve, pile the wilted greens onto a serving plate. Thickly slice the pork and lay on top of the greens. Drizzle over the red wine sauce and serve with the gratin dauphinoise on the side. ","ingredients":" 100ml\/3½fl oz milk,  100ml\/3½fl oz double cream,  1 clove garlic,  1 lemon, zest only,  1 potato, peeled, thinly sliced,  85g\/3oz hard goats' cheese, grated,  salt and freshly ground black pepper,  200g\/7oz pork tenderloin,  2 sprigs fresh rosemary,  2 garlic cloves, sliced,  drizzle olive oil,  salt and freshly ground black pepper,  large handful fresh sorrel leaves,  25g\/1oz butter,  150ml\/5½fl oz red wine,  25g\/1oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rosemaryandgarlicpor_88857"}