{"recipe_name":"Rose veal chop with herb butter, summer vegetables and lightly crushed Jersey Royal potatoes","author":"Paul Rankin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the veal, season the veal chops with salt and freshly ground white pepper. Heat 25g\/1oz of the butter in a large, heavy-based pan over a medium heat for 1-2 minutes, or until it is foaming and has turned golden-brown.  Add the seasoned veal chops and fry for one minute on each side, or until browned on both sides. Reduce the heat, then continue to cook the veal chops for 3-4 minutes on each side (for medium), or until cooked to your liking. When the veal chops are cooked, remove them from the pan and set aside to rest on a warm plate.  Drain the butter from the pan the veal chops were cooked in, then add the chicken stock and bring it to a simmer. Continue to simmer the chicken stock until it has thickened and the volume of liquid has reduced by half (reserve these pan juices).  Meanwhile, in a bowl, mix the remaining 50g\/2oz of softened butter into a bowl with the chopped herbs and lemon juice until well combined. Season, to taste with salt and freshly ground pepper, then set aside.  Meanwhile, for the summer vegetables, bring a pan of salted water to the boil, add the chopped lettuce leaves and boil for one minute, or until just tender. Drain well.  Heat the butter in a frying pan over a medium heat. When the butter is foaming, add the stock, peas, broad beans, spring onions and cooked lettuce and bring the mixture to a simmer. Continue to simmer for 2-3 minutes or until the vegetables are tender and the majority of the liquid has evaporated. Set aside and keep warm.  Meanwhile, for the potatoes, place the cooked, skinned potatoes onto a plate and crush lightly with the bottom of a ramekin or bowl (NB: Don't crush the potatoes too much - they should keep their shape). Season, to taste, with salt and freshly ground white pepper. Sprinkle the chopped spring onions and chopped bacon over the crushed potatoes, then drizzle over the melted butter. Cover the plate with cling film and microwave on full power for two minutes, or until the bacon is cooked and the ingredients are completely heated through.  To serve, divide the summer vegetables and the crushed Jersey Royals equally among four serving plates. Place one cooked veal chop on top of each serving. Place a teaspoonful of the reserved herbed butter on top of each veal chop. Drizzle the reserved pan juices around the edge of the plate. ","ingredients":" 4 x 400g\/14oz rosé veal chops (medium thickness), French trimmed,  salt and freshly ground white pepper ,  75g\/3oz butter, softened,  110ml\/4fl oz chicken stock,  1 tsp chopped fresh parsley leaves,  1 tsp chopped fresh chives,  1 tsp chopped fresh tarragon leaves,  1 tsp chopped fresh chervil leaves,  2 tsp freshly squeezed lemon juice,  8 Romaine lettuce leaves, or similar crisp lettuce leaves, roughly chopped,  25g\/1oz butter,  2 tbsp hot chicken stock,  2 tbsp fresh peas,  2 tbsp broad beans, blanched, pods and inner skins removed,  2 spring onions, trimmed, cut into 1½cm\/½in slices,  8 Jersey Royal potatoes, cooked until tender, skins removed,  salt and freshly ground white pepper ,  2 tbsp spring onions, trimmed, finely sliced,  1 tbsp back bacon, finely chopped,  2 tbsp butter, melted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rosevealchopwithherb_91604"}