{"recipe_name":"Roxy's poule au pot with aioli","author":null,"programme":null,"prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the chicken in a pot slightly larger than the size of the chicken. Fill with water and add all the ingredients down to, but not including, the potatoes. Bring to the boil quickly, then immediately reduce the heat, cover the pot and simmer for an hour. Meanwhile, make the aioli. Use a blender or food processor and blend together the eggs, salt and cayenne pepper, then slowly dribble in the oils until the mixture thickens. Add the lemon juice, garlic and parsley. Adjust seasoning. Add the potatoes, carrots and turnips to the poaching pot and simmer for about 20 minutes until the potatoes are just soft. When done, remove the chicken and carve some slices onto four plates, accompanied by the leeks, potatoes, baby carrots and turnips. Pour over a little of the cooking broth and serve with a dollop of aioli. ","ingredients":" 1 large chicken,  1 large onion, halved,  3 leeks, washed, trimmed and split lengthways,  2 carrots, trimmed and split into quarters lengthways ,  1 handful fresh parsley, chopped,  1 handful fresh tarragon,  1 celery heart with leaves, quartered,  1 bay leaf,  750g\/1lb 10oz small or medium boiling potatoes, scrubbed,  1 bunch of baby carrots, trimmed or 2-3 larger carrots, trimmed and thinly sliced,  1 bunch baby turnips, trimmed,  about 20 whole black or green peppercorns,  2 eggs,  salt and a dash of cayenne pepper,  a few strands of saffron,  225ml\/8fl oz olive and vegetable oils, mixed,  1 tbsp lemon juice,  4 large garlic cloves, finely chopped, or 3 tbsp garlic purée,  ½ handful parsley, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/roxyspouleaupotwitha_73315"}