{"recipe_name":"Rum and honey babas","author":"The Hairy Bikers","programme":"The Hairy Bikers: Mums Know Best","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":null,"pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/rumbabas_93183_16x9.jpg","method":"Grease a deep 12-hole muffin tin or 8-10 metal rum baba moulds set on a baking tray. Place the currants in a pan with the rum and cold water. Place over a medium heat and bring to the boil. Once boiled, remove from the heat and set aside to cool. Sift the flour into a large bowl and stir in the yeast and salt. Whisk the beaten eggs in a separate bowl with the milk and honey until well combined. Gradually mix the egg mixture and the 115g\/4oz butter into the dry ingredients with a wooden spoon. Beat for about 4-5 minutes, or until smooth and glossy.  Drain the currants, reserving the rum, and stir the currants into the batter. Spoon the mixture into the prepared tin and set aside in a warm place to rise for about an hour, or until the mixture has roughly doubled in size. The batter should reach the top of the muffin tins.  Preheat the oven to 190C\/375F\/Gas 5. Bake the rum babas in the oveb for 12-15 minutes or until risen and golden-brown.  Meanwhile, for the syrup, place the sugar into a saucepan with the cold water and heat gently, stirring occasionally until the sugar dissolves. Bring to a simmer, then add the reserved rum, the additional four tablespoons of rum and the honey. Simmer for a few more seconds, then remove from the heat and set aside.  Remove the rum babas from the oven and allow to cool in the tin for five minutes. Loosen the sides with a blunt-ended knife and turn the rum babas out into a large, shallow ceramic dish. Pour half of the syrup slowly over the rum babas. Set aside for five minutes to allow the syrup to be absorbed.  Carefully turn the rum babas over in the dish. Pour over the remaining syrup, reserving a few tablespoons for serving, and leave the rum babas to stand for a further ten minutes. Turn them over one final time, then cover the dish with cling film and chill in the fridge for at least two hours before serving. (They will keep for 2-3 days in the fridge.)  To serve, spoon one rum baba per person onto a serving plate and spoon over a little bit of the syrup in the dish and a few spoonfuls of double cream. ","ingredients":" 115g\/4oz unsalted butter, at room temperature, plus extra for greasing,  75g\/2½oz currants or mixed dried fruit,  4 tbsp dark rum,  2 tbsp cold water,  225g\/8oz plain flour,  1 x 7g sachet easy-blend dried yeast,  ½ tsp fine sea salt,  4 large free-range eggs, beaten,  4 tbsp milk,  1 tbsp clear honey,  400g\/14oz caster sugar,  400ml\/14fl oz water,  3 tbsp clear honey,  4-6 tbsp dark rum,  double cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rumbabas_93183"}