{"recipe_name":"Bitter chocolate and coffee mousse cake served with a coffee anglaise","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease and line two 18 x 30cm\/7 x 12in flat baking trays with baking parchment. For the sponge cake, beat together the caster sugar and eggs until the mixture is pale and fluffy and the mixture forms ribbons on the surface when drizzled. Fold in the plain flour, then pour in the melted butter and fold through.  Pour the mixture onto the lined baking trays and bake for 8-10 minutes, or until golden-brown. Remove from the oven and allow to cool. Once cold, peel off the baking parchment and use a 7cm\/2¾in cutter to cut eight discs.  Place a disc of sponge into the bottom of a chefs’ ring set on each of four serving plates. Drizzle over a tablespoon of coffee liqueur on each disc. Leave to soak and then brush with a little of the melted chocolate.  For the coffee mousse, squeeze out the excess water from the gelatin leaves and stir into the hot coffee. Whisk together the icing sugar and egg yolks in a bowl until pale and fluffy. Fold the coffee mixture into the egg yolk mixture. Fold in the whipped cream. In a clean mixing bowl, whisk the egg whites until stiff peaks form when the whisk is removed.  Fold the egg whites into the coffee mousse.  Pour the coffee mousse onto the soaked bases until the chefs’ rings are half-filled. Soak the remaining discs of sponge in the remaining coffee liqueur and then place on top of the mousse.  Brush with a little more dark chocolate and then make the chocolate mousse. For the chocolate mousse, place the chopped chocolate in a bowl set over a pan of gently simmering water. Once melted, remove from the heat and allow to cool slightly. Beat in the egg yolk.  In a clean bowl, whisk the egg whites until soft peaks form when the whisk is removed. Gradually whisk in the sugar, a little at a time, until stiff and glossy peaks form.  Once the chocolate has cooled to body temperature, fold the egg whites into the chocolate. Spoon the mousse into a piping bag and then pipe it on top of the cakes. Place in the fridge to set.  For the coffee anglaise, heat the cream in a saucepan with the coffee granules.  In a large bowl, mix together the egg yolks, cornflour and caster sugar, then pour in the hot coffee cream, whisking all the time. Return the mixture to a clean saucepan and place over a low heat.  Stir continuously until the custard has thickened and coats the back of a spoon. Pour into a bowl and set aside to cool. Chill in the fridge. For the chocolate sauce, place the chocolate sauce ingredients with five tablespoons water into a saucepan and heat gently.  When all the ingredients have melted, pour into a squeezy bottle or a bowl and allow to cool.  Once ready to serve, use a blowtorch to warm the ring around the mousse stack making it easy to remove. Dust the tops with sweetened cocoa powder. Drizzle with a little of the chocolate sauce and serve the cold coffee anglaise in a jug alongside.  ","ingredients":" 75g\/2½oz caster sugar,  2 free-range eggs,  75g\/2½oz plain flour, sifted,  20g\/1oz butter, melted and cooled,  8 tbsp coffee liqueur,  100g\/3½oz dark chocolate, melted,  1 leaf gelatin, soaked in cold water for five minutes,  4 tbsp instant coffee, dissolved in 4 tbsp boiling water,  2 tbsp icing sugar,  2 free-range eggs, separated ,  300ml\/10fl oz double cream, softly whipped,  2 free-range egg whites,  175g\/6oz chocolate (70% cocoa solids), chopped,  1 free-range egg yolk,  4 free-range egg whites,  25g\/1oz caster sugar,  275ml\/9¾oz double cream,  1 tbsp instant coffee granules,  3 free-range eggs, yolks only,  2 tbsp caster sugar,  1 tbsp cornflour,  100g\/3½oz dark chocolate (70% cocoa solids),  40g\/1½oz caster sugar,  60ml\/4 tbsp double cream,  sweetened cocoa powder, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bitter_chocolate_and_38429"}