{"recipe_name":"Rump of lamb, white beans and courgette flowers with marjoram and feta","author":"John Torode","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C Fan\/Gas 6. For the rump of lamb, mix the herbs, oil and salt and pepper together. Score the lamb fat and roll the rumps in the herb mixture to coat.  Heat a griddle pan. When hot, seal the lamb very well on all sides until golden-brown (about 4 minutes). Transfer to the oven for 10 minutes, or until cooked to your liking. Take out cover with foil and leave to rest in a warm place.  For the white beans, gently heat the oil, garlic and rosemary for about 5 minutes to allow the rosemary to infuse the oil. Discard the rosemary and set the pan aside. Meanwhile, warm the white beans and their water in a saucepan.   Put the warmed beans in a food processor using a slotted spoon. Add all the garlic, half the oil and half the water from the beans. Blend to the texture of hummus. Add some lemon juice, blend again and then add more oil, water or lemon, to taste. For the salad, put all the ingredients in a large bowl, mix and season with salt and pepper. For the courgette flowers, heat the oil in frying pan. Mix the plain flour with salt, pepper and chopped dill. Whisk the water and cornflour together to make a batter.  Roll the flowers in the seasoned flour and then dip in the batter. Lower into the hot oil and fry for 2 minutes or until crisp and golden-brown. Remove with a slotted spoon and drain on kitchen paper. To serve, spread the bean purée on serving plates. Slice the lamb and divide between the plates. Spoon over any roasting juices, sprinkle with the salad and serve with a squeeze of lemon juice and the fried flowers.  ","ingredients":" handful marjoram, chopped ,  ½ handful dill, chopped,  ½ handful oregano, chopped ,  50ml\/2fl oz olive oil ,  2 x 250g\/9oz lamb rump, with fat attached,  salt and freshly ground black pepper,  50ml\/2fl oz olive oil ,  3 garlic cloves, squashed ,  2 sprigs rosemary ,  1 x 400g tin butter beans in water, heated in a saucepan until warm ,  1 lemon, juice only,  1 large banana shallot, peeled and sliced on a mandoline into very thin rings,  handful parsley, chopped,  100g\/3½oz feta (preferably made from goats’ milk)  ,  100g\/3½oz pitted large black or purple olives,  1 lemon, juice only,  4 tsp olive oil,  100g\/3½fl oz vegetable oil, for frying,  60g\/2¼oz plain flour ,  2 tsp chopped dill ,  50ml\/2fl oz sparkling water ,  60g\/2¼oz cornflour ,  4 courgette flowers,  1 lemon, cut into wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rump_of_lamb_white_beans_54834"}