{"recipe_name":"Rump steak, chips and béarnaise sauce","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/rump_steak_chips_and_76854_16x9.jpg","method":"Heat the vegetable oil in a deep fat fryer to 160C\/320F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) For the béarnaise sauce, place the vinegar, white wine, peppercorns and shallot into a small saucepan and bring to the boil. Simmer until the liquid has reduced by half. Remove the peppercorns, then pour the mixture into a medium heat-proof bowl. Add the egg yolks to the bowl and whisk well. Place the bowl over a pan of simmering water and whisk the eggs together until thickened and light in colour. Gradually add the melted butter, whisking constantly. Season with salt and freshly ground black pepper and add the chopped tarragon leaves. Turn off the heat and leave the bowl over the pan until ready to use. For the steak and chips, place the potatoes into the fat fryer, a few at a time, and cook for 2-3 minutes, or until just tender but not coloured. Drain on a plate lined with kitchen paper and turn up the fat fryer to 190C\/375F. Season the steaks with salt and freshly ground black pepper. Heat a frying pan until hot, add the butter, olive oil and the steaks and fry on one side for two minutes (without moving the steak), or until browned. Turn the steak over and cook for another two minutes, then remove the pan from the heat and leave the steaks to rest. Place the semi-cooked chips back into the fat fryer in batches and cook for another 2-3 minutes, or until golden-brown and crispy. Keep warm on a tray in the oven if necessary. To serve, carve the steak into thick slices, place onto plates and spoon the béarnaise sauce over. Pile some chips and salad leaves alongside. ","ingredients":" vegetable oil, for deep fat frying,  400g\/14oz chipping potatoes, peeled and cut into batons 1x1x6cm\/¼in x¼in x 2½in long,  4 x 250g\/9oz rump steaks,  salt and freshly ground black pepper.,  25g\/1oz butter,  1 tbsp olive oil,  2 handfuls mixed salad leaves,  2 tbsp tarragon vinegar,  50ml\/2floz white wine,  1 tsp white peppercorns,  1 small banana shallot, finely diced,  4 free-range egg yolks,  200g\/7oz butter, melted,  salt and freshly ground black pepper,  ¼ lemon, juice only,  2-3 tbsp tarragon, leaves only, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/rump_steak_chips_and_76854"}