{"recipe_name":"Russian box","author":"Marie Campbell","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Makes 1 biscuit box, filled with 60 small biscuits","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the box, beat the butter and sugar until pale and smooth using an electric whisk. Add the eggs gradually and then beat for a minute. Add the treacle, syrup and vinegar and continue to beat at a low speed. Add the flour and other dry ingredients and mix to combine. Roll the dough into six portions, wrap in cling film and rest in the fridge for 20 minutes. Preheat the oven to 190C\/170C fan\/Gas 5. Roll out the dough into 2 x 20cm\/8in squares (these will become the lid and base of the box) and 4 x 20x7cm\/8x3in rectangles (for the sides of the box). Bake for 10-12 minutes. Trim the biscuits while they are still hot to ensure the edges are straight and all the squares are exactly the same size. Leave to harden on a wire rack. Leave the oven on. For the royal icing, beat the egg white in a large bowl and gradually add the icing sugar a tablespoonful at a time, beating well between each addition until you have a thick and glossy icing. Assemble the box using the icing to hold the bottom and sides together. Pipe or stencil decorations on the sides and lid of the box. For the biscuits, cream together the butter and sugar. Add the flours, orange zest and half of the cinnamon and mix to make a ball.   Roll out using a long dowel or rolling pin. Cut out circles or flower shapes using a 6cm\/2½in cutter. Use any leftover dough to make roses and leaves to decorate the top of the box. Bake for 10-12 minutes. Sprinkle the biscuits with cinnamon and caster sugar while still warm.  Melt the white chocolate and the milk chocolate in separate bowls placed over simmering water. Drizzle the chocolate in thin lines over the biscuits. Set aside for the chocolate to harden. Paint the cooled biscuit roses and leaves with a little food colouring. Once dry, stick them to the lid using icing. Fill the box with the biscuits, place the lid on top and serve. ","ingredients":" 165g\/5¾oz lightly salted butter,  300g\/10½oz granulated sugar,  2 medium free-range eggs ,  3 tbsp treacle,  330g\/11½oz golden syrup,  3 tbsp white wine vinegar,  1kg\/2lb 4oz plain flour, plus extra for rolling,  2½ tsp ground ginger,  3¾ tsp ground cinnamon,  2¼ tsp bicarbonate of soda,  ¾ tsp table salt ,  1 free-range egg white,  250g\/9oz icing sugar ,  gel food colour in red and green,  375g\/13oz slightly salted butter ,  125g\/4½oz caster sugar, plus an extra 3 tbsp for sprinkling,  375g\/13oz plain flour,  125g\/4½oz white rice flour,  2 large unwaxed oranges, zest only ,  2 tsp ground cinnamon,  100g\/3½oz  bar white chocolate ,  100g\/3½oz bar milk chocolate","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/russian_box_66106"}