{"recipe_name":"Saag aloo with mussels, clams and spicy carrot salad","author":"John Torode","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the saag aloo, heat a dry pan and toast the whole spices for a minute or so until they start to smell smoky. Put them in a pestle and mortar with the remaining spices, salt, garlic and two chillies and crush to a paste. Heat the ghee in a heavy-based lidded pan. Add the onion and fry until golden. Add the spice paste and reduce the heat. Add the potatoes and mix well, fry for a few minutes and add 100ml\/3½fl oz water and bring to the boil, cover and cook for 10 minutes, checking that all the water does not evaporate.  Meanwhile, cook the mussels and the clams. If any shells are open, tap them lightly on a hard surface. If they don't close, discard them. Add to a large lidded pan and cover with water. Cover and cook for 3–4 minutes. They are cooked when they have opened up. Be sure to discard any that don't open after cooking. Pick the mussel and clam meat from the shells and set aside. Give the curry a good stir and scrape the bottom, cook for 5 minutes. If the mixture looks dry, top up with water. Add the spinach and cook for 5 minutes stirring constantly. Add the mussels and clams, cover the pan, remove from the heat and leave the spinach to steam for 2 minutes. Add the remaining chilli and transfer to a serving bowl. Top with the coriander.  For the flatbreads, heat a little oil in a large frying pan and fry the onions until soft, set aside to cool a little. Mix the onions with remaining ingredients, roll into balls, flatten and then roll out. Cook in a dry pan for 1 minute on each side  For the salad, mix the carrots with the salt and lemon in a large bowl and leave for a minute or two. Add the remaining ingredients. Serve the saag aloo in a large dish with the flatbreads and carrot salad in a bowl alongside. ","ingredients":" 2 tbsp coriander seeds,  2 tbsp cumin seeds,  1 tsp mustard seeds,  2 tsp ground turmeric,  1 tsp chilli powder,  2 tsp salt ,  4 garlic cloves, crushed,  3 long red chillies, sliced (take the seeds out if you don’t like it hot),  100g\/3½oz ghee or clarified butter,  2 large onions, diced,  1 large potato, peeled and diced,  200g\/7oz mussels, scrubbed and debearded,  150g\/5½oz clams, scrubbed,  450g\/1lb large leaf spinach, washed,  small bunch of coriander, leaves picked,  vegetable oil, for frying,  200g\/7oz onions, sliced ,  300g\/10½oz yoghurt ,  300g\/10½oz self-raising flour ,  4 tsp oil,  200g\/7oz carrots, thinly sliced ,  1 tsp salt ,  ½ lemon ,  2 spring onions, sliced on the diagonal,  1 cucumber, thinly sliced,  2 small chillies, thinly sliced ,  1 tsp onions seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saag_aloo_and_spicy_49080"}