{"recipe_name":"Saas ni macchi (Parsee fish in white sauce)","author":"Cyrus Todiwala","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 230C\/450F\/Gas 8. Heat the oil in a casserole and gently cook the onions, garlic and ginger until soft.  Add the fish, the shredded curry leaves and 500ml\/18fl oz water and bring to a simmer. Cook in oven for 5-6 minutes, or until the fish is just cooked through. Remove the fish from the casserole, set it aside in a deep dish and keep it warm. In a large bowl, beat the eggs along with the rice flour, sugar, vinegar, coriander and mint until the liquid is smooth. Add the hot fish cooking liquor to the egg mixture first and then pour it back into the pan. Over a gentle heat, stir slowly but continuously until it thickens. Don’t let it boil. Use a flat wooden spatula and a whisk alternatively to achieve this and to prevent the egg from splitting or scrambling. Whisk in the ground cumin and, when it's well combined, add the chopped green chillies and tomatoes. Check the seasoning and see that you are happy with the sweet, sour and slightly hot tastes. Either add the fish into the sauce or the sauce to the fish and cover. Ideally this should be served immediately with chapattis, poppadum’s or khichri. ","ingredients":" 3-4 tbsp rapeseed oil,  4 small red onions, finely chopped,  6 garlic cloves, crushed,  7-10cm\/3-4in of fresh ginger, peeled and finely chopped,  1 seabass, filleted and pin boned, each fillet cut in half,  15-20 curry leaves, finely shredded,  6 free-range eggs,  6 tbsp fine rice flour,  6-8 tbsp sugar,  6-8 tbsp malt vinegar,  1 bunch fresh coriander leaves, finely chopped,  20-25 mint leaves, finely shredded,  4 tsp ground cumin,  4-5 medium green chillies, finely chopped,  few cherry tomatoes, halved,  salt, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saas_ni_macchi_parsee_05139"}