{"recipe_name":"Sachertorte","author":"Mary Berry","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/sachertorte_59630_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease a deep 23cm\/9in round cake tin then line the base with greaseproof paper. Break the chocolate into pieces, melt gently in a bowl set over a pan of hot water, stirring occasionally, then cool slightly. Beat the butter in a bowl until really soft, then gradually beat in the sugar until the mixture is light and fluffy. Add the cooled chocolate and the vanilla extract and beat again. Add the egg yolks, then fold in the ground almonds and sieved flour. The mixture will be quite thick at this stage. In a separate bowl, whisk the egg whites until they are stiff but not dry. Add about one-third to the chocolate mixture and stir in vigorously. Gently fold in the remaining egg whites. Pour the mixture into the prepared tin and level the surface. Bake in the oven for about 45-50 minutes, or until well risen at the top and the cake springs back when lightly pressed with a finger. Leave to cool in the tin for a few minutes then turn out, peel off the paper and finish cooling on a wire rack. To make the topping, heat the apricot jam in a small pan and then brush evenly over the top and sides of the cold cake. Allow to set.  Make the icing by breaking the plain chocolate into pieces.  Heat the cream until piping hot, remove from the heat and add  the chocolate.  Stir until the chocolate has melted, then cool till a coating consistency.  Then pour the icing on to the centre of the cake. Spread it gently over the top and down the sides, and leave to set. For the ‘icing’ writing, break the milk chocolate into pieces then melt gently in a bowl set over a pan of hot water. Spoon into a small paper icing bag or polythene bag and snip off the corner. Pipe ‘Sacher’ across the top and leave to set. ","ingredients":" 140g\/5oz plain chocolate ,  140g\/5oz unsalted butter, softened,  115g\/4oz caster sugar,  ½ tsp vanilla extract,  5 free-range eggs, separated,  85g\/3oz ground almonds,  55g\/2oz  plain flour, sieved,  6 tbsp apricot jam, sieved,  140g\/5oz plain chocolate ,  200ml\/7fl oz double cream,  25g\/1oz milk chocolate","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sachertorte_59630"}