{"recipe_name":"Saddle of lamb with herb crust and dauphinoise potato","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the dauphinoise potatoes, heat the cream and milk in a pan and add the garlic. Season with salt and pepper. Grease a dish and layer the sliced potatoes in the dish. Pour over the cream mixture.  Bake for 45 minutes. For the lamb, heat an ovenproof pan until hot, add a dash of olive oil and fry the lamb until coloured all over. Transfer the pan to the preheated oven for five minutes and then set aside to rest while you make the crust. Mix the breadcrumbs with the chopped herbs in a small bowl. Liberally spread the Dijon mustard over the lamb. Stir in a drizzle of oil to the breadcrumbs and then use them to coat the lamb. Return the lamb to the oven and cook for a further 15-20 minutes, or to your personal liking. Remove the oven, cover with foil and leave in a warm place to rest for at least five minutes.  For the glazed fennel, cut the fennel in half and peel off the outside piece with a vegetable peeler. Cook until tender in a pan of boiling water and carefully remove the fennel from the pan. Put a ladle of chicken stock in a pan and add the fennel and warm on a low heat then set aside until ready to serve. For the tomato jus, heat the oil, vinegar and sugar over a low heat. Add the tomatoes and thyme and cook gently for five minutes, then leave the tomatoes in the sauce to absorb the flavour until ready to serve.  To serve, slice the fennel into strips. Slice the lamb and place a few slices on each plate with a generous helping of dauphinoise, glazed fennel and a drizzle of the sauce with a cherry tomato. ","ingredients":" 150ml\/5fl oz double cream,  150ml\/5fl oz full-fat milk,  2 garlic cloves, crushed,  salt and freshly ground black pepper,  knob of butter, for greasing,  1kg\/2lb 4oz waxy potatoes, such as Desiree, sliced thinly,  dash olive oil,  about 900g\/2lb boneless saddle of lamb, rolled and held with string (you can get your butcher to do this),  200g\/7oz breadcrumbs,  1 bunch fresh thyme, chopped,  1 bunch fresh flat-leaf parlsey, chopped,  1 tbsp Dijon mustard,  1 head of fennel,  1 ladle chicken stock,  2 tbsp olive oil,  1 tbsp balsmic vinegar,  1 tsp sugar,  4 cherry tomatoes, skinned,  6 sprigs fresh thyme","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saddle_of_lamb_with_herb_91234"}