{"recipe_name":"Goat stew with cabbage and peanut butter","author":"Thandie Newton","programme":"A Taste of My Life","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Season the goat meat with salt and freshly ground black pepper. Heat the oil and butter in a deep, heavy-based pan. Add the goat meat and fry, stirring occasionally, until browned all over.  Add the onions and garlic and fry over a medium heat until the onions are translucent. Add the tomato purée, cloves, ginger and cayenne pepper and fry for one minute, stirring constantly. Add the lemon juice, lamb or beef stock, thyme and bay leaf and bring to the boil. Reduce the heat, cover with a lid and simmer for 1½-2 hours, or until the meat is tender. For the cabbage, place the cabbage into a bowl and cover with cold salted water for half an hour. Drain off all but a few tablespoons of the cabbage soaking water and transfer the cabbage to a pan over a medium heat. Cover with a lid and steam the cabbage until tender. Drain the cabbage, then return to the pan. Add the peanut butter and stir into the cabbage. To serve, place the cabbage and the goat stew into separate serving bowls. Serve with millet - roll the millet into a ball in your hand and dip into the goat stew. ","ingredients":" 1kg\/2lb 5½oz goat meat cut into 2.5cm\/1in pieces,  salt and freshly ground black pepper ,  3 tbsp vegetable oil,  25g\/1oz butter,  1 large onion, finely chopped,  2 garlic cloves, chopped,  4 carrots, finely chopped,  2 tsp tomato purée,  ¼ tsp cloves,  ¼ tsp ginger powder,  pinch cayenne pepper,  2 tbsp lemon juice,  450ml\/15fl oz lamb or beef stock,  2-3 sprigs fresh thyme,  1 bay leaf ,  salt and freshly ground black pepper,  1 medium cabbage, shredded,  salt,  3-4 tbsp (or to taste) peanut butter,  200g\/7oz millet, cooked according to packet instructions","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sadzagoatstewwithcab_89103"}