{"recipe_name":"Saffron risotto with braised monkfish, fennel, coriander and mint","author":"Matt Tebbutt","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the risotto, heat a large frying pan or sauté pan and melt the butter. Add the onion, fennel and celery and cook until soft, this will take 3–5 minutes. Stir in the rice and cook for 2–3 minutes. Add the wine and cook until reduced in volume at least by half. Pour the stock into a saucepan and drop in the saffron. Gently heat, then add the stock to the rice mixture in batches, stirring until it is absorbed before adding more stock. This will take 15–20 minutes. Finish with the butter. For the monkfish, heat the butter in a large, lidded frying pan and add the onion and fennel.  Cook for 2–3 minutes, then add the chilli and coriander seeds and zest and juice of the orange and cook for a further 1–2 minutes. Add the tomatoes and red wine. Bring to the boil and cook until reduced to a thick, sticky consistency. Add the monkish and cover. Cook for 3–4 minutes, or until the fish is cooked through. Serve the risotto in shallow serving bowls, topped with the monkfish and finished with the coriander and mint.  ","ingredients":" 75g\/2½oz unsalted butter,  1 onion, finely chopped,  1 small fennel bulb, finely chopped,  1 stick celery, finely chopped,  200g\/7oz risotto rice,  150ml\/5fl oz white wine,  300–400ml\/10–14fl oz fish stock,  large pinch saffron,  75g\/2½oz unsalted butter,  50g\/1¾oz unsalted butter,  1 onion, chopped,  1 fennel bulb, chopped,  1 red chilli, chopped,  1 tsp coriander seeds,  1 orange, juice and zest,  1 x 400g tin chopped tomatoes,  500ml\/18fl oz red wine,  1 small-medium monkfish tail, cut into medallions,  1 tbsp freshly chopped coriander,  1 tbsp freshly chopped mint","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saffron_risotto_with_09360"}