{"recipe_name":"Sage-and-onion-stuffing sausage rolls with tomato relish","author":"Brian Turner","programme":"Christmas Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato relish, grind the cumin seeds to a fine powder in a pestle and mortar. Transfer to a bowl and stir in the remaining tomato relish ingredients (except for the parsley), until well combined. Season, to taste, with salt and freshly ground black pepper. Chill in the fridge for at least 30 minutes, or until needed. Stir in the parsley just before serving.  For the sausage rolls, pre-heat the oven to 200C\/180C Fan\/Gas 6. Roll out the pastry onto a lightly floured work surface to the thickness of pound coin. Make a long rectangle measuring at least 10-15cm\/4-6in in width. In a bowl, mix together the garlic, sage, leftover stuffing and sausage meat until well combined. Season with salt and freshly ground black pepper if necessary. Roll the stuffing mixture into a sausage shape that’s a little shorter than the long side of the pastry. Lay the stuffing mixture on top of the pastry rectangle, close to one long side of the rectangle. Brush the pastry all over with beaten egg. Roll the pastry over the stuffing mixture and press the edges to seal well. Brush the top with the remaining egg and sprinkle with the sesame seeds. Cut into six equal-sized sausage rolls. Transfer to a baking tray. Bake for 25 minutes, or until the pastry has risen and is golden-brown and the filling is cooked through. Allow the sausage rolls to cool slightly before serving. Serve with the tomato relish in dipping bowls alongside. ","ingredients":" ½ tsp cumin seeds,  250g\/9oz tomatoes, skins left on, seeds removed, flesh finely chopped,  4 spring onions, trimmed, finely diced,  125g\/4oz Greek-style yoghurt,  1 lime, juice plus grated zest of ½ lime,  ½ small red chilli, seeds removed, finely chopped,  salt and freshly ground black pepper,  2 tbsp chopped fresh parsley,  250g\/9oz readymade puff pastry,  plain flour, for dusting,  1 garlic cloves, crushed,  1 tbsp chopped fresh sage,  250g\/9oz leftover cooked sage-and-onion stuffing, chopped into small pieces,  250g\/9oz good-quality sausagemeat,  2 free-range egg yolks, beaten with 1 tbsp milk,  100g\/3½oz sesame seeds,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sage-and-onion-stuffing_53177"}