{"recipe_name":"Sage brined roast turkey with chestnut and sausage stuffing","author":"Brian Turner","programme":"Christmas Kitchen with James Martin","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a large pan, warm 1 litre\/1¾ pints water and add the salt and sugar. Wrap the dried herbs, garlic and ginger in muslin and add to the pan. When salt and sugar has all dissolved, leave the liquid to cool. When cool, put the turkey into a container and pour over the brine. Leave to soak for 24 hours in the fridge. Then take the turkey out of the brine out and pat it dry. For the stuffing, melt the butter in a pan and add the onion and apples. Cook gently to soften them. Remove from the heat and allow to cool. Mix together with the chestnuts, sausage meat, parsley, salt and pepper.  To cook the turkey, preheat the oven to 160C\/325F\/Gas 3 and soak a few cocktails sticks in water (these will be used to secure the cavity later). Mix the softened butter with the sage and chicken stock. Loosen the skin of the breasts of the turkey, taking care not to pierce it. Smear the mixture onto the breast meat inside the skin. Put the stuffing in the loose skin at the neck end of the turkey, being careful not to put too much in or the skin will tear. Secure with the soaked cocktail sticks. Put the turkey in the oven and cook for 1 hour  to 1 hour 30 minutes, or until the juices run clear and the turkey is cooked through. Any leftover stuffing can be put in a separate buttered oven dish and roasted with the turkey for the final 20-30 minutes, or until cooked through. Take out the turkey when cooked and leave to rest for 15 minutes before serving. For the Brussels sprouts, heat a large saucepan of boiling water and add the sprouts. Blanch for a couple of minutes and drain. Heat a large frying pan and add the butter. Once hot, add the sprouts and cook for a couple of minutes. To serve, slice the turkey crown and place on a large platter with the sprouts, roast potatoes and gravy. ","ingredients":" 2 tbsp sea salt,  2 tbsp brown sugar,  1 tbsp dried sage,  1 tbsp dried thyme,  1 tbsp dried rosemary,  2 garlic cloves, crushed,  1 tbsp chopped fresh ginger,  1.5kg\/3lb 5oz turkey crown, wish bone removed,  125g\/4½oz softened butter,  2 tbsp chopped fresh sage,  2 tbsp chicken stock,  25g\/1oz butter,  1 onion, finely chopped,  1 Bramley apple, peeled, cored and finely chopped,  250g\/9oz pre-cooked chestnuts, chopped,  800g\/1lb 12oz pork sausage meat,  2 tbsp chopped parsley,  salt and freshly ground black pepper,  500g\/1lb 2oz Brussels sprouts,  50g\/1¾oz unsalted butter,  roast potatoes,  gravy","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sage_brined_roast_turkey_44971"}