{"recipe_name":"Salade landaise with romaine lettuce and bleu d’Auvergne","author":"Eric Chavot","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the salt marinade. Mix all the ingredients together thoroughly and store in an airtight container. You will need 60g\/2oz of the salt rub per kilo of meat.  Rub the dug legs all over with the salt rub. Leave them in the fridge for 24 hours, turning the meat at least four times during the curing process. To make the blue cheese dressing, place the ingredients in a blender, and blend for 2-3 minutes until smooth. Taste and season with salt and pepper if required. Keep refrigerated until needed. For the house dressing, using a stick blender mix the French dressing, honey and vinegar together. Slowly add the vegetable oil with the blender still running (the same way as you would to make mayonnaise).  When the dressing has emulsified add the shallots, garlic and herbs. Blend until the dressing starts to turn greenish from the herbs. Leave to infuse for 1-2 hours, and then pass through a fine chinois or fine sieve. Season with salt and pepper to taste and keep refrigerated until needed. For the crème fraîche dressing, whisk together all the ingredients in a bowl. Keep refrigerated until needed. For the honey dressing, whisk together all the ingredients in a bowl with 50ml\/2fl oz water. Keep refrigerated until needed. For the remoulade, place all the ingredients in a large glass bowl and mix. For the spice mix place all the ingredients in a spice grinder or pestle and mortar and grind to a powder. To confit the duck legs, remove them from the salt marinade and wash them.  Heat a heavy frying pan over a low-medium heat, then add the duck legs to the pan and cover them completely in the duck fat. Bring the duck fat to a gentle simmer and cook the duck legs gently for 2-2½ hours, or until the meat is very tender.  Preheat the oven to 165C\/330F\/Gas 4. Remove the duck legs from the fat and transfer to a hot ovenproof pan. Fry them skin side down until browned. Add the chestnuts to the pan and transfer to the oven to heat through and crisp. Keep warm until ready to serve.  For the spicy pecans, preheat the oven to 165C\/330F\/Gas 4 In a large frying pan, melt the butter with the sugar to make a caramel. Add the cayenne pepper then fold in the pecans. Gently fold in the whisked egg whites until all the nuts are coated. Transfer the pan to the oven and cook for 25 minutes, stirring two or three times, until done. For the duck breast, place it skin-side down in a hot, dry pan. Season the upper side with salt. Fry until cooked to your liking. Add the honey dressing to the pan and season with spice mix before serving To assemble the salad, place the remoulade in the corner of a large serving board. Season the lettuce with salt and pepper, drizzle with blue cheese dressing and house dressing. Dot over the top with the blue cheese, chives, croutons, fresh grapes, dried grapes. Roll up the duck ham and place on top. Take the chestnuts from the pan that has been in the oven and dress them in the house dressing. Add them on top of the salad. Season the salad with the espelette pepper. Place the confit leg and sliced duck breast on the end of the board. ","ingredients":" 150g\/5½oz sea salt,  7g crushed black peppercorns,  18g garlic, peeled and chopped,  5g fresh thyme leaves,  37g\/1oz caster sugar,  1g pink salt,  2 duck legs, skin on, bone in,  375g\/13oz duck fat,  150g\/5½oz cooked chestnuts, halved,  3g garlic, peeled and crushed,  70g\/ 2½oz fourme d’Ambert cheese,  30g\/\/1oz gorgonzola cheese,  50g \/1¾oz buttermilk,  40g \/1½oz soured cream,  40g \/1½oz mayonnaise,  dash Worcestershire sauce,  dash tabasco,  30g\/1oz French dressing,  30g\/1oz clear honey,  30g\/1oz white balsamic vinegar,  500ml\/18fl oz vegetable oil,  5g shallots, peeled and diced,  ½ garlic clove, sliced,  1 tsp chopped parsley,  1 tsp chopped chives,  1 tsp chopped basil,  1 tsp chopped thyme leaves,  150g\/5½oz mayonnaise,  50g\/1¾oz crème fraîche ,  1 lemon, zest and juice,  dash tabasco,  25g\/1oz honey,  50ml\/2fl oz red wine vinegar,  ½ celeriac, peeled and julienned,  ½ Granny Smith, cored and julienned,  ½ red apple, cored and julienned,  1 tbsp blue cheese dressing (from above),  1 tbsp house dressing (from above),  1 tbsp crème fraîche dressing (from above),  2 star anise,  1 cinnamon sticks,  ½ tsp black peppercorns,  4 cloves,  ½ tsp cumin seeds,  125g\/4½oz butter,  150g\/5½oz brown sugar,  2 pinches cayenne pepper,  300g\/11oz pecans,  50g\/1¾oz egg white, beaten until frothy,  1 duck breast,  1 romaine (cos) lettuce, cut in half,  salt and pepper,  100g\/3½oz crumbled bleu d’Auvergne (or other French blue cheese),  1 tbsp chopped chives,  1 baguette, diced and fried to make croutons,  50g\/1¾oz green grapes, sliced in half,  50g\/1¾oz black grapes, sliced in half,  50g\/1¾oz semi-dried grapes,  8 slices duck ham,  pinch espelette pepper, or French ground chilli pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salade_landaise_with_15997"}