{"recipe_name":"Salad of fresh crab and crispy avocado, with a chilli and mint dressing","author":"Stephen Terry","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Combine all the ingredients for the chilli mint dressing one hour before required and set aside. Prepare the salad leaves as desired and season lightly with salt and pepper before adding the olive oil and fresh lemon juice. Place equal amounts on each plate. Dip the quarters of avocado in the flour, shake off any excess, then dip them in the beaten egg, rub gently with a finger to remove any excess and make sure the egg has completely coated the flour. Finally dip them in the breadcrumbs, again ensuring the avocado is completely covered. Deep-fry the avocado quarters at 180C\/350F until they are golden brown - around one minute. Remove, place on kitchen paper and season with salt and pepper. Combine all the ingredients for the crab and place equal amounts on each plate. Dress the avocados with the chilli mint dressing and place two quarters on each plate. ","ingredients":" mixed salad leaves for four small salad garnishes (eg, rocket, frisie, baby gem, oakleaf, dandelion, chicory etc.)salt and pepper,  extra virgin olive oil,  fresh lemon juice,  2 ripe avocados, peeled, stoned and cut into quarters,  20g\/1oz dried breadcrumbs,  5g\/¼oz plain flour,  1 egg, beaten,  fresh white crab meat (allow 40g\/2oz per person),  2 spring onions,  finely chopped ,  ½ bunch chives,  ½ fresh lemon, juiced,  extra virgin olive oil,  small amount flat leaf parsley, chopped,  salt and pepper, to taste,  2 large mild red chillies, de-seeded and  finely chopped,  2 shallots, peeled and  finely chopped ,  ½ bunch mint,  extra virgin olive oil,  2 limes, juiced,  2 tomatoes, blanched, peeled, and the flesh cut into small dice,  sea salt, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saladoffreshcrabandc_13754"}