{"recipe_name":"Salad of sea trout with laverbread","author":"Angela Hartnett","programme":"Great British Menu","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Remove any pin bones from the trout fillets, then score the skin. Prepare the artichokes by pulling off any large leaves, trimming and peeling them, then scooping out the feathery chokes with a teaspoon. As each one is prepared, drop immediately into a bowl of water and lemon juice to prevent discoloration. Cook the carrot, fennel and garlic in a little olive oil with the thyme and a pinch of salt until lightly coloured.  Add the artichokes and cover with the white wine and 100ml\/3½fl oz of water. Cook for about 10 minutes or until the artichokes are tender (test with the tip of a sharp knife).  Meanwhile, mix together the laver bread, oatmeal, lemon juice, parsley, hazelnuts and oil in a bowl and season with salt and freshly ground black pepper. Shape into four little cakes.  Heat the butter and oil in a frying pan and fry the cakes until golden brown on both sides. Remove from the pan and keep hot.  For the sea trout, fry the trout fillets in hot olive oil, skin-side down first, for about two minutes on each side. To serve, place a laver bread cake in the centre of each plate and spoon the warm artichokes on top. Place the trout fillets on the vegetables and serve. ","ingredients":" 2 whole sea trout, filleted,  olive oil,  8-12 baby violet artichokes,  lemon juice,  1 small carrot, finely chopped,  1 small bulb fennel, finely chopped,  1 clove garlic, crushed ,  olive oil,  sprig of thyme ,  salt and freshly ground black pepper ,  100ml\/3½oz white wine,  100g\/3½oz dried laverbread, soaked (or use tinned or vaccum-packed),  100g\/3½oz fine oatmeal,  squeeze of lemon juice,  1-2 tbsp flatleaf parsley, chopped,  25g\/1oz hazelnuts, chopped,  drizzle of hazelnut oil,  salt and freshly ground black pepper,  knob of butter,  1 tbsp vegetable oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saladofseatroutwithl_82001"}