{"recipe_name":"Salmi of pheasant (or partridge, or guinea fowl) with roast chestnuts","author":"Hugh Fearnley-Whittingstall","programme":null,"prep_time":"1-2 hours","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6.  Wipe a little oil over the breasts of the birds.  Oil a roasting tin with a little more oil and shake the vegetables in the tin to oil.  Place the birds in the tin with the vegetables and add the giblets. Place the tray in the oven and roast the birds for about half an hour until nicely browned. The juices between the drumstick and the breast should still run pink. The vegetables and giblets should also be nicely coloured. Leave the birds to cool for a few minutes, then joint the birds. First, gently push the leg (ie drumstick and thigh) away from the body, exposing the end of the thigh bone where it meets the back of the bird. You should be able pull this portion clean away from the bird. The breast can then be sliced away from the carcass, as close as possible to the breast bone, in a portion that includes the wing. Skin all the portions and remove the last two joints of each wing, which have hardly any meat, but will go in the pot for the sauce. Set aside your portions (covered and in the fridge if the dish is for the next day) and get to work on the sauce. Tear up the carcass of the bird with your fingers and break the bones by cracking with a rolling pin. Place the broken carcass with the skin, chopped neck and other giblets, the roasted vegetables from the pan, along with the bay leaf and thyme, into a suitable sized saucepan. For extra flavour, pour any excess oil out of the roasting pan, then deglaze it on a hot hob with half a glass of the wine.  Pour the resulting gravy into the saucepan with the rest of the wine and just enough water to cover everything. Bring to the boil. If you're preparing the dish for the next day you can cook your stock at a gentle simmer for up to two hours. If its for the same day, then boil the stock fairly rapidly for about half an hour. While the stock is cooking, make little slits in the chestnuts with the point of a sharp knife. Roast them in a dry pan over a hob or in a roasting tin in the oven, shaking the pan\/tray occasionally to turn the chestnuts. Cook until well-charred. Leave until cool enough to handle, but still hot, and peel with your fingernails, removing the (slightly furry) inner husk, as well as the shell. Try to keep them whole. The meat of the chestnuts should be browned, even slightly blackened in parts and completely tender to eat. Strain the stock through a chinois or heavy sieve, pressing to extract maximum juices from the carcass pieces. Then strain the stock again, ideally through muslin or a cotton cloth. Taste your stock. If it has a good strong flavour of roast bird then you are ready to proceed and finish the sauce. If it's still a little insipid then you can intensify the flavour by further rapid boiling to evaporate water and reduce (ie concentrate) the stock. Use some of the chestnuts to thicken the stock. 8-12 chestnuts, depending on size, will nicely thicken ½-¾ litre\/¾-1¼pt of stock. Place the chestnuts (preferring any broken ones) in a blender with a couple of ladles of the stock and process until smooth and thickened. Strain into a clean pan and stir in the rest of the stock. Bring carefully to the boil and allow to bubble gently for just a couple of minutes. If the sauce seems too thin (it should be fairly luxurious), then repeat the process with a few more chestnuts. Now season the sauce with salt and freshly ground black pepper to taste. Enrich with a spoonful of double cream (you don't need much). Return the pieces of meat to the sauce in a suitable pan and reheat gently, turning the pieces occasionally in the sauce and allow it to simmer gently for a few minutes. At the same time toss the peeled chestnuts in a lightly oiled pan until they are glistening and hot. Steam some suitable greens, such as savoy cabbage, lightly buttering them when they are done. Serve all together in a plate deep enough to take plenty of sauce. ","ingredients":" 2 pheasants, or 3 partridges, or 3 guinea fowl, with giblets (ie neck, gizzard, heart and liver, washed and trimmed of any discoloured parts if necessary) if possible,  1 stick celery, cut into 8 pieces ,  1 large carrot, cut into 8 pieces ,  1 medium onion, cut into 8 pieces ,  a little sunflower or olive oil ,  bay leaf ,  sprig of thyme ,  1 glass white wine ,  36 plump chestnuts in their skins ,  2 tsp double cream ,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmiofpheasantorpar_14228"}