{"recipe_name":"Salmon and pak choi quiche","author":"Jason White","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4.  To make the pastry, mix the flour, salt and sesame seeds in a medium bowl and make a well in the centre.  Beat together the butter and half the beaten eggs in a small bowl and gradually mix into the flour mixture to make a soft dough. Lightly knead the dough on a floured board until smooth then wrap in cling film and chill for at least 20 minutes. To make the filling, season the salmon with salt and freshly ground black pepper and bake in the oven for about 20 minutes or until just cooked through. Allow the fish to cool a little then flake the flesh into small pieces.  Turn the oven up to 190C\/375F\/Gas 5. Roll the pastry out on a floured board and line a greased 23cm\/9in loose-bottomed tart tin. Chill for 15 minutes then prick the base with a fork, line with aluminium foil and baking beans and bake for 15 minutes. Remove the foil and baking beans, brush the base of the tart case with the remaining beaten egg from the pastry ingredients and bake for five more minutes. Remove the tin from the oven and turn the temperature down to 180C\/350F\/Gas 4. Arrange the salmon over the base of the tart case and drizzle over the soy sauce. Mix the eggs with the cream in a jug, season with salt and freshly ground black pepper then pour three quarters of the mixture over the salmon. Arrange the pak choi on top, cut side up, and pour over the remaining egg mixture. Bake in the oven for about 35 minutes or until the filling is golden brown and just set. ","ingredients":" 250g\/9oz plain flour, sifted,  ½ tsp salt,  1 tbsp toasted sesame seeds,  150g\/5½oz butter, softened,  2 free-range eggs, lightly beaten,  400g\/14oz salmon fillets, skinned,  sea salt and freshly ground black pepper,  1 tbsp soy sauce,  3 free-range eggs,  300ml\/10fl oz double cream,  2 pak choi, sliced in half lengthways","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_and_pak_choi_36040"}