{"recipe_name":"Salmon and watercress pan bagnat","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01sv9j9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. Place the salmon in a deep-sided tray with the lemon slices, cover with water then place in the oven for 15-20 minutes, or until just cooked through. Remove and allow to cool slightly before flaking the fish into large pieces. To make a pesto, put the basil, garlic, pine nuts and two-thirds of the watercress into a food processor and blend until slightly chunky, then add the oil gradually until it forms a thick paste. Heat a griddle pan until very hot. Toss the courgettes with a tablespoon of olive oil and season with salt and black pepper. Place on the griddle in batches and cook for 1-2 minutes until just cooked through. Remove and set aside to cool.  Take the loaf and cut off the top ¼ and set it aside.  Scoop out all the bread from the inside of the loaf. (You can keep it for making breadcrumbs at a later date.)  Spread some of the pesto into the bottom of the loaf. Place a quarter of the charred courgettes into the bottom of the loaf and press down lightly. Place a quarter of the remaining watercress on top and press down. Top with a quarter of the salmon, peppers, sliced onions and more pesto, then repeat the layers until the loaf is full to the brim, then place the lid back on top. Wrap very tightly in cling film and place in the fridge for at least one hour, but preferably overnight or even for up to three days. To serve, unwrap and cut into wedges. ","ingredients":" 1.5kg\/3lb 5oz salmon fillet,  1 lemon, sliced,  1 large bunch basil,  2 garlic cloves,  60g\/2¼oz toasted pine nuts,  400g\/14oz picked watercress,  400ml\/14fl oz extra virgin olive oil,  2 red onions finely, sliced,  6 courgettes, thinly sliced lengthways,  2 tbsp olive oil,  salt and freshly ground black pepper,  1 large pain de compagne loaf (round loaf of rustic bread or sourdough),  3 x 200g\/7oz jars roasted piquillo red peppers, opened out","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_and_watercress_66531"}