{"recipe_name":"Salmon gravlax with gin ","author":"The Hairy Bikers","programme":"Hairy Bikers Everyday Gourmets","prep_time":"overnight","cooking_time":"no cooking required","serves":"Serves 12","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p015nmfw.jpg","method":"Run your fingers across the top of the salmon fillets, removing any bones you find. In a large bowl, mix together the salt, muscovado sugar and granulated sugar until well combined. Grind the dill seeds, coriander seeds and cracked black pepper to a powder in a pestle and mortar. Sprinkle the seed powder over the salt mixture, then stir in the lime zest, gin and chopped fresh dill until well combined. Take a large piece of aluminium foil, large enough to wrap around both fillets of fish, and place one fillet of salmon, skin-side down, on top of it.  Cover the salmon fillet with all of the salt mixture, then place the remaining salmon fillet, skin-side up, on top of it. Wrap the fillets tightly in the foil, then pierce a few holes in it using a cocktail stick (this allows excess liquid to drain from the fish).  Place the fish onto a baking tray and place another baking tray on top. Weigh the top baking tray down with a couple of house bricks or weights from a set of kitchen scales. Chill in the fridge for 2-3 days, turning the packet of fish every 6-8 hours, where possible. To serve, unwrap the salmon, scraping off any excess salt mixture. Slice the fillets very thinly on the diagonal using a sharp knife, and serve with a wedge of lemon, rye bread and a simple green salad.  ","ingredients":" 2 x 1kg\/2lb 4oz centre-cut pieces salmon, skin on, pin-bones removed,  400g\/14oz coarse sea salt ,  100g\/3½oz light muscovado sugar,  150g\/5¼oz granulated sugar,  1 tbsp dill seeds,  1 tbsp coriander seeds ,  1 tbsp cracked black pepper,  2 limes, zest only,  100ml\/3½fl oz gin,  150g\/5¼oz fresh dill, roughly chopped,  1 lemon, cut into wedges,  rye bread,  lightly dressed green salad","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_gravlax_with_gin_65124"}