{"recipe_name":"Salmon, herb and courgette roulade","author":"Ed Baines","programme":"Country Show Cook Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 1 roulade","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chutney, place the star anise, cloves and peppercorns on a piece of muslin and make into a parcel, securing it with cook’s string. Add to a large pan with the white wine vinegar, salt and sugar. Bring to a boil, then simmer gently.   Put the remaining chutney ngredients into the pan with the muslin parcel. Bring to the boil slowly and then simmer gently until the sauce has reduced to a syrupy consistency. For the roulade, preheat the oven to 180C\/350F\/Gas 4. Chop the ends off the courgettes and grate them into a bowl.  Sprinkle with a teaspoon of salt and leave for 5-10 minutes. In another bowl, rub the margarine into the flour using your fingertips until the mixture resembles breadcrumbs.  Add the courgettes and any juice that seeped out while they were salted. Pick the leaves from the sprigs of herbs, then chop the marjoram, thyme, parsley and sage and add to the mixture. Add the egg and season to taste with salt and freshly ground black pepper. Bring all the ingredients together to form a dough (add a little water or more flour if needed). Roll out the mixture on greaseproof paper so it is 1cm\/½in deep, then lift the greaseproof paper into a baking tin and bake in the oven for 8-12 minutes. For the filling, in a bowl mix together the spring onion, chives, rocket, watercress, soft cheese, salmon and lemon juice. Season to taste with salt and freshly ground black pepper. Remove the roulade from the oven and set aside to cool slightly.  Spread the filling over the roulade and roll tightly. Place in the fridge for 10 minutes. To serve, cut the roulade into slices, garnish with salad leaves and add a spoonful of the chutney. ","ingredients":" 3 star anise,  3 cloves,  4 peppercorns,  280ml\/½ pint white vinegar,  ½ tsp salt,  125g\/4½oz granulated white sugar,  900g\/2lb beetroot, boiled until tender, cut into wedges,  2 shallots, chopped,  1 tomato, peeled and chopped,  1 stalk of rhubarb, chopped,  200g\/7oz runner beans, chopped,  1 tbsp freshly grated horseradish ,  2 medium courgettes ,  salt and freshly ground black pepper,  75g\/2½oz margarine,  200g\/7oz self-raising flour ,  1 sprig marjoram,  1 sprig thyme,  1 sprig parsley,  1 sprig sage,  1 free-range egg,  salad leaves, to serve,  3 spring onions, finely chopped,  50g\/1¾oz watercress, finely chopped,  50g\/1¾oz rocket, finely chopped,  2 garlic cloves, finely chopped ,  1 small bunch chives, finely chopped,  100g\/3½oz soft cheese,  8 slices of smoked salmon, cut into cubes,  ½ lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_herb_and_38145"}