{"recipe_name":"Salmon rendang with mint salad","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spice paste, place all the ingredients into a food processor and pulse to form a paste. Transfer the paste to a small bowl and set aside. For the salmon, heat a heavy-based pan over a medium heat, add half the oil then brown the salmon on all sides, remove from the pan and set aside. Add the remaining oil to the pan and fry the spice paste for 2-3 minutes. Add the cinnamon, cloves, star anise, cardamom and lemongrass and cook for another couple of minutes. Return the salmon to the pan, mix well then add the coconut milk, 200ml\/7fl oz water, tamarind paste and lime leaves and bring to a simmer. Add the toasted coconut, soy and fish sauces and return to the boil, stirring all the time to make sure it doesn’t stick. Turn down to a gentle simmer and cook for 2-3 minutes. Add the lime juice and season with sea salt and freshly ground black pepper. For the salad, whisk the rice wine vinegar and sesame oil together in a bowl then add the remaining ingredients and toss to combine. To serve, spoon the curry onto the plate and pile the salad alongside. ","ingredients":" 5 shallots, roughly chopped,  3cm\/1¼in galangal, roughly chopped,  3 stalks lemongrass, roughly chopped,  5 cloves garlic, roughly chopped,  3cm\/1¼in ginger, roughly chopped,  5 dried chillies, soaked in warm water, seeds removed and roughly chopped,  5 tbsp vegetable oil,  1kg\/2lb 4oz salmon fillet, cut into cubes,  2 cinnamon stick,  3 cloves,  3 star anise,  3 cardamom pods,  1 stalk lemongrass, roughly chopped,  400ml\/14fl oz coconut milk,  2 tsp tamarind paste ,  6 kaffir lime leaves ,  6 tbsp desiccated coconut, toasted,  2 tbsp soy sauce,  2 tbsp fish sauce,  2 limes, juice only,  sea salt and freshly ground black pepper,  2 tbsp rice wine vinegar,  3 tbsp toasted sesame oil,  3 tbsp mint leaves,  3 tbsp coriander leaves,  ½ cucumber, finely shredded,  250g\/9oz white cabbage, finely shredded,  1 red chilli, finely shredded","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_rendang_with_mint_04196"}