{"recipe_name":"Salmon, scallop and mackerel pie with green salad and honey dressing","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the puff pastry, place the flour in a mound on a clean work surface and make a well in the centre.  Place the butter and salt in the well and work them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand. When the cubes of butter have become small pieces and the dough is grainy, gradually add the iced water and mix until it is all incorporated, but don’t overwork the dough – you should have a marbled effect with the butter without mixing it in properly. Roll the mixture into a ball, wrap in cling film and refrigerate for 20 minutes.  Flour the work surface and roll out the pastry into a 40x20cm\/16x8in rectangle. Fold the top third down to the centre, then the bottom third up and over that. Give it a quarter-turn.  Roll the block of pastry into a 40x20cm\/16x8in rectangle as before, and fold it into three again. These are the first two turns. Wrap the pastry in cling film and refrigerate it for 30 minutes. Give the chilled pastry another two turns, rolling and folding as before. This makes a total of four turns. Wrap the pastry in cling film and refrigerate for at least 30 minutes before using.  For the salmon, scallop and mackerel pie, preheat the oven to 200C\/400F\/Gas 6. Using a sharp knife, cut each mackerel along its belly until 5cm\/2in away from the tail end.  Discard the guts and carefully remove all the bones to butterfly the mackerels, leaving the tail attached to the fillets.  Place the salmon and cream in a food processor and blend. Add the egg white and blend again until a mousse-like consistency is achieved. Season with salt and pepper and spoon into a piping bag. Pipe the salmon mousse into the centre of the mackerel and lay the sliced scallops on top. Place the herbs on top of that and season with salt and pepper. Wrap each filled mackerel in puff pastry, leaving the tails exposed. Brush the pastry with egg yolk and leave to rest in the fridge for 30 minutes. Remove from the fridge and place in the oven for 12-20 minutes, or until the pastry is golden-brown and the fish cooked through. For the green salad and honey dressing, place the honey, vinegar and 50ml\/2fl oz water in a small saucepan and heat until a syrup consistency is formed. Allow to cool. Place the lettuce, beans and tomatoes in a large glass bowl, pour over the honey dressing and mix. To serve, cut the mackerel parcels in half and stand the tail halves on end. Serve the dressed salad alongside. ","ingredients":" 250g\/9oz plain flour, plus extra for dusting,  250g\/9oz unsalted very cold butter, cut into small cubes,  ½ tsp salt,  125ml\/4fl oz ice cold water,  1 free-range egg yolk, beaten,  4 whole mackerel, heads removed,  400g\/14oz fresh salmon pieces, skin removed,  300ml\/10½fl oz double cream,  1 free-range egg white, whipped to soft peaks,  salt and freshly ground black pepper,  4 scallops, cleaned and sliced,  1 tbsp chopped fresh tarragon, leaves only,  1 tbsp chopped fresh dill, leaves only,  50g\/1¾oz honey,  50ml\/2fl oz red vinegar,  4 baby gem lettuce heads, washed and leaves separated,  100g\/3½oz French green beans, blanched,  4 heritage tomatoes, cut into quarters","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_scallop_and_12054"}