{"recipe_name":"Salmon, sweet citrus salad, remoulade and bread and butter crisps","author":"Stephanie Moon","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salmon, mix the olive oil, vanilla seeds and seasoning together in a large bowl. Add the salmon pieces and leave to marinade for at least 30 minutes.  Preheat the oven to 180C\/350F\/Gas 4. (You need to preheat the oven for the bread crisps.) Once you are ready to cook the salmon, remove it from the marinade. Heat a non-stick frying pan and fry the salmon for one minute on each side. Set aside to cool until ready to serve. To make the dressing, place all the ingredients, (except the oils and vinegar) in a pan and bring to the simmer. Cook for 6-8 minutes to soften the zest, then transfer to a blender and blend until smooth.  With the motor on the blender running, slowly add the oils and vinegar. Continue to blend until smooth. Season to taste with salt and pepper.  For the celeriac remoulade, place the egg yolks in a food processor. Add the mustard and, with the motor running, slowly adds the oils until smooth and emulsified. Season to taste with salt and freshly ground black pepper.  Place the fennel and celeriac into a large bowl and stir in the chopped parsley and all but four tablespoons of the dressing. Mix together and season to taste.   For the bread crisps, cut the toasted bread slices into small triangles and arrange on a baking tray. Brush with butter and place in the oven to bake until golden-brown. To serve, place the celeriac remoulade onto four serving plates. Scatter with the chopped chicory leaves. Arrange the mixed leaves on top and the grapefruit segments over. Arrange the salmon pieces on top and sprinkle with fennel tops to garnish. Finish with a spoonful of dressing, the bread crisps and borage flowers to garnish. ","ingredients":" glug of olive oil,  1 vanilla pod, split in half and seeds scrapped out,  salt and freshly ground black pepper,  400g\/14oz salmon fillet, skinned and cut into large bite-sized pieces (two pieces per portion),  1 orange, zest and juice,  1 lemon, zest and juice,  1 lime, zest and juice ,  1 pink grapefruit, zest and juice,  50g\/1¾oz caster sugar,  50ml\/2fl oz olive oil,  50ml\/2fl oz vegetable oil,  2 tbsp white wine vinegar,  3 free-range egg yolks,  2 tsp wholegrain mustard,  1 tbsp olive oil,  1 tbsp vegetable oil,  salt and freshly ground black pepper,  1 small fennel, finely sliced,  ½ small celeriac, peeled and finely sliced,  small handful chopped flatleaf parsley,  2 slices of white bread, crusts removed and toasted both sides,  1 green chicory, chopped into pieces,  1 bag of mixed salad leaves or 2 lettuces washed and prepared,  1 pink grapefruit, segmented and chopped,  1 white grapefruit, segmented and chopped,  fennel tops or micro fennel tops,  borage flowers","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_sweet_citrus_93056"}