{"recipe_name":"Salmon vindaloo with coconut and peanut rice","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the coconut and peanut rice, place the rice in a large saucepan and add the water until it covers the rice by 2cm\/1in. Cook until all the water has gone, and then place a lid on top and leave to cook for 10-15 minutes. Turn off the heat and leave to steam for 10 minutes. Just before serving stir through the peanuts, coconut and fried onions. For the salmon vindaloo, heat the grill to high. Heat a small frying pan and add the cumin, coriander, caraway, mustard seeds, whole cloves and cinnamon stick. Cook until the seeds start to pop, then remove from the pan, add to a spice grinder and grind to a powder. Pour the spices into a small bowl and add the turmeric, black pepper and chilli powder, and stir. Place the oil, onion, garlic, chillies, red wine vinegar and palm sugar in a food processor and blend to a paste. Add the mixture of spices and blend again. Preheat the grill to hot. Smear half of the paste on the salmon fillets and place on a baking tray. Put under the grill for 4-5 minutes. Heat a large saucepan and add the remaining paste and cook for 2-3 minutes. Add the coconut milk and cook for a further two minutes. To serve, place the rice in a large serving bowl and flake the cooked salmon over the top. Pour the sauce over and garnish with the chopped coriander.  ","ingredients":" 310g\/11oz basmati rice,  100g\/3½oz peanuts, crushed,  100g\/3½oz fresh coconut, shaved,  100g\/3½oz fried onions,  1 tsp whole cumin seeds,  1 tbsp whole coriander,  ½ tsp caraway seeds,  1 tsp mustard seeds,  4 whole cloves,  1 cinnamon stick,  1 tsp ground turmeric,  1 tsp ground black pepper,  1 tsp red chilli powder,  2 tbsp sunflower oil,  1 onion, sliced,  2 garlic cloves, finely chopped,  2cm\/1in piece fresh ginger ,  2 red chillies, finely chopped,  2 tbsp red wine vinegar,  1 tsp palm sugar,  4 x salmon fillets, skin on 150-200g\/5½-7oz per portion,  1 x 400g\/14oz can coconut milk,  2 tbsp finely chopped fresh coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_vindaloo_with_36077"}