{"recipe_name":"Salmon with a quinoa salad and ginger sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ginger sauce, heat 2 tablespoons of oil in a frying pan. Fry the cumin seeds over a low heat for 1-2 minutes then add the sesame seeds, ginger, green chilli and chilli powder. Season with a little salt. Stir fry for 2-3 minutes and then cover the mixture with a circle of greaseproof paper and let it cook very gently for 40-45 minutes.  Let the mixture cool then transfer to a food processor and blend to a fine paste with the tamarind paste and palm sugar.  Heat the remaining oil in a separate pan, add the asafoetida, red chilli and mustard seeds. As the mustard seeds pop, add the curry leaves, stir for 30 seconds then pour into the ginger chutney mixture and mix well. Set aside. For the quinoa salad, heat a large griddle pan. Put the oil in a large bowl and add all the vegetables and lemon. Mix to combine and season with salt and pepper. Place onto the griddle pan and cook for 3-4 minutes on each side or until char marks appear. Cook the quinoa according to the packet instructions and place in a large bowl. Mix in the charred vegetables, sultanas, tomatoes and herbs. Season with salt and pepper and squeeze over some of the juice from the lemon wedges. For the salmon, heat a large frying pan and add the oil. Once hot, add the salmon skin-side down. Cook for 2-3 minutes then turn over and cook for a further 4-5 minutes.  To serve, dress the plates with the ginger sauce and dot round the salad. Place the salmon on top. ","ingredients":" 1 tbsp rapeseed oil,  1 tsp cumin seeds,  2 tsp sesame seeds,  200g\/7oz fresh ginger, peeled and thinly sliced,  1 green chilli, slit open,  1 tsp red chilli powder,  100g\/3½oz tamarind paste,  100g\/3½oz palm sugar,  pinch asafoetida,  1 dried red chilli,  ½ tsp mustard seeds,  5-6 curry leaves,  2 tbsp olive oil,  ½ small cauliflower, cut into florets and thinly sliced,  1 courgette, thinly sliced on an angle ,  1 red onion, cut into wedges,  1 lemon, cut into wedges,  400g\/14oz quinoa ,  75g\/2½oz sultanas,  2 tomatoes, finely chopped,  ¼ bunch basil,  ¼ bunch coriander,  ¼ bunch mint,  salt and pepper,  1 tbsp olive oil,  4 salmon fillets (200-250g\/7-9oz each), skin-on and pin boned","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmon_with_a_quinoa_08834"}