{"recipe_name":"Salmon and cod fishcakes with salsa verde","author":"John Torode","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Makes 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Put the salmon and cod in a large deep container, then mix plenty of boiling water in a jug with a little salt and a dash of white wine vinegar. Pour over the fish to cover. Put the lid on. After 20 minutes take the cod out of the water. Then after a further ten minutes remove the salmon. Place in a pan and warm through for a couple of minutes. Then flake the flesh into a large bowl and mix in the mashed potato, onions, chillies, herbs, lemon juice and zest, salt and freshly ground black pepper. Try and keep the chunky texture. Next spread the flour on a plate. Shape the mixture into 12 fishcakes and dip in the flour. Heat some butter and oil in a pan and fry them on both sides for about 6-8 minutes, until golden.  To make the Salsa Verde, soak the breadcrumbs in the vinegar briefly, then put into a food processor with the herbs, garlic and seasoning. Process briefly to  a coarse paste. With the motor running, add the olive oil a little at a time, until it is all incorporated. Add the anchovies and the capers and blitz for 2 seconds (literally press the switch on and off, to preserve the texture). Bring a pan of water to the boil, put in the eggs and boil for 3 minutes. Run some cold water over the eggs briefly, then shell them while still warm. Scoop out the yolks and stir into your mixture. Finally chop the egg whites and fold them into the sauce. ","ingredients":" 600g\/1lb 5oz salmon fillet, skin on,  600g\/1lb 5oz cod fillet, skin on ,  boiling water,  salt and freshly ground black pepper,  dash white wine vinegar,  4 big floury potatoes, cooked and mashed with skin,  2 medium red onions, finely diced,  3 long, red chillies, seeded and chopped,  2 handfuls chopped parsley,  2 handfuls chopped coriander,  2 lemons, juice only and zest of 1,  flour, for dusting,  100g\/3½oz butter,  200ml\/7fl oz oil,  50g\/2oz white breadcrumbs,  1½ tbsp of red wine vinegar,  basil, small bunch,  flat-leaved parsley, small bunch,  3 garlic cloves, chopped,  ½ tsp salt and freshly ground black pepper,  120ml\/4fl oz olive oil,  6 anchovy fillets, roughly chopped,  1 tbsp salted capers, rinsed,  2 eggs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmonandcodfishcake_70662"}