{"recipe_name":"Salmon en croute with spinach, cream cheese and orange","author":"Elizabeth Guy","programme":"Countryfile Summer Diaries","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"If you have time the night before, put the salmon in a bowl and squeeze over the orange juice. Cover and leave in the fridge until you're ready to cook the dish. Set the orange zest aside. Preheat the oven to 200C\/400F\/Gas 6. Slice the puff pastry into two rectangles vertically through the middle of the block. Roll out one block of puff pastry into a rectangle approx 26cm\/10in long by 14cm\/5½in wide (this allows for shrinkage when cooked), setting the other piece aside. Prick all over with a fork. Place on a baking tray and bake in the oven for about 15 minutes until well risen and golden brown.  In a frying pan over a low heat, soften the spring onions in a little butter. If using fresh spinach, rinse and put in a large saucepan and cook until wilted. If using frozen spinach, defrost thoroughly.  Put the spinach in a sieve and really press hard to squeeze all the moisture out.  Combine the spring onions, spinach, orange zest, black pepper and cream cheese in a bowl and mix thoroughly. Slice the salmon, at an angle, into six portions. Arrange half the salmon on the cooked pastry base.  Spoon the spinach mixture onto the salmon and flatten. Arrange the rest of the salmon on top. Roll out the remaining pastry into a rectangle slightly bigger than the base. Using a beaten egg, brush around the edge of the base and then lay the top pastry over to cover the salmon. Tuck the pastry top under the base or press down firmly to seal. Brush with beaten egg and make small cuts in the top to allow steam to escape while cooking. Bake in the centre of the oven for about 40 minutes, reducing the temperature to 150C\/300F\/Gas 2 after 20 minutes.  Serve in slices with new potatoes and a fresh green salad. ","ingredients":" 1 medium salmon, skinned and filleted ,  1 orange, juice and zest,  1 x 375g\/13oz packet readymade puff pastry,  1 tbsp butter,  1 bunch of spring onions, finely sliced,  1 x 300g\/11oz packet spinach, either fresh or frozen (if frozen ensure that it is defrosted thoroughly),  freshly grated black pepper,  1 x 200g\/7oz cream cheese,  1 free-range egg, beaten,  new potatoes ,  fresh green salad","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmonencroutewithsp_83719"}