{"recipe_name":"Black Forest gâteau cream horns","author":"Ian Cumming","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 12 cream horns","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rough puff, sift the flour and cocoa into a mixing bowl and stir in the salt. Add the butter and rub it into the flour using your fingertips (you should have small flakes of butter throughout). Mix in 160ml\/5½fl oz water and gently knead together. Bring the dough together and shape into a rectangle. Wrap in cling film and chill for 20 minutes. On a lightly floured work surface, roll out the chilled pastry to a rectangle about 60cm\/24in long. With the short edge facing you, fold the top third down and the bottom third up. Turn the pastry by 90 degrees (known as a quarter turn) and roll out into a rectangle as before. Repeat the folding process, wrap in cling film and chill again. To make the Black Forest gâteau filling, whip the double cream until stiff peaks form when the whisk is removed. Mix in the chopped cherries, syrup, kirsch and almond extract. Stir through then sift in the icing sugar and mix until combined. Preheat the oven to 220C\/200C Fan\/Gas 7. Roll out the pastry until it is 3-4mm thick. Cut into long strips about 1cm\/½in wide. Wrap each strip around a horn mould starting at the tip and working upwards, with the pastry overlapping slightly. Brush with beaten egg, dust with icing sugar and place on a baking tray seam-side down. Bake for about 15-20 minutes until the pastry is crisp and darkened slightly. Once the horns are cooked, set aside cool for a couple of minutes then remove from horn moulds and allow to cool completely on a wire rack. For the chocolate ganache, heat the cream, butter and chocolate in a pan. Remove the pan from the heat and whisk the mixture until smooth and thickened. Leave to cool slightly then spoon into a piping bag fitted with a small plain nozzle. Stand the horns in mugs to keep them upright and then pipe fine lines of the chocolate ganache inside the horns reaching as far as possible.   Fill the horns with the Black Forest gâteau filling. Top with a cherry and a few almond flakes. Pipe a thin line of chocolate along the top rim of the pastry. ","ingredients":" 340g\/12oz strong white flour, plus extra for dusting,  60g\/2¼oz cocoa powder,  1 tsp fine sea salt,  400g\/14oz unsalted butter, cut into cubes,  1 free-range egg, beaten for egg wash,  icing sugar, for dusting,  300ml\/10fl oz double cream,  250g\/9oz black cherries in kirsch flavoured syrup (drained weight), 12 reserved and the rest chopped ,  2 tbsp syrup from black cherries (see above),  2 tbsp kirsch,  few drops of almond extract,  50g\/1¾oz icing sugar,  50g\/1¾oz toasted flaked almonds, plus extra for decoration,  100ml\/3½fl oz double cream,  1 tsp unsalted butter,  100g\/3½oz plain chocolate","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/black_forest_gteau_cream_88183"}