{"recipe_name":"Salmon kiev","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Blend the butter, garlic, lemon juice, lemon zest and tarragon in a food processor until well combined.  Turn out the mixture onto a sheet of cling film and roll it into a cylinder. Chill in the freezer for five minutes. Using a sharp knife, make a deep slit into the side of each salmon fillet to form a pocket.   When the butter mixture has chilled, slice it into four pieces and insert one into each of the pockets in the salmon fillets.  Sprinkle the flour onto a plate. Beat the egg in a bowl. Mix together the breadcrumbs and polenta on a separate plate. Season the mixture, to taste, with salt and freshly ground black pepper. Dredge each stuffed fish fillet first in the flour, then dip it in the beaten egg, then roll it in the breadcrumbs mixture until completely coated.  Heat the oil in an ovenproof frying pan over a medium to high heat. Add the coated salmon fillets and fry for 2-3 minutes on each side, or until the breadcrumb coating is crisp and golden-brown. Transfer the salmon to the oven and cook for a further 8-12 minutes, or until cooked through. (NB: The salmon is cooked through when the flesh is opaque.) Serve with new potatoes and spinach. ","ingredients":" 150g\/5½oz butter,  3 garlic cloves, crushed to a paste with the edge of a knife,  ½ lemon, juice and zest,  1 tbsp chopped fresh tarragon,  4 x 175g\/6oz salmon fillets,  30g\/1¼oz plain flour,  1 free-range egg, beaten,  75g\/2¾oz fresh breadcrumbs,  30g\/1¼oz polenta,  salt and freshly ground black pepper,  3-4 tbsp vegetable oil,  boiled new potatoes,  wilted spinach leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmonkiev_92528"}