{"recipe_name":"Salmon parcels and salad dressed with salmon roe","author":"Dave Myers","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Lay out the sheets of filo pastry onto a lightly floured work surface.  Cut a slit along the long side of each salmon piece and open up like a book. Lay one opened piece of salmon onto the edge of each sheet of pastry. Place three anchovies, one teaspoon of sour cream and one teaspoon of the dill onto one side of each open piece of salmon. Fold the other side of the salmon over the filling. Add a squeeze of lemon juice and a sprinkle of freshly ground black pepper and sea salt flakes over the top of each filled salmon parcel. Brush all of the filo sheets with the egg wash, then roll up around the salmon to form a neat parcel. Brush the outside of the pastry with the egg wash. Heat the oil in a frying pan. Add the salmon parcels and fry until golden. Don't overcook the parcels otherwise you may overcook the salmon. Meanwhile, for the salad, place the olive oil, vinegar, honey and salt into a bowl. Place the watercress and rocket into a clean bowl and pour over a little of the dressing. Mix well to coat the leaves. To serve, slice each of the avocado halves and fan out onto each plate. Spoon a little of the dressing over the avocado. Place a handful of watercress and rocket salad alongside the avocado fans and sprinkle a little salmon roe over the top. Top each pile of salad with a salmon parcel and serve immediately. ","ingredients":" 4 x ready-made filo pastry sheets,  flour, for dusting,  4 x 75g\/2½oz pieces of salmon fillet, trimmed to the size of a thin matchbox,  12 marinated anchovy fillets,  4 tsp soured cream,  4 tsp chopped fresh dill,  1 tsp lemon juice,  ½ tsp ground black pepper,  pinch sea salt flakes,  1 free-range egg, beaten, for egg wash,  vegetable oil, for shallow frying,  2 tbsp olive oil,  1 tbsp white wine vinegar,  2 tsp honey,  pinch of salt,  110g\/4oz watercress,  110g\/4oz rocket,  2 avocados, peeled, halved, stone removed,  1 jar salmon roe","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmonpastillaandsal_88717"}