{"recipe_name":"Salmon fillets with chorizo, broad beans and new potatoes","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the butter, sun-dried tomatoes, parsley, salt and freshly ground black pepper into a food processor and blend until smooth. Mould the mixture into a log and wrap in greaseproof paper. Place into the fridge to chill for one hour. (This will make more sun-dried tomato butter than is needed in the recipe; the rest will keep in the fridge for up to a week wrapped in cling film.) Preheat the oven to 180C\/355F\/Gas 4. Rub the salmon fillets with the vegetable oil and season with salt and freshly ground black pepper. Heat an ovenproof frying pan until hot and add the salmon fillets, skin-side down. Cook for 5-6 minutes, then carefully turn over and place the pan into the oven for 4-5 minutes, or until the salmon is just cooked through.  Heat another frying pan until hot and add a splash of vegetable oil. Fry the chorizo over a medium heat for 2-3 minutes, or until golden-brown and aromatic.  Add the new potatoes to the pan, then add a tablespoon of the sun-dried tomato butter and cook for 2-3 minutes. Add the broad beans and cook for further 3-4 minutes, then squeeze over the lemon juice.  To serve, divide the chorizo, potato and broad bean mixture equally among four serving plates and place a salmon fillet on top of each. ","ingredients":" 150g\/5oz butter,  100g\/3½oz sun-dried tomatoes, chopped,  1 tbsp chopped fresh parsley,  salt and freshly ground black pepper,  4 x 150g\/5½oz salmon fillets,  1 tbsp vegetable oil, plus extra for frying,  150g\/5½oz chorizo,  200g\/7oz new potatoes, cooked until tender,  150g\/5½oz broad beans, out of their pods, inner membranes removed, blanched,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmonwithchorizobro_92216"}