{"recipe_name":"Salmon with green butter","author":"Sophie Grigson","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/salmonwithgreenbutte_90283_16x9.jpg","method":"First make the herb butter. Place the butter in the bowl of a food processor. Chop the herbs roughly. You should aim for two tablespoon each of parsley and chives; there will be more of the sorrel. Place the herbs into the bowl with the butter. Process until the herbs are finely chopped, scraping down the bowl with a spatula once or twice if necessary. (If you don't have a processor, chop the herbs finely, then beat into the softened butter.) Scrape the butter onto a sheet of silver foil, pat into a sausage shape, roll up and chill in the fridge until needed. (Herb butters can be frozen for up to a month.) For the salmon, add the olive oil to a non-stick frying pan and carefully wipe up any excess oil with kitchen paper - you don't want a lot of oil in the pan. When the pan's hot, add the salmon, skin-side down first, and cook for 2-3 minutes, depending on the thickness of your salmon, without moving it around at all. This will ensure the skin doesn't stick to the pan. While the salmon is cooking, remove the butter from the fridge and slice off eight discs with a hot knife (using a hot knife creates a clean cut). Season with salt and freshly ground black pepper, then turn the fish over and cook for a further 1-2 minutes or so, until the salmon is cooked but still has a line of translucent, darker pink flesh in its centre. This slight 'undercooking' keeps the salmon moist and tender. To serve, lay the salmon on warm serving plates and top with a slice or two of green butter. Tuck a lemon wedge in on the side and garnish with the parsley and chives, if you like. ","ingredients":" 225g\/7oz unsalted butter, softened,  small handful fresh parsley,  small handful fresh chives,  large handful fresh sorrel leaves (if you can't get sorrel you can use extra parsley and chives or tarragon or basil and add a squeeze or two of lemon juice),  a drizzle of olive oil,  4 portions salmon fillet, skin-on, about 170g\/6oz each,  salt and freshly ground black pepper,  lemon wedges,  a few sprigs of parsley and lengths of chive","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmonwithgreenbutte_90283"}