{"recipe_name":"Salmon with herb crust, sautéed leeks and pesto","author":"Gino D'Acampo","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. To make the herb crust, place the bread into a food processor and blend to make fine crumbs. Add the coriander, chives and parsley and pulse until well mixed. Add the egg and pulse once again.  Meanwhile, heat the 2 tbsp oil in an ovenproof non-stick frying pan over a high heat. Season the salmon with salt and freshly ground black pepper, then place the salmon into the hot pan. Sear the salmon for one minute then turn over.  Spread the herb mixture on top of the salmon, then transfer to the oven and cook for 4-5 minutes, until the salmon is completely cooked through and the crust is golden and crisp. For the leeks, heat the oil in a pan over a medium heat. Add the pepper, leeks and garlic and sauté for 2-3 minutes, until soft. Add the spinach and season, to taste, with salt and freshly ground black pepper. Cook for 2-3 minutes, until the spinach has wilted. To make the pesto, place the basil, chives, oil and salt and freshly ground black pepper into a food processor and blend until smooth. To serve, remove the salmon from the oven and place onto a serving plate. Spoon the sautéed leeks alongside and drizzle the pesto around the plate. ","ingredients":" 3 slices bread,  3 tbsp fresh coriander leaves,  3 tbsp chopped fresh chives,  3 tbsp chopped fresh flatleaf parsley,  1 free-range egg,  2 tbsp olive oil,  salt and freshly ground black pepper,  1 salmon fillet,  1 tbsp olive oil,  ¼ romero pepper, sliced,  ¼ leek, sliced,  1 garlic clove, peeled and chopped,  2 handfuls spinach leaves,  salt and freshly ground black pepper,  handful fresh basil,  handful fresh chives,  55ml\/2fl oz olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmonwithherbcrusts_80984"}