{"recipe_name":"Salmon with spiced lemongrass crust, sweet potato chips and a lime and soy vinaigrette","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salmon, remove the tough outer layers of the lemongrass and finely chop the inside layers. Using a pestle and mortar, grind together the curry powder, dried chilli flakes, coriander seeds, chopped lemongrass, salt and freshly ground black pepper. Spread over one side of the salmon fillet. To form a crust. Heat half the olive oil in a frying pan, add the salmon (crust side down) and pan fry for 2-4 minutes, or until bronzed. Turn over with a fish slice and cook the other side for 2-4 minutes. Set aside and keep warm. Add the remaining tablespoon of olive oil to the frying pan, heat then add the spring onions, fry until golden and crispy. Remove with a slotted spoon and drain on kitchen paper.  For the sweet potato chips, place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep fry for 3-4 minutes or until crisp. Carefully remove the chips from the oil with a slotted spoon and drain on kitchen paper. For the vinaigrette, mix all the ingredients together in a small bowl. To serve, place the crispy spring onions onto a serving plate, top with the salmon, scatter the sweet potato chips round the edges of the plate and pour the vinaigrette over the salmon. Place the steamed broccoli spears to one side. ","ingredients":" 1 stick lemongrass,  pinch curry powder,  ½ tsp dried chilli flakes,  ½ tsp coriander seeds,  salt and freshly ground black pepper,  150g\/5½oz salmon fillet, skin removed,  2 tbsp olive oil,  1 spring onion, thinly sliced,  300ml\/½ pint vegetable oil for deep frying,  1 sweet potato, peeled, thinly sliced,  1 lime, juice and zest,  2 tbsp olive oil,  2 tbsp soy sauce,  salt and freshly ground black pepper,  85g\/3oz broccoli spears, steamed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salmonwithspicedlemo_86284"}