{"recipe_name":"Salt-baked leg of lamb with salsa verde","author":"Raymond Blanc","programme":"Raymond Blanc: How to Cook Well","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/salt-baked_leg_of_lamb_10556_16x9.jpg","method":"Remove the lamb from the fridge about three hours before you wish to cook it to allow it to rise to room temperature to get an even bake. Preheat the oven to 180C\/350F\/Gas 4.  In a large, heavy roasting tray, heat the vegetable oil over a high heat. Fry the lamb in the vegetable oil for two minutes on each side until evenly coloured. Remove from the heat and leave to rest for 15 minutes. For the salt crust, in a large mixing bowl whisk together the salt and egg whites until even mixed and light and fluffy (whisking in a free-standing mixer for about one minute will achieve this result). The salt will perfectly season the meat to the core. The salt draws out some of the moisture from the meat; this dissolves the salt and then the salt is absorbed back into the meat. The crust also absorbs a lot of heat and allows it to slowly permeate the lamb, cooking it gently and giving an even pink colour to the meat. On a flat baking tray, spread a 1.5cm\/5\/8in layer of the salt crust mixture in the rough shape of the leg of lamb. Place the leg of lamb on top of the salt mixture.  Using a spatula, evenly cover the leg of lamb in the remaining salt crust mixture, ensuring that the leg is completely covered - with the sides meeting the base. Make sure there are no holes. The meat must be sealed inside the crust for the baking method to work. Bake the salt-encrusted lamb in the oven for 50 minutes.  Remove the leg of lamb from the oven and leave to rest for 30 minutes, during which time the meat will continue to cook and the juices will permeate in the residual heat.  For the salsa verde, place all the ingredients into a pestle and mortar and pound together until smooth and emulsified. To serve, using a sharp serrated knife cut the crust around the base of the leg and lift off the top part of the crust in one piece. Lift the leg from the base of the crust onto a chopping board. Carve into slices and serve with the salsa verde.  ","ingredients":" 4 tbsp vegetable oil,  2.5-3kg\/5lb 8oz-6lb 8oz leg of lamb, bone in,  1.25kg\/2lb 12oz table salt (without anti-caking additives),  175g\/6oz free-range egg white (about 4-5 large egg whites) ,  1 garlic clove, crushed to a paste,  2 anchovy fillets, finely chopped,  15g\/½oz fresh flatleaf parsley, chopped,  10g\/¼oz fresh mint, chopped,  4 tbsp extra-virgin olive oil,  ½ tsp red wine vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salt-baked_leg_of_lamb_10556"}