{"recipe_name":"Salt-crusted sea bass with runner bean salad","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/salt-crusted_sea_bass_20066_16x9.jpg","method":"For the sea bass, preheat the oven to 200C\/400F\/Gas 6. Stuff the thyme into the cavity of the sea bass.  Whisk the egg whites in a bowl until soft peaks form, then fold in the salt. Line a baking tray with greaseproof paper and spread one-third of the egg white mixture over the tray.  Lay the sea bass on top and spoon over the remaining egg white mixture, ensuring the fish is completely covered. Bake the sea bass in the oven for 30-35 minutes, or until crisp. Carefully crack the salt crust, remove it from the fish and discard. Peel the skin from the fish and place it onto a serving plate. Meanwhile, for the salad, blanch the runner beans in a pan of boiling water for 1-2 minutes, or until just tender. Drain and refresh in iced water, then drain thoroughly. Mix the runner beans, parsley, shallots, broad beans, lettuce and croûtons in a bowl until well combined. Whisk the mustard, vinegar, lemon juice and olive oil together until well combined, then season with a pinch of sugar, salt and freshly ground black pepper. Pour a little dressing over the salad and mix until well combined. Spoon the salad onto a serving plate and serve alongside the fish. ","ingredients":" 1 x 1.5kg\/3lb 5oz sea bass,  bunch fresh thyme,  4 free-range egg whites,  300g\/11oz sea salt,  400g\/14oz runner beans, thickly sliced diagonally,  4 tbsp chopped fresh flatleaf parsley,  2 banana shallots, sliced into rings,  200g\/7oz cooked broad beans,  2 Little Gem lettuces, leaves separated,  50g\/2oz croûtons,  1 tsp English mustard,  1 tbsp red wine vinegar,  squeeze lemon juice,  3 tbsp olive oil,  pinch sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salt-crusted_sea_bass_20066"}