{"recipe_name":"Salt and pepper breaded squid with chilli dip and coriander salad","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the squid, preheat a deep-fat fryer to 190C\/375F. Alternatively heat vegetable oil in a deep-sided, heavy bottomed pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended).  Heat a frying pan until smoking, then add the black peppercorns and Sichuan peppercorns and dry fry for a few seconds, shaking the pan frequently, until the peppercorns darken slightly and become aromatic.  Tip the peppercorns into a pestle and mortar and crush to a coarse mixture, then stir in the sea salt.  Combine in a bowl with the chilli and breadcrumbs and mix thoroughly to combine. Dredge the squid into the flour, pat off the excess, then dredge in the egg, then breadcrumbs. Carefully lower the squid pieces into the fat fryer, a few at a time, and cook until light golden brown and crisp. Remove from the squid from the oil with a slotted spoon and drain onto kitchen paper. Season with a little salt and lime juice. For the chilli dip, heat a frying pan until hot, add the caster sugar and cook until it becomes a light caramel colour. Add the rice wine vinegar, salt and chillies and cook for a couple of minutes. Remove from the heat and cool slightly before serving. For the salad, place the rice wine vinegar, lime juice and sugar into a pan and heat until just dissolved. Place the cucumber into a bowl and pour the hot dressing over the top then set aside for at least five minutes – up to one hour. Drain the cucumber and toss with the coriander leaves, discarding the pickle solution.  To serve, pile the salad onto the plate and pile the squid alongside. Pour the dip into a small bowl and serve with the squid. ","ingredients":" 2 tsp black peppercorns,  2 tsp Sichuan peppercorns,  2 tsp sea salt ,  1 red chilli, thinly sliced ,  75g\/3oz breadcrumbs, preferably panko,  75g\/3oz plain flour,  3 eggs, lightly beaten,  500g\/1lb 2oz squid, cleaned and cut into rings,  1 lime, quartered, for garnish,  3 spring onions, sliced,  75g\/3oz sugar,  125ml\/4½fl oz rice vinegar,  1 pinch salt,  2 red chillies, finely chopped,  1 cucumber, scooped into small balls, using a melon baller,  75ml\/3fl oz rice wine vinegar,  50g\/2oz caster sugar,  ½ lime, juice only,  4 tbsp coriander cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salt_and_pepper_breaded_67799"}