{"recipe_name":"Salt beef with a fried egg, gooseberry ketchup and pickled onion rings","author":"James Mackenzie","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salt beef, place the onion in a frying pan with a little rapeseed oil, a few leaves of picked thyme leaves and a little salt and pepper. Fry the onion until it is soft and translucent, remove from the heat and allow to cool. Place the mashed potato in a mixing bowl. Drain away any liquid from the onion and add the onion to the mash with the herbs, spring onion and mustard.  Add the salt beef to the mash and mix it all together. Season with some black pepper and a little salt if needed. Divide the mixture into four and shape into cakes using a large round cutter with a dusting of flour if needed. They should be big enough to sit a fried egg on top when served. Place the salt beef cakes on a tray and put in the fridge until required. They can be made well in advance. Preheat the oven to 220C\/450F. To make the gooseberry ketchup, place all the ingredients in a large saucepan, bring to the boil and then simmer until the gooseberries break down to a shiny chutney consistency. Blend in a food processor and then pass the cooked gooseberries through a sieve. Cook in a clean pan to reduce down the volume of liquid a little more if required.  Pour the ketchup into a squeezy bottle and refrigerate until cold. For the pickled onion rings, heat the oil in a pan for deep-fat frying. Heat until a breadcrumb drop in sizzles and goes brown. (Caution: hot oil can be dangerous. Do not leave unattended.) Put the milk and flour into separate bowls. Dip the largest onion rings in milk, then coat them in flour. Dust off the excess flour and repeat the process again.  Deep-fry the pickled onion rings until golden-brown and crisp. Remove from the oil with a slotted spoon and drain them on kitchen paper and sprinkle with a little salt.  To finish the salt beef hash cakes, shallow fry the hash cakes in some rapeseed oil and a good knob of butter, cook for about four minutes on each side until golden-brown. Finish in the hot oven for a few minutes. Fry the eggs in a little rapeseed oil and a knob of butter. To serve, place the egg on top of each of the cakes in the centre of four plates, garnish with blobs of the gooseberry ketchup, the deep-fried pickled onion rings and a sprig of watercress. ","ingredients":" 1 large white onion, finely chopped,  rapeseed oil, for frying,  2 sprigs fresh thyme ,  salt and freshly ground black pepper,  4 spring onions, sliced,  400g\/14oz dry, cooked mashed potato,  ½ bunch fresh chives, chopped,  handful fresh flatleaf parsley, chopped,  fresh lovage (optional) ,  1 tbsp wholegrain mustard ,  200g\/7oz cooked salt beef, cut into 2cm\/1in pieces,  250g\/9oz fresh gooseberries, stalks removed,  1 large white onion, finely chopped,  150g\/5½oz unrefined sugar ,  100g\/3½oz dark brown sugar,  200ml\/7fl oz cider vinegar ,  ½ tsp ground mixed spice,  1 star anise,  dash of Worcestershire sauce ,  1 garlic clove, chopped,  rapeseed oil, for deep frying,  2 large pickled onions, thinly sliced into rings,  200ml\/7fl oz milk,  200g\/7oz plain flour ,  rapeseed oil, for frying,  butter, for frying,  4 free-range eggs,  watercress, for garnish (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salt_beef_with_a_fried_38435"}