{"recipe_name":"Mini Black Forest meringues with everlasting syllabub","author":"Mary-Anne Boermans","programme":"The Great British Bake Off","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Makes 12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the syllabub, place the dessert wine, brandy, lemon zest and juice and sugar in a small bowl and stir until the sugar has dissolved. Cover the bowl with cling film and leave overnight. Preheat the oven to 125C\/250F\/Gas ½. Line two large baking trays with greaseproof paper. Draw 12 x 6cm\/2½in circles with pencil on one of sheets of paper. For the meringue baskets, mix the sugar and blackcurrant powder and set aside. Whisk the egg whites until they form stiff peaks then add the water and continue whisking for two more minutes. Gradually whisk in the sugar mixture, until all of the sugar has been added and  the meringue is firm and glossy. Spoon the mixture into a piping bag fitted with a plain 1cm\/½in nozzle. Pipe circles onto the paper using the pencil lines to guide you, then pipe a further two rings on top to make the ‘walls’ of the baskets.  For the meringue sticks, mix the sugar and raspberry powder and set aside. Whisk the egg whites until they form stiff peaks then add the water and continue whisking for two more minutes. Gradually whisk in the sugar mixture, until all of the sugar has been added and  the meringue is firm and glossy. Spoon the mixture into a piping bag fitted with a plain 1cm\/½in nozzle. Pipe 5cm\/2in sticks onto the other baking tray. Bake the meringues for 40 minutes then reduce the heat to 110C\/225F\/Gas ¼ and bake for a further two hours.  Remove the meringues from the oven and carefully transfer to a wire rack to cool. Meanwhile, finish the syllabub. Strain the liquid into a large bowl and add a large pinch of nutmeg. Pour in the cream and beat with a wire whisk until it just holds its shape, being careful not to overbeat or it will curdle. Transfer to a clean bowl and chill until ready to use. To assemble the meringues, spoon or pipe the syllabub into the meringue baskets and garnish with the fruit and basil leaves. Serve the meringue sticks on the side for 'dipping'. ","ingredients":" 225ml\/8fl oz Muscat dessert wine,  4 tbsp brandy,  2 lemons, zest and juice ,  115g\/4oz caster sugar,  pinch freshly grated nutmeg,  600ml\/1 pint double cream,  200g\/7oz caster sugar,  3 tbsp blackcurrant fruit powder,  100g\/3½oz free-range egg whites,  2 tbsp water,  100g\/3½oz caster sugar,  3 tbsp raspberry fruit powder,  100g\/3½oz free-range egg whites,  2 tbsp water,  175g\/6oz blackberries,  175g\/6oz black cherries, stoned, halved,  175g\/6oz blackcurrants,  12 small basil leaves","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/black_fruit_meringues_04123"}