{"recipe_name":"Salt cod brandade with seared squid","author":"Chris King","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Soak the cod in water and leave in the fridge for 48 hours, changing the water at least four times. For the parsley oil, blanch the parsley in boiling water until very tender. Drain and squeeze dry. Put in a blender with the olive oil and pinch of salt. Blend for two minutes. Hang in a muslin cloth over a bowl. Leave overnight and collect the parsley oil. Preheat the oven to 200C\/180C (fan)\/Gas 6. Sit the potato on a pile of salt on a baking tray and bake for 1 hour, until tender. When cool enough to handle, remove the skin. Drain the cod. Put it in a saucepan and cover with milk. Add the bay leaves, thyme and garlic. Bring just up to the boil and then turn off the heat. Leave for a few minutes and then carefully flake the fish leaving behind any bones and skin. Sieve the milk and reserve. Put the cod in a food processor with a third of its volume of potato. Add a ladleful of poaching milk and start to blend. With the motor running, slowly drizzle in the olive oil, until you have a silky, smooth mixture. Add a little more milk or potato if necessary. Season with ground white pepper. For the  ink vinaigrette, whisk together the squid-ink, lemon juice and 3 tablespoons of olive oil in a small pan and warm gently.  Heat a griddle pan to hot. Lightly season the squid with salt and black pepper and cook on the griddle for 3-4 minutes, or until done to your liking.  To serve, spoon the warm salt cod brandade onto hot plates and top with the squid and garlic croutons. Dress with a little of the ink vinaigrette and parsley oil. Sprinkle over the Espelette pepper and serve straight away. ","ingredients":" 200g\/7oz dry salt-cod,  ½ bunch flatleaf parsley, leaves picked,  200ml\/7fl oz olive oil,  pinch salt,  1 large baking potato,  100g\/3½oz salt,  1 litre\/1¾ pints full-fat milk,  2 bay leaves,  1 sprig thyme,  6 garlic cloves, peeled and bruised,  400ml\/14fl oz olive oil,  200ml\/7fl oz extra virgin olive oil,  ground white pepper,  16g sachet squid ink,  ½ lemon, juice only,  350g\/12oz small squid, cleaned, cut into pieces,  salt and freshly ground black pepper,  1 baguette, thinly sliced, toasted, rubbed with garlic ,  ground Espelette pepper (Basque chilli pepper)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salt_cod_brandade_with_73461"}