{"recipe_name":"Salt cod with deep fried cauliflower and pepper sauce","author":"José Pizarro","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the salt cod into a very large bowl of cold water and soak for 24 hours, changing the water 3-4 times. Drain the salt cod, pat dry and set aside. Bring a large saucepan of water to the boil. Add the cauliflower and cook for about five minutes. Drain and place onto kitchen roll to dry. Half-fill a deep, heavy-based saucepan with the oil and heat to 180C\/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Place the seasoned flour onto a large plate and roll the hard-boiled egg halves, cauliflower florets and salt cod pieces in the flour and then dip into the beaten eggs.  Cook the eggs, fish and cauliflower in batches in the hot oil for about four minutes, or until golden-brown and crisp.  Carefully remove with a slotted spoon and set aside to drain on kitchen paper. Keep warm until ready to serve. For the sauce, place the olive oil in a medium frying pan over a medium heat. When hot, add the onion and cook for two minutes, or until softened. Add the garlic, saffron and bay leaves and cook for a further minute. Pour in the wine, allow to bubble for a minute, before adding the stock and the peppers. Continue to cook for a further few minutes, or until the volume of liquid has reduced and the sauce has a thicker consistency. Toss the fried cauliflower, fish and egg in the sauce, divide between the plates and serve scattered with almonds and chopped parsley. ","ingredients":" 4 x 75g\/2¾oz pieces salt cod,  1 small cauliflower, cut into bite-sized florets,  1 litre\/1¾ pints sunflower oil for deep-frying,  50g\/2oz plain flour, seasoned with black pepper,  4 medium free-range eggs, hard-boiled, peeled and halved ,  2 medium free-range eggs, beaten,  2 tbsp Spanish extra virgin olive oil,  1 onion, finely diced,  2 garlic cloves, finely sliced,  1 pinch saffron,  2 bay leaves,  100ml\/3½fl oz Spanish white wine,  100ml\/3½fl oz fresh chicken stock,  2 roasted red peppers, skins removed and torn into strips,  2 tbsp slivered almonds, toasted,  3 tbsp roughly chopped flat-leaf parsley ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salt_cod_with_deep_fried_76598"}