{"recipe_name":"Salt and peppered steak with sweet potato mash, orange-glazed carrots and balsamic onion","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the steak, rub the steak in oil and season with salt and coarsely ground black pepper. Heat a griddle pan and fry the steak for 4-6 minutes on each side, or until cooked to your liking. Leave aside to rest in a warm place. For the mash, boil the sweet potato in a pan of salted water for 8-10 minutes, or until tender. Drain and mash with a fork or potato masher. In a clean saucepan, heat the butter and add the spinach to the pan. Heat gently until the spinach has wilted, then stir the spinach into the mashed sweet potato. Add the nutmeg and season, to taste, with salt and freshly ground black pepper. Set aside to keep warm. For the carrots, boil another pan of salted water and blanch the carrots for three minutes, or until tender, then drain. In a non-stick frying pan, heat the butter and add the carrots. Add the orange zest and juice and heat until it has reduced to a sticky glaze. Keep warm. For the balsamic onion, heat the butter in a small non-stick frying pan and fry the onion rings until soft, but not coloured. Increase the heat and add the balsamic vinegar. Simmer for 3-4 minutes, or until the balsamic vinegar has reduced to a sticky glaze. Serve the steak on a bed of mash with the glazed carrots and onions arranged on the side. ","ingredients":" 200g\/7oz beef fillet steak,  1 tbsp olive oil,  pinch salt,  1 tsp coarsely ground black pepper,  ½ sweet potato, peeled and chopped,  30g\/1oz butter,  150g\/5½oz spinach leaves, washed,  ¼ tsp freshly grated nutmeg,  salt and freshly ground black pepper ,  1 bunch baby carrots, scrubbed and trimmed,  15g\/½oz butter,  ½ orange, zest and juice,  30g\/1oz butter,  1 red onion, sliced into rings,  2 tbsp balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saltandpepperedsteak_86934"}