{"recipe_name":"Salt-baked sea bass with sorrel hollandaise","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/450F\/Gas 7. Lightly oil a deep-sided roasting tin. Fill the belly cavity of the fish with the lemon slices and season inside with freshly ground black pepper.  In a bowl, mix the herbs with the sea salt, lemon zest, chilli flakes and beaten egg white.  Place one third of the salt mixture in the roasting tin and place the fish on top. Completely cover the fish with the rest of the salt mixture. Place the salt-covered fish in the oven and bake for 35-40 minutes.  Meanwhile, make the hollandaise. In a small saucepan combine the white wine vinegar with the tablespoon of water and cook until it reduces down to one teaspoon in volume.  Allow to cool then add the beaten egg yolks and whisk continuously over a low heat. Once cooked, the eggs in your hollandaise should be smooth and velvety rather than granular. When the texture is right you can very gradually incorporate the butter, a little at a time.  Whisk vigorously while adding the butter. If it gets too thick add a few drops of warm water. Once all the butter has been incorporated, season to taste and keep warm. Do not let it get too hot as the sauce will split.   For the sorrel, melt the unsalted butter in a shallow pan until hot and foaming. Add the sorrel leaves and heat gently until the leaves have wilted.   Remove from the heat and roughly chop the sorrel leaves. Stir the sorrel into the warmed hollandaise.  When the fish is cooked, remove from the oven. Carefully crack open the salt case and remove the fish. Serve on a large dish with the sorrel hollandaise. ","ingredients":" 1.8kg\/4lb sea bass, cleaned and scaled,  1 lemon, thickly sliced,  freshly ground black pepper,  100ml\/3½fl oz olive oil,  leaves from small bunch of thyme,  1 small bunch of rosemary, chopped,  750g\/1lb 10oz coarse sea salt ,  1 lemon, grated zest only,  1 tsp chilli flakes ,  1 free-range egg white, lightly beaten,  melted butter and lemon wedges, to serve ,  1 tbsp white wine vinegar,  1 tbsp of water,  3 free-range egg yolks beaten with 2 tbsp water,  225g\/8oz unsalted butter cut in tiny pieces, or melted and left to cool until just warm,  15g\/1oz unsalted butter,  225g\/8oz sorrel, washed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saltbakedseabasswith_74663"}