{"recipe_name":"Salted caramel and apple rolls","author":null,"programme":null,"prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Makes 12 rolls","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/salted_caramel_and_apple_43744_16x9.jpg","method":"For the filling, heat the sugar and water in a large saucepan set over a medium heat until the sugar melts and forms a caramel. (Do not stir the caramel.) Meanwhile, gently warm the cream in a saucepan. Carefully, add one-third of the cream to the caramel and, once the bubbling has subsided, whisk in the remaining cream and sea salt. Pour the mixture into a bowl and set aside until completely cooked. For the dough, warm the milk and butter in a saucepan until the butter has melted and the mixture is lukewarm. Sift the flour and salt into a large bowl. Make a well in the centre and add the yeast. Stir the milk mixture into the flour mixture until the contents of the bowl comes together as a dough. Turn the dough out onto a lightly floured surface and knead for five minutes, or until the dough is smooth and elastic. Lightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size.  Lightly grease two baking trays and line with greaseproof paper. Knock the dough back to its original size and turn out onto a lightly floured work surface. Roll the dough out into a large rectangle. Drizzle half of the caramel over the dough then scatter with the chopped apples. Roll the dough into a tight cylinder and cut twelve 4cm\/1½in slices from it.  Place the rolls, cut-side facing upwards, onto the baking trays. Cover with a tea towel and set aside to rise for 30 minutes. Preheat the oven to 200C\/400F\/Gas 6. Bake the rolls in the oven for 25-35 minutes, or until risen and golden-brown. Remove the rolls from the oven and set aside to cool on a cooling rack. Drizzle with the remaining caramel.  ","ingredients":" 200g\/7oz caster sugar,  1 tbsp water,  200ml\/7fl oz whipping cream,  3 Granny Smith apples, peeled, cored, chopped into small cubes,  3\/4 tsp sea salt,  250ml\/8½fl oz full-fat milk,  25g\/1oz butter,  500g\/1lb strong white flour,  1tsp salt,  1 x 7g\/¼oz sachet fast-action dried yeast,  vegetable oil, for greasing","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/salted_caramel_and_apple_43744"}