{"recipe_name":"Saltfish and ackee with fried dumplings","author":"Julia Titus","programme":"The Hairy Bikers: Mums Know Best","prep_time":"overnight","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/saltfish__ackee_with_64803_16x9.jpg","method":"For the saltfish, soak the salt cod overnight, changing the water a couple of times.  Drain, then put the cod in a large pan of fresh water and bring to the boil. Drain again, add fresh water and bring to the boil again.  Simmer for about five minutes, or until cooked through, then drain and flake the fish into large pieces. Discard any skin or bones. For the dumplings, mix the flour and suet with a pinch of salt and 250ml\/9fl oz water to make a dough.  Wrap the mixture in clingfilm and leave in the fridge to rest.  Open the can of ackee, drain and rinse, then set aside. Heat a tablespoon of olive oil in a pan and fry the onion until softened but not brown.  Add the spices, seasoning, pepper sauce and sliced peppers and continue to fry until the peppers are tender.  Add the chopped tomatoes, then the salt cod and mix together. Lastly stir in the ackee very gently and leave to simmer until ready to serve. When you’re almost ready to eat, heat about 1cm\/½in vegetable oil in a frying pan and heat until just smoking. Shape the dumpling mix into plum-size balls and shallow-fry until golden-brown. (CAUTION: hot oil can be dangerous. Do not leave the pan unattended.) Drain the dumplings on kitchen paper and serve with the saltfish and ackee. ","ingredients":" 450g\/1lb salt cod,  1 x 400g\/14oz can ackee,  olive oil,  1 onion, chopped,  1 tsp paprika,  2 tsp mild curry powder,  2 tsp jerk seasoning,  1 tsp hot pepper sauce,  1 red pepper, seeds removed and sliced,  1 yellow pepper, seeds removed and sliced,  200g\/7oz tomatoes, chopped,  salt and freshly ground black pepper,  250g\/9oz self-raising flour,  30g\/1oz vegetable suet,  pinch of salt,  vegetable oil, for frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/saltfish__ackee_with_64803"}