{"recipe_name":"Black pepper shrimp with dried pineapple","author":"Peter Lloyd","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the black pepper shrimp with sundried pineapple, preheat the oven to 90C\/200F\/Gas ¼. Put a rack on top of a rimmed baking tray and line the rack with greaseproof paper. Put the pineapple pieces on the greaseproof paper in a single, even layer. Bake for about three hours until the pineapple is dried, shrivelled, and chewy. Remove from the tray and cool completely on a cooling rack. Heat one tablespoon of the oil in a large saucepan over medium-high heat. Add the spring onions, ginger and garlic and cook, stirring, until softened and golden-brown. Add the crushed pepper and cook until fragrant, then add the black beans, soy sauces, lime juice, sugar, and salt and bring the mixture to a boil, stirring occasionally. Reduce the heat to medium and simmer for two minutes. Transfer to a blender and purée until coarsely blended. Set aside. Heat the remaining two tablespoons oil in a wok or large frying pan over high heat. When the oil is just about smoking, add the prawns and cook, turning the pieces once, until crisp and browned. Remove the oil from the wok, then add the black pepper sauce and two tablespoons water. Cook, stirring, until the prawns are well-coated. To serve, decoratively arrange the prawns on your serving plate, garnish with the jicama, pea shoots and pineapple. ","ingredients":" ½ pineapple, peeled, cored, and cut into 2½cm\/1in chunks,  3 tbsp grapeseed oil,  3 spring onions, trimmed and thinly sliced,  1 tbsp fresh ginger, finely chopped,  1 tbsp finely chopped garlic,  1¾ tsp black peppercorns, crushed,  1¾ tsp fermented black beans (available from Chinese supermarkets), rinsed, squeezed dry and chopped,  3 tbsp sweet soy sauce,  1 tbsp soy sauce,  1 lime, juice only,  1½  tbsp sugar,  ½ tsp salt,  12 large prawns, cleaned, peeled, veins removed and halved,  30g\/1oz diced jícama (optional), to garnish,  10g\/½oz baby pea shoots, thinly sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/black_pepper_shrimp_with_47852"}