{"recipe_name":"Sambhar vada: yellow lentil soup with spiced doughnuts","author":"Padmaja Kochera","programme":"The Hairy Bikers: Mums Know Best","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/sambhar_vada_yellow_10317_16x9.jpg","method":"For the sambhar, rinse the lentils and put them in a large pan with the onion, green chilli, tomatoes, chilli powder and turmeric. Add 200ml\/7fl oz water, bring to the boil and cook for about 30 minutes until the lentils are soft then season to taste with salt. Meanwhile, make the vada. Drain the black lentils and rice, place them in a food processor with one tablespoon of water and blend to a thick batter. Add the chopped onion, chilli, bicarbonate of soda and a pinch of salt, mix well then set aside. To finish the sambhar, heat the sunflower oil in a large pan and add the mustard seeds and cumin seeds. When they start spitting, add the curry leaves and sambhar powder. Fry for one minute then add the cooked lentil mixture and the tamarind juice and simmer gently for five minutes.  To finish the vada, heat the sunflower oil in a deep-fat fryer to about 180C\/350F. The oil is hot enough when a cube of bread dropped into it turns golden-brown and floats to the surface. (Caution: Hot oil can be dangerous. Do not leave unattended). To shape the doughnuts, drop large spoonfuls of the batter onto a piece of cling film moistened with a little water. Press each one down slightly, make holes in the middles, then carefully drop them into the hot oil. Shape and fry the doughnuts a few at a time until all the mixture is used up, draining them in kitchen paper. Garnish the sambhar with coriander leaves and serve with the spiced doughnuts. ","ingredients":" 200g\/7oz yellow lentils (toor dal),  1 onion, chopped,  1 green chilli, chopped,  2 tomatoes, chopped,  1 tsp chilli powder,  ½ tsp turmeric,  salt,  1 tbsp sunflower oil,  1 tsp black mustard seeds,  1 tsp cumin seeds,  2 fresh curry leaves,  1 tbsp sambhar powder  (available from Asian grocers),  4–5 tbsp tamarind water,  2 sprigs fresh coriander,  200g\/7oz black gram (urid or urad) lentils, soaked in water for 1 hour,  1 tbsp rice, soaked in water for 1 hour,  1 onion, finely chopped,  1 green chilli, finely chopped,  pinch bicarbonate of soda,  450ml\/16fl oz sunflower oil, for deep-frying","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sambhar_vada_yellow_10317"}