{"recipe_name":"Sambuca kisses","author":"Nigella Lawson","programme":"Nigellissima","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/sambuca_kisses_79344_16x9.jpg","method":"Put the egg and ricotta into a bowl and beat together until smooth. Add the flour, baking powder, sambuca, sugar and grated orange zest. Beat the mixture again to make a smooth batter. Pour about 2cm\/1in oil into a frying pan, and heat until a small piece of bread sizzles when you drop it into the pan and browns in about 40 seconds (the temperature should be at about 180C\/350F). And keep your eye on the pan at all times. Oil a teaspoon measure and gently drop rounded teaspoons of the ricotta batter into the pan, about four at a time is manageable. The little kisses will puff up slightly and turn golden underneath, so flip them over carefully with an implement, to colour the other side. Watch out that the oil doesn’t get too hot, turning the heat down if they are browning too quickly. Once they are golden all over, lift them out with a slotted spoon and place them on a plate lined with one or two sheets of kitchen roll, to get rid of any excess oil. Carry on cooking until all the mixture is used up, then turn off the heat under the oil. Once the kisses have cooled a bit, push the icing sugar through a small sieve to dust them thickly. If you are not eating them straightaway, pop the pre-sugared cooked kisses on a rack over a tin in a 150C\/Gas 2 oven, and keep them warm for up to one hour. Serve with an espresso, with one teaspoon of sambuca added, for each person. ","ingredients":" 1 free-range egg,  100g\/3½oz ricotta,  40g\/1½oz plain flour,  1 tsp baking powder,  2 tsp sambuca liqueur,  1 tsp sugar,  1 tsp grated orange zest,  vegetable or corn oil, for frying,  1-2 tsp icing sugar, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sambuca_kisses_79344"}