{"recipe_name":"Black pudding fritters with a grilled pork chop, wilted spring greens and an apple and scrumpy sauce","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat a grill to high. Melt the butter in a frying pan over a medium heat, then add the chopped shallot and cook for 3-4 minutes. Set aside and allow to cool slightly. Meanwhile finely chop the parsley and place in a mixing bowl. Remove the skin from the black pudding and crumble it into the parsley. Add the cooked shallot, season with salt and pepper and mix. Press the black pudding mixture into a 2.5cm\/1in width dish (or alternatively roll into a sausage and wrap in cling film). Place in the fridge for at least an hour. Heat a deep fat fryer to 180C\/350F, or heat vegetable oil in a deep-sided, heavy based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Season the pork chop with salt and pepper and place on a baking sheet. Grill for 15 minutes until the fat on the chop is crisp. Meanwhile remove the black pudding mixture from the fridge and cut into 5cm\/2in x 2.5cm\/1in squares (or cut into 5cm\/2in slices, if using the sausage shape). Place the beaten flour, egg and breadcrumbs on separate plates and dip the black pudding squares first into the flour, then the egg and finally breadcrumbs, and deep fry for 3-4 minutes until crisp. Remove from the fryer and drain onto kitchen paper. Season with salt. For the wilted spring greens, heat a lidded frying pan until hot, add the butter and spring greens and fry for 2-3 minutes, then add 50ml\/2fl oz water and cover with a lid. Cook for a further 2-3 minutes, until the greens have wilted. Season with salt and freshly ground black pepper. Heat the jus in a small sauce pan. For the apple and scrumpy sauce, place the apples, butter and cider into a saucepan, cover with a lid and cook for 4-5 minutes, or until the apple pieces begin to break down. To serve, place a chop on each serving plate with the black pudding next to it. Place the greens and sauce by the side and drizzle the jus around the plate. ","ingredients":" 1 shallot, finely chopped,  1 tbsp finely chopped flatleaf parsley,  400g\/14oz black pudding,  salt and freshly ground black pepper ,  110g\/4oz plain flour,  2 free-range eggs, beaten,  110g\/4oz panko breadcrumbs,  4 large pork chops,  25g\/1oz butter,  250g\/9oz spring greens, finely sliced,  3 Bramley apples, peeled, cored and chopped,  50g\/2oz butter,  75ml\/3fl oz dry cider,  2-4 tbsp caster sugar, to taste,  150ml jus","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/black_pudding_fritters_58637"}