{"recipe_name":"Satay tiger prawns with prawn pad Thai","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Soak four wooden skewers in water for 10 minutes and then pat dry. For the marinated tiger prawns, place the prawns into a large bowl. Blend the remaining marinated tiger prawns ingredients to a purée in a food processor. Spoon the mixture over the prawns and stir well to coat. Chill in the fridge for up to one hour to marinate. Meanwhile, for the satay sauce, blend the shallots, garlic, lemongrass, lime leaves and vegetable oil in a food processor to a purée. Heat a frying pan over a medium to high heat, add the purée and cook for 1-2 minutes, or until fragrant. Add the crushed peanuts and continue to fry for a further minute. Add the coconut milk and bring the mixture to a simmer, stirring well to combine. Continue to simmer for 1-2 minutes, or until the mixture has thickened. Add the soy sauce, sugar, fish sauce and lime juice and stir well. Continue to cook until the sugar has dissolved and the mixture is well combined. Remove from the pan and set aside. When the prawns have marinated, thread three marinated prawns onto each soaked wooden skewer and brush all over with a little of the satay sauce. Heat a griddle pan over a medium to high heat, add the prawn skewers and griddle for 1-2 minutes on each side, or until the prawns are cooked through and the marinade is golden-brown on all sides. Remove the skewers from the heat and set aside to rest for a few minutes. Meanwhile, for the prawn pad Thai, heat the oil in a wok over a high heat. When the oil is smoking, add the shallot, chilli and ginger and stir fry for one minute. Add the prawns and stir fry for a further minute. Add the cooked pad Thai noodles and stir fry for 30-40 seconds, or until heated through. Drizzle over the fish sauce, soy sauce and lime juice and continue to cook for 1-2 minutes, stirring well to coat the noodles. Just before serving, stir in the chopped coriander leaves.  To serve, divide the prawn pad Thai equally among four serving plates. Sprinkle over the crushed peanuts. Place one prawn skewer on top of each serving. Serve the satay sauce in dipping bowls alongside. ","ingredients":" 12 large raw tiger prawns, heads and shells removed, de-veined,  ½ tsp ground turmeric,  ½ tsp ground coriander,  4 Thai shallots or banana shallots, roughly chopped,  2 garlic cloves, roughly chopped,  5cm\/2in piece fresh ginger, peeled and roughly chopped,  1 red chilli, roughly chopped,  1 lime, juice only,  2 tbsp vegetable oil,  3 Thai shallots or banana shallots, roughly chopped,  1 garlic clove, roughly chopped,  ½ lemongrass stalk, tough outer part removed, inner stem finely chopped,  2 lime leaves, finely chopped,  2 tbsp vegetable oil,  125g\/4½oz roasted salted peanuts, crushed ,  200ml\/7fl oz coconut milk,  2 tbsp soy sauce,  1 tbsp soft brown sugar,  1 tbsp fish sauce,  ½ lime, juice only,  1 tbsp vegetable oil,  1 large Thai shallot or banana shallot, finely sliced,  1 red chilli, sliced,  2 tsp freshly grated ginger,  150g\/5oz cooked shelled prawns,  400g\/14oz pad Thai noodles, cooked according to packet instructions, drained and refreshed in cold water,  2 tbsp fish sauce,  1 tbsp soy sauce,  1 lime, juice only,  3 tbsp chopped fresh coriander,  2 tbsp roasted salted peanuts, crushed, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sataytigerprawnswith_91337"}