{"recipe_name":"Sausage and bacon rustic hotpot","author":"The Audbrey-Wade Family","programme":"The Hairy Bikers' Cook Off","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/sausage_and_bacon_rustic_54743_16x9.jpg","method":"Heat one tablespoon of olive oil in a frying pan over a medium heat. Add the sausages and mushrooms and fry for ten minutes until browned and the sausages are just half cooked. Remove from the pan and, when cool enough to handle, cut the sausages into thick slices. Heat the remaining olive oil in the same pan and fry the bacon and garlic for 2-3 minutes or until the bacon is cooked and the garlic softened. Add the leeks and fry gently for five minutes or until the leeks are softened. Stir in the tomatoes and tomato purée and simmer for five minutes then pour in the beef stock. Return the sausages and mushrooms to the pan and simmer for 5-10 minutes or until the sausages are completely heated through and cooked. Stir in the cannellini beans and kidney beans and heat through. Meanwhile, cook the broccoli in a pan of boiling salted water for 3-4 minutes until tender then drain.  Preheat the grill to medium and toast the slices of bread on one side. Turn the toast and sprinkle the other side with the grated cheese then return to the grill until melted and bubbling. Spoon the sausage and bacon one-pot into a warm serving bowl, put the broccoli on top and garnish with parsley. Serve with the grilled cheese toast on the side. ","ingredients":" 2 tbsp olive oil,  2 pork sausages ,  150g\/5oz small button mushrooms,  2 rashers smoked back bacon, roughly chopped,  1 smoked garlic clove, roughly chopped,  1 large leek, sliced,  4 tomatoes, peeled and chopped,  4 tsp tomato purée ,  570ml\/1 pint beef stock ,  1 x 400g\/14oz can cannellini beans, drained,  ½ x 400g\/14oz can kidney beans, drained,  1 small head broccoli, cut into florets,  1 small baguette, thinly sliced,  40g\/2oz medium strength cheddar,  handful parsley, chopped, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sausage_and_bacon_rustic_54743"}