{"recipe_name":"Sausage and lentil cassoulet","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sausage and lentil cassoulet, first fry the sausages in the butter and oil, until browned.  Heat a sauté pan or a large frying pan and then add the knob of butter and two tablespoons of olive oil. Once hot, add the onion and cook for two minutes. Add the garlic, diced bacon, carrot, celery, leek, bay leaf and cumin and cook for a further two minutes. Add the lentils and red wine and bring to the boil. Cook until the volume of wine has reduced by half, then add the stock. Place the cooked sausages, duck and smoked duck in the pan and cook the lentils for 25-30 minutes. Mix in the sherry vinegar and parsley. For the pomme purée, cook the potatoes in boiling salted water for 12-15 minutes, or until tender. Drain. Push the potato through a potato ricer into a saucepan. (Alternatively, mash with a potato masher, but the finish will not be as smooth.) Return to the heat, then add the butter and cream and beat to a smooth purée. Season, to taste, with salt and freshly ground black pepper. Place in a piping bag and set aside. To serve, pipe the pomme purée into shallow bowls and pour some sausage and lentil cassoulet alongside. ","ingredients":" 1 tbsp butter,  1 tbsp olive oil,  8 Toulouse sausages,  knob of butter,  2 tbsp olive oil,  1 onion, finely chopped,  1 garlic clove, finely sliced,  150g\/5½oz smoked bacon, diced,  1 small carrot, finely chopped,  1 stick celery, finely chopped,  ¼ leek, finely chopped,  1 bay leaf,  2 tsp ground cumin,  300g\/10½oz Puy lentils,  175ml\/6fl oz red wine,  450ml\/16fl oz dark veal stock,  2 confit duck legs, meat shredded,  150g\/5½oz smoked duck, shredded ,  2 tbsp good sherry vinegar,  2 tbsp chopped fresh parsley,  300g\/10oz King Edward potatoes, peeled and cut into chunks,  50g\/1¾oz butter,  110ml\/3¾fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sausage_and_lentil_58708"}