{"recipe_name":"Sausage and spinach cakes on braised barley","author":"Brian Turner","programme":"A Taste of Britain","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the braised barley, heat the oil in a frying pan and add the whites of the spring onions and the garlic. Cook gently to soften but do not let them colour. Add the barley and stir for two minutes, then add the stock and bring to the boil. Cover with a lid and gently simmer for 20 minutes. Add the spring onion greens and the tomatoes and cook for 4-5 minutes. Remove from the heat, stir in the chervil, season with salt and freshly ground black pepper and set aside. Meanwhile, for the sausage and spinach cakes, melt the butter in a frying pan, add the spinach, nutmeg and a pinch of salt and cook to wilt the spinach. Allow to cool, squeeze out the liquor, then chop the spinach. Put the sausage meat in a bowl and add the spinach. Mix in the Worcestershire sauce and shape into eight round patties. Put the flour, beaten egg and breadcrumbs into three shallow bowls. Pass the patties through the flour to coat them, then coat them in the egg and finally the breadcrumbs. Reshape them if necessary. Heat the oil in large frying pan. Fry the patties until nicely browned all over, then bake for 15-20 minutes, until cooked through. For the sauce, melt half the butter in a pan, then add the shallot and garlic, followed by half the tomatoes. Add the stock and turn up the heat. Cook until the tomatoes break down to a purée, then season with salt and freshly ground black pepper. Stir in the remaining butter, then the rest of the tomatoes and finally, the parsley. To serve, put the barley on a serving plate, lay the cakes on top, pour over the sauce and decorate with the chervil sprigs. ","ingredients":" 1 tbsp rapeseed oil,  8 spring onions, white and green parts separated, shredded,  1 garlic clove, crushed,  225g\/8oz pearl barley,  425ml\/15fl oz chicken stock,  4 tomatoes, skinned, seeds removed and chopped,  2 tbsp chopped fresh chervil,  salt and freshly ground black pepper,  30g\/1oz butter,  225g\/8oz baby spinach,  pinch freshly grated nutmeg,  680g\/1½lb sausage meat,  splash Worcestershire sauce,  115g\/4oz plain flour,  2 eggs, beaten,  225g\/8oz breadcrumbs,  2-3 tbsp oil ,  chervil sprigs, to garnish,  30g\/1oz butter,  1 shallot, finely chopped,  1 garlic clove, crushed,  6 tomatoes, skinned, seeds removed and chopped,  2 tbsp chicken stock,  2 tbsp finely chopped fresh parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sausage_and_spinach_65547"}