{"recipe_name":"Sausage, bacon and boiled-egg pie with juniper creamed cabbage","author":"Brian Turner","programme":"Christmas Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. Heat the chicken stock in a pan until reduced in volume by half. For the pie, in a large pan, mix together the sausages, bacon, mushrooms, eggs, Worcestershire sauce and and parsley until well combined. Pour over the reduced chicken stock, bring the mixture to the boil, then add the cream and return to the boil. Season, to taste, with salt and freshly ground black pepper. Pour the pie filling into a heatproof pie dish. Brush the lip of the dish with a little of the beaten egg. Roll out the shortcrust pastry onto a lightly floured work surface, then cover the pie with the pastry, sealing the edges to the pie dish. Brush the top of the pie with the remaining beaten egg, then bake the pie in the oven for 25-30 minutes, or until the pastry is crisp and golden-brown and the filling is bubbling. Meanwhile, for the juniper creamed cabbage, boil the double cream gently for 3-4 minutes, until it has thickened slightly. Blanch the shredded cabbage in a pan of salted, boiling water then drain well and plunge into the bowl of iced water. Drain in a colander and set aside to dry for a few minutes. Stir the cheese into the warm cream until melted. Stir in the blanched cabbage and ground juniper, then season, to taste, with salt and freshly ground black pepper. Serve the pie in slices with some of the juniper creamed cabbage piled alongside. ","ingredients":" 600ml\/1 pint chicken stock,  10 cooked leftover sausages, cut in half lengthways,  8 rashers cooked bacon, cut into 0.5cm\/¼in-wide strips,  200g\/7oz mushrooms, sliced, fried in butter until golden-brown,  4 hard-boiled eggs, peeled and halved,  1 tbsp Worcestershire sauce,  2 tbsp chopped fresh parsley,  150ml\/¼ pint double cream,  375g\/13oz ready-made shortcrust pastry,  plain flour, for dusting,  1 egg, plus 1 egg yolk, beaten together,  150ml\/¼ pint double cream,  1 Savoy cabbage, outer leaves and root removed, leaves shredded,  large bowl iced water,  50g\/2oz Wensleydale, grated,  6 juniper berries, ground to a powder,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sausage_bacon_and_88810"}