{"recipe_name":"Sausage casserole","author":"The Hairy Bikers","programme":"Hairy Bikers' Meals on Wheels","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 40","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oven to 200C\/Gas mark 6. Place the sausages on two large baking trays and place in the oven for 20 minutes until golden-brown. Remove from the oven and set aside to cool.  Cut the sausages into small pieces then transfer to a large saucepan or a flameproof casserole dish and set aside.  Fry the bacon pieces in a large frying pan for 4-5 minutes, or until crisp and golden-brown, then add them to the sausages.  Heat the oil in the frying pan and fry the onions over a medium heat for five minutes or until they start to soften, stirring often.  Add the garlic and cook for 2–3 minutes more until the onions turn a pale golden-brown, stirring frequently.  Sprinkle over the smoked paprika and cook together for a few seconds longer.  Add the stock to the pan with the tomatoes, tomato purée, Worcestershire sauce, sugar, dried herbs, bay leaves, thyme and bring to a simmer.  Tip the mixture carefully into the pan with the sausages and bacon and bring it to a simmer, then reduce the heat, cover the pan loosely with a lid or aluminium foil and leave to simmer very gently for 20 minutes, stirring from time to time.  Drain the beans and rinse them in a sieve under cold running water. Stir the beans into the casserole, and continue to cook for 10 minutes, stirring occasionally, until the sauce has thickened. Season to taste with salt and freshly ground black pepper. ","ingredients":" 40 good quality pork sausages,  20 rashers rindless streaky bacon, cut into 2.5cm\/1in lengths,  5 tbsp sunflower oil,  10 medium onions, thinly sliced,  10 garlic cloves, crushed,  1½ tsp smoked paprika,  2.5 litres\/4½ pints chicken stock,  2kg\/4lb 8oz canned chopped tomatoes,  150g\/5½oz tomato purée,  4 tbsp Worcestershire sauce,  70g\/2½oz demerara sugar,  5 tsp dried mixed herbs,  8 bay leaves,  15 sprigs fresh thyme,  5 x 400g\/14oz cans mixed beans ,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sausage_casserole_76873"}