{"recipe_name":"Sausages in a red wine sauce with Duchess potatoes","author":"Brian Turner","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Duchess potatoes, preheat the oven to 220C\/425F\/Gas 7. Arrange a bed of salt on a baking tray. Place the potatoes on the salt and bake in the oven for an hour. For the sausages in red wine sauce, preheat the oven to 180C\/350F\/Gas 4. Heat the dripping in a casserole with a lid. Add the sausages and fry them to colour well all round and then remove from the pan. Add the leek and onion to the pan and fry gently to colour them. Add the tomatoes, garlic, thyme, bay leaf, wine and stock. Bring to the boil and add the sausages back in, place a lid on and put in the oven for 30 minutes. Remove from the oven and remove the sausages and keep them warm. Remove the thyme and the bay leaf and discard. Heat the dish on the hob to reduce the sauce to a thicker consistency. Blend the sauce using a hand-blender and then pass it through a fine metal sieve to make it smooth. Set aside and keep warm. Heat a frying pan and add half of the butter and one tablespoon of oil and add the mushrooms. Fry until lightly coloured, then add the ham and fry to colour it too. Remove the ham and mushrooms from the pan and drain on kitchen paper. Add the rest of the butter and the oil to the pan and heat. Once hot, add the bread and cook until golden-brown, then add it to the mushrooms and ham. To finish the Duchess potatoes, cut the potatoes in half and scoop out the middles, then pass through a potato ricer into a clean bowl. Beat in the egg yolks and apple purée. Season with a little nutmeg, salt and pepper. Preheat the grill to high and line a baking tray with non-stick baking paper. Put the potato mixture into a piping bag fitted with a star-shaped nozzle. Pipe a border of the potato around the edge of each serving plate. Put the plates under the grill to dry slightly. Beat egg with a little water, then brush over the potato border, then colour quickly under the grill. To serve, share the sausages between the plates, placing them in the middle of the potato border, pour the sauce over the sausages, sprinkle with chopped parsley and serve with Duchess potatoes around the edge of the plate. ","ingredients":" 650g\/1½lb floury potatoes, such as Desiree, King Edward or Maris Piper,  enough salt to cover the baking tray in a thin layer,  2 free-range egg yolks,  1 tbsp apple purée,  grated nutmeg,  salt and freshly ground black pepper,  1 free-range egg,  2 tbsp dripping,  8-12 premium pork sausages,  1 leek, finely chopped,  1 onion, finely chopped,  6 tomatoes, chopped,  2 garlic cloves, finely chopped,  sprig thyme,  1 bay leaf,  300ml\/½ pint red wine,  300ml\/½ pint chicken stock,  50g\/1¾oz butter, unsalted,  2 tbsp olive oil,  100g\/3½oz button mushrooms, quartered,  100g\/3½oz boiled ham, cut into batons ½cm\/¼in thick,  1 slice bread, crust removed and diced ½cm\/¼in thick,  2 tsp chopped fresh parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sausages_in_a_red_wine_56164"}