{"recipe_name":"Sausages in a bag","author":"Ed Baines","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Using a bread knife in a clockwise direction, trim off the outside leaves of the artichokes.  Boil the artichokes in salted water acidulated with half the lemon juice for 30 minutes.  While they boil, rip off a 50cm\/20in sheet of foil, place on the work surface and drizzle with olive oil.  Heat a frying pan to high and fry the sausages, quickly sealing on all sides until you have a nice even brown colour.  Place two sausages on the foil, sprinkle with a quarter of the grated lemon zest and a quarter each of the sliced onion, garlic and paprika.   Fold the foil over gently, sealing the edges to create a loose parcel.  Repeat with the remaining sausages to make 4 parcels in all. Place your parcels in the oven and cook for 20 minutes. Preheat a hot grill.  Drain the artichokes and, using a small knife, cut them into quarters, removing any leathery leaves and the hairs from the chokes.  Place the artichoke quarters on a lightly oiled tray, squeeze the remaining lemon juice over them and lightly grill for five minutes. Bring another saucepan of salted water to the boil and top and tail the beans.  Blanch the beans for four minutes, then drain and tip into a large bowl. Add the artichokes and mix well.  Whisk all the dressing ingredients together, then season to taste. Pour the dressing over the vegetables and toss to coat them evenly.  Serve the sausages with the dressed beans and artichokes. ","ingredients":" 4 globe artichokes,  salt and freshly ground black pepper,  1 lemon, zest of whole and juice of ½ only ,  2 tbsp olive oil,  8 good quality butcher's fresh sausages,  1 Spanish onion, sliced,  4 garlic cloves, sliced,  4 pinches of paprika,  275g\/10oz runner beans,  2 tsp Dijon mustard,  1 tbsp white wine vinegar,  1 egg yolk,  150ml\/¼ pint olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sausagesinabag_72157"}