{"recipe_name":"Sautéed lambs liver, minted peas, potato purée, sherry vinegar sauce","author":"Daniel Clifford","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb’s livers, dust the livers in flour. Gently fry the livers in oil for a minute or two. Add the butter, turn the livers over and season with salt. When cooked to your liking, remove from the pan and set aside to rest. For the sauce, melt the butter in a pan until foaming. Add the shallot and fry until soft and translucent. Deglaze the pan with the sherry vinegar and reduced lamb stock. Bring to the boil and add a dash of cream. Season, to taste, with salt, pepper and lemon juice. Pour the sauce over the livers.  For the peas, blanch the peas in boiling, salted water for 20 seconds. Refresh in ice-cold water and drain well.  Heat a sauté pan and add the butter and a little water. Add the peas, lettuce leaves, mint, spring onions and baby breakfast radishes and toss together. Season with salt and pepper and lemon juice.    For the Mayan Gold potatoes, bring a pan of salted water to the boil. Add the potatoes and cook gently until tender. Drain and allow them to steam off slightly. Pass the potatoes through a potato ricer (or mash), gently fold in the boiled milk and butter until smooth. Keep warm until ready to serve.  To serve, divide the pea salad between four bowls. Place a large quenelle of potato purée alongside the salad and place the lamb’s liver on top of the purée. Drizzle the sauce all over. ","ingredients":" 1 tbsp plain flour,  350g\/12oz lamb’s liver, skinned, sliced and cut into 1cm\/½in-thick pieces,  oil, for frying,  2 tbsp butter,  salt,  50g\/1¾oz unsalted butter,  1 shallot, peeled and finely chopped,  20ml\/¾fl oz sherry vinegar,  100ml\/3½oz reduced lamb stock or brown chicken stock,  100ml\/3½oz cream,  salt and pepper,  1 lemon, juice only,  250g\/9oz peas,  50g\/1¾oz unsalted butter,  2 heads Little Gem lettuce ,  2 sprigs mint, leaves picked and finely chopped,  2 spring onions, finely chopped,  4 baby breakfast radish, finely chopped,  2 tbsp olive oil,  rock salt, to taste,  lemon juice, to taste,  400g\/14oz Mayan Gold potatoes, peeled and cut into chunks,  100ml\/3½oz milk, boiled,  100ml\/3½oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sauted_lambs_liver_91472"}