{"recipe_name":"Blackberry and hazelnut meringue roulade","author":"Stephanie Moon","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the apple cake, preheat the oven to 180C\/350F\/Gas 4 and line a 30x40cm\/12x16in baking tin, 4cm\/2in deep, with greaseproof paper. Cream the butter and sugar together until pale and fluffy.  Add the eggs one by one and beat to combine.  Sieve in the baking powder, bicarbonate of soda, flour and salt and fold to combine.  Stir in the soured cream and chopped apples.  Pour into the prepared tin and bake for 30 minutes, or until springy to the touch and golden-brown. For the roulade, line a 30cm\/12in Swiss roll tin with baking paper and brush with vegetable oil. Whisk the egg whites in a bowl with a pinch of salt until you reach soft peaks when the whisk is removed from the bowl.  Add the sugar, whisk again and then add the lemon juice and keep whisking until stiff peaks are formed when the whisk is removed from the bowl.  Tip the mixture onto the prepared tray and use a palette knife to spread out. Sprinkle with the chopped hazelnuts, cinnamon and a touch of caster sugar.  Bake in the oven at 180C\/350F\/Gas 4 for 8-10 minutes before turning out onto a clean kitchen cloth and leaving to cool.  Whisk the cream with the sugar until soft peaks form when the whisk is removed from the bowl. Fold the blackberries through the cream.  Once the meringue is cool, spread with the cream mixture and carefully roll the roulade up. For the blackberry coulis and blackberry jelly, heat the blackberries, sugar and water in a pan for 6-8 minutes to soften.  Remove from the heat and blend the mixture until smooth using a food processor or hand-blender. Pass the mixture through a sieve and then divide into two batches. Reserve one batch to use as a coulis (for dressing the dessert). With the other batch, heat again gently, then remove from the heat and stir in the gelatine leaves.  Pour into a small container and leave to set.  Once set, cut into small cubes to serve. For the apple purée, heat the butter in a pan and fry the apple and caster sugar for 8-10 minutes over a gentle heat until softened, adding a splash of water if necessary.  Remove from the heat and blend (in a food processor or using a hand-blender) until smooth.  For the caramelised apples, heat the butter in a pan and add the apple wedges. Cook for a few minutes to soften, then stir in the sugar.  Allow the sugar to dissolve and cook until the apples have caramelized. To serve, cut the roulade into slices and arrange on serving plates. Garnish with a sprig of mint. Spoon the apple purée on the plate and smear using a spoon. Cut the apple cake into squares and serve alongside. Arrange the jelly cubes on the plate, and spoon the caramelised apples alongside also. Finish with drops of blackberry coulis to finish. ","ingredients":" 225g\/8oz unsalted butter,  375g\/13oz caster sugar,  4 free-range eggs,  1 tsp baking powder,  1 tsp bicarbonate of soda,  450g\/1lb plain flour,  pinch salt,  450ml\/16fl oz soured cream,  4 apples, peeled and chopped,  vegetable oil, for greasing,  4 free-range egg whites,  pinch salt,  175g\/6oz caster sugar, plus extra to sprinkle,  ½ tsp lemon juice,  75g\/2¾oz toasted hazelnuts, chopped,  pinch ground cinnamon,  400ml\/14fl oz double cream,  caster sugar, to taste,  75g\/2¾oz blackberries, whole or chopped,  4 punnets blackberries ,  4 tbsp caster sugar,  570ml\/½ pint water,  5 leaves of gelatine, soaked in a bowl cold water,  knob of butter,  4 Bramley apples, peeled and chopped,  5 tbsp caster sugar,  knob of butter,  2 apples, peeled and cut into wedges,  55g\/2oz sugar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blackberry_and_hazelnut_72381"}