{"recipe_name":"Scallop, almond, gooseberry and sorrel","author":"Lee Westcott","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Run a knife down the back of the scallop shell to loosen the scallop meat from the flat part of the shell. Carefully twist the flat part of the shell off and discard. Using a spoon, remove the scallop carefully then wash it in ice-cold water to remove any grit or sand. Repeat with the other scallops then pat them dry using kitchen paper. Slice each scallop into 4 pieces. Remove the scallop roe from the remains using scissors and wash well. Preheat the oven to 75C\/50C Fan\/Gas ¼, or the lowest setting possible.   Blanch the roes in boiling salted water for 5 seconds then plunge them into ice-cold water to refresh. Drain, dry with kitchen paper and place on a baking tray.  Bake for 4 hours, or until the roes are completely dry. Set aside to cool then blend to a fine powder. For the sorrel emulsion place all the ingredients into the blender with 4 teaspoons water. Briefly blend to a very coarse paste. Season with flaked sea salt. For the pickled fennel slices, cut the fennel in half through the stalk and slice thinly on a mandoline. Place the remaining ingredients in a pan with 300ml\/10fl oz water. Bring to a simmer, then remove from the heat, add the fennel slices and leave to cool for 5 minutes. Drain and place on kitchen paper.  To serve, carefully crack the shells of the green almonds. Remove the green outer shell, trying your best to keep the almond piece fully intact. Discard the green shell. Take the almond and peel using a small knife, and then break each nut into two pieces.  Marinate the sliced scallops in the sorrel emulsion for 2-5 minutes, ensuring the scallops are completely covered. Drain and lay out the scallop slices on a tray or plate. Season with flaked sea salt and lemon zest. Arrange 4 scallop slices on each serving plate. Scatter the gooseberries and green almonds on top. Arrange 3 slices of the pickled fennel on top of the scallop slices.  To finish, arrange some nasturtium leaves and fennel tops around the plates. Garnish with a dusting of the dried roe powder. ","ingredients":" 4 extra-large scallops in the shell, roes reserved,  1 lemon, zest only,  140g\/5oz large common sorrel leaves (stalks discarded),  30g\/1oz lemon or white balsamic vinegar ,  220ml\/8fl oz rapeseed oil,  flaked sea salt,  2 fennel bulbs,  70g\/2½oz sugar,  6 tbsp lemon juice,  40ml\/1½fl oz rapeseed oil,  2 star anise,  50ml\/2fl oz aniseed liqueur, such as Pernod,  5 sprigs thyme ,  4 sprigs tarragon,  2 bay leaves,  1 punnet green gooseberries, trimmed and halved,  1 punnet red gooseberries, trimmed and halved,  12 large green almonds,  nasturtium leaves, to garnish ,  fennel tops, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallop_almond_90603"}