{"recipe_name":"Scallops and shrimps with beurre blanc, topped with puff pastry","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the fish stock, place the bones, onion, fennel, parsley stalks, garlic and bay leaf into a large saucepan. Add the vermouth, white wine and enough water to cover the bones. Bring to the boil and simmer for 20 minutes, skim any scum that rises to the top while cooking. Do not cook for any longer as the stock will be cloudy. Strain and set aside. For the scallops, place the vegetables in a pan and add enough fish stock to cover. Bring to the boil and cook for a couple of minutes, drain and set aside. To make the mousse, in a food processor combine the plaice, scallops and 250ml\/9fl oz fish stock and blend until smooth. Whip the cream in a separate bowl then add the blended fish to the cream. Season with salt and freshly ground black pepper and stir until combined. Set aside in the fridge until needed. For the scallops, start to assemble the scallop shells. Place some of the spinach leaves in each shell and add some of the blanched vegetables on top. Place the scallops on top of the vegetables to one side and a spoonful of mousse to the other. Top with the reserved coral and sprinkle the brown shrimps all over. Pour two tablespoons of stock over the top and finish with a sprig of chervil. Roll out the puff pastry on a lightly floured surface and cut four circles out about 2cm\/1in bigger than the scallop shells. Whisk the egg and milk together in a bowl. Brush the egg mix around the shell edges and underneath (reserving any remaining egg wash for later). Place the pastry on top and seal underneath. Place in the fridge to rest for 30 minutes. Preheat the oven to 200C\/400F\/Gas 6. Meanwhile make the beurre blanc. In a pan, bring the shallots, white wine vinegar, white wine and a tablespoon of water to the boil. Reduce the heat until the mixture is simmering, then continue to simmer until the sauce has reduced to two tablespoons of liquid. Strain and return the liquid to the pan. Reduce the heat to low, then gradually whisk in the butter, 25g\/1oz at a time, waiting until the butter has melted and incorporated into the mixture before adding more. Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it through a fine sieve into a clean saucepan. Season to taste with salt and freshly ground black pepper, then stir in the tarragon and keep warm. For the scallops, just before baking the shells in the oven brush with the top of the pastry with egg wash. Place in the oven and cook for 8-10 minutes, or until the pastry is golden-brown. Serve the scallops in their shells with the beurre blanc in a jug. ","ingredients":" 1kg\/2lb 4oz white fish bones, washed,  1 onion, roughly chopped,  1 fennel bulb, sliced,  4 parsley stalks,  1 garlic bulb, cut in half,  1 bay leaf,  375ml\/13fl oz dry white vermouth,  750ml\/1¼ pints white wine,  1 carrot, peeled, cut into thin strips ,  1 leek, trimmed, cut into thin strips,  2 sticks celery, cut into thin strips,  fish stock (from above),  20g\/1oz baby spinach,  4 large scallops, shelled (shells cleaned and reserved), coral removed and reserved,  100g\/3½oz brown shrimps, preferably Morecambe Bay,  4 sprigs fresh chervil,  250g\/9oz all-butter puff pastry,  1 medium free-range egg, lightly beaten with 4 tsp full-fat milk for egg wash,  1 plaice, filleted and skin removed ,  2 scallops, shelled, coral removed and cleaned,  250ml\/9fl oz fish stock (from above),  250ml\/9fl oz double cream,  salt and pepper,  2 shallots, peeled and finely sliced,  1 tbsp white wine vinegar,  3 tbsp white wine,  225g\/8oz butter, diced,  4 tbsp fresh tarragon, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_and_shrimps_79281"}