{"recipe_name":"Scallops in a white wine sauce with watercress","author":"Brian Turner","programme":"A Taste of Britain","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Mix the turmeric and flour together in a bowl. Dip the top of the scallops in the mixture and shake off any excess. Heat the oil in a frying pan over a high heat. Add 30g\/1oz butter. When melted, cook the scallops floured-side down for 1-2 minutes or until golden-brown.   Turn over the scallops and season with a little salt. Cook until just coloured (about 30 seconds to a minute), then remove from the pan and keep warm. Drain half the fat from the pan, add the shallot and fry gently until soft but not coloured. Add the wine and bring to the boil. Cook until the volume of liquid has reduced by two-thirds. Add the stocks and reduce again by half. Add the cream and reduce to a sauce consistency. Season with salt and freshly ground black pepper. Beat in 80g\/3oz butter until the sauce is smooth and glossy. Meanwhile, finely shred a quarter of the watercress leaves and set aside. In a clean pan, melt the remaining 30g\/1oz butter. Add all the remaining watercress, season with salt, pepper and nutmeg and cook until the watercress is wilted. Remove from the heat and drain. To serve, put the cooked watercress in the middle of four serving plates and surround each with three scallops. Add the shredded watercress to the sauce and pour around the scallops.  ","ingredients":" 30g\/1oz ground turmeric,  30g\/1oz plain flour,  12 large scallops, shelled, corals removed, washed and dried,  2 tbsp oil,  140g\/5oz unsalted butter, cubed,  sea salt and freshly ground black pepper,  1 shallot, finely chopped,  175ml\/6fl oz dry sparkling white wine,  140ml\/¼ pint fish stock,  140ml\/¼ pint chicken stock,  140ml\/¼ pint double cream,  large bunch watercress, leaves picked,  freshly grated nutmeg","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_in_a_white_wine_16525"}