{"recipe_name":"Scallops in their shells with fennel and herbs","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the puff pastry, place the flour in a mound on a clean work surface and make a well in the centre.  Place the butter and salt in the well and work them together with the fingertips of one hand, gradually drawing the flour into the centre with the other hand. When the cubes of butter have become small pieces and the dough is grainy, gradually add the iced water and mix until it is all incorporated, but don’t overwork the dough – you should have a marbled effect with the butter without mixing it in properly. Roll the mixture into a ball, wrap in cling film and refrigerate for 20 minutes. Flour the work surface and roll out the pastry into a 40x20cm\/16x8in rectangle. Fold the top third down to the centre, then the bottom third up and over that. Give it a quarter-turn.  Roll the block of pastry into a 40x20cm\/16x8in rectangle as before, and fold it into three again. These are the first two turns. Wrap the block in cling film and refrigerate it for 30 minutes. Give the chilled pastry another two turns, rolling and folding as before. This makes a total of four turns. Wrap the pastry in cling film and refrigerate for at least 30 minutes before using. For the roasted scallops with fennel and herbs, preheat the oven to 200C\/400F\/Gas 6. Remove the scallops from their shells, retaining both halves of each shell. Rinse the removed scallops and the reserved shells and pat them dry with kitchen paper. Cut each scallop in half horizontally to form two thinner scallops. Set aside. Heat a frying pan to medium hot, add the butter, vegetables and star anise and fry for a couple of minutes, or until softened but not browned. Add the wine and cook until the volume of liquid has reduced by half. Add the fish stock and cook until reduced by half again. Add the cream and cook until reduced by one-third. Add the tomato and herbs, then taste and season with salt and freshly ground black pepper to taste. Roll the pastry out to about 3mm thick, then cut into long strips.  Spoon some of the sauce into the bottom half of each of their shells, top with the scallops and the remaining sauce. Brush the edge of the shells with the beaten egg, then place the top half of each shell on top. Egg wash the outside join of the shells and seal with the pastry strips. Brush the pastry with more egg wash. You now have eight closed scallop shells. Place eight piles of salt onto a baking tray then place the scallop shells on the piles so that they sit flat. Bake for 12-15 minutes, or until the pastry is golden-brown and crisp. Remove and serve on another little pile of salt on plates. ","ingredients":" 250g\/9oz plain flour,  250g\/9oz very cold butter, cut into small cubes,  ½ tsp salt,  125ml\/4fl oz ice-cold water,  8 scallops in their shells,  50g\/1¾oz butter,  1 banana shallot, finely sliced,  4 baby leeks,  4 baby carrots,  2 sticks wild fennel or ½ bulb fennel ,  1 star anise,  150ml\/5fl oz white wine,  150ml\/5fl oz fish stock,  150ml\/5fl oz double cream,  1 plum tomato, skinned, seeds removed and chopped,  1 tbsp chervil, finely chopped,  1 tbsp parsley, finely chopped,  salt and freshly ground black pepper,  2 free-range eggs, beaten,  large handful salt","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_in_their_shells_68066"}