{"recipe_name":"Scallops, mash, sea purslane and tarragon dressing","author":"Nigel Haworth","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mash, preheat the oven to 180C\/350F\/Gas 4. Place the potatoes on a baking tray and bake them for 50-60 minutes, or until tender. Bake the garlic cloves for 10-15 minutes, or until soft. Carefully remove the potato skins and set it aside. Mash the potatoes in a bowl, add the milk and butter and beat until smooth. Stir in the ham, spinach and roasted garlic flesh. Season, to taste, with salt and freshly ground black pepper. Heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. Alternatively, use an electric deep-fat fryer heated to 180C\/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Deep-fry the reserved potato skins for one minute, or until crisp and golden-brown. Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Season with salt. For the roes, mix the rice flour, paprika, cayenne pepper and salt together in a bowl. Whisk the egg whites in a separate bowl until soft peaks form when the whisk is removed. Dip each roe in the egg white, then coat in the flour mixture. Deep-fry the roe for 2-3 minutes, or until golden-brown and crisp.  Remove from the pan with a slotted spoon and set aside to drain on kitchen paper. Season with salt. For the tarragon dressing, whisk all of the ingredients together in a bowl until well combined. For the scallops, blot the scallops with kitchen paper and place onto a plate. Pour over the clarified butter and season with salt and a squeeze of lemon juice.   Heat a frying pan until hot and fry the scallops for 30 seconds on each side, or until golden-brown on both sides. To serve, spoon some of the mash into serving bowls, place the scallops on top and scatter over the deep-fried roes, sea purslane, purslane and crisp potato skins. Pour the dressing over and scatter over the pumpkin seeds.  ","ingredients":" 700g\/1½lb potatoes such as Maris Piper, King Edward or Desirée, ,  2 garlic cloves,  200ml\/7fl oz milk,  25g\/1oz butter,  10g\/½oz good-quality ham, roughly chopped,  75g\/3oz baby spinach leaves,  salt and freshly ground black pepper,  vegetable oil, for frying,  salt,  20g\/¾oz pumpkin seeds, toasted,  25g\/1oz rice flour,  pinch paprika,  pinch cayenne pepper,  1 free-range egg white,  ¼ lemon, zest and juice,  200ml\/7fl oz chicken stock,  50ml\/2fl oz pumpkin seed oil,  2 sprigs fresh tarragon ,  30 queen scallops, roes removed and reserved,  50ml\/2fl oz clarified butter,  salt,  squeeze lemon juice,  50g\/2oz sea purslane,  25g\/1oz purslane","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_mash_sea_47259"}