{"recipe_name":"Scallops with cauliflower cream","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the cauliflower cream, place the cauliflower in a pan with milk to cover and cook until tender. Drain.  Heat half of the butter in a pan and cook all the chopped vegetables until softened.  In a separate pan, heat the measured milk, double cream and salt and pepper. Add the drained cauliflower to the heated cream and milk and remove from the heat. Once cooled slightly, use a hand-blender to blend the mixture until smooth. Once smooth add the remaining butter and stir to melt into the mixture. For the mushroom duxelle, melt the butter in a pan. Add the garlic, shallot, mushrooms, parsley and salt and pepper, to taste. Cook until the shallots are softened. For the scallops, heat a dash of olive oil in a pan and fry the scallops for 30 seconds on each side. To serve, place a spoonful of the cauliflower cream in each bowl, then a spoonful of the mushroom duxelle followed by the cooked scallop. Garnish with chopped chives and a drizzle of truffle oil. ","ingredients":" 1 large cauliflower, leaves removed, chopped,  250ml\/9fl oz milk, plus milk to cook the cauliflower,  100g\/3½oz butter,  1 white onion, chopped,  2 garlic cloves, chopped,  1 small leek, chopped,  250ml\/9fl oz double cream,  salt and pepper, to taste,  50g\/1¾oz butter,  1 small garlic clove, chopped,  1 small shallot, finely chopped,  150g\/5½oz sliced chestnut mushrooms,  2 tsp chopped fresh parsley,  salt and freshly ground black pepper to taste,  dash olive oil,  6-8 large fresh scallops,  chopped chives ,  drizzle truffle oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_with_78274"}