{"recipe_name":"Scallops with a champagne sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 7. Prick the potatoes with a knife then place in the oven and bake for 45 minutes, or until cooked through. Meanwhile, remove the scallops from the shell, clean well and discard the corals, leaving the main flesh of the scallop.  Clean four of the deep halves of the shells and place them in the oven for a couple of minutes to dry out. Remove from the oven and place onto a baking tray, with the shells sat on mounds of salt to keep them level. Remove the cooked potatoes from the oven and leave to cool for a few minutes before cutting them in half and scooping out the flesh. Pass the potato flesh through a potato ricer into a bowl. Add the egg yolks and 25g\/1oz of the butter and work with a wooden spatula until smooth.  Season lightly with salt and pepper then place in a piping bag and set aside.  Season the scallops with salt and pepper. Heat a frying pan until hot, add the remaining butter and cook the scallops on each side for 1-1½ minutes until golden-brown. Remove the scallops from the pan and place on kitchen paper to drain. To make the sauce, heat a large sauté pan and add 75g\/2½oz of the butter. Once hot, add the banana shallot, carrots, leeks and celery and cook until soft. Heat a frying pan and add the rest of the butter. Once hot, add the shallots and cook for 2-3 minutes. Add the white wine and heat until reduced in volume by half, add the fish stock and reduce by half again. Add the cream and reduce by half again. Add the champagne, tomatoes, herbs and lemon juice and remove from the heat. Preheat the grill on a high setting.  Using a slotted spoon remove some vegetables from the sauce and place into each scallop shell, so that they are visible over the edge of the shell. Place two scallops in each shell on top of the vegetables. Pour over the champagne sauce. Cover generously with piped mashed potato and sprinkle with Gruyère and breadcrumbs.  Place the baking tray with scallops on under the grill for 1-2 minutes, until the potato is pale golden-brown.  To serve, pile salt into the centre of four plates. Sprinkle dulse over the salt. Carefully place the scallop shells on top of the dulse, and serve immediately.  ","ingredients":" 310g\/11oz baking potatoes,  8 scallops in their shells, well-scrubbed ,  salt, to stand the shells on,  2 free-range eggs, yolks only,  125g\/4½oz butter,  salt and freshly ground black pepper,  25g\/1oz plain white flour,  150ml\/5fl oz double cream,  15g\/½oz Gruyère, finely grated,  15g\/½oz fine breadcrumbs,  175g\/6oz butter,  1 banana shallot, finely chopped,  1 carrot, finely diced,  4 baby leeks, trimmed,  2 sticks celery, cut in half lengthways then widthways,  2 medium shallots, finely sliced,  150ml\/5fl oz white wine,  150ml\/5fl oz fish stock,  150ml\/5fl oz double cream,  150ml\/5fl oz champagne,  2 tomatoes, skinned, deseeded and finely diced,  1 tbsp finely chopped fresh chervil,  1 tbsp finely chopped fresh tarragon,  1 tbsp finely chopped chives,  ½ lemon, juice only,  100g\/3½oz dulse seaweed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_with_a_90535"}