{"recipe_name":"Scallops with apple, black pudding, apple salad and an apple and vanilla purée","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the scallops, preheat the oven to 200C\/180C Fan\/Gas 6. Sandwich the bacon between two baking sheets and place in the oven for 8-10 minutes. Heat a large frying pan and add the oil, once hot add the black pudding. Cook for 2-3 minutes and then add the scallops. Cook the scallops on each side for 1-2 minutes, depending on the size of the scallops. Add half the butter at the end and baste the scallops. Keep warm until ready to serve. Heat a separate frying pan and add the remaining butter. Once hot, add the apple slices and cook on each side for 1-2 minutes, or until golden-brown. For the salad, place the apples and leaves in a large bowl and mix. In a small bowl mix the oil, vinegar and lemon juice. For the purée, melt the butter in a saucepan. Add the apples, sugar, vanilla pod and seeds. Cook for about 4-5 minutes, or until the apples start to break down.  Remove the vanilla pod and then blend the mixture to a smooth purée using a hand-held blender. Push the mixture through a fine sieve into a saucepan and season to taste with salt and pepper. To serve, toss the salad in the dressing and divide between four serving plates. Place the scallops, black pudding and apple slices alongside and dress the plates with the purée. Garnish with the bacon and coriander cress. ","ingredients":" 8 slices maple-cured streaky bacon,  2 tbsp rapeseed oil,  200g\/7oz black pudding, sliced,  12 scallops, roe removed ,  100g\/3½oz unsalted butter,  2 green apples, peeled, cored and sliced,  2 green apples, peeled and julienned,  50g\/1¾oz watercress leaves,  50g\/1¾oz bull’s blood leaves,  3 tbsp rapeseed oil,  1 tbsp white wine vinegar,  ½ lemon, juice only,  40g\/1½oz butter ,  300g\/10½oz Granny Smith apples, peeled, cored and chopped  ,  20g\/¾oz caster sugar ,  1 vanilla pod, split lengthways and seeds scraped out,  salt and freshly ground black pepper,  2 tbsp coriander cress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_with_apple_19964"}