{"recipe_name":"Blackcurrant delice with mini doughnuts, lemon posset and sugared almonds","author":"James Martin","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 10-12","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sorbet syrup, put the sugar, glucose and 165ml\/5½fl oz water in a saucepan and bring to the boil, stirring occasionally with a wooden spoon. Boil for about 2-3 minutes. Pass the syrup through a fine sieve to remove any sugar crystals. (CAUTION: boiling sugar is extremely hot.) Set aside to cool completely.  For the blackcurrant purée, place the blackcurrants in a blender with the syrup and blend until smooth. Pass the mixture through a fine sieve into a bowl. For the Italian meringue, place the sugar and 5 teaspoons water in a pan. Slowly heat until the syrup reaches 110C\/230F on a sugar thermometer. At this stage, place the egg whites in the bowl of a freestanding mixer and whisk until firm peaks form when the whisk is removed.  As soon as the sugar reaches 121C\/250F, remove the pan from the heat. Immediately resume whisking the egg whites. With the beater at its lowest speed, pour in the melted sugar, in a steady stream, making sure it is clear of the beaters. Continue beating for about 5 minutes, until the meringue is tepid.  For the blackcurrant mousse, reserve 4 tablespoons of the blackcurrant purée and set aside. Put the remaining purée in a saucepan with the powdered milk and vanilla pod. Bring to the boil.  Put the egg yolks and caster sugar in a large bowl and whisk until the mixture leaves a trail when the whisk is removed (the ribbon stage). Pour the blackcurrant mixture over the egg mixture, whisking continuously, then return the mixture to the pan. Heat gently, stirring continuously with a spatula, until the custard is thick enough to coat the spatula. Do not allow it to boil or the custard will split. Remove the pan from the heat and stir the drained gelatine into the custard. Discard the vanilla pod, then pass the custard through a fine sieve into a bowl and leave to cool, stirring occasionally to prevent a skin forming. For the base, place one half of the sponge flan base on a board. Mix together the syrup and a tablespoon of the reserved blackcurrant purée. Brush the mixture over the sponge. Place a 25cm\/10in flan ring (about 6cm\/2½in deep) onto the sponge and cut out a circle to form the base. Put the sponge base in the bottom of the flan ring and place on a flat plate or board.  When the blackcurrant custard is lukewarm, gently fold in half of the Italian meringue (you do not need the remainder for this recipe). Stir in the crème de cassis, then fold in the whipped cream. Start to assemble the dessert immediately, before the gelatine causes the mousse to set. Fill the flan ring with the blackcurrant mousse mixture, leaving a small gap at the top, and carefully smooth the surface using a palette knife. Place in the freezer or a very cold fridge for 2-3 hours, or until the mousse is set.  For the glaze, put the syrup and the remaining blackcurrant purée in a pan and heat gently. Remove from the heat and stir in the gelatine. Leave to cool, then spread the glaze over the top of the mousse. Place into the fridge to chill while you make the doughnuts. For the lemon posset, slowly bring the double cream and sugar to the boil in a large saucepan set over a low heat, stirring well to dissolve the sugar in the cream. Boil for 3 minutes, then remove from the heat and set aside to cool. Once the cream mixture has cooled, whisk in the lemon juice and zest. Pour the posset mixture into a medium bowl and chill in the fridge for at least 3 hours. For the mini doughnuts, combine the flour, salt and caster sugar in a large bowl. Mix in the butter, 150ml\/5fl oz water and yeast until the mixture comes together to form a smooth dough. Cover with cling film and set aside in a warm place for about an hour, or until doubled in size. Divide the dough into 12 equal portions and roll each into a ball. Line a baking tray with baking parchment and place the dough balls on top, leaving plenty of room between each ball. Cover with a tea towel and set aside in a warm place to prove for a further 20 minutes. When the dough has proved, preheat a deep-fat fryer to 150C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.) Carefully lower the doughnuts into the hot oil in batches and deep-fry for 3-4 minutes, or until golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. For the sugared almonds, preheat the oven to 130C\/110C Fan\/Gas 1 and line a baking tray with baking parchment. Lightly beat the egg white with a tablespoon water. Add the almonds and stir until well-coated. Mix the sugar and salt together and sprinkle over the nuts. Toss to coat, and spread evenly on the tray. Bake for 1 hour, stirring occasionally, until golden-brown. Leave to cool.  To serve, remove the delice from the mould using a chef’s blow torch and place slices on serving plates. Garnish with the mini doughnuts and sugared almonds. Stir the posset and place a quenelle on each plate. Top with a sprig of mint. ","ingredients":" 190g\/6¾oz sugar,  1 tbsp liquid glucose,  350g\/12oz blackcurrants,  50ml\/2fl oz sorbet syrup (from above),  60g\/2¼oz sugar,  1 free-range egg white,  blackcurrant purée (from above),  12g\/½ oz powdered milk,  ½ vanilla pod,  3 medium free-range egg yolks,  25g\/1oz caster sugar,  4½ gelatine leaves, soaked in cold water for 15 minutes,  Italian meringue (from above),  200ml\/7fl oz crème de cassis,  400ml\/14fl oz double cream, lightly whipped to the ribbon stage ,  1 ready-made round sponge flan base, cut in half horizontally (you will only need one half),  50ml\/2fl oz sorbet syrup (from above),  1 tbsp blackcurrant purée (from above),  50ml\/2fl oz sorbet syrup (from above),  3 tbsp blackcurrant purée (from above),  3 gelatine leaves, soaked in cold water for 15 minutes,  600ml\/20fl oz double cream,  150g\/5½oz caster sugar,  2 large lemons, zest and juice only,  250g\/9oz strong white flour,  pinch salt,  50g\/1¾oz caster sugar,  30g\/1oz butter, softened,  1 tsp fast-action yeast,  vegetable oil, for deep frying,  1 egg white ,  550g\/1lb 4oz blanched almonds ,  200g\/7oz caster sugar ,  ¼ tsp sea salt ,  mint sprigs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blackberry_delice_with_29437"}