{"recipe_name":"Scallops with bacon, black pudding and colcannon","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/scallops_with_bacon_03338_16x9.jpg","method":"For the colcannon, cook the potatoes in boiling water for 15 minutes or until very tender.  Meanwhile, heat 25g\/1oz of the butter in a large heavy-based frying pan and gently fry the onion for five minutes, or until softened, stirring regularly. Add the kale and cook for 2-3 minutes.  Preheat the oven to 140C\/275F\/Gas 1. Preheat a heatproof dish. Drain the potatoes in a large colander and return to the saucepan. Leave to stand for a couple of minutes. Warm the cream and remaining 25g\/1oz butter in small saucepan. Mash the cooked potatoes with the cream and milk until smooth. Season to taste with salt and freshly ground black pepper. Add the softened kale and stir together until lightly combined. Transfer to the warmed dish and cover with foil. Keep warm in the oven until ready to serve. For the scallops, heat one tablespoon of the oil in a large non-stick frying pan. Fry the bacon rashers over a medium-high heat for 4-6 minutes until the fat crisps, turning once. (If lots of liquid comes out of the bacon, tip it away and return the pan to the heat.) Remove the bacon, place on a baking tray and keep warm in the oven. Heat one more tablespoon of oil and a small knob of butter in the frying pan. Add the black pudding and cook for 2-3 minutes on each side until it darkens and becomes crisp around the edges. Transfer the black pudding to the tray in the oven, tip out most of the buttery liquid and return the pan to the hob. Pat the scallops dry with kitchen paper and season on each side with salt and freshly ground black pepper.  Cook the scallops for 1-2 minutes on each side, depending on their size, until golden-brown on the outside but tender within. Remove the baking tray out of the oven and put the scallops on it alongside the bacon and black pudding.  Return the frying pan to the heat and add the chicken stock and Marsala. Stir well and bring to a simmer. Add the remaining butter, in small pieces, to the liquid, stirring constantly until the butter melts and the sauce thickens. Remove from the heat. Spoon the colcannon onto four plates and top with the black pudding, scallops and bacon. Strain a little of the Marsala sauce over each one, garnish with fresh parsley and serve.  ","ingredients":" 2 tbsp sunflower oil,  8 rashers smoked streaky bacon, rindless,  16 medium-sized scallops, shelled, coral removed and cleaned ,  200g\/7oz black pudding, cut into 12 thick slices,  25g\/1oz butter,  100g\/3½oz chicken stock ,  3 tbsp Marsala,  sea salt flakes and freshly ground black pepper,  fresh flatleaf parsley, to garnish,  750g\/1lb 11oz potatoes, preferably Maris Piper or King Edward, peeled, chopped,  50g\/2oz butter,  1 onion, finely chopped,  100g\/3½oz curly kale, roughly shredded ,  200ml\/2fl oz double cream","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_with_bacon_03338"}