{"recipe_name":"Scallops with miso tar and mackerel tartare","author":"Jason Atherton","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Peel the pomelo, leaving about 2.5cm\/1in of pith on the skin, cut the skin into strips. Cut the pomelo flesh into quarters, then place into a sous vide bag or sealable plastic bag. Blanch the pomelo skin in boiling water for one minute, then drain and refresh in cold water. Repeat three more times.  Re-fill the pan with 150ml\/5fl oz of water, add the caster sugar and lime juice and bring to the boil, stirring well. Add the pomelo peel, reduce the heat until the mixture is simmering and simmer for 15-20 minutes, or until the liquid resembles syrup, stirring occasionally. Remove the pan from the heat and set aside to cool completely. Bring a pan of water to the boil, then drop the bag of pomelo quarters into the water and cook for one minute. Remove the bag from the pan and refresh in iced water. Gently rub the bag to separate the pomelo pearls then tip out onto a plate, you need about 50g\/2oz pomelo pearls. Whisk the yuzu juice and olive oil together then add the pearls and set aside. For the miso tar, heat the sugar in a frying pan until it melts into a caramel. Carefully stir in the cream and the butter then slowly whisk in the miso. Pass the mixture through a sieve and set aside to cool to room temperature. Whisk in the lime juice. For the mackerel tartare, using a biscuit cutter, stamp the kohlrabi into circles. Whisk the mustard and vinegar together in a bowl, then slowly whisk in the oil until well combined. Add the kohlrabi circles and set aside. Mix the remaining ingredients together in a bowl and chill in the fridge for one hour. Heat a frying pn until hot, add the butter and scallops. Cook the scallops for 45 seconds on each side, then remove from the pan and rest for a couple of minutes.  To serve, remove the kohlrabi discs from the marinade. Place a disc of kohlrabi onto a chopping board, spoon a little mackerel tartare onto one half and fold it over. Repeat with the remaining kohlrabi and mackerel tartare. Spoon some miso tar into the middle of the serving plates, top with the scallops, then the mackerel tartare. Spoon the marinated pomelo pearls and candied pomelo skin around the edge of the plate and garnish with the radish cress. ","ingredients":" 1 pomelo,  150g\/5oz caster sugar,  1 lime, juice only,  25ml\/1fl oz yuzu juice,  1 lime, juice only,  50ml\/2fl oz olive oil ,  12 hand dived scallops,  knob of butter,  1-2 tbsp radish cress,  60g\/2½oz caster sugar ,  125ml\/4½fl oz cream,  knob of butter,  125g\/4½oz dark miso,  1 tbsp lime juice ,  1 kohlrabi, peeled, very finely sliced on a mandolin,  1 tsp mustard,  1 tbsp vinegar,  3 tbsp olive oil,  2 mackerel fillets, skin and pin bones removed, finely diced,  25g\/1oz shallot, finely diced,  2 lemons, 2 zested, 1 juiced,  45g crème fraiche ,  1 sprig fresh dill, finely chopped,  2 tsp capers, finely chopped ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallops_with_miso_tar_34315"}