{"recipe_name":"Scallops with oloroso sherry, oyster mushrooms and migas","author":"Sam and Sam Clark","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the migas, heat the olive oil in a wide pan over a low-medium heat. Add the garlic cloves and fry for a few minutes to release their flavour. Turn down the heat if the garlic is sizzling too quickly - it's very important that it does not burn. Add the bread and bay leaves and fry gently for 20-25 minutes, turning and stirring often, until the bread and garlic are golden-brown all over. Pour over the saffron and its soaking liquid and continue to cook for 5-10 minutes, or until the bread is crunchy again. Remove from the heat, season with salt and keep warm. For the scallops, heat three tablespoons of the olive oil in a small saucepan over a medium heat. Add the onion and a small pinch of salt and fry for about 15-20 minutes, stirring occasionally, until golden-brown, caramelised and sweet in flavour. If the onion is colouring too quickly, turn down the heat. Drain off any excess oil and set aside. Place another frying pan over a high heat and add the remaining two tablespoons of olive oil. When the oil is hot, add the scallops, seasoned with a little salt and freshly ground black pepper. Cook for 1-2 minutes on each side, until just golden-brown. Add the softened onion, oloroso sherry and water to the pan, taking care as it may spit, and gently simmer for another minute. For the mushrooms, heat a griddle pan until very hot. Drizzle the mushrooms with the olive oil and season with salt and freshly ground black pepper. Place on the griddle and cook for 1-2 minutes, or until charred and tender. To serve, divide the mushrooms among four serving plates. Spoon over the scallops and their sauce and sprinkle over the crisp migas. Finish with a sprinkling of chopped oregano and sweet paprika. ","ingredients":" 6 tbsp olive oil,  10 garlic cloves, peeled,  200g\/7oz day-old, slightly dry, rustic white bread, such as ciabatta or sourdough, crusts removed, torn into 2cm\/1in pieces,  2 fresh bay leaves,  large pinch saffron strands, infused in 3½ tbsp boiling water,  pinch salt,  5 tbsp olive oil,  ½ large onion, finely chopped,  pinch salt,  12 large scallops with corals, removed from their shells, washed, trimmed and patted dry,  salt and freshly ground black pepper ,  150ml\/6fl oz medium-dry oloroso sherry,  25ml\/1fl oz water,  300g\/12fl oz oyster mushrooms, torn into strips if large,  1 tbsp olive oil,  salt and freshly ground black pepper ,  1 tbsp roughly chopped fresh oregano,  1 tsp sweet paprika (not hot)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallopswitholorosos_87612"}