{"recipe_name":"Scallops with puréed shallots and black peppered tangerines","author":"Gary Rhodes","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the shallot purée, warm the olive oil and add a knob of butter in a saucepan. Once bubbling, add the sliced shallots, cover and cook for 15 minutes without allowing to colour. Stir occasionally. To avoid the shallots sticking to the pan, add 3-4 tablespoons of water to the pan once the shallots have softened. Add the cream and continue to cook for a further five minutes. Remove from the heat, season and then liquidise to a smooth purée.  Place the peeled tangerine segments on a lightly oiled baking tray, brushing each with melted butter and topping with black pepper.  To cook the scallops, heat a drizzle of oil in a large frying pan. Place scallops in the hot pan and add the knob of butter.  Cook for 1-1½ minutes. Once coloured with deep tinges on their border, turn them over and continue to cook for a further 1-1½ minutes. The scallops will be cooked medium-rare. Season each with a few granules of sea salt, and place to one side. Pour away excess fat from scallop pan and return to heat. Add the brandy to the pan, and deglaze.  Place the peppered tangerine segments under a hot grill. Once the baking tray is almost dry, add the tangerine juice and boil quickly, allowing it to reduce in volume by at least half, to a syrupy consistency. Strain the syrup through a fine sieve. Lay three tablespoons of warm shallot purée on each plate. Place a scallop on top of each, then place two warmed peppered segments on top of each scallop. Now drizzle the syrup over, finishing with two chives. Serve. ","ingredients":" 12 scallops ,  olive oil,  knob of butter,  coarse sea salt,  2 tbsp brandy,  6 tangerines, juice only,  1cm\/0.5in thick chives (approx 2 chives per scallop),  2 tbsp olive oil,  knob of butter,  325g\/12oz shallots, peeled and thinly sliced,  4 tbsp double cream,  salt and freshly ground black pepper,  24 tangerine segments,  oil, for greasing,  butter, for brushing,  black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scallopswithpureedsh_73833"}