{"recipe_name":"Scones with strawberry jam and clotted cream","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the jam, heat the sugar, lemon juice and three tablespoons water in a large pan, slowly, until the sugar has melted. Add the strawberries and stir gently. Bring the jam up to the boil and cook for 3-4 minutes or up to 10 minutes if you prefer a thicker jam. Remove from the heat, allow to cool slightly, then pour into sterilised jars and allow to cool completely.    Preheat the oven to 220C\/425F\/Gas 7. Sift together the flour, baking powder and salt into a bowl then add the butter and rub into the flour, creating a fine breadcrumb consistency.  Add the sugar and two eggs, lightly beaten, and mix well. Add the milk, a little at a time, working with a wooden spoon to form a smooth dough. Roll on a lightly floured work surface until 2cm\/¾in thick. Dip a 5cm\/2in pastry cutter into the flour then stamp out rounds from the dough, using one sharp tap and not twisting the dough as you cut - twisting the scone mix will result in an uneven rising. Re-roll the leftover dough and cut out more scones until all the dough has been used. Flip the scones over and place onto a baking tray. Brush the beaten egg yolks over the top of the scones, taking care not to let any run over the edges. Place the scones on a greased baking tray and bake in the pre-heated oven for 10-12 minutes until golden-brown.  Allow to cool slightly, then serve while still warm with strawberry jam, butter and clotted cream. ","ingredients":" 500g\/1lb 2oz jam sugar,  1 lemon, juice only,  500g\/1lb 2oz strawberries,  450g\/1lb strong white flour, plus extra for dusting,  5 tsp baking powder,  pinch salt,  75g\/2¾oz unsalted butter, plus extra for serving,  75g\/2¾oz caster sugar,  2 free-range eggs, lightly beaten plus 2 egg yolks for glazing,  135ml\/4¼fl oz milk,  400g\/14oz clotted cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scones_with_strawberry_81786"}