{"recipe_name":"Scorched confit pork belly with hot pickled pineapple salad and black pepper powder","author":"Glynn Purnell","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 160C\/140C Fan\/Gas 3. Place the pork belly in a deep roasting tray or casserole large enough to hold the volume of oil and the pork. Pour over the oil and add the rest of the ingredients. Cover with a lid or two layers of aluminium foil. Roast for 2-2½ hours, or until pork belly is tender. Remove from oven and leave to cool for 30 minutes. Remove the pork carefully and wrap in cling film. Press it between 2 trays with a weight on top and put it in the fridge for 4 hours, or preferably overnight. For the black pepper powder, heat the oil and black pepper in a saucepan to 60C, remove from heat and leave to cool. Refrigerate overnight to infuse the oil. Place the maltodextrin tapioca in a blender. Pass the oil through a fine sieve and pour the oil onto the tapioca. Blend on a slow speed until the oil has emulsified into the tapioca and turns into a powder. For the pineapple salad, in a saucepan gently heat the oil and vinegar then add the pineapple. When warmed through add all the greens and remove the pan from the heat. Be careful not to heat the greens too much as to wilt them down too far. When you are ready to serve, preheat the oven to 160C\/140C Fan\/Gas 3. Cut pork into portions and heat through in oven for 10 minutes. Remove from the oven and use a blowtorch to brown the fat on top of the pork. Put onto the serving plate next to the pineapple and wilted greens. Dress with the black pepper powder and fresh watercress. ","ingredients":" 1kg\/2lb 4oz pork belly,  1.5 litres\/2½ pints sunflower oil,  6 cardamom pods,  5 garlic cloves,  3 bay leaves,  2 sprigs fresh thyme,  1 vanilla pod, split and de-seeded,  1 lemon, zest and juice,  50g\/1¾oz sunflower oil,  3 tbsp cracked black pepper,  50g\/1¾oz maltodextrin tapioca,  200ml\/7fl oz olive oil,  50ml\/2fl oz sherry vinegar,  ½ pineapple, peeled and diced,  100g\/3½oz baby spinach,  100g\/3½oz watercress, plus extra to garnish ,  100g\/3½oz rocket","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/scorched_confit_pork_51052"}