{"recipe_name":"Blackberry and pear crumble with custard","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crumble, preheat the oven to 180C\/350F\/Gas 4. Grease an ovenproof dish with butter. In a large bowl, mix together the butter and the flour, using your fingertips, until the mixture resembles breadcrumbs. Add the sugar, mix until well combined, then set aside. For the filling, place the whole pears into a pan, cover them with water and add 50g\/1¾oz of the sugar. Bring the mixture to the boil, then reduce the heat to a simmer and cook for 10-12 minutes, or until the pears are tender. Drain well and set the pears aside to cool. When the pears have cooled, remove the cores and finely chop the flesh.  Spoon one-quarter of the pears in an even layer on the bottom of the prepared ovenproof dish. Scatter one-quarter of the blackberries over the layer of pears and then sprinkle over two tablespoons of the remaining caster sugar. Repeat the layering process until all of the chopped pears, blackberries and sugar have been used up. Sprinkle over the crumble topping and bake the crumble in the oven for 20-25 minutes, or until the crumble is golden-brown and the filling is bubbling. Meanwhile, make the custard. Place the egg yolks and sugar in a bowl and whisk until thick and pale. Place the milk and cream into a saucepan and bring to the boil. Pour onto the egg mixture, whisk well, then return the mixture to the pan. Heat gently, until the custard is thick enough to coat the back of the spoon. To serve, divide the crumble between serving bowls and pour the custard over. ","ingredients":" 110g\/4oz butter, cubed, plus extra for greasing,  180g\/6½oz plain flour,  110g\/4oz demerara sugar,  5 pears, peeled and left whole,  150g\/5½oz caster sugar,  300g\/10½oz blackberries,  4 free-range egg yolks,  40g\/1½oz caster sugar,  150ml\/5½fl oz milk,  150ml\/5½fl oz double cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blackberryandpearcru_90060"}