{"recipe_name":"Sea bass and lemon sole, with beurre noisette and Jersey Royals","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring a pan of salted water to the boil, add the potatoes and cook for 8-10 minutes until just tender. Drain, return the potatoes to the pan with a little butter, crush with the back of a fork and season with salt and black pepper. For the beurre noisette, heat a non-reactive frying pan until hot, add the butter and heat until it turns a nut-brown colour. Add the lemon juice, a pinch of salt and freshly ground black pepper, then remove from the heat. Season the sea bass and lemon sole with a little salt. Heat a frying pan until hot, add some of the olive oil and the sea bass, skin side down. Sear for a minute then turn the heat down to low and cook for 4-5 minutes on the skin side. Flip over, add some butter to the pan and coat the sea bass with the melted butter. Remove from the heat and allow to rest in the pan for a minute. Meanwhile, heat a separate pan until medium hot, add the remaining butter and oil and the lemon sole and cook over a high heat for two minutes then flip and cook for a minute. To serve, place the crushed potatoes in a little pile at one end of a rectangular plate. Place the sea bass, skin side up, on top, then place the lemon sole at the other end of the plate and spoon over the beurre noisette. Garnish with watercress leaves and the muslin-wrapped lemon.  ","ingredients":" 200g\/7oz new potatoes, preferably Jersey Royals, scrubbed,  knob of butter,  salt and freshly ground black pepper,  110g\/4oz unsalted butter,  ½ lemon, juice only,  salt and freshly ground black pepper,  4 x 110g\/4oz pieces sea bass fillet (2.5cm\/1in thick), skin on,  4 x 75g\/3oz fillets lemon sole, skin removed,  3 tbsp olive oil,  75g\/3oz butter,  1 handful watercress, picked,  2 lemons, cut in half and wrapped in muslin squares","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sea_bass_and_lemon_sole_38421"}