{"recipe_name":"Sea bass, paprika potatoes with a chorizo, pimientos and basil salad ","author":"Jun Tanaka","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the dressing, bring a pan of water to the boil and blanch the coriander, basil, mint and parsley leaves for 30 seconds. Drain and transfer to a blender.  Skin the green pepper by placing under a grill (or using a blow-torch) and charring the skin for a few minutes on each side. Allow to cool before peeling off the skin. Remove the seeds and chop into bite-sized pieces.  Gently fry the pepper in a hot pan with a tablespoon of oil for a few minutes to soften. Transfer to a blender and add the herbs, vinegar, capers, mustard, lemon juice, anchovies, and the remaining oil. Season with salt and pepper and blend until smooth.  For the potatoes, put the cubed potatoes into a pan of cold water and bring it to the boil, and boil for 3-4 minutes. Drain and then rinse in ice cold water. Heat the oil in a large pan and fry the potatoes for 4-5 minutes, or until light golden-brown. Add the smoked paprika and chorizo slices and continue to cook for a further few minutes. Stir in the peppers, season with salt and pepper and continue to cook until the potatoes are tender. Stir in the wild rocket and set aside for a few minutes to wilt.  For the sea bass, heat the oil in a non-stick frying pan. Lightly score the sea bass skin using a sharp knife. Fry the bass skin-side down for 2-3 minutes until crisp. Turn over and cook for a further 30 seconds, or until cooked through.  To serve, spoon the roast paprika potatoes onto serving plates. Top with the sea bass fillet and drizzle the basil and caper dressing over to finish. ","ingredients":" handful fresh coriander leaves,  handful fresh basil leaves,  handful fresh mint leaves,  handful fresh flatleaf parsley,  75ml\/2½oz olive oil ,  1 green pepper,  2 tbsp white wine vinegar,  2 tbsp capers,  2 tsp Dijon mustard,  1 lemon, juice only,  4 anchovy fillets, chopped,  salt and pepper,  400g\/14oz new potatoes, peeled and chopped into cubes,  2 tbsp olive oil,  2 tbsp smoked paprika,  250g\/9oz chorizo, sliced,  200g\/7oz pimientos peppers, chopped into bite-sized pieces,  100g\/3½oz wild rocket,  2 tbsp olive oil,  4 x sea bass fillets, scaled and pin-boned ,  salt and pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sea_bass_paprika_38011"}