{"recipe_name":"Sea bass with crab mayonnaise, roasted fennel and orange","author":"Nathan Outlaw","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring a large pan of water to the boil (big enough to submerge the crab). Season the water liberally with sea salt to make it as salty as seawater. When the water comes to a rolling boil, lower the crab into it and cook for 15 minutes. Carefully lift the crab out of the water, place on to a board and leave until cool enough to handle.  Prepare and extract the meat from the crab. (You can save the shells to make stock for future use). Blend the brown crab meat in a food processor until smooth and save for the crab mayonnaise.  Pick through the white meat removing any shell and cartilage. Set aside in the fridge until needed. Preheat the oven to 200C\/375F\/Gas 6.  Cut each fennel half into 6 or 8 wedges. Heat a non-stick frying pan over a medium heat and add a drizzle of rapeseed oil. When hot, add the fennel wedges and cook for two minutes on each side until golden-brown.  Season with salt and pepper and transfer the fennel to an oven tray and bake in the oven for four minutes. Then set aside and keep warm. Meanwhile, heat an ovenproof non-stick frying pan and add a drizzle of rapeseed oil. When hot, place the sea bass, skin side down, in the pan and season with salt.  Cook until the skin starts to turn golden-brown, then transfer the pan to the oven to cook for four minutes. When ready, take out the fennel and keep warm.  Remove the fish from the oven and flip the sea bass fillets over – they will finish cooking in the heat of the pan.  For the mayonnaise, whisk the egg yolks, lemon zest and juice in a bowl and slowly add the oil drop by drop to begin with, then in a steady stream, whisking constantly, until it has all been incorporated.  In a mixing bowl, mix half of the mayonnaise with the white crab meat, two tablespoons of brown meat, the chopped tarragon and salt and pepper to taste. Keep in the fridge until needed. For the sauce, whisk the double cream into rest of the mayonnaise and thin down with the crab stock. Keep cool until serving then just warm through. To serve, spoon the crab mayonnaise into the centre of four warmed plates, top with the fish and place the fennel alongside. Spoon the crab sauce around the fish. Finish with the orange pieces and a drizzle of olive oil. Serve at once.   ","ingredients":" 1 live brown crab, about 1kg\/2lb 4oz, placed in the freezer an hour before cooking,  2 fennel bulbs, trimmed and halved,  sea salt and freshly ground black pepper,  light rapeseed oil, for cooking,  4 x 200g\/7oz filleted sea bass portions,  1 orange, peel and pith removed, segmented and diced ,  olive oil, to drizzle ,  2 eggs, yolks only,  1 lemon, zest, finely grated, and juice,  300ml\/11fl oz light olive oil,  2 tbsp chopped tarragon,  salt and freshly ground black pepper,  50ml\/2fl oz double cream ,  125ml\/4fl oz crab stock","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sea_bass_with_crab_91616"}