{"recipe_name":"Sea bass with lemon mash and a saffron mussel sauce","author":"The Dares Family","programme":"The Hairy Bikers' Cook Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4 (optional, this is to finish cooking the sea bass, however you could cook it on the stove).  For the mash, boil the potatoes in a pan of salted water for 20 minutes or until tender, then drain thoroughly. Mash the potatoes with the butter, cream, lemon zest and juice and some salt and freshly ground black pepper until smooth. Keep warm. For the cabbage, fry the cabbage in a large pan with the butter and garlic for five minutes, or until just softening. Add the white wine and caraway seeds and season with salt and freshly ground black pepper. Simmer for 4-5 minutes over a low heat, or until just tender. Keep warm. For the saffron mussel sauce, place the mussels into a saucepan with a tightly fitting lid and steam over a high heat for 3-4 minutes, shaking the pan gently once or twice, until all the mussels have opened. Discard any mussels that have remained closed. When cool enough to handle, pick the mussels out of their shells and set aside. Heat the olive oil in a small pan over a medium heat, add the shallots and garlic and fry gently for five minutes until softened and translucent. Pour in the white wine, increase the heat to high and boil for one minute until reduced in volume by half. Reduce the heat, stir in two tablespoons of the double cream and all of the saffron and simmer gently, stirring occasionally, for five minutes. When ready to serve, stir the mussel meat into the sauce and heat through thoroughly. Season with salt and freshly ground black pepper. If the sauce is too thick, add a splash more cream. For the sea bass, rub the sea bass with the olive oil and season with salt and freshly ground black pepper. Heat an ovenproof frying pan over a medium-high heat and place the fish, skin-side-down in the pan. Cook for three minutes, or until the skin is crisp. Turn the fish over and transfer to the oven to finish cooking for 3-4 minutes. (Alternatively finish cooking the fish in the pan.) To serve, spoon the lemon mash into the middle of warm serving plates, top with the cabbage and a fish fillet and finish by spooning over the saffron sauce and dotting the mussels around the edge of the plate. ","ingredients":" 4 medium floury potatoes, such as King Edward, peeled and cut into even-sized chunks,  large knob of butter,  2-3 tbsp double cream,  1 lemon, grated zest and juice only, to taste,  salt and freshly ground black pepper,  1 small Savoy cabbage, thinly sliced,  knob of butter,  1 garlic clove, crushed,  3 tbsp white wine,  1 tsp caraway seeds,  10 mussels, cleaned, beards removed (discard any mussels that do not close tightly when tapped),  2 tbsp olive oil,  2 shallots, finely chopped,  1 garlic clove, crushed,  3 tbsp white wine,  2-3 tbsp double cream,  pinch saffron threads,  2 fillets sea bass, each weighing about 150g\/5oz, skin diagonally scored in three places with a sharp knife,  1 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sea_bass_with_lemon_mash_53738"}