{"recipe_name":"Sea bass with mussels and saffron","author":"Luke Matthews","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Clean the mussels well and pull of any beards. Discard any that have broken shells. Discard any open mussels that do not close when given a sharp tap. In a large pan with a lid, heat a little butter. Gently fry half the shallot and the thyme until softened.  Add the mussels and white wine and cover with a lid. Shake the pan regularly to ensure the all mussels cook. Strain the mussels making sure you retain all the cooking liquid for the sauce. Discard any mussels that have not opened.  Pick the cooked mussels out of the open shells and reserve. Blanch the tomatoes in boiling water, refresh in iced water and peel. Remove the seeds and dice neatly. Heat a little of the butter in a clean saucepan and gently cook the remaining shallot until soft and transparent. Add the fennel and a pinch of saffron.  Add the mussel cooking liquor, bring to the boil and cook to reduce in volume until thickened. Stir in the cream and the remaining butter. Add the samphire, mussels and diced tomatoes and season to taste with salt and pepper. Cook for 2-3 minutes until the samphire is tender. In a non-stick pan, heat a little oil. Season the fish on the skin-side only, place in the pan skin-side down and cook over a low\/medium heat for five minutes until it is almost cooked through. Season it on the flesh side and turn it over (the skin should be nice and crisp) and cook for a further minute.  To serve, place the sauce on the plate with the fish on top and garnish with the micro fennel.  ","ingredients":" 60 mussels,  60g\/2¼oz unsalted butter,  1 banana shallot, finely chopped,  2 sprigs thyme,  100ml\/3½fl oz white wine ,  2 plum tomatoes,  1 tbsp olive oil,  4 portions wild sea bass, (about 140g\/5oz each), pin boned,  salt and freshly ground black pepper,  1 fennel bulb cut in half, cored and finely sliced,  pinch saffron,  100ml\/3½fl oz double cream,  100g\/3½oz samphire, picked and woody middle branch removed,  1 punnet micro fennel, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sea_bass_with_mussels_04742"}