{"recipe_name":"Sea bass with mussels and saffron cream sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the mussels, discard any with cracked shells and any open ones that do not close when given a sharp tap. Heat half of butter and oil in a lidded saucepan. Once hot add the shallots, white wine and mussels and cover. Cook for 2-3 minutes, or until the mussels have opened (discard any mussels that have not opened). Remove from the heat and drain, keeping the liquor. Remove some of the mussels from their shells and keep a few in their shells for presentation. For the cream sauce, heat a frying pan and add the butter and oil. Add the shallots and cook for a couple of minutes, add the mussel liquor and white wine. Reduce the heat and cook until the volume of liquid has reduced by half.  Add the courgette and tomatoes and cook for 1-2 minutes. Add the cream and saffron and cook for a further 1-2 minutes. Just before serving add the mussels and chervil. Heat a medium saucepan of boiling water and blanch the samphire and sea aster. Drain and set aside. In a separate frying pan add the butter and fry the samphire and sea aster for a few minutes. To cook the sea bass, heat another frying pan and add the remaining oil and butter and place the sea bass fillets skin side down in the pan. Cook on each side for 2-4 minutes, or until the skin is crispy and cooked through. Spoon the sauce and vegetables around a serving plate and place the fish in the centre. Garnish with the mussels, samphire and sea aster. ","ingredients":" 75g\/2¾oz unsalted butter,  2 tbsp olive oil,  1 shallot, diced,  5 tbsp white wine,  400g\/14oz mussels, cleaned and debearded,  4 x 175-200g\/6-7oz sea bass fillets, skin on,  50g\/1¾oz butter,  1 tbsp olive oil,  2 shallots, roughly chopped,  150ml\/5fl oz white wine,  1 yellow courgette, balled with a Parisian scoop,  1 green courgette, balled with a Parisian scoop,  3 tomatoes, peeled, seeds removed, chopped,  110ml\/3¾fl oz double cream,  pinch saffron strands,  2 tbsp roughly chopped fresh chervil,  300g\/10½oz samphire,  100g\/3½oz sea aster (available online),  50g\/1¾oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sea_bass_with_mussels_83172"}