{"recipe_name":"Sea bream, tomato chutney, cucumber relish and samphire","author":"Galton Blackiston","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sea bream, place all the ingredients except the sparkling water, sea bream and vegetable oil in a large glass bowl and mix to combine.  Gradually add the water and lightly whisk, then place in the fridge to rest.   For the cucumber relish, place all the ingredients in a large bowl, stir and set aside. To make the chutney, preheat the grill to hot.  Place the tomatoes on a baking tray and cook under the grill for 5-10 minutes.  Remove from the grill and add the chillies, garlic, shallot and ginger. Sprinkle with the sugar and place back under the grill for a further five minutes. Remove from the grill and tip the cooked tomatoes and other ingredients onto a chopping board. Chop to a pulp, then add to a pan and cook over a medium heat for 20 minutes. Set aside until ready to serve. For the samphire, place a pan of boiling water on the hob, add the samphire and cook for 2-3 minutes. Prepare a bowl of ice cold water.  Drain the samphire, tip it into the cold water and once, cool, drain again and set aside. Place a large pan on the heat and add enough vegetable oil for deep fat frying. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Heat to 180C\/350F, or until a bread cube sizzles and turns golden-brown when dropped in the oil. Remove the batter from the fridge, dip each fish strip in the batter and deep fry for three minutes, or until golden-brown and crisp. Place a frying pan on the heat and, once hot, add the butter and gently fry the samphire for 2-3 minutes. To serve, arrange the cucumber relish, chutney and samphire on each plate and place the battered fish on top. ","ingredients":" 100g\/3½oz plain flour,  1 tbsp cornflour,  ¼ tsp chilli powder,  ¼ tsp ground turmeric,  ¼ tsp ground coriander,  ¼ tsp garam masala,  2 garlic cloves, finely chopped,  1 large knob fresh root ginger, finely chopped,  120ml\/4fl oz sparkling water,  3 whole sea bream, skinned, filleted and cut into strips,  vegetable oil, for deep-fat frying,  1 cucumber, peeled and finely chopped,  2 tomatoes, skinned, deseeded and cut into strips,  ½ red onion, finely chopped,  ½ bunch fresh coriander,  ½ lime, juice only,  2 tbsp olive oil ,  8 tomatoes,  2 red chillies, sliced and seeds removed,  2 garlic cloves, peeled and chopped,  1 shallot, sliced,  small knob fresh root ginger, sliced,  1 tbsp soft brown sugar,  4 tbsp olive oil,  1 lemon, juice,  300g\/10½oz samphire,  50g\/1¾oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sea_bream_tomato_chutney_57238"}