{"recipe_name":"Sea bream with a myoga salad and potatoes","author":"Jason Atherton","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2 as a main course, or 4 as a starter","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dressing, mix all the grated vegetables together and squeeze out as much liquid as possible using kitchen paper. Add the soy sauce, ponzu sauce, rice vinegar, and grapeseed oil. Season with black pepper and mix well. Store in a lidded container in the fridge. For the salad, combine the myoga, ginger and shiso green. Chill in iced water until ready to serve. For the potato, preheat a deep-fat fryer to 180C.  Wash the potatoes very well in ice cold water. Drain the potatoes then mix with the katakuriko and mix well. The potatoes should be in individual pieces and not stuck together. Deep-fry the potato strips until golden-brown, season with table salt and drain on a plate lined with kitchen paper. To serve, drain the salad thoroughly and arrange on the plates. Drizzle the dressing over the salad and slices of sea bream. Serve the potatoes alongside. ","ingredients":" 200g\/7oz onion, grated ,  60g\/2¼oz carrot, grated ,  20g\/¾oz fresh root ginger, peeled and grated ,  50g\/1¾oz Granny Smith apple flesh, grated ,  6 tbsp dark soy sauce ,  3 tbsp ponzu sauce,  3 tbsp rice vinegar ,  150ml\/5fl oz grapeseed oil,  ground black pepper, to taste,  100g\/3½oz myoga (also known as Japanese ginger), cut in half lengthways and cut into a very fine julienne,  20g\/¾oz ginger, peeled and sliced,  20g\/¾oz shiso green, sliced,  500g\/1lb 2oz ice cubes,  500g\/1lb 2oz potatoes, peeled and cut into a very fine julienne,  20g\/¾oz katakuriko (also known as potato starch),  2 litres\/3½ pints oil, for deep frying  ,  table salt, to taste,  1 really fresh sea bream, filleted, pin boned and very thinly sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sea_bream_with_a_myoga_56018"}