{"recipe_name":"Sea bass in coconut milk and ginger sauce with curry leaf potatoes, topped with asparagus cress","author":"Atul Kochhar","programme":"Great British Menu","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the coconut and ginger sauce, heat the oil in a flat pan and sauté the mustard seeds and curry leaves until they pop.  Add the ginger, garlic, green chillies and sliced onions and sauté until the onions are translucent. Reduce the heat to low and stir in the ground spices. Pour in 120ml\/4fl oz of water and add the tamarind extract. Once the sauce comes to a simmer, add the coconut milk and salt. Simmer until the sauce is thick. Remove from the heat and set aside until required. Reheat for serving. Prepare the potatoes. Cook the potatoes in boiling salted water until just tender, then drain.  Heat the oil and sauté the ginger, lentils and mustard seeds until spluttering. Add the potatoes and stir well to mix, crushing them roughly, then add the curry leaves and salt. Cook for a further 2-3 minutes. Remove from the heat and keep warm. Add the chopped coriander just before serving. For the sea bass, fry the fish in hot oil, until crisp. Meanwhile, mix all the cresses together and dress with a little curry leaf oil. To serve, place the potatoes in the centre of warm plates and spoon the sauce around them. Place the fish on top of the potatoes and garnish with the cress salad. Drizzle with curry leaf oil to finish. ","ingredients":" 1 tbsp coconut or vegetable oil,  ¼ tsp mustard seeds,  1 tsp finely chopped fresh ginger,  3 cloves garlic, sliced into fine strips,  2 green chillies, slit lengthways,  2 onions, finely sliced,  10 curry leaves,  1½ tsp ground turmeric ,  1 tsp ground coriander ,  ¼ tsp freshly ground black pepper,  2 tbsp freshly prepared tamarind extract (made by soaking dried tamarind in water and then passing through sieve),  400ml\/14fl oz coconut milk,  1½ tsp salt,  200g\/7oz Jersey Royal potatoes, peeled,  1 tbsp vegetable oil,  ¼ tsp finely chopped fresh ginger,  ¼ tsp black gram lentils,  ¼ tsp mustard seeds,  10 curry leaves, deep-fried and crushed ,  ½ tsp salt,  1 tbsp finely chopped coriander leaves,  4 small fillets of sea bass, each 80-100g (3-3½oz),  vegetable oil,  salt and freshly ground black pepper,  asparagus cress (available from specialist suppliers and online),  mustard cress (available from specialist suppliers and online),  coriander cress (available from specialist suppliers and online),  curry leaf oil (made by infusing curry leaves in hot oil for a day or two)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/seabassincoconutmilk_82081"}