{"recipe_name":"Sea bream marinated in white miso with pickled onion salsa","author":"Nic Watt","programme":"Saturday Kitchen Best Bites","prep_time":"over 2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sea bream, place the sweet white miso, sugar, saké, mirin and soy sauce into a bowl and whisk together. Rub the sea bream fillets all over with the vegetable oil, then cover generously with the miso mixture. Place onto a dish, cover and transfer to the fridge to marinate for two hours. Remove the sea bream fillets from the marinade and place skin-side up onto a clean work surface. Thread a metal skewer through each fillet, starting 4cm\/1½in from the right-hand side of the tail end, gently folding the fillets to form ripples as the skewer threads up diagonally towards the top of the fillet. Repeat with another skewer from the left-hand side of each fish. Place wedges of lemon on one end of each skewers. Preheat the grill to its highest setting. Place the skewered fish under the grill, skin-side up for 4-5 minutes, until golden-brown. Turn the fillets and grill for 4-5 minutes on the other side, or until golden-brown and completely cooked through. Remove the lemons from the skewers and slide a fillet onto each plate. For the pickled onion salsa, bring a pan of salted water to the boil and add the green beans. Boil the beans for 30 seconds, then drain and plunge into iced water to stop the cooking process. Meanwhile, place the rice vinegar and caster sugar into a clean pan and bring to the boil. Place the onion and chilli slices into a bowl and pour the hot vinegar over. Cover and set aside for 30 minutes to pickle. Place the tomatoes, beans, red onion pickle, rock chives and 1 tsp of the pickling liquid into a bowl and mix well. Season, to taste, with salt and freshly ground black pepper. Serve the pickled onion salsa alongside the sea bream fillets. ","ingredients":" 500g\/1lb 2oz sweet white miso,  2½ tbsp caster sugar,  3 tbsp saké,  3 tbsp mirin (available in Asian supermarkets),  1 tbsp light soy sauce,  4 large sea bream fillets,  4 tbsp vegetable oil ,  1 lemon, quartered,  6 green beans, cut in half,  200ml\/7fl oz rice wine vinegar,  2 tbsp caster sugar,  1 small green chilli, finely sliced,  2 large red onions, finely sliced,  2 baby plum red tomatoes, cut into quarters,  2 teardrop yellow tomatoes, cut into quarters,  ½ punnet rock chives (subtitute a small bunch of ordinary chives if unavailable),  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/seabreammarinatedinr_87263"}