{"recipe_name":"Seafood chowder","author":"Darina Allen","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a stainless-steel saucepan and brown the bacon well until it is crisp and golden. Add the onion, cover and sweat for a few minutes over a low heat. Stir in the flour and cook for 1-2 minutes. Add the fish stock or water gradually. Add the milk, bouquet garni and potatoes. Season well with salt, pepper, mace and cayenne. Cover and simmer until the potatoes are almost cooked, approximately 5-6 minutes. (The chowder may be prepared ahead to this point.) Cut the fish into 2.5cm \/1in cubes.  Add to the pot as soon as the tip of a knife will go through a potato. Simmer gently for 3-4 minutes, stir in the cream and add the shellfish. Add any liquor obtained from opening the mussels or clams. When boiling, remove from the heat. Taste, correct the seasoning and sprinkle with freshly chopped parsley and chives. Serve in a deep dish with plenty of bread and butter. ","ingredients":" 1 tbsp olive or sunflower oil,  110g\/4oz streaky bacon, rind removed, cut into 5mm\/¼ in dice,  175-225g\/6-8oz onions, chopped,  25g\/1oz flour,  850ml\/1½ pints homemade fish stock or, if no fish stock, water,  425ml\/¾ pint milk,  Bouquet garni made up of 6 parsley stalks, 2 sprigs of thyme and 1 bay leaf,  6 medium-sized potatoes, e.g. Golden Wonder, cut into 5mm\/¼ in dice.,  salt and freshly ground pepper,  pinch of mace,  pinch of cayenne pepper,  700g\/1½ lb haddock, monkfish, cod or other firm white fish (or a mixture), free of bones and skin,  150ml\/¼ pint single cream,  450g\/1lb mixed cooked shellfish - mussels, clams, scallops, shrimps or prawns and the cooking liquor.,  freshly chopped parsley and chives,  crusty bread and butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/seafoodchowder_73917"}