{"recipe_name":"Seafood laksa","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 1-2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a griddle pan.  Brush the squid with a little oil and then chargrill for 30-45 seconds on each side.  Transfer to a plate and leave to cool. Then add the monkfish and prawns to the plate.  Squeeze over the lemon juice and set aside to marinate. Heat a large pan.  Place the chillies in a food processor with the garlic, ginger, ground coriander, fresh coriander and sesame oil and blend together to a coarse paste. Add this laksa paste to the heated pan and stir-fry for 1 minute. Then pour in the coconut milk and stock and bring this to the boil.  Simmer for 10 minutes to allow the flavours to combine and until slightly reduced, stirring occasionally. Place the noodles in a large pan of boiling salted water and immediately remove from the heat.  Set aside for 3-4 minutes, then drain and refresh under cold running water. Set aside.  Blanch the sugar snap peas in a small pan of boiling water. Set aside.  Add the fish sauce and the monkfish to the coconut milk mixture  and stir gently for just a few seconds.  Add the chargrilled squid and the prawns and stir gently for another few seconds until the prawns are just cooked and opaque in colour.  Divide the noodles between serving bowls and scatter the sugar snap peas on top.  Ladle over the coconut broth and sprinkle the mint and basil leaves and the spring onions on top to serve. ","ingredients":" groundnut oil ,  9 baby squid, 5cm\/2in pieces,  340g\/12oz monkfish fillet, skinned (5cm\/2in pieces),  18 raw tiger prawns, peeled with veins removed,  1 lemon, juice only,  2 medium hot red chillies, halved and seeded,  4 cloves garlic, roughly chopped,  5cm\/2in fresh root ginger, peeled and roughly chopped,  1 tsp ground toasted coriander seeds,  handful of fresh coriander ,  40ml\/2fl oz sesame oil,  1.2 litres\/2 pints coconut milk,  900ml\/1½ pints fresh fish or vegetable stock ,  200g\/7oz dried vermicelli noodles,  170g\/6oz sugar snap peas,  50ml\/2fl oz Thai fish sauce (nam pla),  handful of fresh mint and basil leaves,  3 spring onions, thinly sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/seafoodlaksa_66343"}