{"recipe_name":"Seared sirloin steak with a rendang sauce and Asian slaw ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sauce, pound the lemongrass to a pulp in a pestle and mortar.  Gently toast the coriander seeds, cumin seeds, turmeric, star anise and cardamom in a dry frying pan until fragrant, then grind until the spices are as smooth as possible. In a wide pan or wok, melt the coconut cream over a low heat. Add the onions, garlic, chillies, ginger and pounded lemongrass and cook gently until the onions have softened. Add the ground spices and the bay leaf and fry for a few minutes more until the mixture is really bursting with aroma. Add the coconut milk, bring to the boil and then add the hot stock. Turn the heat up to high and continue cooking - the amount of liquid will quickly reduce. Only stir occasionally until the sauce reduces to a thick paste.  Rub a little oil on the steaks. Heat a heavy based frying pan or griddle pan over a high heat. When hot, add the steaks and cook for 1-2 minutes on each side depending on the thickness. For the Asian slaw, put all the ingredients into a bowl and mix well. Put all the ingredients for the dressing into a pestle and mortar and pound to a rough paste. Just before serving, add the dressing to the salad and mix well. To serve, cut the steak into slices and place on serving plates. Pour over the rending sauce. Serve the slaw on the side. Garnish with coconut shavings. ","ingredients":" 1 lemongrass stalk, roughly chopped,  20g\/¾oz coriander seeds,  ½ tsp cumin seeds,  ½ tsp ground turmeric,  1 star anise,  3 cardamom pods, crushed and seeds removed,  50g\/1¾oz coconut cream,  1½ large onions, sliced,  3 garlic cloves, chopped,  3 red chillies, seeds removed, chopped,  1 thumb-sized piece fresh root ginger, peeled and chopped,  1 bay leaf,  1 x 400g tin coconut milk,  250ml\/9fl oz strong veal or beef stock, heated,  1 tbsp oil, for frying the steaks,  4 x 200g\/7oz sirloin steaks,  ¼ red cabbage, thinly sliced,  100g\/3½oz Asian greens, thinly sliced,  ¼ hispi cabbage, thinly sliced,  1 bok choi, thinly sliced,  ¼ coconut, grated,  1 tbsp fresh coriander leaves,  1 tbsp fresh mint leaves,  2 tbsp Thai basil,  4 tbsp sesame seeds,  2 limes, juice only,  4 garlic cloves, crushed,  2 tbsp finely grated fresh root ginger,  2 tbsp palm sugar,  4 tbsp fish sauce,  6 tbsp soy sauce,  1 red chilli, finely sliced,  1 tbsp chopped fresh mint leaves,  1 tbsp chopped fresh coriander leaves,  1 tbsp fresh Thai basil,  ¼ coconut, shaved, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/seared_rib-eye_steak_66880"}