{"recipe_name":"Seared beef salad with cashel blue dressing","author":"Paul Rankin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Make sure that the beef fillet is trimmed and free of sinew and fat.  Cut in half lengthways so that you have two longish, flat pieces. Season these with the olive oil, salt and peppercorns. Heat a cast-iron frying saucepan over a very a high heat until very hot.  Add the beef and cook for 2 minutes on each side for rare, and about 5 minutes on each side for medium to well done. When cooked, transfer the beef to a plate, and allow to cool. To cook the celery, place in a small saucepan with the other ingredients and 150ml\/¼ pint) of water.  Cover tightly and simmer for 4 minutes. Remove the saucepan from the heat and allow the celery to cook in the liquid. To make the Cashel Blue dressing, simply whisk the crumbled cheese with the vinaigrette dressing in a small bowl. To make the Vinaigrette, dissolve the salt, pepper and mustard in the vinegar in a bowl. Whisk in the oil, slowly at first to allow it to be incorporated. Check and adjust the seasoning to taste. (Alternatively, this dressing can be easily made in a food processor. Simply place all the ingredients in together and blend.) Remember to keep all vinaigrettes in the fridge if they are not being used immediately, otherwise they can develop a rancid taste. To serve, slice the beef thinly and arrange on four plates, with a little celery.  Place the salad leaves in the centre of each and spoon on a little dressing. Garnish with the chives and chervil leaves. ","ingredients":" 350g\/12oz beef fillet, trimmed and in one piece,  1 tbsp olive oil,  1 tsp cracked black peppercorns,  mixed salad leaves, to serve,  1 tablespoon snipped fresh chives, to garnish,  fresh chervil leaves, to garnish,  3 celery sticks, cut diagonally into 1cm\/½in slices,  3 tbsp olive oil,  ¼ tsp salt,  ½ tsp cracked black peppercorns,  50g\/2oz Cashel Blue cheese, crumbled,  Makes about 250ml\/9fl oz (use only 150ml\/5fl oz),  ½ tsp salt,  ½ tsp freshly ground black pepper,  2 tsp Dijon mustard,  2-4 tbsp white wine vinegar,  225ml\/8fl oz light olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/searedbeefsaladwithc_70260"}