{"recipe_name":"Seared scallops with bacon, Jerusalem artichoke purée and crushed peas","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Jerusalem artichoke purée, place the Jerusalem artichokes into a saucepan, cover with water and bring to the boil. Reduce the heat and simmer for 8-10 minutes, or until tender, then drain. Cool. Place the Jerusalem artichokes into a food processor with the butter, cream and lemon juice and blend to make a smooth purée. Place the purée into a saucepan, season, to taste, with salt and freshly ground black pepper and heat gently to warm through. For the crushed peas, bring a pan of salted water to the boil, add the peas and cook for 3-4 minutes until tender. Drain the peas, then place back in the saucepan. Add the cumin, butter, cream and lemon juice and mix well. Crush the mixture using the back of a fork or a potato masher. Season, to taste, with salt and freshly ground black pepper. For the seared scallops, season the scallops with salt and freshly ground black pepper. Heat a frying pan until hot, then add the olive oil and the scallops and cook for two minutes on each side, or until lightly golden. Remove the scallops from the pan and set aside to rest on a plate. Heat another frying pan and add the bacon. Cook over a high heat until crisp, then remove from the pan and drain on kitchen paper. To serve, place a spoonful of artichoke purée onto each of four plates and smear slightly across the plate. Top with three scallops, followed by a piece of streaky bacon and a few pea shoots. Serve a spoonful of the crushed peas alongside. ","ingredients":" 400g\/14oz Jerusalem artichokes, peeled and chopped,  water, to cover,  75g\/3oz butter,  50ml\/2fl oz double cream,  ½ lemon, juice only,  salt and freshly ground black pepper,  250g\/9oz fresh peas, pods removed,  ½ tsp ground cumin,  50g\/2oz butter,  75ml\/3fl oz double cream,  ½ lemon, juice only,  salt and freshly ground black pepper,  12 hand-dived scallops, coral removed,  salt and freshly ground black pepper ,  1 tbsp olive oil,  4 rashers streaky bacon ,  handful pea shoots, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/searedscallopswithba_86497"}