{"recipe_name":"Seared scallops with prosciutto and sautéed potatoes","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven 200C\/400F\/Gas 6. For the potatoes, heat the olive oil in an ovenproof pan over a high heat. Add the potatoes and fry for two minutes on each side, until crisp and golden. Add the garlic and cashew nuts, mix together with a spoon and season with salt and freshly ground black pepper. Transfer to the oven and roast for five minutes, or until cooked through. Transfer to a warm bowl and sprinkle over the parsley. For the prosciutto, heat the oil in a saucepan over a high heat. Fry the prosciutto for one minute each side, until crisp and golden. Drain on kitchen paper. For the salad, place the oil and lemon juice into a bowl and whisk together with a fork. Add the basil and parsley leaves, mix together with the fork and season with salt and freshly ground black pepper. For the scallops, place a saucepan over a high heat. Rub the scallops with the oil and season well with salt and freshly ground black pepper. Place the scallops into the saucepan and fry for two minutes on each side, or until completely cooked through. To serve, arrange the salad of basil and parsley leaves onto a plate. Put the scallops and prosciutto on top and serve the sautéed potatoes alongside. ","ingredients":" 1 tbsp olive oil,  100g\/3½oz new potato, peeled and cut into ½cm slices ,  1 garlic clove, chopped,  2 tbsp cashew nuts, chopped,  salt and freshly ground black pepper,  1 tbsp fresh parsley, chopped,  1 tbsp olive oil,  2 slices prosciutto ,  1 tbsp olive oil,  1 tsp lemon juice,  small handful fresh parsley leaves,  small handful fresh basil leaves,  salt and freshly ground black pepper ,  3 scallops, cleaned and orange foot removed,  1 tbsp olive,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/searedscallopswithpr_84310"}