{"recipe_name":"Seared smoked salmon with an apple and watercress salad and horseradish mayonnaise","author":"Nick Nairn","programme":"Great British Menu","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/425F\/Gas 6. For the bread, whisk the milk powder into the warm water, then add the yeast and sugar and stir gently. Leave to stand for 10 minutes to give the yeast time to activate.  Mix the flours and salt into a large bowl. Add the yeast mixture, stirring all the time. Add the oil, and mix into a dough. If you're doing this by hand, you can mix the seeds in now; if you're using a mixer with a dough hook, it's better to add the seeds a little later so that they won't be crushed. Knead for 10 minutes (6-8 minutes in a mixer).  Lightly oil a big bowl. Place the dough in the bowl, cover with cling film or a damp cloth and leave to prove at room temperature until doubled in size.  Remove from the bowl and re-mix, knocking the air out. Form into four individual loaves. Place on a baking sheet lined with baking parchment. Place the baking sheet in a bin bag and blow air into it. Scrunch up the end, catching the air inside, to make a sort of tent for your loaves to sit in. Allow them to double in size once more.  Remove the bin bag. Lightly score the tops of the loaves and dust with flour. Bake for 40-50 minutes or until the bread sounds hollow when tapped on the base. Allow to cool. To make the mayonnaise, combine the egg yolk, lime juice, vinegar, horseradish cream and salt to taste in a bowl and whisk gently until smooth. Add the sunflower oil a few drops at a time, whisking continuously to form an emulsion. When about one-third of the oil has been added, you can add it more quickly, but be sure to combine well. When all the oil has been added, you may find that the mayonnaise needs a splash of hot water to thin it a little.  For the salad, mix the shredded cabbage with the rice wine vinegar, sugar and a pinch of salt. Leave to marinate for 40 minutes at room temperature. Add the chilli, spring onions, apple, lime juice, and stir in well. Divide the salad into four portions and arrange on the left side of each of four plates.  At the last minute, heat a little sunflower oil until hot in a frying pan. Flash fry the smoked salmon for about 30 seconds on each side or until cooked to your liking. Place the watercress on the cabbage salad and top with the salmon. Place or pipe a blob of mayonnaise to the side. Serve immediately, with the bread. ","ingredients":" 21g\/¾oz milk powder,  610ml\/1 pint lukewarm water ,  40g\/1½oz fresh yeast,  21g\/¾oz caster sugar,  500g\/1lb 2oz strong white flour, sieved, plus extra for dusting,  500g\/1lb 2oz brown flour, sieved,  18g\/¾oz salt,  50ml\/2fl oz extra virgin olive oil,  small handful of sunflower seeds,  small handful of pumpkin seeds,  1 free-range egg yolk,  squeeze of lime juice,  1 tbsp rice wine vinegar,  1 tsp horseradish cream,  salt, to taste,  150ml\/5fl oz sunflower oil,  125g\/4½oz white cabbage, very finely shredded,  2 tbsp rice wine vinegar,  1 tsp caster sugar,  pinch of salt,  ½ red chilli, finely sliced,  2 spring onions, finely sliced at an angle,  ½ Cox's apple, skin on, cut into fine julienne,  lime juice, to taste,  80g\/3oz watercress, thick stalks removed ,  4 thick pieces of best-quality lightly smoked organic salmon, each 85-90g\/3-3½oz,  sunflower oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/searedsmokedsalmonwi_82226"}