{"recipe_name":"Seared swordfish steaks with salmoriglio and tomato and pepper salad","author":"Rick Stein","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat a griddle pan until very hot, or preheat the barbecue, allowing the flames to die down (approximately 40 minutes). For the salmoriglio, place the oil and water into a bowl and whisk together until thick and emulsified. Add the lemon juice and a pinch of salt, to taste. Add the garlic, oregano, celery herb or leaves (if using) and parsley and stir well. For the swordfish, brush the swordfish generously with oil and season well with peperoncini or crushed dried chilli and salt and freshly ground black pepper. Place the swordfish onto the griddle pan or barbecue and cook for four minutes on each side, or until completely cooked through. For the dressing, place the lemon juice and olive oil into a clean bowl and mix well. Add the red chilli, garlic and season, to taste, with salt and freshly ground black pepper.  To serve, place the swordfish steaks onto four plates and drizzle over the salmoriglio. Place a large spoonful of the chopped tomatoes next to each portion of swordfish.  Top each pile of tomatoes with a little of the sliced roasted peppers, followed by some red onion and a sprinkle of preserved lemon pieces. Drizzle the dressing over the tomato salad and sprinkle over the chopped coriander. ","ingredients":" 6 tbsp extra virgin olive oil,  3 tbsp water,  1½ tbsp lemon juice,  pinch salt,  1 garlic clove, very finely chopped,  1 tbsp chopped fresh oregano,  1 tbsp chopped fresh celery herb or celery leaves (optional),  1 tbsp chopped fresh flatleaf parsley,  4 x 200g\/7oz swordfish steaks (about 2cm\/1in thick),  olive oil,  peperoncini or crushed dried chillies,  salt and freshly ground black pepper,  1½ tbsp lemon juice,  3 tbsp extra virgin olive oil,  1 medium-hot red chilli, seeds removed, finely chopped,  1 garlic clove, finely chopped,  salt and freshly ground black pepper,  500g\/1lb 2oz ripe and juicy tomatoes, skinned, seeds removed, chopped,  2 red peppers, roasted, peeled, seeds and stalk removed, cut into strips,  1 small red onion, finely chopped,  60g\/2½oz preserved lemon, rinsed, flesh removed and discarded, skin chopped into small pieces,  2 tbsp chopped fresh coriander","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/searedswordfishsteak_87046"}