{"recipe_name":"How to cook seared tuna ","author":"Mitch Tonks","programme":null,"prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/searedtunasteakswith_90287_16x9.jpg","method":"Preheat the oven to 200C\/400F\/Gas 6. For the tuna, season the tuna steaks with the sea salt and drizzle with the olive oil. Rub the salt and oil into the steaks. Heat a heavy-based frying pan until hot. Add a tuna steak to the hot pan and sear until lightly browned. Carefully turn over and sear the other side (this will take about 30 seconds on each side, longer if the tuna is thickly cut). Remove and keep to one side. Repeat with the other tuna steak. Place the tuna steaks in a roasting tray and place in the hot oven for another minute or two (they should still be slightly pink on the inside). Remove and keep warm. For the salsa verde, place the mustard and a few tablespoons of the olive oil in a bowl and whisk to emulsify. Chop the anchovies finely and add to the bowl. Pick the leaves from the herbs (except the basil - you can include the stems in the sauce). Pile the picked herbs onto a chopping board. Sprinkle the capers over the top. Chop the herbs and capers finely with a sharp knife. When finely chopped, add to the bowl with the mustard and oil mixture. Peel the garlic clove. Place it on the chopping board and sprinkle over the sea salt. Crush to a fine paste with a knife blade and add the paste to the bowl and mix. Add some of the remaining olive oil to the bowl. The sauce should have a spooning consistency, so add just enough oil - you may have some left over. Mix thoroughly. Just before serving, add the lemon juice to the sauce (the lemon will cause the herbs to go brown if you add it too early). To serve, place the tuna steaks onto plates. Squeeze over some lemon juice and serve with a wedge of lemon, a dollop of salsa verde and a sprig of parsley each. ","ingredients":" 2 x 150g\/5oz tuna steaks,  pinch sea salt,  drizzle extra virgin olive oil,  1 heaped tsp Dijon mustard,  150-250ml\/5-9fl oz fruity, extra virgin olive oil,  4 anchovy fillets,  handful fresh flatleaf parsley,  handful fresh mint,  handful fresh basil,  handful fresh tarragon,  1-2 tbsp capers,  1 garlic clove,  pinch sea salt,  1 lemon, juice only,  lemon wedges,  2 sprigs fresh flatleaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/searedtunasteakswith_90287"}