{"recipe_name":"Blackcurrant mousse cake","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease a 20cm\/8in springform tin with butter.  For the cake, bring a little water to the boil in a pan, then reduce the heat until the water is simmering. Suspend a heatproof bowl over the water. (Do not allow the base of the bowl to touch the water.) Add the eggs and sugar to the bowl and beat together for five minutes.  Gradually sieve in the flour and beat again until well combined.  Spoon the cake batter into the prepared tin and bake for 8-10 minutes, or until pale golden-brown and cooked through (the cake is cooked through when it springs back when a finger is pushed lightly into the centre of it). Set aside until completely cooled. For the mousse, bring the sugar, blackcurrants and blackcurrant liqueur to a simmer in a pan. Continue to simmer for 4-5 minutes. Meanwhile, soak the gelatine leaves in the hot water for 10 minutes, or until dissolved.  Blend the blackberries to a purée in a food processor. Add the dissolved gelatine, cream and yoghurt and blend again until smooth. Pour the mousse mixture into a bowl, then gently fold in the whisked egg whites until just combined. Spoon the mousse mixture over the base, smooth over using a palette knife, then set aside to chill overnight. Serve with chocolate sauce and whipped cream. ","ingredients":" butter, for greasing,  2 free-range eggs,  50g\/2oz caster sugar,  50g\/2oz plain flour,  75g\/2¾oz sugar,  200g\/7oz blackcurrants,  40ml\/1¾fl oz blackcurrant liqueur,  3 gelatine leaves,  1½ tbsp hot water,  75ml\/2¾fl oz double cream, whipped until soft peaks form when the whisk is removed, plus extra to serve,  25g\/1oz Greek-style yoghurt,  2 free-range egg whites, whisked until stiff peaks form when the whisk is removed,  chocolate sauce, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blackcurrantmousseca_92809"}