{"recipe_name":"Sea trout with licorice carrots, sautéed Little Gem lettuce and langoustine bisque","author":"Marcus Wareing","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the langoustine bisque, heat an ovenproof frying pan until hot, then add the butter and langoustine heads and fry for 2-3 minutes. Transfer to the oven to roast for 10-12 minutes. Remove from the oven and place back onto a medium heat. Add the vegetables and herbs and sauté for 3-4 minutes. Add the brandy and pastis and carefully flambé to burn off the alcohol. Once the flames have died down, cook for a further minute, then add the star anise and the stock. Bring to the boil, then reduce the heat and simmer for 30 minutes. Strain the bisque into a fresh pan and season, to taste, with salt and freshly ground black pepper. Add the cream and stir to combine. For the sea trout, heat a frying pan until hot then add the butter. Once the butter has melted, add the trout and fry on both sides for 4-5 minutes, or until completely cooked through. Remove the trout from the pan and sprinkle with the cumin seeds and chervil. Leave to rest in a warm place. For the licorice carrots, heat a saucepan until hot and then add the butter and carrots. Fry together for 1-2 minutes, then add the stock and bring to the boil. Reduce the heat and simmer until the carrots are tender and the stock has almost all evaporated. Add the licorice and cook for a further 2-3 minutes, until the licorice has just softened. For the Little Gem lettuce, heat a frying pan until hot and add the olive oil and Little Gem leaves. Sauté the leaves until just wilted down. To serve, place a few Little Gem leaves onto the centre of each plate and spoon the carrots around the edge. Place the trout on top of the Little Gem and spoon the bisque around the carrots. ","ingredients":" 40g\/1½oz butter,  300g\/11oz langoustine heads,  2 large carrots, roughly chopped,  ½ onion, roughly chopped,  ½ stalk celery, roughly chopped,  ½ bunch thyme,  ½ bunch tarragon,  75ml\/3fl oz brandy,  50ml\/2fl oz pastis,  6 star anise,  1 litre\/1¾ pints chicken stock,  110ml\/4fl oz double cream,  50g\/2oz butter,  4 x 175g\/6oz sea trout, scaled and gutted,  2 tbsp cumin seeds, toasted,  ½ bunch fresh chervil, chopped ,  60g\/2½oz butter,  2 large carrots, very finely chopped,  110ml\/4fl oz chicken stock,  2 fresh licorice sticks (available from some health food shops), very finely chopped,  2 tbsp olive oil,  2 Little Gem lettuce, leaves separated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/seatroutwithliquoric_88339"}