{"recipe_name":"Secret squirrel cake","author":"Frances Quinn","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Makes 1 x 3-tier celebration cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4 and grease and line the three separate cake tins with non-stick baking parchment.  For the almond squirrel cake, sift the flour and almonds into a bowl and set aside.  Cream the butter and sugar together in the bowl of a free-standing mixer fitted with the paddle attachment until pale and fluffy. Beat in the eggs, one at a time, beating the mixture well between each addition and adding a tablespoon of the flour and ground almonds with the last egg to prevent the mixture curdling.  Sift in the remaining flour and almonds and the baking powder and gently fold together with the almond milk and extract until thoroughly combined, and the mixture is a dropping consistency. Spoon the mixture into the 15cm\/6in cake tin and bake on the middle shelf of the oven for 30-40 minutes. Remove from the oven and set aside to cool in the tin for 10 minutes, then turn it out on to a wire rack and leave to cool completely. Cut in half horizontally and transfer to the fridge. For the remaining cakes, prepare three separate large plastic bowls with a sticker stuck on each, saying what flavour chocolate cake mixture each will contain (dark chocolate, milk chocolate and white chocolate). For each cake, combine the flour, ground nuts and baking powder in the three separate labelled bowls and set aside. Place the butter, sugar and flavoured oils into the three mixing bowls and label.  Put the soured cream, eggs, milk, extracts and\/or coffee into three separate large jugs, and beat well with a fork. Label each jug and set aside.  Start making up the three chocolate cake mixtures.  Cream the butter, sugar and oils for each separate cake until the mixture is pale and fluffy. Gradually add each soured cream mixture to its corresponding butter and sugar mixture, alternating with a spoonful of the bowl of dry ingredients to prevent the mixture curdling. Sift the remaining bowl of dry ingredients bowl into the mixture and mix together. Now add the melted chocolate and beat together. This process should be repeated with all three chocolate cake mixtures.  Once all three chocolate cake mixtures have been made, place alternate spoonfuls of all three cake batters into the two remaining prepared tins and draw a knife through the mixture to create a marbled effect. Bake both cakes for 35-50 minutes, or until well risen and a skewer inserted into the cakes comes out clean. The smaller cake will take slightly less time. Turn out onto a wire rack and leave to cool completely.  While the cakes are baking make the gingerbread dough. Sift the flour, spices, salt and bicarbonate of soda into the bowl of a free-standing food mixer fitted with the paddle attachment.  Measure the butter, sugar and golden syrup into a medium heavy-based saucepan and stir gently over a low heat until everything is completely melted and combined. Remove the pan from the heat and pour into the flour mixture while beating at slow to medium speed. Beat in the egg yolk. Mix well to make a smooth, even dough and transfer to a lightly floured surface. When cool, knead gently,  cover with cling film and leave to chill in the fridge for 30 minutes.  Meanwhile, to make the chocolate ganache, heat the cream in a large bowl set over a pan of simmering water. Remove from the heat when bubbles appear around the edge of the cream and then add the chocolate. Stir together until all the chocolate has melted, stir through the extracts and set aside to cool. To make the hazelnut buttercream, place the butter in the bowl of a free-standing mixer fitted with the paddle attachment and beat on a high speed for five minutes. Sift in the icing sugar and beat until completely incorporated. Reduce the speed of the mixer and gradually add in the hazelnut milk, add the ground hazelnuts, then turn up and beat on high for another 2-3 minutes, or until light and creamy. Divide the mixture in half and add five tablespoons of the chocolate ganache mixture to one half to create a hazelnut chocolate buttercream.  To finish the gingerbread, remove the chilled dough from the fridge and transfer to a lightly floured surface. Roll out the dough to the thickness of a pound coin and, using a squirrel cookie cutter, cut out three squirrel shapes from the dough. Cut out 15 leaves with leaf cookie cutters and cut strips to make twigs. Place on a baking tray lined with non-stick baking parchment.   Roll the remaining dough into cylinders to create the acorns (in the shape of liquorice torpedo sweets). Transfer these to another baking tray lined with non-stick baking parchment.  Bake all the biscuits for 5-10 minutes. Remove the biscuits from the oven and transfer to a wire rack to cool – except the cylinders for the acorns; these should be shaped into acorns while still warm and pliable. Cut each torpedo in half to create the acorns, and pinch the tips to create a small point. Set aside to finish later. For the decorations, prepare the chocolate leaves by painting the underside of the rose and bay leaves with the melted chocolate. Leave to set and then gently peel the leaf away from the chocolate - not the other way round. Use the remaining chocolate to make chocolate curls and chocolate bark shapes. To finish the acorns, combine two tablespoons of the melted chocolate with 30g\/1oz of the desiccated coconut and mould into acorn \"hats\". Stick each hat onto each acorn using more melted chocolate. When the cakes have cooled, cover the bottom two ‘trunks’ with the buttercreams - using the hazelnut chocolate buttercream on the sides and the lighter-coloured hazelnut buttercream on the tops. Apply the chocolate ganache around the edge of the cakes and use a fork and knife to create the effect of bark.  Reserve enough buttercream and ganache to top the remaining cake. Transfer the cakes to the fridge to set and prepare the secret squirrel tier. Remove the reserved almond cake from the fridge and carefully cut out a squirrel from the bottom half using the squirrel cookie cutter.  In a food processor, blend together the cake squirrel that has been cut out with the whole almonds, hazelnuts, walnuts and remaining desiccated coconut. Blend together with 10 gingerbread leaves.  Mix together the blended cake mixture with a tablespoon of the chocolate ganache, a tablespoon of the hazelnut buttercream and a tablespoon of the chocolate hazelnut spread. Lightly grease the cookie cutter with hazelnut oil and pack this mixture back into the cookie cutter. Level off and transfer to the fridge to chill. When ready carefully remove from the cutter with the aid of steam from the kettle if necessary and place inside the cut-out squirrel cake. Place the top half back on to the cake. Cover with buttercream and ganache and place in the fridge with the other cakes.  Remove the chilled cakes from the fridge and cover with the chocolate hazelnut spread to create a top layer of bark, coated to look like a tree. Assemble the cakes with the dowelling and arrange the edible foliage around the trunks.  Finally remove the secret squirrel cake from the fridge and top with any remaining chocolate hazelnut spread. Place it on top of the trunk, secured with doweling, together with the squirrel biscuits, assembled acorns and remaining foliage that you have made, plus whole nuts for decoration. ","ingredients":" 225g\/8oz plain flour,  25g\/1oz ground almonds,  175g\/6oz butter, softened,  175g\/6oz golden caster sugar,  3 free-range eggs,  1½ tsp baking powder,  3 tbsp almond milk,  1 tsp almond extract,  150g\/5½oz dark chocolate (70% cocoa solids), melted,  300g\/10½oz plain flour,  100g\/3½oz ground walnuts,  4 tsp baking powder,  100g\/3½oz soured cream,  4 free-range eggs,  50ml\/2fl oz milk,  1 tsp vanilla or walnut extract,  2 tsp instant coffee granules,  200g\/7oz butter, softened,  300g\/10oz golden caster sugar,  50ml\/2fl oz walnut oil,  150g\/5½oz milk chocolate (30% cocoa solids), melted,  50ml\/2fl oz plain flour,  100g\/3½oz ground hazelnuts,  4 tsp baking powder,  100g\/3½oz soured cream,  4 free-range eggs,  50ml\/2fl oz hazelnut milk,  1 tsp hazelnut extract,  200g\/7oz butter, softened,  50g\/1¾oz golden caster sugar,  50ml\/2fl oz hazelnut oil,  100g\/3½oz white chocolate, melted,  300g\/10½oz plain flour,  100g\/3½oz ground almonds,  4 tsp baking powder,  200g\/7oz butter, softened,  50ml\/2fl oz almond oil,  300g\/10½oz golden caster sugar,  100g\/3½oz soured cream,  1 tsp almond extract,  4 free-range eggs,  50ml\/2fl oz almond milk,  175g\/6oz plain flour, plus extra for flouring,  1 tsp ground ginger,  1 tsp mixed spice,  pinch of salt,  ½ tsp bicarbonate of soda,  85g\/3oz unsalted butter, softened,  75g\/2½oz dark muscovado sugar,  2 tbsp golden syrup,  1 free-range egg yolk,  600ml\/20fl oz double cream,  400g\/14oz dark chocolate (70% cocoa solids), chopped,  200g\/7oz milk chocolate (30% cocoa solids), chopped,  ½ tsp almond extract,  ½ tsp vanilla extract,  500g\/1lb 2oz butter, softened,  1kg\/2lb 4oz golden icing sugar,  5 tbsp hazelnut milk,  100g\/3½oz ground toasted hazelnuts,  5 tbsp chocolate ganache (see above),  300g\/10½oz milk chocolate (30% cocoa solids), melted,  300g\/10½oz dark chocolate (70% cocoa solids), melted,  handful rose leaves,  handful bay leaves,  80g\/3oz desiccated coconut,  50g\/1¾oz whole almonds,  50g\/1¾oz whole hazelnuts,  50g\/1¾oz walnuts,  750g\/1lb 10oz jar of chocolate hazelnut spread,  hazelnut oil, for greasing,  selection of nuts, to decorate, to taste","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/secret_squirrel_cake_49338"}