{"recipe_name":"Sesame salmon with tempura salmon and yuzu mayonnaise","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a deep fat fryer to 190C\/375F, alternatively heat vegetable oil in a deep-sided, heavy based pan until a breadcrumb sizzles and turns golden brown when dropped in. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Slice 375g\/13oz of the salmon very very thinly and lay onto four serving plates. Heat the sesame oil in a frying pan until just smoking then pour it over the sliced salmon. Sprinkle over the sesame seeds, yuzu juice and soy sauce. Mix the mizuna leaves, cabbage, coriander and mint together and place in a small ball in the centre of the salmon. For the yuzu mayonnaise, blend the egg yolks, vinegar and mustard in a food processor. With the motor still running, gradually add the oil. Continue until all the oil has been added and the mayonnaise has thickened. Season the mayonnaise with the yuzu juice, salt and freshly ground black pepper. To make the tempura batter, mix together the plain flour and cornflour in a bowl.  Pour in the sparkling water gradually (you may not need all the water) and whisk to make a thick batter. Slice the remaining salmon into 5mm\/¼in slices and dip them in the batter to coat. Lower the salmon pieces into the fryer, a few at a time, and cook for about 2-3 minutes, until crisp and golden-brown. Once cooked, drain the tempura salmon onto kitchen paper and season with salt.  To serve, drizzle the yuzu mayonnaise over the salad. Place a few pieces of tempura salmon on top then garnish with the cress. ","ingredients":" vegetable oil, for deep-frying,  500g\/1lb 2oz salmon fillet, pin boned and skinned,  3 tbsp sesame oil,  2 tbsp sesame seeds,  1 tbsp yuzu juice,  1 tbsp soy sauce,  50g\/2oz mizuna leaves,  75g\/3oz white cabbage, very finely sliced,  3 tbsp coriander leaves, picked,  3 tbsp mint leaves, picked,  50g\/2oz plain flour,  50g\/2oz cornflour,  125ml\/4 fl oz sparkling water,  salt, to season,  2 tbsp mixed cress leaves,  3 free-range egg yolks,  1 tbsp white wine vinegar,  1 tbsp Dijon mustard,  500ml\/18fl oz rapeseed or light olive oil,  1-2 tsp yuzu juice, to taste","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sesame_salmon_with_55799"}