{"recipe_name":"Sesame tuna with noodle stir fry","author":"Bill Oddie","programme":"The Hairy Bikers' Cook Off","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02c014d.jpg","method":"For the tuna, place the soy sauce, garlic, ginger and honey into a non-reactive bowl and add the tuna. Coat the tuna steaks in the marinade, cover and transfer to the fridge to marinate for about half an hour.  For the stir-fry, bring a pan of salted water to the boil. Cook noodles according to packet instruction then drain well and toss with the sesame oil. Heat the groundnut oil in a wok over a high heat until smoking then add the garlic and chilli, cook for 30 seconds until fragrant then add all the vegetables and a dash of soy sauce. Stir-fry for another minute or two, then add the noodles and toss for 30 seconds or until heated through. Stir in the coriander. Heat a large frying pan over a high heat until. Remove the tuna from the marinade and pat dry. Sprinkle the sesame seeds onto a plate. Rub the tuna with a little groundnut oil and press both sides into the sesame seeds until coated all over with sesame seeds. Place the tuna in the hot pan and sear for one minute on each side, until the outside is golden-brown and the middle is still raw. Set aside to rest for a few minutes. Serve the tuna steaks on the noodle stir-fry and garnish with the lime wedges. ","ingredients":" 2 tbsp dark soy sauce,  1 garlic clove, finely chopped,  2.5cm\/1in piece fresh root ginger, peeled and grated,  1 tbsp clear honey,  2 x 150g\/5oz tuna steaks,  1 tbsp groundnut oil,  1 tbsp black sesame seeds,  1 tbsp white sesame seeds,  150g\/5oz dried egg noodles,  2-3 tbsp sesame oil,  1 tbsp groundnut oil ,  2 garlic cloves, finely sliced,  1 red chilli, seeds removed, finely chopped,  2 heads bok choi, leaves separated,  75g\/3oz mangetout,  75g\/3oz baby sweetcorn,  3 spring onions, chopped,  1-2 tbsp soy sauce, or to taste,  small bunch fresh coriander, roughly chopped,  1 lime, cut into wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sesame_tuna_with_noodle_70936"}