{"recipe_name":"Shallot tarte tatin with whipped goats' cheese and watercress","author":"Paul Ainsworth","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Season the shallots lightly with salt and white pepper. Heat a large frying pan over a medium heat. Add the oil and the butter and cook until foaming. Add the shallots and cook until caramelised.  Drain off the butter and return the shallots to the heat. Add the vinegar and cook until it has evaporated. Add the Madeira and cook until it too has evaporated.  Add a little chicken stock, reduce to a simmer and place some parchment on top. Gently cook until the shallots are getting a little soft. Remove from the heat and leave to rest and suck up all the flavours.    For the balsamic caramel, put the sugar in a saucepan. Add a little water and stir so it’s like a paste. Slowly bring to the boil (CAUTION: boiling sugar is extremely hot. Handle very carefully.). The liquid will boil clear and very slowly it will start to turn amber. When the sugar syrup is golden, remove from the heat and at arm’s length add the balsamic. Leave for a few moments, then whisk in the butter until the sauce has a butterscotch consistency. Season with salt and pepper and taste; it may take a little more balsamic to cut the sweetness and a little more seasoning. Set aside.  For the whipped goats’ cheese, put the cheese in a food processor with the paddle attachment and turn the processor on to slow. Add a little cream just to lighten the consistency (you may not need it all). Add a little lemon juice to taste (reserve the zest for garnish). Spoon into a bowl and cover with cling film, then set aside.  Preheat the oven to 200C\/180C Fan\/Gas 6. Spoon the caramel into four blini pans to lightly cover the bottom of each pan. Add some thyme to each pan, then add the shallots. Roll the pastry on a lightly floured surface to 3mm thick and cut out four circles just larger than the blini pans. Place the pastry over the shallots and, using the end of a spoon, push it into them all the way around. Make a small hole in the middle. Bake for 20–30 minutes, or until cooked through.  Leave the tarts for 10 minutes to soak up all that wonderful flavour. While they are still warm, turn them out onto a plate and serve with a spoon of the goats’ cheese in the middle of each tart. Top with watercress, a little olive oil, the lemon zest and chives.  ","ingredients":" 10 banana shallots, cut into round circles about a 1cm\/½in thick,  2 tbsp olive oil,  50g\/1¾oz butter,  50ml\/2fl oz sherry vinegar,  50ml\/2fl oz dry Madeira,  100ml\/3½fl oz chicken stock,  20g\/¾oz fresh thyme, leaves picked,  500g\/1lb 2oz ready-made all-butter puff pastry,  plain flour, for dusting,  sea salt and white pepper,  100g\/3½oz caster sugar,  1 tbsp balsamic vinegar,  45g\/1½oz butter, chilled and cut into cubes,  200g\/7oz goats’ cheese, preferably Dorstone or Tymsborough goats’ cheese, at room temperature, cut into small pieces,  200ml\/7fl oz single cream,  1 unwaxed lemon, zest and juice only,  1 bunch fresh watercress,  50ml\/2fl oz extra virgin olive oil,  50g\/1¾oz chives, snipped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/shallot_tarte_tatin_with_24797"}