{"recipe_name":"Sheftalia with Greek salad","author":"Paul Rankin","programme":"Take on the Takeaway","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the hummus, place the chickpeas into the bowl of a food processor and blend until they form a rough paste (or you can mash the chickpeas with a potato masher). Add the garlic, lemon juice and tahini (if using) and season to taste with salt and freshly ground black pepper. Add the olive oil and blend again, until the mixture is almost smooth. For the sheftalia, halve the pork chop horizontally to make two thin slices, then finely chop the slices until the pork resembles coarse mince. Place the chopped pork chop and the pork mince into a large bowl. Add the onion, garlic, parsley and lemon juice and season well with salt and freshly ground black pepper. Using clean hands, knead the pork mixture together in the bowl until it is smooth and evenly mixed. Divide the pork mixture into six. Flatten them into oval shapes. Place a cube of feta into the middle each portion and mould the pork mixture around the cheese to completely enclose. Form each into an oval shape. Heat the oil in a large non-stick frying pan. Add the sheftalia and cook over a medium heat for 15-20 minutes, turning occasionally, until golden-brown all over and completely cooked through. Add the chopped olives, chillies and red onion to the pan with the sheftalia. Cook gently until the onion is softened but not browned. Squeeze over some lemon juice, turn off the heat and keep warm. For the Greek salad, place the cucumber, tomato, red onion and parsley into a clean bowl. Drizzle with the olive oil and balsamic vinegar, add the feta and olives and gently mix together. Sprinkle with oregano. Place three sheftalia onto two plates. Place some Greek salad alongside, add a dollop of hummus sprinkled with paprika and serve ","ingredients":" 1 x 400g\/14oz can chickpeas, rinsed and drained,  1 garlic clove, peeled and finely chopped,  ½ lemon, juice only,  1-2 tbsp tahini (sesame paste) (optional),  salt and freshly ground black pepper,  4-6 tbsp light olive oil,  pinch paprika,  1 x 150g\/5¼ oz boneless pork chop,  250g\/8¾oz pork mince,  ½ onion, peeled and finely chopped,  3 garlic cloves, peeled and finely chopped,  small bunch fresh flatleaf parsley, finely chopped,  ½ lemon, juice only, plus extra for squeezing,  salt and freshly ground black pepper,  25g\/1oz feta cheese, cut into six cubes,  1 tbsp olive oil,  6 Kalamata olives, stones removed, finely chopped,  2 pickled chillies, finely chopped, or 1 fresh green chilli, finely chopped,  ½ medium red onion, peeled and finely chopped,  ½ cucumber, peeled, cut into 2cm\/1in chunks,  4 medium ripe tomatoes, cut into quarters,  ½ medium red onion, peeled, thinly sliced,  small bunch fresh flatleaf parsley, roughly chopped,  3 tbsp extra virgin olive oil,  1 tbsp balsamic vinegar,  100g\/3½oz feta cheese, cut into cubes,  60g\/2oz Kalamata olives,  ½ tsp dried oregano","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sheftalia_86979"}