{"recipe_name":"Shellfish cassoulet","author":"Steve Groves","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the stock in a saucepan then add the onion, garlic and the rest of the vegetables. Add the drained soaked haricot beans and cook for 30-40 minutes until cooked through. Once cooked remove the roughly chopped carrot and celery and set aside. While the beans are cooking, start to cook the shellfish. Clean the mussel and cockle shells. Discard any open ones that do not close when given a sharp tap. Heat a saucepan, add the butter and start to cook the shallots, garlic and thyme. Add the mussels, cockles, the heads and tails of the prawns and then the white wine. Cover with a lid and allow to steam for few minutes until all the shellfish open - discard any that do not open during cooking. Pick the meat from the mussels and cockles and set aside. Reserve the cooking liquid. Preheat the grill to high or preheat the oven to 220C\/425F\/Gas 7. In another pan, cook the fennel for a couple of minutes in oil, add the tomatoes and then the cooked haricot beans, followed by the mussel stock from cooking the mussels. Bring to a boil then reduce the heat and add the prawns and scallops, followed by the reserved meat from the mussels and cockles. Add the lemon thyme, parsley, lemon zest and juice. Taste and season with salt and pepper as needed. To serve, spoon the mixture into a scallop shell for each serving and top with the breadcrumbs. Place under the grill for 30 seconds or a minute (you can stand them on scrunched up balls of kitchen foil to hold them steady if needed). Serve on a bed of seaweed. ","ingredients":" 400ml\/14fl oz fresh chicken stock,  1 small onion, finely diced,  1 garlic clove, finely chopped,  ½ carrot, roughly chopped,  1 celery stick, roughly chopped,  200g\/7oz dried haricot beans, soaked overnight in water, then drained,  10 mussels,  10 cockles,  50g\/1¾oz unsalted butter,  1 shallot, finely sliced,  1 garlic clove, crushed,  1 sprig thyme,  150ml\/5fl oz white wine,  4 medium-sized blue prawns, peeled and diced (reserve shells and heads),  1 small fennel, diced,  100g\/3½oz wild fennel,  2 plum tomatoes, peeled, seeds removed, diced,  2 large diver caught scallops, removed from the shells, shells kept and cleaned for serving,  1 tsp lemon thyme leaves,  1 tsp chopped parsley,  1 lemon, zest and juice,  salt and freshly ground black pepper,  2 tbsp fresh breadcrumbs, toasted in butter,  seaweed, for serving (optional)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/shellfish_cassoulet_59415"}