{"recipe_name":"Shellfish stew","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p03dqd81.jpg","method":"Preheat the oven to its highest setting.  Place the onion, garlic, 75ml\/2½fl oz of the olive oil, the fennel, fennel seeds, star anise and half of the white wine into a large ovenproof casserole. Stir well then cook in the oven for 5-6 minutes, or until the vegetables have just softened. Stir the tomatoes and crabmeat into the casserole and return to the oven for a further 4-5 minutes. Meanwhile, scatter the cubes of bread into a roasting tray and drizzle with the remaining oil, mixing well to coat the bread.  Remove the casserole from the oven and add the croutons, toasting for 2-3 minutes until just browned. Stir the lobster meat, pollock, mackerel, prawns and mussels into the casserole and season well with pepper. Remove the croutons and return the casserole to the oven for a further 8-10 minutes, or until the fish is cooked through (discard any mussels that remain closed).  To serve, sprinkle the croutons over the shellfish stew, garnish with the basil, then serve at the table with crusty bread. ","ingredients":" 1 onion, roughly chopped,  6 garlic cloves, crushed,  125ml\/4fl oz extra virgin olive oil,  1 head fennel, roughly chopped,  1 tsp fennel seeds,  4 star anise,  300ml\/10fl oz white wine,  2 x 400g tins tomatoes,  200g\/7oz brown crabmeat, puréed in a food processor until very smooth,  1 small sourdough loaf, cut into small cubes,  1 x 750g\/1lb10z cooked small lobster, meat extracted and cut into pieces,  3 x 75g\/2¾oz pollock fillets, skin left on,  1 x 350g\/12oz whole mackerel, cut into large chunks,  12 raw tiger prawns, shells left on,  1kg\/2lb 4oz mussels, scrubbed and de-bearded (discard any mussels that do not close tightly when tapped),  freshly ground black pepper,  basil, to garnish,  crusty bread, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/shellfish_stew_53179"}