{"recipe_name":"Shellfish sauce vierge with fried cod and sautéed courgettes","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the shellfish vierge, heat the olive oil in a large, high-sided sauté pan. Add half the shallots and sweat for one minute, then add the  shellfish and white wine and bring to the boil. Turn the heat down, cover the pan and simmer for 3-4 minutes until all the shells have opened. (Discard any that don't open.) Remove the shellfish from the pan and reserve the cooking liquid. Once the shellfish has cooled slightly, pick the meat from half of the shells and set aside,  discarding  the shells. Heat the olive oil in frying pan over a low heat, add the remaining shallots and garlic and heat for one minute. Add the tomatoes and heat for a further two minutes. Add the picked shellfish, the shellfish still in its shell, and 3-4 tbsp of the cooking liquid and heat through. Stir in the herbs, lemon zest and juice, and season, to taste, with salt and freshly ground black pepper. For the cod, season the cod fillet, to taste, with salt and freshly ground black pepper. Heat half the olive oil in an ovenproof frying pan, place the cod in, skin side down, and fry for 1-2 minutes until the skin is crisp. Turn the cod over and fry on the other side for one minute. Transfer to the oven and roast in the oven for 6-8 minutes, until the cod is cooked through and opaque. Heat the remaining olive oil in a separate frying pan, add the courgettes and thyme and sauté for 2-3 minutes until light golden-brown and tender. Season, to taste,  with salt and freshly ground black pepper. To serve, place the cod in the centre of the plate and the courgettes around. Spoon the shellfish vierge over and around the cod. ","ingredients":" 2 tbsp olive oil,  4 large shallots, finely diced,  2kg\/4lb 4oz assorted shellfish, such as cockles, clams, razor clams, mussels, winkles (discard any bivalves that don't close tightly when firmly tapped),  500ml\/18fl oz dry white wine,  6 tbsp extra virgin olive oil,  2 garlic cloves, finely chopped,  4 tomatoes, seeds removed, diced,  4 tbsp roughly chopped fresh basil leaves,  2 tbsp roughly chopped fresh dill,  1 tbsp roughly chopped fresh tarragon,  1 lemon, zest and juice,  2 tbsp olive oil,  25g\/1oz butter,  4 x 175g\/6oz cod fillet, skin on,  2 courgettes, finely diced,  2 sprigs fresh thyme","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/shellfishsaucevierge_92617"}