{"recipe_name":"Shepherd's pie","author":"Antony Worrall Thompson","programme":"Food and Drink","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/shepherdspie_2077_16x9.jpg","method":"In a large saucepan, heat the dripping. Add the onion and cook for 5 minutes.  Meanwhile, in a large frying pan, heat a little olive oil and fry the mince, stirring, until browned all over. While the meat is frying, break up any lumps with the back of the spoon.  Stir the onions and add the flour (this helps to thicken the juices) and stir. Mix well and add the bay leaves, thyme and the anchovy and stir. Add the chopped tomatoes, stock (keep a little aside, for putting into the mince pan to de-glaze the pan) and Worcestershire sauce.  Add the cooked mince and then pour the stock mixture into empty mince pan, scraping off any bits of mince left in the pan. Pour the remaining stock into the pan containing the sauce mixture. Bring the mixture to the boil, adding a pinch of salt and pepper and let it simmer for about 45 minutes, stirring regularly.  Preheat the oven to 200C\/180C Fan\/Gas 6. For the mash, boil the potatoes until tender (about 10 minutes). Drain, add the milk, butter and egg yolk, then mash until smooth. Season with salt and pepper.  Pour the meat into a 1.4 litre\/2½ pint ovenproof dish and spread the mash on top, smooth over and mark with a spatula. Put the dish into the oven and cook until the surface is golden-brown. ","ingredients":" 25g\/1oz dripping,  1 large onion, finely chopped,  2 tbsp olive oil,  500g\/1lb 2oz minced lamb ,  1 tbsp plain flour,  2 bay leaves ,  2 sprigs fresh thyme,  1 anchovy, finely chopped (optional),  1 x 400g tin chopped tomatoes,  2 tsp Worcestershire sauce ,  450ml\/16fl oz chicken, beef or lamb stock ,  salt and freshly ground black pepper ,  700g\/1½lb potatoes, peeled and cut into halves or quarters,  55ml\/2fl oz milk,  75g\/3oz butter ,  1 free-range egg yolk","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/shepherdspie_2077"}