{"recipe_name":"Shin of beef with ginger, carrot and cabbage","author":"Tom Kerridge","programme":"2007-16","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/shin_of_beef_with_ginger_70320_16x9.jpg","method":"Place the beef shins into a large bowl with the red wine, cover and leave to marinate in the fridge for 24-48 hours.  Strain the shins through a sieve, reserving the wine, then pat the shins dry. Preheat the oven to 170C\/325F\/Gas 3. Bring the red wine to the boil in a saucepan and skim off the scum that comes to the top.   Heat a large casserole until medium hot, add a little vegetable oil and the onion, carrot, celery and ginger and cook until browned.   In a separate frying pan, fry the shins in a little oil until browned very well.   When the shins have browned, drain them into a colander to get rid of any excess cooking fat.   Place the shin on the top of the vegetables in the casserole, cover with the skimmed red wine and veal stock.   Add the bay leaves, clove, white peppercorns, thyme and salt.   Bring to a simmer, cover with a lid then place in the oven to braise for 2½ hours.   When cooked, remove from the oven and leave the shins to cool down in the stock.   When cool, remove the shins from the stock and pass the stock through a fine metal seive into a saucepan and skim off any fat.   Place the pan of liquid back onto the heat and cook over a medium heat until reduced to half the volume, then pass through a fine sieve again.   To reheat the shin, warm it through in a covering of shin stock.  For the carrots, place all the ingredients into a saucepan with 200ml\/7floz water and cook over a medium heat until the carrots are soft. Turn the heat up and cook over a high heat until the liquid glazes the carrots. For the cabbage, heat a frying pan until medium hot, add the butter and cabbage, cover and cook until just tender. Stir in the caraway seeds, season and serve. To serve, pile the cabbage onto the plate, place the carrot alongside and then finish with the beef shin and sauce. ","ingredients":" 6 x 225g\/8oz pieces beef shin,  750ml\/1pint 6fl oz red wine,  vegetable oil, for frying,  200g\/7oz onion, roughly chopped,  150g\/5oz carrot, roughly chopped,  150g\/5oz celery, roughly chopped,  75g\/3oz fresh ginger, grated with skin on,  1½ litres\/2½ pints veal or beef stock,  5 bay leaves ,  1 clove,  1 tbsp white peppercorns,  1 bunch thyme,  3 tsp sea salt,  5 carrots,  125g\/4½ oz butter,  75g\/3oz sugar,  1½ tsp salt,  4 star anise (wrapped in muslin cloth),  knob of butter,  1 savoy cabbage, cut into large strips,  2 tbsp toasted caraway seeds","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/shin_of_beef_with_ginger_70320"}