{"recipe_name":"Short rib of beef with mussels, parsley and wild garlic","author":"Glynn Purnell","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the short ribs, preheat the oven to 180-200C\/350-400F\/Gas 4-6. Heat a large ovenproof frying pan or casserole and add the butter. When the butter is melted and foaming, add the short ribs and seal the beef until browned all over. Add the vegetables, herbs and peppercorns. Pour in the wine and stock. Place in the oven for three hours, or until the meat is very tender.  When the short ribs are cooked, remove from the oven and set aside to rest. Pass the cooking juices through a fine sieve and return to the pan. Cook over a medium-high heat until the volume of liquid has reduced to a thick glaze. For the mussels, scrub the mussels clean in cold water and pull off any beards. Discard any mussels with broken shells or open shells that do not close when given a sharp tap. Heat a large saucepan and add the butter. Once the butter is melted, add the shallots, garlic and parsley stalks. Add the mussels and cider. Place a lid on the pan and cook the mussels for 3-4 minutes, or until the shells are open (discard any unopened shells).  Drain the mussels, reserving the cooking liquor. Remove half the mussels from their shells. For the garlic and parsley butter, place the parsley, garlic and wild garlic leaves in a blender and blend until smooth.  Put the butter in a bowl and mix in the blended parsley and wild garlic. Place the reserved mussel juices in a frying pan and bring to a simmer. Whisk in the garlic butter and cook until thickened. Add the mussels (both in and out of the shells) and remove from the heat.  To serve, shred the beef and divide between serving plates. Pour over the glaze. Warm the mussels in the garlic and parsley butter and serve over the top of the beef. Garnish with parsley leaves. ","ingredients":" 2 tbsp butter,  2 short ribs, soaked in brine for 3 hours,  1 carrot, peeled and roughly chopped    ,  1 onion, roughly chopped   ,  2 sticks celery, roughly chopped ,  1 garlic clove, sliced,  3 sprigs thyme ,  2 bay leaves   ,  4 peppercorns ,  250ml\/9fl oz red wine ,  250ml\/9fl oz beef stock,  25g\/1oz unsalted butter,  2 shallots, finely chopped,  1 garlic clove, sliced    ,  2 tbsp fresh parsley stalks,  1.5kg\/3lb 5oz mussels, cleaned and beards removed,  200ml\/7fl oz dry cider,  ½ bunch flat leaf parsley,  5-6 large leaves wild garlic,  150g\/5½oz salted butter, softened,  1 garlic clove, chopped,  handful baby watercress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/short_rib_of_beef_with_66188"}