{"recipe_name":"Shortcake biscuits with salted peanut caramel filling","author":null,"programme":null,"prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 12 biscuits","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/shortcake_biscuits_with_02142_16x9.jpg","method":"For the caramel peanuts, lightly grease a non-stick baking tray and arrange the peanuts on the tray. Heat the sugar and water in a saucepan until the sugar melts and the mixture is boiling and golden-brown in colour (do not stir the caramel). Pour the caramel over the peanuts and set aside to harden. Once set, roughly chop the caramel peanuts and set aside.  Meanwhile, for the biscuits, preheat the oven to 170C\/325F\/Gas 4. Line two baking sheets with baking parchment. Cream the butter and sugar together in a bowl, then beat in the peanut butter until well combined. Sift over the flour and stir until the mixture comes together as a dough. Cover the dough with cling film and chill in the fridge for 15 minutes.  Roll the biscuit dough out onto a lightly floured surface and, using a biscuit cutter, cut out 24 biscuits.  Place the biscuits onto the lined baking trays and chill for a further 15 minutes.  Bake the biscuits in the oven for 12-15 minutes, or until golden-brown. Remove the biscuits from the oven  and set aside to cool for 5 minutes, then transfer to wire rack to cool completely. Spread the dulce de leche on half the biscuits, then sprinkle with sea salt and chopped peanuts. Sandwich together with a plain biscuit. Melt the chocolate in a bowl set over a saucepan of simmering water (do not let the base of the bowl touch the water). Drizzle the melted chocolate over the biscuits then sprinkle over the caramel peanuts. Set aside until the chocolate has set, then serve. ","ingredients":" 50g\/2oz caster sugar,  1 tbsp water,  2 tbsp salted peanut halves,  250g\/8oz unsalted butter,  250g\/8oz caster sugar,  2 tbsp crunchy peanut butter,  375g\/12oz plain flour, plus extra for dusting,  300g\/10½oz dulce de leche,  ½ tsp sea salt flakes,  1 tbsp salted peanuts, chopped,  75g\/3oz dark chocolate, melted","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/shortcake_biscuits_with_02142"}