{"recipe_name":"Black Forest gâteau with chocolate peppermint shards","author":"James Martin","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 8-10","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Grease and line a deep 26cm\/10½in springform cake tin. For the sponge, crack the eggs into a mixing bowl, add the sugar and whisk well until light and fluffy and a ribbon-like trail forms when the whisk is removed. Gently fold in the sifted flour and the cocoa powder. Pour the mixture into the prepared tin, transfer to the oven and bake for about 55 minutes, or until risen and cooked through. Turn out onto a wire rack and leave to cool. For the filling, place the cherries into a bowl with the Kirsch. Place the cherry juice from the jar into a pan and bring to the boil. While the juice is heating, mix the arrowroot with a little water in a small bowl to make a paste. When the cherry juice is boiling, mix the arrowroot paste into it, then strain through a sieve into the bowl with the cherries and leave to cool. Cut the cooled sponge into three layers using a sharp bread knife. Sandwich the three layers together using the whipped cream (reserve a little for attaching the chocolate shards) and half of the cherries in their syrup. For the chocolate shards, place the chocolate into a heatproof bowl set over a pan of gently simmering water and heat, stirring occasionally, until melted and smooth. Stir in the peppermint essence and sugar, then spread the mixture onto a tray lined with cling film and allow to cool. Place into the fridge to set. When the chocolate is set, break it into large shards and stick around the edge of the cake, using a little whipped cream on the back to hold the shards in place. To serve, top with the remaining cherries and the almonds. ","ingredients":" butter, for greasing ,  9 free-range eggs,  255g\/9oz caster sugar,  200g\/7½oz self-raising flour, sifted,  40g\/1½oz cocoa powder,  1 x 340g\/12oz (drained weight) jar cherries, drained, juice reserved,  good dash of Kirsch,  2 tbsp arrowroot,  750ml\/1¼ pint double cream, whipped,  300g\/10½oz dark chocolate,  ½ tsp peppermint essence,  110g\/4oz demerara sugar,  50g\/2oz toasted flaked almonds, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blackforestgateau_86364"}