{"recipe_name":"Sichuan beef with noodles","author":"Ken Hom","programme":"Take on the Takeaway","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Cut the beef into thin slices. For the marinade, mix the soy sauce, sesame oil, sherry and cornflour together in a bowl. Add the beef, spoon over the marinade and leave to marinate for a few minutes. To cook the beef, heat the vegetable or groundnut oil in a wok until it's very hot. Add the beef and the marinade and stir fry for about one minute. Carefully pour the stir-fried beef into a sieve set over a bowl to strain off the excess juices. Discard the juices and set aside the beef until ready to serve. For the noodles, wipe the inside of the wok clean with kitchen towel and return the wok to the heat. Add the vegetable or groundnut oil to the wok. Heat until very hot, then add the onion, garlic, ginger and chilli and stir fry for 1-2 minutes. Add the red pepper and most of the sherry. Cook for 1-2 minutes then add the mangetout and stir fry for another minute. Add the noodles and pesto and stir until thoroughly mixed and heated through. Add a pinch of sugar and the remaining sherry. Add the spring onions and drizzle over the sesame oil.  Return the beef to the wok, mix with the other ingredients and stir fry for another minute until thoroughly reheated. Season with plenty of freshly ground black pepper. To serve, divide between two plates and sprinkle with coriander. ","ingredients":" 250g\/9oz beef fillet,  3 tbsp vegetable or groundnut oil,  2 tbsp soy sauce,  2 tsp toasted sesame oil,  1 tbsp dry sherry,  2 tsp cornflour,  1 tsp vegetable or groundnut oil,  1 onion, peeled and chopped,  1 garlic clove, peeled and finely chopped,  1 tbsp finely sliced fresh ginger,  1 red chilli, seeds removed, flesh sliced into thin strips,  1 red pepper, seeds removed, flesh sliced into strips,  1 tbsp dry sherry,  100g\/3½oz mangetout,  300g\/10½oz (cooked weight) pre-cooked or ready-to-wok noodles,  4 tbsp pesto (you can use green pesto, red pesto or coriander pesto, or a mixture),  pinch sugar,  4 spring onions, trimmed and sliced diagonally,  1 tsp toasted sesame oil,  freshly ground black pepper,  small bunch fresh coriander, chopped, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sichuanbeef_86985"}