{"recipe_name":"Sicilian lemon and orange sweet bread","author":"Paul Hollywood","programme":"Paul Hollywood's Bread","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 10","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/sicilian_lemon_and_38672_16x9.jpg","method":"To make the dough, combine the flour, salt, sugar, yeast, milk, eggs and butter in a food mixer fitted with a dough hook. Mix on a slow speed for three minutes and then set on a medium speed for five minutes, to work the mixture together into a soft dough. If you haven’t got a mixer, mix the dough ingredients together by hand and knead on a lightly floured surface until you get a soft, elastic dough. Tip the dough into a clean bowl, cover and leave to rise for one hour.  For the citrus mixture, combine the citrus zest with the toasted almonds, mixed peel, dried cranberries and lemon juice. Add the citrus mixture to the dough and use your hands to incorporate it into the dough.  Grease a 23cm\/9in round deep spring-form cake tin.  Shape the dough into a ball and place it into the prepared tin. Cover, or place inside a large plastic bag, and leave to rise for three hours, or until the dough has reached the top of the sides of the tin. Preheat the oven to 200C\/400F\/Gas 6 (in a fan oven) and bake the bread on the middle shelf for 20 minutes. For the topping, in a bowl stir together the egg whites, sugar and ground almonds to make a paste. After 20 minutes of baking, remove the bread from the oven and spread the paste over the top. Sprinkle with flaked almonds and a little more sugar. Reduce the oven temperature to 180C\/350F\/Gas 4 and return to the oven for a further 20 minutes. If it is going to brown towards the end of baking then cover it loosely with foil. Remove from the oven and leave to cool in the tin for 10 minutes; then release the sides of the tin. Remove from the tin and leave to cool completely on a wire rack.  ","ingredients":" 400g\/14oz strong white flour,  7g salt,  40g\/1½oz caster sugar,  10g instant yeast,  120ml\/4fl oz milk,  4 free-range eggs, lightly whisked,  100g\/3½oz softened unsalted butter, cut into small pieces, plus extra for greasing,  2 lemons, finely grated zest only,  1 orange, finely grated zest only ,  100g\/3½oz toasted flaked almonds,  100g\/3½oz mixed candied peel,  100g\/3½oz dried cranberries,  ½ lemon, juice only,  2 free-range egg whites ,  25g\/1oz sugar,  25g\/1oz ground almonds,  50g\/1¾oz flaked almonds,  caster sugar, to sprinkle","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sicilian_lemon_and_38672"}