{"recipe_name":"Sicilian-style stew","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the oil in a large casserole over a medium heat. Add the chicken pieces and fry for 4-5 minutes, turning regularly, or until browned on all sides. Remove from the casserole and set aside. Add the potato cubes, garlic, peppers, celery, aubergine and carrots to the same casserole that the chicken was cooked in. Reduce the heat to low and fry the vegetables for 4-5 minutes, or until softened. Add the capers, olives, chilli flakes, wine and tomatoes and stir well to combine. Return the chicken pieces to the casserole, increase the heat and bring the mixture to the boil.  Reduce the heat until the mixture is simmering and continue to simmer for 20-25 minutes, or until the chicken pieces are cooked through. (NB: The chicken is cooked through when the juices run clear when the chicken is pierced in the thickest part.) Just before serving, sprinkle over the chopped herbs and season, to taste, with salt and freshly ground black pepper.  Serve in bowls with crusty bread. ","ingredients":" 2 tsp olive oil,  1 large chicken, cut into serving pieces,  2 large baking potatoes, peeled, cut into cubes,  2 garlic cloves, peeled, sliced,  2 red peppers, seeds removed, cut into strips,  2 yellow peppers, seeds removed, cut into strips,  2 green peppers, seeds removed, cut into strips,  6 celery stalks, trimmed, chopped,  1 aubergine, cut into cubes,  2 carrots, peeled, sliced,  2 tbsp capers, drained,  20-24 green olives,  1 tsp dried chilli flakes,  75ml\/3fl oz white wine,  8 ripe plum tomatoes, roughly chopped,  chopped fresh mint leaves,  chopped fresh parsley leaves,  salt and freshly ground black pepper,  crusty bread","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sicilianstew_92526"}