{"recipe_name":"Silk Road chutney","author":"Ed Baines","programme":"Country Show Cook Off","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 2 medium jars","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat one tablespoon of the oil in a frying pan over a medium heat. Add the onion, garlic, ginger, green chili and chipotle chilli.   Add the corn kernels and tomatoes and cook for 10 minutes. Put the red vinegar, sugar, tomato juice and a pinch of salt in a separate pan. Once the sugar has dissolved, add this mixture to the pan with the tomatoes.  Dry fry the mustard seeds, cumin seeds, ras-el-hanout and smoked paprika in a frying pan until fragrant. Allow to cool slightly, then grind in a pestle and mortar and add to the chutney.  Fry the curry leaves in a tablespoon of oil in a hot pan for a few seconds until they begin to crackle, drain them on kitchen paper, then add to the chutney and stir everything through. Remove from the heat and allow to cool slightly. Blend half of the mixture in a blender or food processor. Add a splash of water and then fold the blended mixture back into the remaining chunky mixture.   Stir back over the heat for two minutes, add extra seasoning and red chilli to taste and then add the chopped coriander just before putting the chutney into clean jam jars.  Seal the lids tightly and place the jars into a large pan of boiling water.  Boil the jar for 30 minutes. Leave to cool completely, then check that the jars are sealed. If the seal has not formed, store in the fridge and serve within a month. If sealed, store in a cool dark place and serve within three months.  ","ingredients":" 2 tbsp vegetable oil,  1 onion, chopped,  2 garlic cloves, chopped,  1 thumb-sized piece fresh root ginger, finely chopped,  1 green chilli, finely chopped,  1 chipotle chilli, soaked in warm water, drained,  1 corn-on-the-cob, kernels removed (or handful frozen sweetcorn kernels, thawed),  4 tomatoes, chopped,  2 tbsp red wine vinegar,  2 chunks Chinese rock sugar (available from specialist Asian grocers),  freshly squeezed juice from 2-3 tomatoes, sieved ,  pinch salt ,  ¼ tsp mustard seeds,  ½ tsp cumin seeds  ,  2 pinches ras-el-hanout,  ¼ tsp smoked paprika,  4 curry leaves,  dried red chilli (to taste),  1 tbsp finely chopped coriander ","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/silk_road_chutney_59505"}