{"recipe_name":"Simple chicken curry","author":"Helen Mills","programme":"The Hairy Bikers: Mums Know Best","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/simple_chicken_curry_09881_16x9.jpg","method":"Rub the skin of the chicken pieces with 2 tablespoons of the curry powder, wrap well with cling film and leave to absorb overnight in the fridge. Heat 2 tablespoons of the oil in a pan with a lid, and fry the chicken over a medium heat, turning regularly until well browned all over. Remove the chicken from the pan and set aside.  Add a little more of the oil to the pan if needed, lower the heat and fry the onions, garlic, potatoes and red chillies until the onions have softened. Put the chicken back in the pan and sprinkle over the remaining 1 tablespoon of curry powder, and the garam masala, then mix well to combine. Add enough of the chicken stock to just cover the chicken, put the lid on and bring to the boil.  Once boiling, reduce the heat and simmer gently for 30-40 minutes, or until the potatoes are soft and the chicken is cooked through. To test if the chicken is cooked, remove one of the larger pieces to a plate and pierce with a skewer – if cooked, the juices will run clear. If the juices remain pink, the chicken needs to be cooked for longer.  Once cooked, sprinkle with chopped spring onions and serve the curry with boiled rice or roti. ","ingredients":" 1 medium chicken, prefereably free-range, jointed into 8 pieces,  3 tbsp curry powder, mild or hot, depending on taste,  2–3 tbsp vegetable oil,  2 medium onions, sliced,  2–3 garlic cloves, finely sliced,  2 medium waxy potatoes, chopped into 2cm\/¾in cubes,  2 red chillies, seeds removed and finely chopped,  2 tbsp garam masala,  600ml\/20fl oz chicken stock,  3–4 spring onions, chopped to garnish","vegetarian":false,"calories":491.0,"protein":59.0,"carbs":27.0,"sugars":6.0,"total_fat":15.0,"saturated_fat":3.0,"fiber":7.0,"salt":0.7,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/simple_chicken_curry_09881"}