{"recipe_name":"Simple cod gratin with béarnaise sauce topping","author":"Rick Stein","programme":"Rick Stein's Long Weekends","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/simple_cod_gratin_with_90850_16x9.jpg","method":"Gently fry the leeks, carrots and onion in the butter until softened and starting to caramelise. Add the cod and flour and stir over the heat for a minute or two. Stir in the wine and cook for another minute to allow the sauce to thicken a little. Season with salt and pepper For the béarnaise sauce, gently heat the vinegar in a saucepan. Add the shallots, tarragon sprigs, bay leaf and peppercorns. Heat gently over a medium heat until the volume of liquid has reduced by at least half. Strain and set aside until cooled. Meanwhile, preheat the oven to 180C\/160C Fan\/Gas 4 and butter a shallow ovenproof dish. Beat the egg yolks with a teaspoon of water. Stir the mixture into the strained, cooled vinegar and pour into a heatproof bowl set over a pan of simmering water. Whisk constantly until the sauce has increased in volume and is thick enough to coat the back of a spoon.  Melt the unsalted butter in a saucepan. Remove the bowl from the heat and slowly pour in the melted butter in a steady stream, whisking continuously, until the mixture has thickened and is smooth. Fold in the chopped tarragon and season to taste with salt and pepper. Spoon the cod and vegetable mixture into the ovenproof dish. Pour over the béarnaise sauce and bake for 15-20 minutes.  ","ingredients":" 2 leeks, sliced,  2 carrots, sliced,  1 onion, chopped,  40g\/1½oz butter, plus extra for greasing,  600g\/1lb 5oz cod loin, skinned and cut into 3cm\/1in chunks,  2 tbsp plain flour,  50ml\/2fl oz dry white wine ,  salt and freshly ground black pepper,  70ml\/2½fl oz white wine vinegar,  2 shallots, finely chopped,  2 sprigs fresh tarragon, plus 1 tsp freshly chopped ,  1 bay leaf,  6 peppercorns,  4 free-range egg yolks,  300g\/10½oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/simple_cod_gratin_with_90850"}