{"recipe_name":"Singapore deep-fried hake with pad Thai noodles","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the Singapore deep-fried hake, heat the oil in a deep, heavy-based pan until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Season the hake with a little salt and freshly ground black pepper. Mix the flour, cornflour and a pinch of salt together in a bowl. Whisk in enough sparkling water to form a smooth batter (you may not need all of the water). Dip the hake into the batter and carefully lower into the hot oil. Fry for 2-3 minutes on each side, or until crisp and golden-brown. Remove from the pan and set aside to drain on kitchen paper. Heat a wok until hot, add the groundnut oil, garlic, ginger and chillies and stir-fry for one minute. Add the tomato ketchup, sweet chilli, hoisin sauce, fish sauce, water and sugar and bring the mixture to the boil. Reduce the heat and simmer for 2-3 minutes. Add the hake and coriander and stir until well combined. For the pad Thai noodles, heat a wok until hot. Add the groundnut oil, garlic, ginger and shallot and stir-fry for one minute. Stir in the fish sauce, tamarind paste and soy sauce and bring the mixture to a simmer. Add the noodles and stir-fry until warmed through, then add the beansprouts and cook for a further minute.  Push the noodle mixture to one side of the wok, add the egg to the empty side and cook it for 30 seconds.  Stir the egg into the noodle mixture and season, to taste, with the white pepper.  Stir in the coriander. To serve, spoon the pad Thai onto serving plates and sprinkle over some of the chopped peanuts. Spoon the Singapore deep-fried hake alongside.  ","ingredients":" vegetable oil, for frying,  500g\/1lb 2oz hake, skin removed, cut into 3cm\/1¼in cubes,  salt and freshly ground black pepper,  50g\/2oz plain flour,  50g\/2oz cornflour,  110ml-150ml\/4-5fl oz chilled sparkling water,  2 tbsp groundnut oil,  2 garlic cloves, chopped,  3cm\/1¼in piece fresh ginger, peeled, finely sliced,  3 red bird's-eye chillies, de-seeded, finely chopped,  125ml\/5fl oz tomato ketchup,  75ml\/3fl oz sweet chilli sauce,  75ml\/3fl oz hoisin sauce,  3 tbsp Thai fish sauce,  75ml\/3fl oz water,  1 tbsp caster sugar,  2 tbsp chopped fresh coriander,  4 tbsp groundnut oil,  2 garlic cloves, finely chopped,  1 tbsp chopped fresh ginger,  1 shallot, finely chopped,  2 tbsp Thai fish sauce,  1 tbsp tamarind paste,  1 tbsp light soy sauce,  200g\/7oz rice noodles, soaked in hot water, drained,  150g\/5oz fresh beansprouts,  1 free-range egg, lightly beaten,  ¼ tsp ground white pepper,  2 tbsp chopped fresh coriander,  25g\/1oz roasted peanuts, roughly chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/singapore_deep-fried_71853"}