{"recipe_name":"Black pepper chicken (Murgh kali mirch) with seasoned potato and cauliflower (Aloo gobhi)","author":"Manju Malhi","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the chicken, mix together one tablespoon of oil, the ginger, garlic, salt and black and white peppers, and rub the mixture into the chicken pieces.  Cover and refrigerate for 30 minutes. Heat the remaining oil in a wok and fry the onion for two minutes.  Add the marinated chicken pieces and gently stir-fry for 10 minutes.  Add the chillies and 200ml (7fl oz) boiling water, cover and simmer for 10 minutes, until chicken is cooked.  Stir in the lemon juice and sprinkle over the coriander leaves.  To make the potato and cauliflower, heat the oil in a frying pan and add onions, chillies, garlic and potatoes. Fry for seven minutes or until the onion is deep yellow and translucent. Add the cauliflower and fry for a further three minutes until brown. Add the turmeric, cumin, coriander, and salt and garam masala. Stir and fry for five minutes. Add butter and mix, then add five tablespoons of cold water, cover and simmer for five minutes. Stir in ginger.  Serve with the chicken. ","ingredients":" 3 tbsp vegetable oil,  1 tsp peeled and finely grated root ginger,  2 garlic cloves, crushed,  ¼ tsp salt,  1 tsp coarsely ground black pepper,  1 tsp ground white pepper,  6 chicken breasts, boneless and skinless, cut into bite-sized pieces,  1 medium onion, finely chopped,  2 fresh green chillies, slit lengthways,  1 tsp lemon juice,  30g\/1oz coriander leaves, chopped,  2 tbsp vegetable or groundnut oil,  1 large Spanish onion, finely chopped,  2 green finger chillies, finely chopped,  2 garlic cloves, finely chopped,  300g\/10½oz white potatoes, peeled and cut into 2cm (¾in) cubes,  200g\/7oz cauliflower florets, cut into 4cm (1¾in) pieces,  1 tsp turmeric,  ¼ tsp ground cumin,  ¼ tsp ground coriander,  ½ tsp salt,  ¼ tsp garam masala,  1 tbsp butter or ghee,  1 tsp peeled and finely grated root ginger","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blackpepperchickenmu_74040"}