{"recipe_name":"Singapore noodles","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/singapore_noodles_69488_16x9.jpg","method":"Put the pork fillet in a bowl and pour over the soy sauce and sherry. Stir in the sugar and five spice powder and leave to stand for 30 minutes, turning in the marinade every ten minutes.  Preheat the oven to 200C\/400F\/Gas 6. Drain the pork, reserving the marinade. Place the pork on a small aluminium foil-lined tray. Drizzle with one tablespoon of the oil and roast for 12 minutes. Remove from the oven and set aside to stand. While the pork is cooking, cook the noodles according to the packet instructions. Place a large heavy-based frying pan or wok over a medium heat. Add two tablespoons of the oil and stir-fry the onion, red pepper and mushrooms for 5-6 minutes or until beginning to soften and lightly colour. Add the garlic and ginger and stir-fry for one minute. Sprinkle the curry powder into the pan and cook for two further minutes.  Cut the pork lengthways in half and then slice into thin pieces. Add the pork to the hot pan along with the prawns and spring onions. Stir-fry for one minute then add the drained noodles and reserved marinade. Mix together with chopsticks, or a couple of forks, for 2-3 minutes until piping hot. Serve immediately. ","ingredients":" 300g\/10oz pork tenderloin, trimmed of fat and sinew,  3 tbsp dark soy sauce,  2 tbsp dry sherry,  2 tsp soft light brown sugar,  ½ tsp Chinese five spice powder,  3 tbsp sunflower oil,  100g\/3½oz fine egg noodles (vermicelli egg noodles),  1 red onion, cut into thin wedges,  1 red pepper, deseeded and sliced ,  100g\/3½oz shiitake mushrooms, sliced,  2 garlic cloves, crushed,  20g\/¾oz fresh root ginger, peeled and finely grated,  2 tsp medium Madras curry powder ,  200g\/7oz prawns,  10 spring onions, trimmed and sliced diagonally","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/singapore_noodles_69488"}