{"recipe_name":"Singapore noodles","author":"Ken Hom","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Soak the rice noodles in a bowl of warm water for 25 minutes. Then drain them in a colander or sieve. Set them aside until you are ready to use them.  Soak the mushrooms in warm water for 20 minutes. Then drain them and squeeze out the excess liquid.  Remove and discard the stems and finely shred the caps into thin strips. Put the peas in a small bowl and let them thaw. Combine the eggs with sesame oil, salt and pepper and set aside.  In a bowl, mix together all the sauce ingredients and set aside. Heat a wok or large frying-pan over high heat until it is hot. Add the groundnut oil, and when it is very hot and slightly smoking, add the garlic, ginger and chillies and stir-fry the mixture for 30 seconds. Add the water chestnuts, mushrooms, pork and spring onions and stir-fry for 1 minute. Add the rice noodles, prawns and peas, and stir-fry for 2 minutes.  Add the sauce and cook over high heat for another 5 minutes or until most of the liquid has evaporated. Pour the egg mixture over the noodles. Stir-fry constantly until the egg has set. Turn the noodles unto a large platter, garnish with the coriander leaves and serve at once. ","ingredients":" 225g\/8oz thin rice noodles,  50g\/1¾oz Chinese black mushrooms,  175g\/6oz frozen small sweet peas (petis pois),  4 medium free range eggs, beaten,  1 tbsp sesame oil,  3 tbsp groundnut oil (or peanut oil),  1 tsp salt,  ½ tsp freshly ground white pepper ,  1½ tbsp finely chopped garlic,  1 tsp finely chopped fresh ginger,  6 fresh red or green chillies, de-seeded and finely shredded,  6 fresh or tinned water chestnuts,  100g\/3½oz Chinese barbecue pork (or cooked ham), finely shredded,  3 spring onions, finely shredded,  100g\/3½oz small cooked prawns, shelled,  fresh coriander leaves, to garnish,  2 tbsp light soy sauce,  3 tbsp Indian Madras curry paste or powder,  2 tbsp Shaoxing rice wine or dry sherry,  1 tbsp sugar,  1 tsp salt,  1 tsp freshly ground black pepper,  250ml\/9fl oz tinned coconut milk","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/singapore_noodles_81196"}