{"recipe_name":"Sirloin beef, chips, baby beetroot and spinach","author":"Galton Blackiston","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Put a large roasting tin on the hob and add half the olive oil. Once hot, add the bones and cook until coloured on each side and carmelised. Place the roasting tin in the preheated oven for 30-40 minutes.  Remove from the oven and tip the roasted bones into a large saucepan filled with the stock. Cook over a medium heat until the volume of liquid has reduced at least by half. When reduced to a sauce consistency, pour through a sieve and discard the bones. Keep the jus warm until ready to serve. Meanwhile, place the beetroots in a large pan of boiling water. Season with salt and simmer for 20-30 minutes. Once cooked, drain and set aside. Heat a deep-fat fryer to 150C\/300F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cook the chips in the fryer for 5-8 minutes, or until softened and just beginning to colour. Carefully transfer to a plate lined with kitchen paper to drain.  Increase the temperature on the deep-fat fryer to 180C\/350F. Meanwhile, place a large frying pan on the heat and add the remaining two tablespoons of olive oil. When hot, put the steaks in the pan and cook on each side for 3-4 minutes, or until cooked to your liking (this will depend on the thickest of the steak). Set aside to rest. Place a separate frying pan on the heat and add half the butter and the spinach. Cook until the spinach has wilted, then set aside until ready to serve. Add the remaining butter to another pan. When the butter has melted, add the baby beetroots and toss to coat. Set aside. Put the chips back into the fryer and cook for a further 3-4 minutes. Once cooked through and golden-brown, drain the chips on a plate lined with kitchen paper. To serve, place the wilted spinach in the centre of each plate and place the steak on top. Pile the chips to the side and place a couple of beetroots to the other side of the chips. Drizzle the jus around the plate and on top of the steak. ","ingredients":" 4 tbsp olive oil,  4 sirloin steaks (preferably Aberdeen Angus), including the bones separate,  570ml\/1 pint fresh beef stock ,  1 bunch baby beetroots, leaves removed,  1 bunch baby golden beetroots, leaves removed,  pinch salt,  vegetable oil, for deep-fat frying,  1kg\/2lb 4oz chipping potatoes, peeled and cut into 1x5cm\/½x2in sticks,  50g\/1¾oz unsalted butter,  100g\/3½oz baby spinach","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sirloin_beef_chips_baby_16963"}