{"recipe_name":"Sirloin steak with garlic pak choi, roast mushrooms, jasmine rice and teriyaki sauce","author":"Richard Phillips","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the steak, heat a dash of vegetable oil in a large frying pan and cook the sirloin for roughly three minutes on each side. Remove from the heat and leave to rest, covered, in a warm place. In a bowl, toss the red onions and grapefruit segments with the chopped coriander in a bowl. For the ‘seaweed’, heat the vegetable oil in a deep fat fryer to 180C\/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Add the spring greens to the deep-fat fryer and cook until crisp. Carefully remove using a slotted spoon and transfer to a plate lined with kitchen paper. For the teriyaki sauce, heat all the ingredients in a small pan and simmer. To finish the steak and vegetables, cut the pak choi leaves away from the stem and rinse under cold, running water. Heat a dash of sesame oil in a pan and toss the leaves and sliced garlic for 4-5 minutes, or until wilted. To serve, slice the sirloin and lay it on the pak choi on each plate. Spoon the grapefruit segments along with the ‘seaweed’ and drizzle the teriyaki sauce over the meat. ","ingredients":" dash vegetable oil,  6 sirloin steaks, roughly 150g\/5¾oz per portion,  2 red onions, finely sliced,  1 pink grapefruit, cut into small segments,  1 white grapefruit, cut into small segments,  1 tbsp chopped fresh coriander,  3 heads pak choi,  dash sesame oil,  3 garlic cloves, finely sliced,  vegetable oil, for deep-fat frying,  1 bunch spring greens, finely shredded,  150ml\/5fl oz rice wine,  150ml\/5fl oz light soy sauce,  50g\/1¾z sugar,  1 tsp Chinese five-spice powder","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sirloin_steak_with_83477"}