{"recipe_name":"Sirloin steak with new potatoes and tartare and oyster mayonnaise","author":"Paul Ainsworth","programme":"Spring Kitchen with Tom Kerridge","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a griddle pan until hot. Brush the sirloin steaks with the olive oil, season with salt and pepper and place the steak on the griddle pan. Cook each side for two minutes. Remove from the pan and allow to rest before serving.  Mix together the peas, broad beans, breakfast radishes and lettuce in a bowl. Mix in the potatoes. For the tartare dressing, place the capers, gherkins, shallot, lemon zest and juice, garlic, thyme, chives and chervil in a bowl and mix with the rapeseed oil.  Put the oysters and their juice in a food processor with the mustard and blend until smooth. Gradually add the oil, blending as you go, until you achieve a mayonnaise consistency. Store in the fridge until you're ready to serve. Spoon a little bit of the dressing directly onto the steak. And then run the rest of the dressing through the salad. Place the steak on a serving plate, serve with the salad and tartare dressing and place the oyster mayonnaise next to it.    ","ingredients":" 2 aged sirloin steaks, at room temperature,  1 tbsp olive oil,  salt and freshly ground black pepper,  400g\/14oz fresh peas,  400g\/14oz fresh broad beans,  ½ bunch breakfast radishes with leaves, halved,  1 Cos lettuce, leaves separated,  400g\/14oz new potatoes, boiled, quartered,  2 tbsp baby capers,  2 large gherkins, finely diced,  1 banana shallot, finely diced,  1 lemon, zest and juice,  ½ garlic clove, grated,  2 sprigs thyme, leaves only,  1 tbsp finely chopped fresh chives,  1 tbsp finely chopped fresh chervil,  100ml\/3½fl oz rapeseed oil,  3 oysters,  1-2 tbsp Dijon mustard,  300ml\/10½fl oz vegetable oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sirloin_steak_with_new_91595"}