{"recipe_name":"Slow-braised pork belly with wilted greens, olives, capers and feta polenta","author":"Maria Elia","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Remove the skin from the pork belly, cut the meat into four equal pieces and season each with salt. Heat a little olive oil in a large heavy-based saucepan. Add the pork and cook over a high heat until browned on all sides. Add the wine and deglaze the pan by scraping the cooked on juices from the bottom of the pan. Take the pork out of the pan and set aside on a plate. In a clean large heavy-based saucepan add the onion, leek, fennel, garlic and anchovies to the pan and cook over a medium heat for about 10 minutes, or until the onion and leeks are tender. Add the pork to this pan, and add the wine from the deglazed pan. Heat until reduced in volume by half. Add the chicken stock (this should be about 2cm\/1in short of covering the pork), then bring to the boil cover and simmer for 1½ hours.  Add the greens, broccoli, capers and olives and stir to combine the leaves with the cooking liquor. Cover and simmer for a further 30 minutes, by which time the pork should be tender and the greens and broccoli wilted. If necessary, continue to cook the pork, covered, until the meat is tender (the time taken will depend on the thickness of the belly). If you want to serve the pork with butter beans or black-eyed peas, add them now. Remove the pork and leave it to rest in a warm place before serving. Add the lemon juice and season the greens to taste. Stir in the parsley. For the feta polenta, heat the milk, bay leaf, garlic and 300ml\/10½fl oz of water in a saucepan until almost boiling. Turn off the heat and leave to infuse for about 20 minutes. Skim off any skin from the milk and remove the bay leaf and garlic. Reheat until simmering, then add the polenta in a thin, steady stream, whisking continuously. Whisk until thick (2-3 minutes), then remove from the heat and stir in the butter and feta. Season generously with salt and pepper and serve immediately. Serve the pork belly and vegetables in a shallow bowl with the feta polenta next to it, drizzled with olive oil. ","ingredients":" 1.5kg\/3lb 5oz piece pork belly,  sea salt and freshly ground black pepper,  olive oil,  1 onion, finely chopped,  1 leek, finely chopped,  1 small fennel bulb, finely sliced,  4 garlic cloves, finely chopped,  6 salted anchovies,  350ml\/12fl oz white wine,  500ml\/18fl oz chicken stock,  500-600g\/1lb 4oz-1lb 5oz mixed leafy greens, such as a mix of spinach, chard (red or green), kale, dandelion, or similar, torn into rough pieces,  200g\/7oz broccoli, roughly chopped,  50g\/1¾oz capers, rinsed,  100g\/3½oz pitted green olives roughly chopped,  butter beans or black-eyed peas (optional), to taste,  ½ lemon, juice only, to taste,  30g\/1oz finely chopped fresh flat-leaf parsley,  500ml\/18fl oz milk,  1 bay leaf,  2 garlic cloves, bruised,  150g\/5½oz instant polenta,  20g\/¾oz butter,  50g\/1¾oz feta, crumbled,  sea salt and freshly ground black pepper ,  extra virgin olive oil, to drizzle","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/slow-braised_pork_belly_95710"}