{"recipe_name":"Slow-roasted shoulder of pork with sherry-roasted parsnips, mash and gravy ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the slow-roasted shoulder of pork, preheat the oven to 150C\/300F\/Gas 2. Place the onion, carrots, celery and thyme in a large deep roasting tin. Pour 600ml\/20fl oz water in the bottom and place the shoulder on top. Cover with foil and place in the oven for three hours. Remove the foil and increase the temperature of the oven to 200C\/400F\/Gas 6. Cook for a further 1½ hours. For the sherry-roasted parsnips, heat a deep-fat fryer to 180C\/350F.  Heat a large saucepan of boiling water and place the parsnip chunks in the water for 2-3 minutes. Drain the parsnips and heat a frying pan. Add the butter and, once melted, add the parsnips. Cook until golden-brown all over, then add the sherry and honey cook for a further couple of minutes. Finish with the parsley and sage. Deep fry the remaining parsnip slices until golden-brown and crisp. Drain on kitchen paper and season with salt. For the mash, put the potatoes in a pan, cover with water and bring to the boil. Cook for 15-20 minutes, or until the potatoes are tender. Drain the potatoes and place back in the pan. Mash the potatoes with the cream and butter. Set aside, keeping warm. Remove the pork from the oven, cover and set aside to rest in a warm place for about 15 minutes.  Place the roasting tin on the hob and heat. Add the stock and cook until the volume of liquid has reduced by half. Strain and discard the vegetables. Slice or pull apart the pork and serve the mash, parsnips and pork with the gravy poured over. Top with the parsnip crisps. ","ingredients":" 1 shoulder of pork, skin scored,  1 large onion, cut in half,  2 carrots, roughly chopped,  2 sticks celery, roughly chopped,  ¼ bunch fresh thyme,  500ml\/18fl oz chicken stock,  450g\/1lb parsnips, three-quarters cut into chunks, one-quarter finely sliced on a mandoline,  50g\/1¾oz butter,  4 tbsp sherry,  3 tbsp clear honey,  1 tbsp chopped parsley,  1 tbsp chopped sage leaves,  salt ,  1kg\/2lb 4oz Maris Piper potatoes,  100ml\/3½fl oz double cream,  100ml\/3½ oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/slow-roasted_shoulder_of_08905"}