{"recipe_name":"Slow-roasted shoulder of lamb with green bean, pomegranate and pine nut salad","author":"Lesley Waters","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Pour the oil into a large ovenproof pan, add the potatoes, shallots, garlic, oregano, bay leaves, salt and pepper. Cut the lamb into 8-10 large chunks. Place in a bowl, squeeze over the lemon juice and season, to taste, with salt and freshly ground black pepper. Arrange the lamb and squeezed lemon quarters on top of the vegetables and pour over the stock. Cover with a tight-fitting lid and cook in the oven for 3½-4 hours, or until tender, basting the lamb with the juices occasionally. For the salad, add the beans to a pan of boiling water set over a medium heat and simmer for a few minutes. Prepare a bowl of ice water. Once tender, drain the beans well and place in the ice water. Drain again once cold. Combine all the other salad ingredients together in a bowl and season well. To serve, spoon the lamb onto a large warm platter and top with the potatoes, shallots, garlic and herbs and spoon over the juices. Serve with the salad. ","ingredients":" 2 tbsp olive oil (preferably Greek) ,  900g\/2lb Charlotte potatoes, washed, thickly sliced,  6 banana shallots, peeled,  1 garlic bulb, cut in half across the middle,  4 large sprigs oregano,  3 bay leaves,  2 tsp sea salt,  1 tsp cracked black pepper,  1.64kg\/3lb 8oz lamb shoulder, boned and trimmed,  2 small un-waxed lemons, cut into quarters,  200ml\/7fl oz vegetable stock,  200g\/7oz fine green beans, trimmed,  ice, for blanching,  100g\/3½oz wild rocket, washed,  1 pomegranate, seeds removed,  100g\/3½oz pine nuts, toasted,  1 tbsp extra virgin olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/slow-roasted_shoulder_of_43089"}