{"recipe_name":"Black treacle brushed pork, crushed butterbeans and Devon cider apple sauce","author":"James Tanner","programme":"2007-16","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the beans, place the butterbeans into a stainless steel bowl, cover with plenty of water and leave to soak overnight. Preheat the oven to 200C\/400F\/Gas 6. Drain the soaked beans, and rinse with fresh water then place into a large saucepan and add enough fresh water to just cover the beans. Place on the heat, bring to the boil then reduce the heat and cook for 20-25 minutes, or until just softened (do not add any salt at this stage as this well make the beans tough). Drain the beans and blend in a food processor with the vinegar and butter to form a firm paste (alternatively crush with a fork and mix well with a wooden spoon.) Season to taste with salt and freshly ground black pepper, and place in a saucepan ready to be warmed up just before serving. For the pork, season the pork fillet with salt and black pepper then lightly cover in half the olive oil. Heat a large non-stick ovenproof pan on the hob until hot, then add the pork fillet and sear for a few minutes, turning every so often until the fillet is coloured on each side. Add the crushed garlic and a knob of the butter to the pan and baste the fillet, then place into the oven for 8-10 minutes, turning half way through cooking, until the pork is cooked through. The pork is cooked if the juices run clear when a skewer inserted into the thickest part of the fillet. Meanwhile, for the apple sauce, put the cider into a saucepan and bring to the boil. Cook for 3-4 minutes, or until the volume of liquid is reduced by half. Add the stock, bring to the boil and cook for 5 minutes, or  until the volume of liquid has reduced by half again. Add the apple sauce, chopped apple and butter and stir to combine. Season, to taste, with salt and freshly ground black pepper. Place the treacle into a small saucepan and warm through over a low heat. Remove the pork from the oven, discard the garlic and pour over the warm treacle. Set the pork aside to rest for a few minutes. To serve, warm the butterbeans through and divide between 2 plates. Slice the pork and fan half the slices over each serving of beans, then drizzle over the apple and cider sauce. ","ingredients":" 250g\/9oz dried butterbeans,  2 tbsp white wine vinegar,  35g\/1¼oz cold diced butter,  salt and freshly ground black pepper,  400g\/14oz pork tenderloin fillet, fully trimmed ,  2 tbsp olive oil,  1 garlic clove, peeled, lightly crushed,  knob of butter,  3 tbsp black treacle,  150ml\/5floz dry Devon cider, such as Ashridge,  275ml\/10fl oz beef stock,  2 tbsp apple sauce or apple purée,  1 Braeburn apple, peeled, core removed, chopped,  35g\/1¼oz butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blacktreaclebrushedp_93568"}