{"recipe_name":"Slow roast pork shoulder with roasted vegetable tabbouleh and apple BBQ sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pork shoulder, preheat the oven to 150C\/300F\/Gas 2. Boil a kettle and pour the boiling water over the pork skin, discarding the water. Pat the pork shoulder dry using kitchen paper and place in a deep-sided roasting tray. Roast in the oven for four hours, or until very tender and golden-brown. Remove the pork from the oven and set aside to rest for 30 minutes. For the roasted vegetable tabbouleh, preheat the oven to 200C\/400F\/Gas 6. Mix the courgettes, aubergine, peppers and onions with the olive oil and place onto a roasting tray. Roast in the oven for 20-30 minutes, or until tender and slightly charred.  Remove the vegetable from the oven and chop roughly. Drain the bulgur wheat well and place into a large bowl. Add the remaining ingredients, the chopped roasted vegetables and mix until well combined. Season to taste with salt and freshly ground black pepper. For the apple BBQ sauce, heat the olive oil in a saucepan and fry the onion and garlic for 1-2 minutes, or until just softened. Add the apple pieces and chilli and fry for a further minute. Stir in the sugar, teriyaki sauce vinegar and tomato ketchup.  Cover and cook for 3-4 minutes, or until the apples are softened. To serve, shred the pork meat with two forks and pile onto one side of a large serving plate. Spoon the tabbouleh alongside and serve the apple sauce in a bowl. ","ingredients":" 3.5kg\/7lb 10oz boned pork shoulder, skin scored,  2 courgettes, thinly sliced,  1 aubergine, thinly sliced,  1 red pepper, cut into quarters, seeds removed,  2 red onions, cut into wedges,  4 tbsp olive oil,  250g\/9oz bulgur wheat, soaked in cold water overnight,  1 bunch fresh mint, roughly chopped,  1 bunch fresh coriander, roughly chopped,  2 lemon, juice only,  1 pomegranate, seeds only,  6 tbsp extra virgin olive oil,  1 tbsp olive oil,  1 onion, finely chopped,  2 garlic cloves, finely chopped,  2 Bramley apples, peeled, roughly chopped,  1 red chilli, finely chopped,  50g\/2oz dark muscavado sugar,  50ml\/2fl oz teriyaki sauce,  2 tbsp cider vinegar,  150ml\/5fl oz tomato ketchup","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/slow_roast_pork_shoulder_08225"}