{"recipe_name":"Slow-cooked beef fillet with horseradish mash, wild mushroom tortellini and red wine sauce","author":"John Campbell","programme":"2007-16","prep_time":"1-2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the beef, preheat the oven to 60C\/140F\/Gas ¼. Heat a frying pan until hot, then add the corn oil. Add the beef and fry until it has browned on all sides - this should take no more than two minutes in total. Remove the beef from the pan and allow to cool. Wrap the fillet in cling film and place on a roasting tray in the oven. Cook for 50-60 minutes. (NB: Not every type of cling film is suitable for using with all foods. Check the description on the packaging to see what foods and what temperatures it can be used with.) For medium rare, the core temperature of the meat will be 57-59C (135-138F). Test the meat with a digital meat thermometer - if the 57-59C (135-138F) temperature has not been reached,  increase the heat in the oven slightly and return the beef to the oven for a further 10 minutes, before checking once more. Repeat until the desired temperature has been reached. Remove the beef from the oven and heat a pan until hot. Fry the beef in the hot pan for no more than 30 seconds. You will find that there is no need to rest the meat as the proteins have not shrunk so that it requires resting. Meanwhile, for the pasta, place the flour in a large bowl. Make a well in the centre and crack in the eggs. Mix well until the dough comes together as a ball, then knead, using your hands, for about five minutes. Cover and allow to rest for as long as possible - you can cut the pasta you don't wish to use into portions and freeze any extra for another dish. Flour the pasta machine. Starting at the lowest (thickest) setting, feed the dough through the machine, turning the handle with one hand and holding the dough as it comes through the machine with the other. Change the setting on the pasta machine to the next-thickest setting, flour it again and feed the pasta sheet through the machine again, as before. Repeat this process 3-4 more times, flouring the machine and changing the setting down each time. It helps to cut the pasta into smaller squares as this will mean the pasta is less likely to dry out (any pasta you are not working on should be covered with cling film). Cut all the sheets into 7½cm\/3in discs. For the wild mushroom filling, place the chicken breast into a food processor and process for 20 seconds, or until it is loosely minced. Add salt, to taste. Continuing to process the chicken, gradually adding the cream - this should take no more than 30 seconds or the cream will split. Add the cooked wild mushrooms and chopped parsley and pulse once more to combine. Remove the mixture from the food processor and place in the fridge, covered, for 10 minutes to rest. Meanwhile wrap a  little of the filling in a square of cling film and poach in a pan of boiling water. Remove the filling from the cling film and taste it - you will then know if the filling requires more salt. Add more salt as required. To make the tortellini, place a disc of pasta onto your work surface, brush the edge with water and place a teaspoon of filling into the centre. Top with another disc of pasta and press down around the edges to seal. Repeat with the remaining pasta and filling. Bring a large pan of salted water to the boil, add the tortellini and simmer for three minutes until the tortellini float to the top of the pan. Remove the tortellini using a slotted spoon and drain onto kitchen paper. For the horseradish mash, place the potatoes into a large pan of cold water, bring up to the boil, then immediately drain and rinse in cold water. Place the rinsed potatoes back into cold water and bring to about 80C\/175F (using a thermometer to check the temperature). You should be able to see steam coming up off the pan but there should not be movement in the water. Cook for 1½ hours at this temperature, then drain the potatoes, return them to the pan and place back over the heat to drive off any excess moisture.  Pass the potatoes through a potato ricer or mash them, then add the cream and horseradish, to taste. Season with salt and freshly ground black pepper, to taste, then spoon the potatoes into a piping bag. Set aside. For the cabbage, blanch the cabbage by boiling it in a large pan of boiling salted water for three minutes. Drain well. Add the butter to a separate pan and once it has melted, add the carrot and shallot and fry for two minutes.  Add the blanched cabbage, bay leaf, thyme and chicken stock. Bring to the boil and cook until the volume of liquid has reduced slightly - roughly five minutes. Add salt and freshly ground black pepper, to taste. Set aside, keeping the cabbage warm. For the red wine sauce, heat a frying pan until hot, add the butter, shallots and mushrooms and fry until golden-brown. Drain the mushrooms and shallots in a colander to remove any fat, then return them to the pan. Add the reduced red wine and the beef stock. Bring to the boil, then reduce the heat slightly and simmer for 10 minutes  Pass the sauce through a sieve, return it to the pan and season, to taste, with salt and freshly ground black pepper. To serve, drain the cabbage of any excess liquid and place it in the centre of four bowls. Pipe a mound of mashed potato next to the cabbage. Carve the beef and place it next to the cabbage and mash. Place the tortellini next to the mash on top of the cabbage. Finish the dish with the red wine sauce and garnish with watercress. ","ingredients":" 1 tbsp corn oil,  500g\/1lb 2oz middle-cut well hung beef fillet,  550g\/1lb 4oz '00' pasta flour, plus extra for dusting,  5 free-range egg yolks,  4 free-range whole eggs,  175g\/6oz boneless skinless chicken breast, cubed,  salt, to taste,  125ml\/4½fl oz whipping cream,  110g\/4oz wild mushrooms, washed and pre-cooked,  1 tsp flatleaf parsley, chopped,  500g\/1lb 2oz potato, peeled and cut into 5cm\/2in cubes,  200ml\/7fl oz double cream,  2-3 tsp grated fresh horseradish root, or to taste,  salt and freshly ground black pepper ,  ½ Savoy cabbage, finely sliced,  40g\/1½oz butter,  1 carrot, finely diced,  1 shallot, finely sliced,  1 bay leaf,  1 sprig thyme ,  250ml\/9fl oz chicken stock,  salt and freshly ground black pepper ,  110g\/4oz butter,  250g\/9oz sliced shallots,  250g\/9oz button mushrooms,  500ml\/18fl oz red wine, simmered in a pan until the volume of liquid has reduced to 200ml\/7fl oz,  500g\/18fl oz beef stock,  salt and freshly ground black pepper ,  watercress","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/slowcookedbeeffillet_90924"}