{"recipe_name":"Slow-cooked Hereford oxtail with stout, prunes and horseradish mash","author":"Antony Worrall Thompson","programme":"Great British Menu","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the marinade, blend the peppercorns, salt, herbs, garlic and sugar in a food processor, then gradually add the oil and vinegar. Rub the oxtail with the marinade, then leave to marinate in a cool place for at least 3 hours or, ideally, overnight. Preheat the oven to 150C\/300F\/Gas 2. For the oxtail, wipe off the marinade and retain. Heat one tablespoon of the olive oil and a third of the butter in a flameproof casserole. Add the oxtail and fry until brown all over. Remove and set aside. Add another tablespoon of oil and a third of butter to the pot and heat gently until foaming, then add the onions and chopped sage. Allow the onions to cook over a gentle heat until caramelised. This will take about 20 minutes. Add ten of the prunes and all the anchovies.   Return the oxtail to the pot and add the reserved marinade, the stout and chicken stock and bring to the boil. Cover the casserole and transfer to the oven to cook for about 3 hours or until the meat is very tender and almost falling off the bone. Allow to cool.  Remove the oxtail from the pot and set aside. Increase the oven temperature to 200C\/400F\/Gas 6. Pour all the pan juices and onions into a food processor and blend until smooth. Pour into a clean saucepan and add the pickled walnuts. Cook until the sauce is thick enough to coat a spoon. Remove 4 tablespoons of the sauce to a large bowl and allow to cool. Set the pan of sauce aside, to reheat for serving. Remove the oxtail meat from the bone, shred it with two forks and place in the bowl with the sauce. Season the mixture with salt and freshly ground black pepper and divide into four equal amounts. Form into burger shapes.  Lay the four sheets of caul fat on a work surface and place an oxtail burger in the centre of each one. Make an indentation in each burger and push in a prune, enclosing it in the oxtail, then wrap the burgers in the caul.  Fry the parcels in a non-stick frying pan until lightly golden all over. Place the oxtail parcels in a roasting tray with the baby onions, carrots, mushrooms and garlic. Add the remaining oil and butter. Set over a moderate heat and shake the pan to brown the vegetables all over. Place the roasting tray into the oven and roast for 30 minutes.  Meanwhile, make the horseradish mash. Cook the potatoes in boiling salted water until tender. Drain and pass through a potato ricer into a bowl.  Add the butter, horseradish cream and half the milk and stir to combine. Add the remaining milk if the mash is too stiff. Season to taste with salt and freshly ground black pepper. Keep warm. Remove the oxtail parcels and keep warm. Add the vinegar and parsley to the vegetables and season to taste with salt and freshly ground black pepper.  Serve the oxtail with the roast vegetables, a little sauce, the horseradish mash and the sprouts alongside. ","ingredients":" 4 tsp coarsely ground black peppercorns,  2 tsp Maldon sea salt,  2 tsp dried oregano,  1 tsp thyme leaves,  4 cloves garlic, peeled,  6 tbsp soft brown sugar,  2 tbsp olive oil,  2 tbsp red wine vinegar,  115g\/4oz unsalted butter,  3 tbsp olive oil,  6 x 5cm\/2in pieces of oxtail, about 1.5kg\/3lb 5oz in total ,  3 onions, finely sliced,  ½ tbsp chopped sage,  14 prunes, pits removed,  6 tinned anchovy fillets, cut in half lengthways,  500ml\/17fl oz Young's luxury double chocolate stout or equivalent beer,  450ml\/16fl oz chicken stock,  4 pickled walnuts, quartered ,  salt and freshly ground black pepper,  4 sheets caul fat (available from traditional butchers),  12 baby onions, peeled,  12 baby carrots, trimmed,  12 button mushrooms,  12 cloves garlic, unpeeled,  2 tsp aged vinegar (eg balsamic),  2 tbsp chopped parsley,  1kg\/2¼lb floury potatoes, peeled and chopped,  115g\/4oz unsalted butter,  6 tbsp strong horseradish cream,  225ml\/8fl oz hot milk,  salt and freshly ground black pepper,  small Brussels sprouts, blanched until tender","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/slowcookedherefordox_81728"}