{"recipe_name":"Smoked cheese croquetas with chimichurri sauce","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat the butter and oil in a saucepan and gently fry the leeks for 3-4 minutes, or until softened.  Stir in the flour a little at a time and cook for five minutes.  Add the milk gradually and then cook for 15 minutes, stirring regularly.  Sprinkle in the grated cheese and stir to melt. Add the peas, seasoning, nutmeg and parsley.  Remove the pan from the heat and cover the sauce with cling film. Allow to cool completely.  For the coating, beat the eggs in a bowl and sprinkle the breadcrumbs onto a plate.  Heat a deep heavy-bottomed saucepan half full of vegetable oil until a breadcrumb sizzles and turns brown when dropped into it. Or use an electric deep fat fryer heated to 180C\/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Once cooled, roll the croqueta mixture into cylinders of approx 7.5cm\/3in long, using floured hands.   Dip the croquetas in the beaten egg and then roll them in the breadcrumbs to coat completely.  Fry the croquetas for 3-4 minutes, or until crisp and golden-brown. Remove with a slotted spoon and set aside to drain on kitchen paper.  For the chimichurri sauce, mix together all the ingredients in a bowl and serve alongside the croquetas. ","ingredients":" 60g\/2oz unsalted butter,  1 tbsp olive oil,  ½ leek, finely chopped,  60g\/2oz plain flour, plus extra for rolling,  250ml\/9fl oz milk,  100g\/4oz smoked cheddar, grated,  75g\/2½oz fresh or frozen peas,  salt and freshly ground black pepper ,  1 tsp grated nutmeg,  1 tbsp chopped fresh parsley,  2 free-range eggs,  150g\/5½oz panko breadcrumbs,  vegetable oil to deep fry,  bunch flat leaf parsley, chopped ,  4 garlic cloves, chopped,  ½ red onion, very finely diced ,  1 tbsp chopped oregano,  150ml\/5fl oz extra virgin olive oil,  50ml\/2fl oz red wine vinegar,  ½ lemon, juice only","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoked_cheese_and_pea_99301"}