{"recipe_name":"Smoked haddock and potted brown shrimp soufflé","author":"The Hairy Bikers","programme":"Hairy Bikers Everyday Gourmets","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p0151mm2.jpg","method":"Preheat the oven to 190C\/375F\/Gas 5. Grease the insides of a 1.5 litre\/2½ pint high-sided ovenproof dish with butter. Mix the parmesan and breadcrumbs together and sprinkle into the greased dish, turning it on its side and rotating to completely coat the base and the insides. Discard any excess. Place the haddock fillet into a saucepan and pour over the milk.  Gently bring to the boil over a low heat, then reduce the heat until the milk is simmering and simmer for two minutes. Remove the pan from the heat and lift out the poached haddock using a slotted spoon. Set aside, reserving the milk in a jug. When the haddock is cool enough to handle, remove the skin and flake the fish into a bowl. Melt the butter in a heavy-based pan over a medium heat. When the butter has melted, remove the pan from the heat and whisk in the flour until smooth and well combined. Return the pan to the heat and cook the butter and flour mixture for two minutes, whisking continuously. Remove the pan from the heat and whisk in the milk used to poach the haddock until fully incorporated into the mixture.  Return the pan to the heat and bring the mixture to the boil, whisking continuously. Reduce the heat until the mixture is simmering and simmer for 3-5 minutes, still whisking, until the mixture becomes a thick glossy sauce.  Remove the pan from the heat and stir in the egg yolks, gruyère, mustard, potted shrimps, flaked haddock and dill until well combined. Set aside. In a clean bowl, whisk the egg whites until soft peaks form when the whisk is removed. Spoon one-third of the egg whites into the haddock and shrimp sauce and beat until the mixture has loosened slightly. Then, using a metal spoon, gently fold the remaining whisked egg whites into the mixture until just combined. Gently tip the soufflé mixture into the prepared dish. Place the soufflé dish onto a baking tray and cook in the middle of the oven for 30 minutes, or until well-risen and golden-brown on top, but with a slight wobble. Serve immediately.  ","ingredients":" 50g\/2oz softened butter, plus extra for greasing,  3 tbsp finely grated parmesan,  3 tbsp fine dried breadcrumbs,  300g\/10½oz smoked haddock fillet (undyed),  350ml\/12fl oz milk,  50g\/2oz butter,  50g\/2oz plain flour,  6 free-range eggs, separated,  50g\/2oz gruyère cheese, grated,  2 tbsp wholegrain mustard,  50g\/2oz potted brown shrimps,  2 tbsp chopped fresh dill","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoked_haddock_and_10296"}