{"recipe_name":"Smoked haddock, mustard butter sauce and Iberico ham","author":"Daniel Clifford","programme":"Series 3","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/smoked_haddock_grain_84630_16x9.jpg","method":"Bring a pan of salted water to the boil. Add the potatoes and butter and cook for approximately 20 minutes, or until tender.  In a large pan, cover the haddock fillets in milk. Add the bay leaves, thyme and garlic. Gently simmer the haddock for approximately 7-8 minutes, or until cooked through.  Meanwhile, for the grain mustard butter sauce, heat a medium frying pan and melt a knob of butter. Add the garlic and shallot and cook for 2-3 minutes. Add the vinegar and white wine and simmer until the volume of liquid has reduced by three-quarters. Add the double cream and heat gently for a minute. Whisk in the remaining butter followed by the grain mustard, tarragon and chives. Remove from the heat.  For the poached eggs and spinach, heat a large saucepan of water until simmering. Add the vinegar and salt and stir the water to create a whirlpool. Crack an egg into the pool of water and cook for 2-3 minutes, or until cooked to your liking. Repeat with the second egg. In a saucepan, melt the butter over a medium heat. Add the spinach and cook until wilted. Stab the clove of garlic onto a fork and use it to stir the spinach around the pan. Discard the garlic.  Place the spinach in the centre of the plates. Spoon the potatoes around the spinach and place the haddock on the spinach. Top with the poached egg and pour over the sauce. Garnish with Iberico ham. ","ingredients":" 200g\/7oz floury potatoes (preferably Mayan Gold), peeled and sliced thickly,  50g\/1¾oz butter,  2 large fillets smoked haddock, pin-boned and cut into 125g\/4½oz chunks,  100ml\/3½fl oz whole milk, or enough to cover the haddock fillets,  2 bay leaves,  3 sprigs thyme,  3 garlic cloves, sliced,  100g\/3½oz unsalted butter,  2 garlic cloves, thinly sliced,  1 shallot, cut length ways,  100ml\/3½fl oz white wine vinegar,  200ml\/7fl oz white wine,  3 tbsp double cream,  1 tbsp wholegrain mustard,  pinch chopped tarragon, preferably fresh,  2 tbsp chopped chives ,  2 free-range eggs,  2 tbsp white wine vinegar ,  large pinch of salt ,  200g\/7oz spinach, washed,  50g\/1¾oz unsalted butter ,  1 garlic clove, peeled and left whole,  Iberico ham, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoked_haddock_grain_84630"}