{"recipe_name":"Smoked haddock pilaf","author":"Simon Hopkinson","programme":"The Good Cook","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/smoked_haddock_pilaf_84768_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. Melt the butter in a large, heavy-based lidded casserole dish. Add the garam masala and allow to sizzle gently for a moment or two. Tip in the rice and stir around until the grains are well coated with this spicy butter.  Add the bay leaf, lemon zest, green chilli, ginger and a touch of salt and freshly ground black pepper. Pour over the stock, bring up to a simmer, then lay the fish on top, gently submerging it under the surface. Put on the lid and cook in the oven for 15-20 minutes.  Remove from the oven, then leave to stand for 5-7 minutes without removing the lid; this is important - it allows the rice to finish cooking. Take off the lid, remove the skin from the fish and immediately add the chopped egg, onions and coriander and, using two forks, gently mix the rice, while also breaking the fish into flakes and mixing everything else in as you go. Remove the bay leaf and cover with a tea towel, clamp on the lid, and leave for a further five minutes to remove any excess steam. Mix again lightly. Serve directly from the dish onto hot plates and squeeze over a little lemon juice. ","ingredients":" 40g\/1½oz butter,  2 tsp garam masala,  250g\/9oz basmati rice ,  1 bay leaf,  1 lemon, zest only,  2 mild green chillies, seeded, chopped ,  1 small piece fresh root ginger, peeled, finely grated,  salt and freshly ground black pepper,  375ml\/13fl oz light chicken stock ,  400g\/14oz un-dyed smoked haddock fillet, boned, skin on, cut into 4 equal portions,  2 free-range eggs, hard-boiled, peeled, grated,  2 spring onions, trimmed, finely sliced ,  1 tbsp chopped fresh coriander ,  lemon juice, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoked_haddock_pilaf_84768"}