{"recipe_name":"Smoked haddock scotch egg with a black pudding and pickled onion salad","author":"Paul Ainsworth","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pickle, place all the ingredients in a pan with 300ml\/10fl oz water and bring to a simmer.  For the black pudding and pickled onion salad, place the shallot rings in a bowl and pour the pickle over. Set aside to cool completely, then transfer to an air-tight jar and set aside to pickle for at least 24 hours. For the smoked haddock scotch egg, preheat the oven to 180C\/350F\/Gas 4. Rub the potatoes in olive oil and rock salt and prick them half a dozen times all over. Wrap them in aluminium foil and bake in the oven for about an hour, or until soft.  Leave to cool, then scoop out the potato and pass through a potato ricer into a bowl (or mash thoroughly).  Cover with cling film and keep warm. Cook the eggs in a pan of boiling water for 3½ minutes, then plunge into iced cold water. When the eggs are thoroughly chilled, peel and place on kitchen paper to drain. In a separate bowl, add the haddock, spring onions and chives. Mix in enough mashed potato to bind (you may not need all the potato). Add the sweet chilli sauce and lemon juice and season to taste with salt and pepper.  Take some of the mix in your hand and push it flat to form a rough circle approximately 5mm\/¼in thick. Place the cooked egg in the middle and wrap gently around the egg. Repeat with the remaining eggs. Place the breadcrumbs on a plate or shallow bowl. In a separate bowl, lightly whisk the egg whites. Dip the scotch eggs in the egg whites and gently shake off any excess, then coat in breadcrumbs. Place on a tray and set aside.   For the black pudding and pickled onion salad, separate the Little Gem leaves and place in a bowl of iced water. Set aside for a few minutes, then transfer to a salad spinner or pat dry with kitchen paper.  In a frying pan, heat the olive oil, add the black pudding and fry until crisp. Drain on kitchen paper.  For the curry mayonnaise, place the mayonnaise in a bowl and add the chilli sauce, curry powder and turmeric. Whisk thoroughly and set aside for a few minutes to let the spices penetrate the mayonnaise. Add the lemon juice and Tabasco, then season to taste with salt and pepper. Transfer to the fridge to chill until ready to serve.  For the smoked haddock scotch egg, heat a deep-fat fryer to 180C\/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Place the scotch eggs carefully into the oil and fry for two minutes, or until golden-brown and crisp. When cooked, transfer to a plate lined with kitchen paper to drain. To serve, dress the Little Gem leaves with a little vinaigrette dressing and season with salt and pepper. Add the fried black pudding, pickled shallots and chives to the lettuce. Place a little curry mayonnaise on each plate to hold the lettuce and make a rustic pile of the dressed lettuce. Next to that, place an extra spoonful of curry mayonnaise. Season the scotch eggs with rock salt and place on the plates (either whole or sliced in half) on top of the curry mayonnaise.  ","ingredients":" 100g\/3½oz sugar,  100g\/3½oz white wine vinegar ,  25g\/1oz olive oil,  salt, to taste ,  2 banana shallots, sliced thinly into rings,  2 Little Gem lettuces, cut in half and root removed,  iced water,  1 tbsp olive oil,  70g\/2½oz black pudding, chopped into 1cm\/½in cubes,  vinaigrette dressing, to taste  ,  20g\/¾oz fresh chives, snipped,  2 large baking potatoes,  olive oil,  rock salt,  4 small free-range eggs (preferably Bantam),  350g\/12oz smoked haddock, chopped into cubes,  3 spring onions, finely chopped,  5g fresh chives, chopped,  35g\/1¼oz sweet chilli sauce ,  ½ lemon, juice only,  salt and pepper ,  200g\/7oz Japanese panko breadcrumbs ,  2 free-range egg whites ,  100g\/3½oz mayonnaise (preferably fresh),  2 tbsp sweet chilli sauce ,  10g\/¼oz mild curry powder (such as korma) ,  2g turmeric ,  lemon juice, to taste,  3 drops Tabasco,  salt and pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoked_haddock_scotch_59758"}