{"recipe_name":"Smoked salmon and haddock kedgeree","author":"Mary Berry","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the smoked salmon and haddock kedgeree, heat one tablespoon of the oil in a large non-stick frying pan over a medium heat and fry the two sliced onions slowly, for 20-25 minutes, stirring occasionally. You’re aiming for a crisp texture and deep golden-brown colour. Season with salt and pepper, drain on kitchen paper, and set aside in a warm place.  Put the haddock, skin-side down, in a large frying pan and pour over enough water to just cover. Simmer, covered, over a low heat for 5-8 minutes until opaque and cooked through. Remove from the heat. Lay the smoked salmon in the liquid, cover, and let stand for two minutes. Drain the fish and discard the skins. Set aside. Put the rice in a sieve and hold under running water until the water runs clear. This removes starch and prevents clumping, making the rice lighter and fluffier. Drain well. Heat the remaining tablespoon of oil in a large, non-stick, deep-sided frying pan or sauté pan. Add the chopped onion, cardamom pods, and cinnamon and fry over a medium-high heat for about five minutes, or until the onion is golden-brown. Stir the drained rice into the onion in the pan. Pour in 450ml\/15fl oz cold water and stir in the turmeric. Bring to the boil. Reduce the heat to low, stir, cover, and cook for 12-15 minutes or until the water is absorbed. Take the rice off the heat and let it stand, covered, for five minutes before fluffing up the grains with a fork.  Place the eggs in a small pan, cover with cold water, and bring to the boil. Simmer for six minutes, at which point the white should be set and firm but the yolks slightly soft. Peel and quarter the eggs. Flake the fish into large pieces. Remove the cinnamon stick from the rice and carefully stir in the butter, cream, coriander, fish, and eggs. Season with salt and cayenne pepper, and add the lemon juice. Heat through over a low heat, stirring gently once or twice only so you don’t break up the fish.  Serve the kedgeree with the warm crispy onion on top. ","ingredients":" 2 tbsp sunflower oil,  3 onions, 2 thinly sliced, 1 finely chopped,  salt and freshly ground black pepper,  350g\/12½oz smoked, undyed haddock fillets, pin boned,  100g\/3½oz smoked salmon,  250g\/9oz basmati rice,  3 cardamom pods, split ,  ½ cinnamon stick, about 3cm\/1¼in long,  ½ tsp turmeric ,  2 large free-range eggs,  30g\/1oz butter,  100ml\/3½fl oz single cream,  2 tbsp finely chopped fresh coriander,  cayenne pepper, to taste,  ½ lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoked_salmon_and_33394"}