{"recipe_name":"Smoked salmon and dill tian with warm potato galette and fennel and apple salad","author":"The Hairy Bikers","programme":"Hairy Bikers Everyday Gourmets","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/smoked_salmon_and_dill_22235_16x9.jpg","method":"Preheat the oven to 180C\/350F\/Gas 4. For the potato galettes, place the potato slices into a large bowl. Melt the butter in a small saucepan over a low heat and pour over the potato slices, mixing well to coat. Season, to taste, with salt and freshly ground black pepper. Line a small baking tray with aluminium foil. Set aside 30 of the best-looking potato slices to add to the top layer of each galette. Arrange the remaining potato slices into two even discs, roughly 12cm\/5in in diameter. Leave a space between the discs. Arrange the reserved potato slices in concentric circles on top of each disc, overlapping them. Bake the potato galettes in the oven for 30-35 minutes, or until the potato slices are tender and beginning to brown. Set aside to cool, then cover with cling film and chill in the fridge until needed. For the smoked salmon and dill tian, mix the crème fraîche, spring onion, capers, lemon juice and dill in a bowl until well combined. Season, to taste, with freshly ground black pepper. Flake the hot-smoked salmon into pieces, discarding the skin. Fold the salmon into the crème fraîche mixture. Grease two 9cm\/4in chefs' rings with a little oil and place onto a baking tray lined with cling film. Spoon half of the salmon and dill mixture into each chefs' ring, smoothing and compressing the mixture with the back of a spoon. Cover the tray with another sheet of cling film and chill in the fridge for at least one hour, or overnight. Fifteen minutes before serving, make the dill dressing. Whisk the egg yolk, vinegar, mustard, and sugar in a bowl until well combined. Season with a pinch of salt and a little freshly ground black pepper and whisk again. Gradually add the oil to the dressing mixture in a thin stream, whisking constantly until the dressing has thickened  slightly and has a creamy consistency. Stir in the chopped dill and season with sea salt, to taste. Set aside until needed. To cook the potato galettes, heat a large non-stick frying pan over a low heat. When the pan is hot, carefully transfer the potato galettes to the pan and fry for 4-5 minutes on each side, or until completely warmed through. (There is no need to add any extra fat to the pan but do keep an eye on them to make sure they don’t burn.) Meanwhile, for the fennel and apple salad, drain the sliced fennel well and place into a large bowl with the apple slices, chopped parsley and lemon juice. Season, to taste, with salt and freshly ground black pepper and mix until well combined. To serve, place one potato galette into the centre of each of two serving plates. Carefully remove the cling film cover and the chefs' rings from the salmon and dill tians and place one on top of each potato galette. Pile a little salad alongside each and spoon the dill and mustard dressing over the salad. Serve immediately. ","ingredients":" 300g\/10½oz waxy potatoes, such as Charlotte potatoes (each with a diameter of approximately 5cm\/2in), peeled, thinly sliced on a mandoline,  50g\/2oz butter,  salt and freshly ground black pepper,  4 tbsp crème fraîche,  1 spring onion, trimmed, finely sliced,  1 tbsp baby capers, drained,  ½ small lemon, juice only,  1 tbsp finely chopped fresh dill,  salt and freshly ground black pepper,  150g\/5oz fillet hot-smoked salmon,  sunflower oil, for greasing,  1 medium free-range egg yolk,  2 tsp white wine vinegar,  1 tsp Dijon mustard,  ½ tsp caster sugar,  2 tbsp sunflower oil,  1 tbsp finely chopped fresh dill,  sea salt flakes       ,  ½ small fennel, trimmed, very finely sliced (place the slices into a bowl of acidulated water until needed to prevent discolouring),  ½ red-skinned apple, core removed, flesh thinly sliced,  2-3 heaped tbsp chopped fresh flatleaf parsley,  2 tsp freshly squeezed lemon juice,  300g\/10½oz waxy potatoes, such as Charlotte potatoes (each with a diameter of approximately 5cm\/2in), peeled, thinly sliced on a mandoline,  50g\/2oz butter,  salt and freshly ground black pepper,  4 tbsp crème fraîche,  1 spring onion, trimmed, finely sliced,  1 tbsp baby capers, drained,  ½ small lemon, juice only,  1 tbsp finely chopped fresh dill,  salt and freshly ground black pepper,  150g\/5oz fillet hot-smoked salmon,  sunflower oil, for greasing,  1 medium free-range egg yolk,  2 tsp white wine vinegar,  1 tsp Dijon mustard,  ½ tsp caster sugar,  2 tbsp sunflower oil,  1 tbsp finely chopped fresh dill,  sea salt flakes       ,  ½ small fennel, trimmed, very finely sliced (place the slices into a bowl of acidulated water until needed to prevent discolouring),  ½ red-skinned apple, core removed, flesh thinly sliced,  2-3 heaped tbsp chopped fresh flatleaf parsley,  2 tsp freshly squeezed lemon juice","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoked_salmon_and_dill_22235"}