{"recipe_name":"Smoked salmon scotch egg with chive beurre blanc","author":"James Martin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Bring a saucepan of water to the boil. Add the four whole eggs and boil for five minutes. Using a slotted spoon, remove the eggs from the saucepan and place into a bowl of iced water, then peel and remove the shells. Place both types of smoked salmon into a food processor and pulse briefly to combine. Transfer the chopped salmon into a bowl and mix with the mashed potatoes. Season with salt and black pepper, mixing well to combine. Divide the mixture into four, mould one portion around a boiled egg and roll it into a circle. Repeat with the remaining mixture and boiled eggs. Dredge the salmon-wrapped eggs in flour, then dip quickly into the beaten eggs to coat. Spread the breadcrumbs out on a plate and roll the wrapped eggs in the breadcrumbs. Repeat the process, dipping each wrapped egg again into the beaten egg and breadcrumbs until thoroughly coated. Preheat a deep-fat fryer to 220C\/425F, or place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully place the eggs into the hot oil, a few at a time, and deep-fry for 2-3 minutes, or until golden-brown and crisp on the outside. Remove from the oil with a slotted spoon and drain on kitchen paper. For the chive beurre blanc, bring the finely sliced shallots, white wine vinegar and white wine to the boil in a non-reactive saucepan. Reduce the heat until the mixture is simmering, then continue to simmer until only two tablespoons of liquid are left in the pan.  Add the cold water and continue to simmer until the volume of liquid remaining in the pan is about one tablespoon.  Reduce the heat to low, then gradually whisk in 225g\/8oz of the butter, 25g\/1oz at a time, waiting until all of the butter has melted and incorporated into the mixture before adding more.  Once all of the butter has been added to the reduction, remove the mixture from the heat and strain it through a fine sieve into a clean saucepan. Season, to taste, with salt and freshly ground black pepper, then stir in the chives. Set aside at room temperature until needed (do not refrigerate as the sauce will separate). Heat a frying pan until hot, add the remaining 50g\/20z butter and the spinach and sauté until wilted then season with a little salt, pepper and nutmeg. To serve, pile the spinach onto the plate. Cut the top off of the egg and nestle into the spinach. Spoon the chive beurre blanc around.  ","ingredients":" 6 medium free-range eggs (for hard boiling), plus 2 extra, beaten,  225g\/8oz cold smoked salmon, roughly chopped,  225g\/8oz hot smoked salmon, roughly chopped,  150g\/5oz cold mashed potato,  salt and freshly ground black pepper ,  75g\/3oz plain flour, for dredging,  110g\/4oz Japanese panko breadcrumbs (use ordinary breadcrumbs if unavailable),  vegetable oil, for deep-frying,  2 shallots, peeled, finely sliced,  1 tbsp white wine vinegar,  4 tbsp white wine,  1 tbsp cold water,  275g\/10oz salted butter, cut into cubes,  salt and freshly ground black pepper,  4 tbsp chopped fresh chives,  300g\/11oz baby spinach leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoked_salmon_scotch_egg_02539"}