{"recipe_name":"Steamed orange and cranberry pudding","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Sift the flour and baking powder together into a bowl. In a separate bowl, beat the butter, sugar and syrup together. Add the eggs, one at a time, beating to incorporate well before adding the next egg.  Add the egg mixture to the bowl of flour and whisk well for two minutes, or until pale and light. Add the dried cranberries and fold in gently. For the sauce, place the sugar, water, marmalade, cranberry jelly and orange juice into a saucepan and heat gently to dissolve the sugar and marmalade. Bring to the boil and simmer gently for 5-10 minutes to form a thick syrup. Grease four ramekins and place a disk of greaseproof paper, cut to fit the ramekins, in the base of each. Spoon a little of the sauce into each ramekin, then sit a round of orange on top. Add the pudding mixture to almost fill the ramekins. Cover each ramekin with aluminium foil and transfer to a deep roasting tray. Half fill the tray with boiling water to create a bain-marie and transfer to the oven to bake for 20 minutes, or until the puddings have set. To serve, turn out the puddings onto plates and serve with a dollop of whipped cream. ","ingredients":" 150g\/5oz self-raising flour,  pinch baking powder,  150g\/5oz butter, softened, plus extra for greasing ,  150g\/5oz soft light brown sugar,  1 tbsp golden syrup,  3 free-range eggs,  1 tbsp dried cranberries,  1 orange, peeled and sliced into rounds,  100g\/3½oz caster sugar,  175ml\/6fl oz water,  1 tbsp orange marmalade,  1 tbsp cranberry jelly from a jar,  2 oranges, juice only,  double cream, whipped until stiff peaks form when the whisk is removed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bloodorangeandcranbe_85041"}