{"recipe_name":"Smoked and confit salmon terrine","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"less than 10 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/430F\/Gas 8. Line a 1kg\/2lb loaf tin with cling film, leavingenough extra to hang over the edges. Slice the salmon into three thick slices, so that they will fit snugly into the loaf tin. Place the salmon onto a baking tray and spoon over the goose fat. Transfer to the oven to cook for five minutes. Remove from the oven and leave to cool. Place the butter and chives into a bowl and beat together. Season with salt and freshly ground black pepper, to taste. Lay a quarter of the smoked salmon in the cling film-lined loaf tin, covering the base and sides. Place one piece of the cooked salmon into the tin completely, covering the base. Spoon over a third of the chive butter, neatly spreading it to the edges. Add a layer of the smoked salmon, covering to the edges. Repeat in layers until you use up all the ingredients, finishing with a layer of smoked salmon. Press down firmly. Cover with cling film. Place the terrine in the fridge and chill for at least one hour. For the salad, mix the salad leaves with the lemon juice, olive oil, salt and freshly ground black pepper in a bowl. Remove the terrine from the fridge and remove the cling film. Carefully transfer the terrine onto a large serving plate. Slice the terrine into pieces and serve with a handful of salad leaves. ","ingredients":" 750g\/1lb 11oz salmon fillet, skin removed,  225g\/8oz goose or duck fat,  250g\/9oz butter, softened,  8 tbsp chives, roughly chopped,  salt and freshly ground black pepper,  400g\/14oz sliced smoked salmon,  200-300g\/7-11oz mixed salad leaves,  ½ lemon, juice only,  4 tbsp extra virgin olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smokedandconfitsalmo_88730"}