{"recipe_name":"Smoked duck tatin","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Heat the butter and the oil in a frying pan over a low to medium heat. Add the onion and fry gently for 18-20 minutes, or until sticky and golden-brown. Season, to taste, with salt and freshly ground black pepper. Meanwhile, bring the water and sugar to the boil in a saucepan, stirring well to dissolve the sugar in the water. Reduce the heat until the mixture is bubbling gently and continue to cook for 3-4 minutes, or until it forms a sticky, golden-brown caramel.  Pour a quarter of the caramel into the bottom of each of four small, ovenproof frying pans or blini pans. Alternatively, pour the mixture into the bottom of four shallow ovenproof dishes. Roll the puff pastry out onto a lightly floured work surface, then cut four 12.5cm\/5in discs (or just larger than the size of the pans) from it.  Arrange a layer of the smoked duck slices on top of each portion of caramel, then spoon over the onions. Brush the rim of each small pan or dish with a little of the beaten egg. Place one of the pastry discs on top of each pan or dish and press down to seal. Transfer the pans or small dishes to the oven and bake for 18-20 minutes, or until the pastry has risen and is golden-brown. Meanwhile, for the dressing, in a bowl, whisk together the mustard, lemon juice and olive oil until well combined. Season, to taste, with salt and freshly ground black pepper. To serve, cover each smoked duck tatin with a warm serving plate, then invert the pan, turning the smoked duck tatin out onto the plate (the filling should become the topping). Place a handful of the microleaf salad alongside and drizzle over the dressing. Spoon a dollop of plum chutney alongside. ","ingredients":" 15g\/½oz butter,  1 tbsp vegetable oil,  1 onion, peeled, sliced,  salt and freshly ground black pepper,  75ml\/2¾fl oz water,  100g\/3½oz sugar,  1 sheet ready-made puff pastry,  flour, for dusting,  2 x smoked duck breasts, sliced into thick strips,  1 free-range egg, beaten,  1 tbsp Dijon mustard,  1 lemon, juice only,  150ml\/5fl oz extra virgin olive oil,  salt and freshly ground black pepper,  micro leaf salad,  plum chutney","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smokedducktatin_92291"}