{"recipe_name":"Smoked haddock fish cakes with chilli jam and watercress","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the haddock cakes, bring the milk to a simmer in a heavy-based pan and add the haddock fillets. Cook over a low heat for 3-4 minutes, or until the fish is cooked through, then remove from the pan and set aside to cool slightly. Discard the milk. Remove the skin from the haddock fillets and flake the flesh into a bowl, discarding any bones. Meanwhile cook the potatoes in a pan of boiling salted water for 15 minutes, or until tender. Drain, then return the potatoes to the pan and cook for one minute to drive off any excess moisture. Pass the potatoes through a ricer or mash well in a bowl. Mix the flaked fish into the mashed potatoes. Add the capers, gherkins, shallots and parsley to the fish and potatoes and mix well to combine. Season with salt and pepper.  With slightly damp hands, divide the mixture into eight equal portions and shape each portion into a small cake. Dredge each cake in the flour, then dip into the beaten eggs and then roll in the breadcrumbs to coat. Place the fish cakes onto a plate, cover with cling film and chill in the fridge for one hour, or until set.  Half-fill a deep, heavy-based pan with vegetable oil and heat to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Fry the fish cakes in small batches for 3-4 minutes, turning them over halfway, until golden-brown and cooked through. Remove with a slotted spoon and drain on kitchen paper.  For the chilli jam, heat the sugar in a heavy-based saucepan over a medium heat until it melts and forms a golden-brown caramel. (Do not stir and keep an eye on it so that it doesn’t burn.) Blend all of the remaining chilli jam ingredients, except the crème fraîche, in a food processor to a smooth purée.  Once the sugar has caramelised, pour in the puréed chilli jam mixture and stir well. Bring the mixture to the boil, then reduce the heat and simmer for 4-5 minutes, or until sticky and jam-like. Remove from the heat and set aside to cool.Once the chilli jam mixture has cooled, stir in the crème fraîche until well combined. Place the watercress in a medium glass bowl and the oil, vinegar and mustard in another and whisk. Just before serving pour over the dressing and mix. Serve the fishcakes with the chilli jam and the watercress salad on the side. ","ingredients":" 500ml\/17½fl oz milk,  700g\/1lb 8oz smoked haddock fillets,  450g\/1lb floury potatoes (such as King Edward or Maris Piper), peeled and cut into chunks,  4 tbsp capers, drained, roughly chopped,  60g\/2½oz gherkins, roughly chopped,  75g\/3oz shallots, peeled, finely chopped,  4 tbsp fresh flatleaf parsley,  50g\/2oz plain flour,  2 free-range eggs, beaten,  75g\/3oz dried panko breadcrumbs,  vegetable oil, for deep frying,  salt and freshly ground black pepper,  75g\/3oz caster sugar,  2 red chillies, roughly chopped,  2 plum tomatoes, roughly chopped,  8 lime leaves,  2 lemongrass stems, tough outer leaves removed, finely chopped,  25g\/1oz roughly chopped fresh ginger,  2 garlic cloves, peeled, left whole,  1 banana shallot, roughly chopped,  4 tbsp Thai fish sauce (nam pla),  40ml\/1½fl oz sesame oil,  50ml\/2fl oz dark soy sauce,  2 tbsp clear honey ,  3 limes, juice and zest,  110g\/4oz crème fraîche,  25g\/10z watercress,  3 tbsp rapeseed oil,  1 tbsp sherry vinegar,  1 tsp Dijon mustard","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smokedhaddockcakeswi_91607"}