{"recipe_name":"Smoked haddock chowder with leeks and sweetcorn","author":"Nigel Slater","programme":"Nigel Slater's Simple Suppers","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/smokedhaddockchowder_92492_16x9.jpg","method":"In a deep pan, heat the butter until melted, add the leeks with the thyme and cover with a circle of greaseproof paper big enough to tuck down a little over the leeks. Cover with a lid so no steam escapes, and cook gently for about ten minutes. Run a sharp knife down the sides of the corn to remove the kernels and add them to the pot with the potatoes, which will add some body to the chowder. Replace the greaseproof paper and the lid and continue to cook for a further ten minutes. Meanwhile, place the smoked haddock fillets in another shallow pan and pour in the milk, enough to just cover the fish. Add a bay leaf or two and a sprinkling of peppercorns. Bring to a gentle simmer and cook the fish for eight minutes or so, being careful not to overcook it. Lift the lid of the pan containing the leeks and remove the greaseproof paper, and ladle in the poaching milk of the fish without the bay leaves or peppercorns, followed by large chunks of haddock, removing any bones as you go. Bring to a simmer and finish with a good sprinkling of chopped parsley before taking the pan to the table for the food to be served into bowls. ","ingredients":" 1 good slice butter,  3-4 medium leeks, roughly sliced,  1 small handful tender fresh thyme sprigs ,  1 corn on the cob ,  a couple of handfuls of new potatoes, cut into bite-sized chunks,  a couple of undyed smoked haddock fillets,  milk, enough to cover the fish,  2-3 fresh bay leaves,  a sprinkling of black peppercorns,  a good handful fresh flatleaf parsley, roughly chopped","vegetarian":false,"calories":258.0,"protein":23.0,"carbs":18.0,"sugars":9.0,"total_fat":10.0,"saturated_fat":6.0,"fiber":4.0,"salt":1.0,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smokedhaddockchowder_92492"}