{"recipe_name":"Smoked haddock rarebit with apricot and chilli chutney","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the apricot and chilli chutney, heat the oil in a non-reactive frying pan over a medium heat. Add the onion, chilli and garlic and fry for 4-5 minutes, or until softened. Add the chopped apricots, demerara sugar and cider vinegar and bring the mixture to the boil. Continue to boil for 12-15 minutes, or until the mixture has thickened and is sticky. Set aside to cool. For the smoked haddock rarebit, preheat the grill to its highest setting. Brush the cut side of each muffin half with the oil. Heat a griddle pan over a high heat until smoking, then griddle the muffin halves, cut sides down, for 1-2 minutes, or until golden-brown griddle marks appear. In a bowl, mix together the grated cheese, egg, Worcestershire sauce and wholegrain mustard until well combined.  Place the muffin halves, griddled sides facing upwards, onto a baking tray. Divide the flaked haddock and sliced onion equally among the four muffin halves, then top with the cheese and Worcestershire sauce mixture. Grill for 3-4 minutes, or until the cheese is bubbling and golden-brown. To serve, place two smoked haddock rarebit muffins onto each serving plate. Spoon a little apricot and chilli chutney alongside. Garnish with the chopped parsley. ","ingredients":" 1 tbsp vegetable oil,  1 onion, finely chopped,  1 red chilli, chopped,  1 garlic clove, finely chopped,  600g\/1lb 5oz apricots, stones removed, chopped,  125g\/4½oz demerara sugar,  125ml\/4½fl oz cider vinegar,  2 English muffins, cut in half,  1 tbsp vegetable oil,  300g\/10½oz cheddar, grated,  1 free-range egg,  dash Worcestershire sauce,  1 tbsp wholegrain mustard,  200g\/7oz smoked haddock fillet, poached in milk, flaked,  ½ red onion, finely sliced,  2 tbsp chopped fresh parsley, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smokedhaddockmuffins_91597"}