{"recipe_name":"Smoked trout with watercress purée and chopped egg salad","author":"Allegra McEvedy","programme":null,"prep_time":"less than 30 mins","cooking_time":"no cooking required","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/smokedtroutwithwater_92663_16x9.jpg","method":"For the watercress purée, bring a saucepan of salted water up to a rolling boil, then add the watercress and cover the pan with a lid. Once the water has returned to the boil, drain the watercress well, then refresh under cold water. Blend the drained watercress in a food processor with four ice cubes and two tablespoons of water. Turn the motor off and scrape a spatula down the insides of the food processor at intervals, then blend again, until the mixture forms a smooth purée. Season, to taste, with salt and freshly ground black pepper. Mix the chopped boiled eggs, mustard cress, cornichons and dill in a bowl until well combined. In a separate bowl, whisk together the mustard, oil and lemon juice and season, to taste, with salt and freshly ground black pepper. Then, pour over the egg mixture and stir well to combine. To serve, spoon the watercress purée into espresso cups or shot glasses. Drizzle half a teaspoon of soured cream or crème fraîche onto the surface of each serving, then place the cups or glasses onto six serving plates. Divide the egg salad, smoked trout and soda bread equally among the plates. Garnish each plate with a lemon wedge. ","ingredients":" 140g\/5oz watercress leaves, washed, roughly chopped,  4 ice cubes,  2 tbsp water,  salt and freshly ground black pepper,  3 free-range eggs, hard-boiled, peeled, chopped,  1 punnet mustard cress,  8-10 cornichons, drained, sliced,  small handful chopped fresh dill,  1½ tsp Dijon mustard,  3 tbsp extra virgin olive oil, or rapeseed oil,  ½ lemon, juice only,  3 tsp soured cream, or crème fraîche,  6 x 40g\/1½oz pieces smoked trout fillet,  6 thin slices toasted soda bread, buttered,  ½ lemon, cut into 6 wedges, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smokedtroutwithwater_92663"}