{"recipe_name":"Smokey mutton Sloppy Joe with crispy lamb’s breast","author":"Daniel Doherty","programme":"Saturday Kitchen Best Bites","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the cure place all the ingredients onto a baking tray and mix them together. Place the lamb breast on the baking tray and rub with the cure, cover with cling film and leave in the fridge for 24 hours. Pre-heat oven to 130C\/260F\/Gas Mark ½. Remove the lamb from the fridge and brush off all of the cure. Put it in an ovenproof dish, add the duck fat to cover, and cook in the oven for 3 hours, or until the meat is tender and gives easily when pushed with a spoon. Allow to cool in the fat. When cool enough to handle, pull the meat into strands with your fingers, then store, covered, in the fridge. For the Sloppy Joe mix, put the mutton in a large frying pan over a medium heat and cook for a few minutes, pouring away any fat as it melts. Add the onions and garlic and cook for 10 minutes, or until the onions are soft. Turn the heat to low, add the remaining ingredients and cook for one hour.  Heat the oil in a deep-fat fryer or in a deep heavy-based saucepan to 180C\/350F. (CAUTION: Hot oil can be dangerous; do not leave unattended). Dust a handful of the lamb with flour and fry for 2-3 minutes, or until crisp. Place on kitchen paper to dry, and season with salt and pepper. Remove the pan from the heat.  Toast the brioche buns and fill with the Sloppy Joe mix. Top with the crispy lamb and coriander and serve.  ","ingredients":" 50g\/1¾oz sea salt,  25g\/1oz caster sugar,  2 sprigs thyme, leaves only,  10 black peppercorns, crushed ,  1 star anise, crushed,  100g\/3½oz piece of lamb’s breast,  200g\/7oz duck fat,  vegetable oil, for frying,  plain flour, for dusting ,  sea salt and freshly ground pepper,  500g\/1lb 2oz minced mutton,  2 onions, finely diced,  2 garlic cloves, finely chopped,  4 chipotle chillies in adobo, mashed to a rough paste,  2 tsp harissa,  2 sprigs rosemary,  4 bay leaves,  3 tbsp tomato purée,  200g\/7oz tomato ketchup,  4 tbsp Worcestershire sauce,  4 tbsp soy sauce,  6 brioche hot dog buns, split,  fresh coriander leaves, for garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smokey_mutton_sloppy_joe_19958"}