{"recipe_name":"Smoky cheese and olive scones","author":"Candice Brown","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 12 scones","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/smoky_cheese_and_olive_25618_16x9.jpg","method":"Preheat the oven to 200C\/190C Fan\/Gas 6. Line a baking tray with baking paper.  Mix the flour, baking powder, salt, pepper, cayenne pepper, mustard powder and smoked paprika in a bowl. Rub in the butter until the mixture resembles breadcrumbs. Stir in the cheeses using a round-ended knife. Chop the olives into varying sizes and add to the mixture along with the fresh and dried basil. Lightly beat the eggs with the milk. Add almost all of the egg mixture to the dry mix (save some for glazing) and mix with a knife until it comes together as a dough. Lightly dust the work surface with flour, then turn out the dough. Knead briefly to bring the dough together – try not to handle it too much, it should be a fairly wet and ragged dough. Using your hands flatten the dough into a circle about 2½cm\/1in thick. Using a 5cm\/2in pastry cutter, cut out 12 scones – push straight down, do not twist.  Place the scones on the prepared tray. Glaze with the reserved egg mixture and grated Parmesan.  Bake for 15 minutes or until golden-brown. Place on a wire rack to cool. ","ingredients":" 675g\/1lb 8oz self-raising flour, plus extra for dusting,  3 tsp baking powder,  pinch salt ,  freshly ground black pepper,  ½ tsp cayenne pepper,  1 tsp mustard powder,  1 tsp smoked paprika,  110g\/3¾oz unsalted butter,  300g\/10½oz Manchego cheese, grated,  150g\/5½oz Parmesan cheese, grated, plus extra to finish,  300g\/10½oz Spanish black and green olives ,  1 bunch fresh basil, leaves chopped,  1 tsp dried basil,  3 large free-range eggs,  250ml\/9fl oz full-fat milk","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoky_cheese_and_olive_25618"}