{"recipe_name":"Smoky chilli chicken wings, spiced potato wedges and padron peppers","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/smoky_chilli_chicken_72607_16x9.jpg","method":"For spiced potato wedges, preheat the oven to 200C\/400F\/Gas 6. Mix the spices and salt together in a bowl with the olive oil, then add the potatoes and toss well to coat thoroughly. Tip out onto a flat oven tray and roast for 30 minutes, turning half way through, until the wedges are golden-brown, crunchy around the edges but tender when pierced with a knife. For the wings, preheat the oven to 220C\/425F\/Gas 7. Place the wings onto a roasting tray in the oven and roast for 15-20 minutes, or until golden-brown and cooked through. Meanwhile, make the dressing. Heat a frying pan until hot, add the extra virgin olive oil and garlic and cook for a couple of minutes over a gentle heat – you don’t want to burn the garlic. Add the smoked paprika and sherry vinegar.  Heat a clean frying pan until hot, add the olive oil and padron peppers and then fry for 2-3 minutes, or until the peppers are charred. Add some salt.  Pile the peppers into a serving bowl and top with some more sea salt. To serve, put the wings onto a serving bowl and drizzle with some of the warm garlic and chilli dressing. Serve with the wedges and peppers. ","ingredients":" 1 tsp ground Sichuan peppercorns,  1 tbsp ground coriander,  1 tbsp ground cumin,  1 tbsp sweet smoked paprika,  1 tsp sea salt,  3 tbsp olive oil ,  4 large potatoes, scrubbed and cut into wedges,  12 large, meaty, free-range chicken wings,  6 tbsp extra virgin olive oil,  6 garlic cloves, finely sliced,  2 tsp hot smoked sweet paprika,  2 tbsp sherry vinegar,  3 tbsp olive oil,  150g\/5oz padron peppers,  sea salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/smoky_chilli_chicken_72607"}