{"recipe_name":"Soft chicken wings stuffed with herbs, potato gnocchi, broad beans and thyme","author":"Alexis Gauthier","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Prepare the chicken wings, there should be three parts to the wing; the tip, the wing and the winglet. Use the middle part, the wing, for the dish, and cut away the tip and the winglet, keeping them for the jus. Remove the two bones in the middle of the wing joint, being careful not to break the outside skin.  Mix together the sun-dried tomatoes, ricotta, chervil, parmesan, garlic, whole egg, egg yolk, salt, pepper and olive oil in a bowl. Taste to check the seasoning, and adjust to taste. Stuff each chicken wing with a large spoonful of the ricotta mixture. Meanwhile, put a large pan of water on to boil.  Arrange the five chicken wings on a sheet of aluminium foil and roll them up tightly . Place the roll of wings into the boiling water to poach for 4 minutes. Remove from water and leave to rest.  For the chicken jus, heat a pan until hot over a medium to high heat, add olive oil and get it hot before adding the chicken wing trimmings. Fry the chicken wing trimmings until nicely golden-brown, but not caramelised, for about 3 minutes.  Add the carrot, onion and garlic. Stir gently for one minute and deglaze the pan with 1 litre\/1¾ pints water.  Let it reduce until you have a rich jus, then drain, keeping the liquid. Set aside until needed. In a large pan of boiling salted water, boil the baking potatoes, with their skins on, until perfectly soft and cooked. Drain, and delicately remove the skin. Allow the potatoes to cool enough to handle, but they need to be hot to be able to remove the skins.  Pass the potato flesh through a ricer, or sieve, into a bowl. Add the nutmeg, egg, egg yolk, corn flour, salt and pepper. Mix the potato mixture vigorously.  Prepare a baking sheet dusted with flour, to lay the gnocchi onto once they're shaped. To shape the gnocchi, take a teaspoon of potato mixture and form into a little ball. Lay it on the baking tray then press with a fork to make the gnocchi shape.   Bring a large pan of salted water to the boil, then add the gnocchi and cook for one minute, or until they float to the surface. Keep them on an oiled plate until serving.  To finish the dish, heat two non-stick frying pans with a little olive oil.  In one pan, fry the chicken wings for two minutes on each side, adding a little butter. In the other pan, fry the gnocchi for three minutes, add a little butter, and turn the gnocchi in the melted butter. Remove the chicken wings from the pan, and add the broad beans, pinch salt and fresh thyme. Quickly toss the beans and add a little chicken jus.  Cook for another 30 seconds then remove from the heat, and spoon a little onto four serving plates.  On top of the beans, add alternating layers of gnocchi and chicken, and cover nicely with the broad beans, thyme and jus mix. ","ingredients":" 20 chicken wings,  100g\/3½ oz sun-dried tomatoes, finely chopped,  60g\/2¼ oz ricotta cheese,  2 bunches fresh chervil, roughly chopped,  50g\/1¾ oz grated parmesan,  2 garlic cloves, finely chopped,  1 egg,  1 egg yolk,  salt and freshly ground black pepper,  50ml\/2 fl oz olive oil,  trimmings from 20 chicken wings (above),  1 carrot, peeled and roughly chopped,  1 onion, sliced,  ½ garlic bulb, peeled and smashed,  1 kg\/2lb 4oz baking potatoes,  1 egg,  1 egg yolk,  3 tbsp corn flour,  nutmeg,  salt,  white pepper,  30g\/1oz unsalted butter,  1kg\/2lb 4oz fresh broad beans, podded and peeled,  5 sprigs fresh thyme","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/soft_chicken_wings_24058"}