{"recipe_name":"Sole in a bag with courgettes and black olives and wet polenta","author":"Bryn Williams","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the cod place the spring onions, yellow courgette, green courgette, black olives and basil into a bowl. Season with salt and freshly ground black pepper, add the olive oil and mix until well combined. Cut four pieces of  greaseproof paper or foil, each measuring 30cm\/12in. Divide the vegetables into four equal piles on the pieces of paper or foil. Place three sole fillets on each of the vegetable mounds, and fold each fillet in half to avoid overcooking.  Season the sole with salt and freshly ground black pepper and top with some butter. Fold the paper or foil over to create four parcels and pour in the wine. Seal the parcels tightly by folding and crimping the edges. Heat a heavy-based frying pan, or roasting tin, over a high heat and cook the parcels until they begin to expand. Remove from the heat and place in the oven for seven minutes. Meanwhile for the polenta, bring the chicken stock, milk and the cream to the boil in a saucepan. Add the garlic, thyme, peppercorns and bay leaf. Remove the mixture from the heat, cover with a lid and set aside to infuse for one hour. Pass the infused stock though a sieve and into a saucepan. Return to the boil and add the polenta. Whisk the polenta for 15-20minutes, or until soft, add the parmesan and season to taste with salt and freshly ground black pepper. Serve the parcels alongside the polenta. ","ingredients":" 1 spring onion, thinly sliced ,  1 yellow courgette, thinly sliced,  1 green courgette, thinly sliced,  50g\/2oz black olives, pitted, cut in half,  bunch fresh basil,  1 tbsp olive oil,  3 lemon sole, skinned, cut into12 fillets,  50g\/2oz butter,  50ml\/2fl oz white wine,  400ml\/14fl oz chicken stock,  110ml\/4fl oz double cream,  110ml\/4fl oz milk,  1 sprig fresh thyme,  1 garlic clove,  5 whole peppercorns,  1 bay leaf,  150g\/5oz polenta,  30g\/1oz parmesan, freshly grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sole_in_a_bag_with_26678"}