{"recipe_name":"Sole satay heart","author":"Henry Dimbleby","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sole satay heart, preheat the oven to 180C\/350F\/Gas 4.  Place the shallots, ginger, four garlic cloves, turmeric, soy sauce, fish sauce and chilli (if using) in a food processor and blend.  Heat a saucepan, and, once hot, add the oil and gently fry the blended mixture until the oil starts to come out. Remove from the heat and stir in the cashew butter and coconut milk. Leave to cool. Cut out a 18in\/46cm long rectangle of greaseproof paper and aluminium foil. Lay the greaseproof paper on top of the foil. Fold it in the middle lengthways and cut out a large heart shape on the fold. Smear some of the satay mixture on one side of heart and put the bottom two fillets of the sole on top (from the white-skinned side of the fish). Add more satay mix, place the remaining two fillets on top and then spoon over the remaining satay mix. Top with the spring onions, red peppers and lime juice and fold the foil and greaseproof paper around the filling like a pasty, starting from the top of the heart and twisting all the way to the bottom (I go round twice for good measure). Bake in the oven for 15 minutes. Meanwhile, heat a frying pan and add the cashews. When the cashews are lightly toasted, add a tiny bit of oil and the remaining garlic clove, chopped, and the chopped chilli. Transfer to a small bowl and allow to cool. For the rice, add one and a quarter cups of water to a pan and add the rice. Bring to the boil, then cover and reduce the heat to very low. Cook until the rice is tender and all the water is absorbed. For the green salad, place the lettuce in a large bowl. In a separate small bowl mix the remaining ingredients to make a dressing. Dress the lettuce just before serving. To serve, place the cooked rice on a large oval serving plate and bring the wrapped fish to the table. Pierce with a knife and place the fillets of fish on top of rice, spoon over any cooking juices and add a squeeze of lime juice. Top with the toasted cashews, garlic and chilli. Sprinkle over the chopped coriander and serve with the green salad. ","ingredients":" 1 shallot, roughly chopped,  2½cm\/1in piece ginger, roughly chopped,  5 garlic cloves ,  ½ tsp ground turmeric,  2 tsp dark soy sauce,  splash fish sauce,  1 red chilli, seeds removed if desired,  2 tbsp vegetable oil,  2 tbsp crunchy cashew nut butter (or peanut butter),  200ml\/7fl oz coconut milk,  1 lemon sole, dark skin removed, filleted,  1 spring onion, chopped into fine batons,  ¼ red pepper, finely chopped,  1 lime, juice only,  1 tbsp shelled cashew nuts, lightly crushed,  ½ red chilli, seeds removed and chopped,  handful fresh coriander, roughly chopped,  1 lime, juice only,  1 cup basmati rice,  1 iceberg lettuce, core removed, shredded,  1 tbsp white wine vinegar,  3 tbsp olive oil,  1 tsp Dijon mustard,  1 lemon, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sole_satay_heart_77289"}