{"recipe_name":"Somerset chicken","author":"The Hairy Bikers","programme":"The Hairy Bikers' Food Tour of Britain","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Season the chicken breasts with salt and freshly ground black pepper. Heat a large frying pan until smoking, then add half of the butter and oil. Fry the chicken breasts in batches, skin-side down first, for 1-2 minutes on both sides, or until golden-brown all over.  Transfer the chicken breast to a deep-sided roasting tray and roast in the oven for 25 minutes, or until the chicken is cooked through (NB: the chicken is cooked through when the juices run clear when the thickest part is pierced with a skewer.) Keep warm.  Preheat the grill to high.  Return the pan to the heat and add the remaining butter and oil. Add the onions and cook for 4-5 minutes, or until softened but not coloured. Stir in the flour and the mustard and cook for a further 1-2 minutes. Add the apples and mushrooms and cook for a further minute, then pour over the chicken stock.  Bring to the boil, then add the cider and return to the boil. Cook for 1-2 minutes, then lower the heat, add the sage and stir in the cream. Simmer for a further 5-6 minutes, then season, to taste, with salt and freshly ground black pepper.  Pour the sauce over the chicken so that it is completely covered.  Sprinkle the cheddar cheese over the chicken and place under the grill for 4-5 minutes, or until the cheese is melted, golden-brown and bubbling. To serve, place a baked potato topped with a knob of butter on each serving plate. Spoon the chicken alongside and serve. ","ingredients":" 6 boneless chicken breasts, skin on,  salt and freshly ground black pepper,  75g\/2½oz butter, plus extra to serve,  3 tbsp olive oil,  2 onions, peeled, sliced,  4 tbsp plain flour,  2 tbsp wholegrain mustard,  2 dessert apples, peeled, cores removed, sliced into batons,  110g\/4oz button mushrooms, sliced,  250ml\/9fl oz chicken stock,  300ml\/10½fl oz cider,  1 tbsp finely chopped fresh sage,  250ml\/9fl oz double cream,  300g\/10½oz cheddar cheese, grated,  6 baked potatoes, to serve,  butter, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/somersetchicken_91978"}