{"recipe_name":"Squid and rice noodle salad","author":"John Torode","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"To make the chilli paste, combine all the ingredients in a food processor until it forms a smooth paste. Transfer to a bowl and add the squid. Leave to marinate while you make the salad and fritters. For the noodle salad, first make the dressing. In a pestle and mortar pound together the lime juice, palm sugar, chilli and fish sauce. Shred all the herbs very, very finely and then mix with the dressing. Pour the mixture over the cooked noodles. For the fritters, heat the vegetable oil in a deep-fat fryer to 180C. Alternatively, pour the vegetable oil into a deep, heavy-based pan so that it reaches two-thirds of the way up the pan and heat until a breadcrumb dropped in sizzles and turns brown in 30 seconds. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Mix the chickpea flour and cornflour with enough water to make a batter. Add the garam masala, chillies and cardamom. Whisk to make a smooth paste and season with salt. Blanch the cauliflower florets in boiling water for 1 minute, then drain and rinse in cold water. Wash and drain the beansprouts well.   Take half the beansprouts, and all the cauliflower and coat them in the batter.  Carefully deep-fry them in batches, turning them to ensure even cooking. Cook until just brown. Remove and drain on kitchen paper. For the squid, heat 100ml\/3½fl oz oil in a wok and add the squid. Let it sizzle for a minute then add the ginger and sambal. Cook until toasted and fragrant. Put a little rice noodle salad on each plate, add the squid and fritters to the side and dress the plate with the chilli sauce. Scatter over the coriander leaves and remaining beansprouts.  ","ingredients":" 2 long red chillies,  30g\/1oz garlic,  50g\/1¾oz ginger,  50ml\/2fl oz rice wine vinegar,  50g\/1¾oz caster sugar,  15g\/½oz sea salt,  25ml\/1fl oz vegetable oil,  1 tbsp chilli sauce,  100ml\/3½fl oz fish sauce,  handful fresh curry leaves,  2 tsp black pepper,  1 lime, juice only,  25g\/1oz palm sugar ,  1 red chilli, chopped,  30ml\/1fl oz fish sauce,  1 lemongrass stalk ,  2 lime leaves ,  handful fresh mint leaves,  handful Thai basil leaves,  handful Chinese chives ,  200g\/7oz rice noodles, cooked,  vegetable oil, for deep frying,  200g\/7oz chickpea flour ,  50g\/1¾oz cornflour,  30g\/1oz garam masala,  2 red chillies, very finely chopped,  6 green cardamom pods, crushed,  pinch salt,  100g\/3½oz cauliflower florets,  200g\/7oz beansprouts,  100ml\/3½fl oz vegetable oil,  1kg\/2lb 4oz squid cleaned and cut into rings, including tentacles (or 400g\/14oz of fresh, cleaned squid meat),  50g\/1¾oz ginger, cut into very thin strips,  50g\/1¾oz sambal ,  handful coriander leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sour_squid_and_rice_84888"}