{"recipe_name":"Sourdough cod cheeks with spicy pea salsa","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02fjgs2.jpg","method":"For the cod cheeks, blend the bread to crumbs in a food processor, then add the lemon zest and pulse again to combine. Tip the mixture into a shallow bowl and clean the food processor. Sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Beat the eggs in a bowl.  In batches, dust the cod cheeks in the flour, then dip them in the beaten egg, then roll them in the breadcrumb mixture until completely coated. Place each breaded cod cheek on a plate. Cover with cling film and chill in the fridge until needed. For the salsa, blend the peas, mint, chillies, lime juice and crème fraîche in the food processor to a rough paste. Tip it into a serving bowl, cover and chill until needed. Heat the oil (and dripping, if using) in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.) Carefully lower the cod cheeks into the hot fat in batches, and fry for 2-3 minutes, or until golden-brown and cooked through. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining cod cheeks. To serve, pile the breaded cod cheeks onto a serving platter. Place the lemon wedges and the bowl of pea salsa alongside. ","ingredients":" 150g\/5½oz stale sourdough bread, roughly chopped,  1 unwaxed lemon, finely grated zest only, plus extra lemon wedges to serve,  75g\/2½oz plain flour,  3 free-range eggs, lightly beaten,  20 cod cheeks, cleaned, membranes removed (available from fishmongers or online specialists),  vegetable oil (or vegetable oil mixed with beef dripping), for deep-frying,  300g\/10½oz frozen peas, defrosted,  3 tbsp roughly chopped fresh mint leaves,  2 green chillies, de-seeded and roughly chopped,  2 limes, juice only,  100g\/3½oz crème fraîche,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sourdough_cod_cheeks_21373"}