{"recipe_name":"South Indian dry masala fish curry with tomato and coconut chutney","author":"The Hairy Bikers","programme":"The Hairy Bikers","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the fish, wash the fish and blot dry with kitchen paper.  In a mixing bowl combine the yoghurt, garam masala, mustard seeds, coriander, cumin, chilli, cardamom pods and salt. Add the fish and coat well with the yoghurt mixture. Cover with cling film and leave to marinate for about an hour. For the chutney, heat the oil in a saucepan, add the onion and cook until soft. Add the ginger, garlic, chilli, curry leaves and coconut. Cook for a couple of minutes, until the coconut is lightly browned. Add the tomatoes, sugar and balsamic vinegar. Simmer uncovered for about 20-30 minutes, until the chutney has thickened and reduced. To cook the fish, heat the oil in a frying pan, shake off the excess marinade from the fish and fry until golden, about 3-5 minutes each side depending on the thickness of the fish. Serve topped with warm chutney. ","ingredients":" 4 x 200g\/7oz white fish fillets (monkfish, haddock, hake, cod or similar),  3 tbsp plain yoghurt ,  2 tsp garam masala,  1 tsp black mustard seeds,  1 tsp ground coriander,  1 tsp ground cumin,  ½ tsp chilli powder,  6 cardamom pods, lightly crushed,  ½ tsp salt,  1 tbsp vegetable oil,  1 tbsp vegetable oil,  1 onion, finely chopped,  7.5cm\/3in piece root ginger, roughly chopped,  6 garlic cloves, finely chopped,  1 green chilli, finely chopped  ,  10 curry leaves (available from Asian grocers and some supermarkets),  1½ tbsp desiccated coconut,  1 x 400g\/14oz can tomatoes, chopped,  2 tsp sugar,  2 tsp balsamic vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/southindiandrymasala_85444"}