{"recipe_name":"South Indian fish sandwich","author":"Atul Kochhar","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to high. For the fish, mix together the chilli powder, ground coriander, ground turmeric, tamarind pulp and salt.  Rub the spice mix into the flesh side of the plaice fillets. Set aside to marinate. Meanwhile, for the crab mixture, heat the vegetable oil in a frying pan over a medium-high heat, then add the cumin, cardamom, bay leaf, cinnamon, cloves and black peppercorns (take care as the spices may spit). Fry for 2-3 minutes, or until the spices are toasted and fragrant and start to crackle.  Add the onions and fry for 4-5 minutes until lightly browned, then stir in the ginger-garlic paste and fry for 2-3 minutes.  Add the tomatoes, turmeric, coriander and chilli powder and fry for 8-10 minutes, until the tomatoes have reduced to form a thick sauce.  Stir in the crabmeat, season with salt, to taste, and sprinkle with the chopped coriander. Put the plaice fillets on a baking tray, skin-side down, and place under the hot grill. Cook for 1-2 minutes, until the flesh starts to become firm and opaque. Remove from the grill and top half of the plaice fillets with the crab mixture. Top with the remaining plaice fillets, skin-side up, to form a 'sandwich' (the skin of the plaice fillets should be on the outside).  Return to the grill for 3-5 minutes, turning once, until the fish is completely cooked and the skin is crisp and golden. To serve, place a fish sandwich onto the centre of each of four serving plates. Pile the tomatoes alongside and top with some cress. Whisk the vinegar, oil and turmeric together and drizzle around the fish. Serve at once. ","ingredients":" ½ tsp chilli powder,  1 tsp ground coriander,  ½ tsp ground turmeric,  2 tbsp tamarind pulp ,  pinch salt,  4 small plaice, filleted,  4 tbsp vegetable oil,  1 tsp cumin seeds,  2 green cardamom pods, crushed lightly with the back of a spoon,  1 bay leaf,  2.5cm\/1in piece of cinnamon stick,  3 cloves,  5 black peppercorns,  2 onions, chopped,  2 tbsp readymade ginger-garlic paste, or 1 tbsp finely chopped garlic and 1 tbsp grated ginger,  3 tomatoes, chopped,  ¼ tsp ground turmeric,  1½ tsp ground coriander,  ½ tsp chilli powder,  250g\/9oz fresh white crabmeat,  salt, to taste,  1 tbsp coriander leaves, finely chopped,  16 cherry tomatoes, halved,  1 punnet cress,  1 tsp balsamic vinegar,  1 tbsp extra virgin olive oil,  ¼ tsp ground turmeric","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/southindianfishsandw_89816"}