{"recipe_name":"Soy chilli steamed scallops with carrot and spinach noodles","author":"Ching-He Huang","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place 2 scallops on each scallop shell, sprinkle over the salt, white pepper and rice wine.  In a small bowl, combine all the scallop dressing ingredients.   Place the scallops on a stainless steel steamer rack that fits into a wok (or you can sit a heatproof plate on a bamboo steamer). Half-fill a wok with boiling water and rest the bottom of the steamer in the wok, making sure it doesn't touch the water. Cover with a lid and steam the scallops for 5-6 minutes. For the noodles, heat a wok and add half the oil. Once hot, add the garlic and chilli and cook for a few seconds. Add the carrot and cabbage and cook for 1 minute, keeping them moving in the pan all the time. Push the carrots to the front edge of the wok and add the remaining oil and the spinach,  stir fry for 10 seconds. Add the noodles and spring onions.  Mix all the sauce ingredients together until smooth, then add to the noodles. Toss well, making sure the sauce coats all of the noodles. Add a dash of sesame oil. Check the seasoning and add more soy sauce if needed. Place the noodles in the centre of a large plate.  Spoon the dressing over the scallops and garnish with fresh coriander. Place the scallops around the noodle plate and serve.  ","ingredients":" 8 queen scallops, removed from shells (reserve 4 shells),  4 very small pinches salt,  4 very small pinches ground white pepper ,  8 small drops Shaoxing rice wine, one drop over each scallop,  1 spring onion, washed and finely chopped ,  2½cm\/1in ginger, peeled and freshly grated ,  ¼ fresh red chilli, preferably Fresno or cayenne, seeds removed and finely chopped,  ½ small garlic clove, finely chopped,  3 tbsp low-sodium light soy sauce ,  2 tbsp lemon juice,  2 tsp toasted sesame oil ,  1 tbsp peanut or rapeseed oil,  1 garlic clove, finely chopped ,  ½ red chilli, seeds removed and finely chopped ,  60g\/2¼oz grated carrots,  40g\/1½oz white cabbage, shredded,  100g\/3½oz winter spinach, washed and drained,  300g\/10½oz rice noodles, soaked,  1 spring onion, washed and sliced lengthways to resemble blades of grass,  ½ cube doufulu (about 25-50g\/1-1¾oz. Also known as Chinese Soy cheese) or 1 tsp red miso,  2 tsp low-sodium light soy sauce ,  1 tsp doubanjiang (chilli bean paste),  1 dash toasted sesame oil ,  pinch sugar,  corainder leaves","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/soy_chilli_steamed_43826"}