{"recipe_name":"Soy-braised duck with greens and a parsnip and turmeric purée","author":"Dhruv Baker","programme":"MasterChef","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the duck, carefully carve the breasts away from each duck. Take off the legs, which can be reserved for another recipe. Score the skin on each breast with a sharp knife then set aside. Using a cleaver or heavy knife, chop the carcass into smaller pieces. Heat a large wok, add the sugar and, as it melts and begins to caramelize, add the galangal and garlic. Reduce the heat to low and cook for 4-5 minutes, taking care not to let the mixture burn. Carefully stir in the cold water (it will splutter a bit), then the soy sauce. Add the chopped duck carcass to the wok and bring to the boil. Stir in the stock and rice vinegar, then reduce the heat and simmer gently for 45-50 minutes, stirring occasionally.  For the parsnip puée, heat vegetable oil in a pan and add the galangal, lemongrass, turmeric, chilli and garlic. Cook gently for 4-5 minutes, then add the parsnips and cook for a further 2-3 minutes. Pour in the coconut milk and bring to the boil, then reduce the heat and simmer for 15-20 minutes, or until the parsnips are tender. Remove the galangal, lemongrass, one piece of turmeric and the chilli and discard.  Strain the parsnip mixture through a sieve, reserving the liquid. Place the parsnips and turmeric into a food processor along with a splash of the reserved cooking liquid and blend to a smooth  purée that holds its shape. Season, to taste, with salt and freshly ground black pepper. Strain mixture through a sieve, collecting the liquid in a bowl underneath. Puree parsnips in a blender, adding enough of the reserved cooking liquor to form a smooth mixture that will just hold it's shape. Spoon into a small pan, taste and season with salt and pepper.  Heat a large frying pan and add the duck breasts, skin-side down. Cook over a low heat for 8-10 minutes, or until most of the fat is rendered and the skin is golden-brown and crisp. Drain off the fat (it can be reserved for another recipe, such as making roast potatoes). Turn the duck over and add a ladleful of the simmering stock from the wok into the frying pan. Add enough so that three-quarters of the meat is covered without any liquid touching the skin. Cook for further 6-7 minutes, or until the duck is cooked but still slightly pink in the middle. Lift out onto a plate and set aside to rest in a warm place. Strain the remaining mixture in the wok through a sieve into the pan used to fry the duck, and bring to the boil. Cook until the liquid has reduced in volume by about two-thirds.  For the greens, heat the oil in a pan and fry the shallots for 4-5 minutes, or until softened but not coloured. Add the garlic and fry for a further minute. Scatter in the green tops of the pak choi and the spring greens. Stir fry for 2-3 minutes, then pour in the stock and bring to the boil. Season with salt and freshly ground black pepper and cook for a further 4-5 minutes, or until the greens are tender.  To serve, gently heat the parsnip purée through. Arrange the greens on serving plates, slice each duck breast lengthways into 1.5cm\/½in slices and fan out over the greens. Spoon the parsnip purée alongside and spoon over the reduced duck sauce. ","ingredients":" 2 Gressingham ducks,  2 tbsp sugar,  5 slices galangal,  3 garlic cloves, peeled,  400ml\/14fl oz cold water,  3 tbsp dark soy sauce,  800ml\/1 pint 9fl oz chicken stock,  1 tbsp rice vinegar,  1 tbsp vegetable oil,  3 slices galangal,  1 lemongrass stalk, tough outer leaves removed, gently bruised,  2 x 5cm\/2in  pieces fresh turmeric, peeled,  1 red chilli, halved,  1 garlic clove, finely chopped,  4 parsnips, peeled and chopped,  1 x 400ml\/14fl oz can coconut milk,  2 tbsp vegetable oil,  2 banana shallots, peeled, finely chopped,  2 garlic cloves, peeled, finely chopped,  4 heads pak choi, green leaves only,  400g\/14oz spring greens,  50ml\/2fl oz chicken stock,  2 tsp sesame oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/soybraisedduckwithgr_93815"}