{"recipe_name":"Spanish seafood stew","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Melt the butter in a large pan over a low heat. Add the shallots, garlic, leek, carrot, fennel and celery and gently fry for 10-12 minutes, until softened but not browned.  Add the tomato purée, tomatoes, white wine and brandy.  Bring to the boil and cook to reduce the liquid volume by half.  Add the bay leaf, fish stock and cream and bring up to the boil. Reduce the heat to a simmer and cook to reduce the volume by half. Add the cayenne pepper, paprika, potatoes, chunks of fish and shellfish, carrots and beans. Simmer for no more than five minutes, or until the fish is just cooked (depending on the fish of your choice). NB: if you are cooking clams, mussels or similar shellfish, discard any that have not opened during cooking. Add the parsley, tarragon and lemon juice and stir gently. To serve, pour into bowls and serve with crusty bread and garlic mayonnaise. ","ingredients":" butter, for frying ,  50g\/2oz shallots, chopped,  1 garlic clove, chopped,  1 leek, chopped,  1 carrot, chopped,  ½ fennel bulb, chopped,  2 celery sticks, chopped,  2 tbsp tomato purée,  4 tomatoes,  175ml\/6fl oz white wine,  50ml\/2fl oz brandy,  1 bay leaf,  750ml\/1¼ pints fish stock,  150ml\/5fl oz double cream,  pinch cayenne pepper,  1 tbsp smoked paprika,  12 new potatoes, cooked,  400g\/14oz assorted fish and shellfish, such as salmon, cod, clams, prawns,  2 carrots, sliced and boiled until tender,  100g\/3½oz fine beans, chopped and cooked,  handful fresh parsley, chopped,  sprig tarragon,  1 lemon, juice only,  crusty bread,  garlic mayonnaise","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spanishseafoodstew_85040"}