{"recipe_name":"Spice crusted sea bream","author":"Vivek Singh","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sea bream, preheat the oven to 200C\/180C Fan\/Gas 5. Line a baking tray with aluminium foil.  Slash the fish 2-3 times on each side using a sharp knife and rub in the salt, chilli powder, turmeric, ginger and garlic paste, carom seeds, nigella seeds and lemon juice. Set aside for a few minutes. To make the spice crust, heat the oil and add the chickpea flour, cook for 2-3 minutes as you would do for a roux. Remove from the heat, cool and set aside. Meanwhile, toast the cumin seeds, coriander seeds and peppercorns in a pan. Add the seeds to a pestle and mortar and grind. Mix the roasted chickpea flour, ginger and yoghurt into the spices. Apply the spice crust on both sides of the fish to form an even coating. Use the leftover spice mix to fill the belly of the fish.  Place the fish on the prepared tray and cook in the oven for 15-18 minutes until cooked through. After 6-8 minutes, turn the fish over and baste with the butter. If the skin is starting to colour too quickly reduce the oven temperature to 180C\/160C Fan\/Gas 4 and cover the fish with foil so that the spice crust doesn’t burn. Serve the fish with green salad and lemon wedges. ","ingredients":" 4 whole sea bream (350-400g\/12-14oz each), gutted, fins and tail trimmed,  1 tsp salt,  1½ tsp red chilli powder,  1 tsp ground turmeric,  1 tbsp ginger and garlic paste,  ½ tsp carom seeds (available online),  ½ tsp nigella seeds,  2 lemons, juice only,  4 tbsp clarified butter ,  1 tbsp vegetable or corn oil,  1 tbsp chickpea flour,  1 tbsp cumin seeds,  1 tbsp coriander seeds,  ½ tsp black peppercorns,  2½cm\/1in piece fresh root ginger, finely chopped,  2 tbsp Greek yoghurt (optional),  ½ tsp red chilli flakes,  ½ tsp salt,  1 tsp sugar,  50g\/1¾oz chopped fresh coriander,  green salad,  lemon wedges","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spice_crusted_sea_bream_48700"}