{"recipe_name":"Spice-crusted lamb with carrot, cumin and tomato salsa","author":"Tony Singh","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 3","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the lamb, place the coriander seeds, cumin seeds, cardamom seeds, chilli flakes, ground turmeric and salt and freshly ground black pepper into a mini food processor and pulse to a coarse mixture.  Roll the lamb chops in the spice mix, squeeze over the lemon juice and leave to marinate in a shallow dish for ten minutes in the fridge.  Heat the olive oil in a frying pan, add the lamb chops and fry for 2-3 minutes on both sides (for rare), or until golden-brown and cooked to your liking. Set aside to rest for five minutes. For the salsa, heat two tablespoons of the olive oil in a frying pan, add the carrot, sugar and cumin seeds and fry for 2-3 minutes, or until the carrot is lightly browned. Stir in the chopped tomato and squeeze over the lemon juice, then fry for 2-3 more minutes, or until the vegetables are tender. In another frying pan, heat the remaining olive oil and add the garlic, ginger and chilli and fry for 1-2 minutes, and then pour over the salsa. Set aside.  For the pilaf, heat the olive oil in a frying pan, add the onion and chilli and fry for 2-3 minutes, or until softened but not coloured. Add the ground turmeric, season with salt and freshly ground black pepper and fry for one minute.  Spoon the onions and chilli mixture into a deep ovenproof dish, add the rice and stock and stir well. Cover with aluminium foil and place into the oven to cook for ten minutes, or until all the water has been absorbed into the rice and the rice is tender.  Blanch the peas in a pan of boiling salted water for 2-3 minutes, drain and then add to the rice and stir in the butter. Grate the root ginger into a clean tea towel, then squeeze the ginger juice into the rice and stir well. Discard the ginger flesh.  To serve, divide the pilaf among three serving plates, top each mound of rice with a lamb chop and then drizzle over the salsa. ","ingredients":" 2 tsp coriander seeds,  2 tsp cumin seeds,  2 cardamom pods, seeds only,  pinch dried chilli flakes,  ½ tsp ground turmeric,  salt and freshly ground black pepper ,  3 lamb chops,  ½ lemon, juice only,  1 tbsp olive oil,  3 tbsp olive oil,  1 carrot, peeled, chopped,  1 tbsp soft brown sugar,  1 tsp cumin seeds,  2 tomatoes, de-seeded, chopped,  squeeze lemon juice,  1 clove garlic, finely chopped,  15g\/½oz fresh root ginger, finely chopped,  1 red chilli, de-seeded, finely chopped,  1 tbsp olive oil,  1 onion, finely chopped,  1 red chilli, de-seeded, finely chopped,  ¼ tsp ground turmeric,  salt and freshly ground black pepper ,  300g\/10½oz basmati rice,  600ml\/1 pint vegetable stock,  85g\/3oz fresh peas, out of their pods,  25g\/1oz butter,  25g\/1oz fresh root ginger, grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicecrustedlambwith_89132"}