{"recipe_name":"Blueberry pain perdu with sautéed blueberries and blueberry ice cream","author":"James Martin","programme":"Christmas Kitchen","prep_time":"over 2 hours","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ice cream, put the cream, milk and vanilla seeds and pod in a large saucepan and bring to a simmer. Whisk together the sugar and egg yolks in a large. Slowly add the warm cream to the eggs and whisk. Pour the mixture back in the saucepan and cook on a medium heat until thickened and coats the back of the spoon. Pour mixture into an ice cream machine. Just as it starts to set add the blueberries and mix. Pour into a freezer-proof container, cover the surface with cling film and freeze until hard. Meanwhile, for the blueberry pain perdu, preheat the oven to 180C\/160C Fan\/Gas 4. Grease a 20x30x3cm\/8x12x1in baking tray with butter and line with a sheet of baking parchment. In a bowl, beat together the butter and sugar until pale and fluffy. Crack in the eggs, one at a time, beating after each addition, until well combined. Fold in the flour by hand, then stir in the blueberries. Pour into the prepared tin and bake for 30-40 minutes, until cooked through (a skewer inserted into the centre should come out clean.) Set aside to cool in the tin. When cooled, cut it into 6 squares, trimming the edges if you like. For the sautéed blueberries, heat the blueberries and sugar in a saucepan over a medium heat, stirring continually. Cook until the blueberries have broken down, the sugar has dissolved in the juices, and the mixture has thickened. Just before serving, heat a little butter in a frying pan over a medium heat. Add the pain perdu slices in batches, and fry for 2 minutes on each side until golden-brown and heated through. To serve, divide the pain perdu slices equally among 4-6 serving plates. Top each with a scoop of ice cream, then spoon a few of the sautéed blueberries alongside. Dust with icing sugar. ","ingredients":" 300ml\/10fl oz double cream,  300ml\/10fl oz whole milk,  1 vanilla pod, seeds removed and keep the pod,  100g\/3½oz caster sugar,  4 egg yolks,  200g\/7oz fresh blueberries,  250g\/9oz unsalted butter, softened  ,  250g\/9oz caster sugar ,  4 eggs ,  250g\/9oz self-raising flour ,  ½ tsp vanilla extract,  250g\/9oz blueberries ,  knob of butter,  icing sugar, for dusting,  250g\/9oz blueberries,  100g\/3½oz caster sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blueberry_pain_perdu_53274"}