{"recipe_name":"Blueberry steamed sponge pudding","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02gs3r7.jpg","method":"For the pudding, grease a 1.2-litre\/2 pint heatproof pudding dish with butter. Pour the golden syrup into the bottom and scatter in the blueberries. Whisk together the remaining pudding ingredients in a bowl until light and fluffy. Carefully spoon the pudding mixture into the pudding dish. Cover the pudding dish with a large square of baking parchment, then cover that with a large square of aluminium foil. Tie the two sheets tightly into place under the rim of the bowl using cook's string, leaving long ends of excess string to make a handle. Loop one of the excess string lengths over the pudding basin and slide underneath the taut string, holding the sheets in place on the other side. Bring up the string and firmly knot with the other piece of excess string, to form a secure handle to lift the pudding in and out of the water.  Place a clean tea towel in the bottom of a large, heavy-based saucepan, then put an upside-down saucer or small plate on top of it. Half-fill the pan with water.  Sit the wrapped pudding dish on top of the saucer, making sure the string handle is easily accessible. Cover the pan with the lid and bring the water to the boil. Reduce the heat until the water is simmering and cook the pudding for 1½-2 hours. Meanwhile, for the custard, bring the milk, cream, vanilla pods and vanilla seeds gently to the boil in a saucepan.  Whisk the sugar and egg yolks in a bowl until pale and creamy.  When the milk mixture is just about to boil, pour it onto the egg mixture, whisking continuously until all of the liquid has been incorporated.  Return the mixture to the pan and cook over a low heat, whisking all the time, until the custard has thickened enough to coat the back of a wooden spoon.  Strain the custard into a clean pan and warm through very gently. When the pudding has cooked, lift it out of the pan using the string handle. Unwrap the pudding and discard the foil and baking parchment. Turn the pudding out onto a serving plate, then cut into wedges and serve with the custard. ","ingredients":" 175g\/6oz unsalted butter, softened, plus extra for greasing,  150g\/5½oz golden syrup,  200g\/7oz blueberries,  175g\/6oz golden caster sugar,  3 free-range eggs,  175g\/6oz self-raising flour,  1 tsp baking powder,  pinch salt,  250ml\/9fl oz full-fat milk,  250ml\/9fl oz double cream,  1 vanilla pod, split in half lengthways, seeds scraped out using a sharp knife,  110g\/3¾oz caster sugar,  6 egg yolks","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/blueberry_steamed_sponge_48910"}