{"recipe_name":"Spiced garlic king prawns with chickpea salad, peppers and coriander","author":"Paul Rankin","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the king prawns, heat the oil in a pan and fry the garlic with the turmeric, salt and pepper for a few minutes.  Transfer to a bowl and leave to cool. Add the prawns and mix together to combine. Leave to marinate for an hour. Once marinated for an hour, thread onto skewers and preheat the grill to high. Grill the prawns for about six minutes, turning occasionally. For the chickpea salad, heat the oil in a large pan and gently fry the onion for a few minutes. Add the ginger, spices, chilli and the peppers and cook until the peppers have softened.  Add the chickpeas, tomatoes, lemon juice and season well to taste. Warm for a few minutes and stir in the chopped coriander before serving. To make the garlic butter, fry the garlic and chilli gently in the butter. Add the curry powder, salt and pepper and cook until the garlic and chilli are softened.  To serve, spoon the chickpea salad onto serving plates. Arrange the prawns on top, serve the garlic butter drizzled over the prawns and drizzle with excess flavoured oil from cooking. Serve garnished with a sprig of coriander. ","ingredients":" 2 tbsp vegetable oil ,  2 garlic cloves, chopped,  ½ tsp ground turmeric,  salt and pepper,  12 raw king prawns, headless, shelled and cleaned,  1 lime, juice only,  4 sprigs fresh coriander,  2 tbsp vegetable oil,  1 small red onion, sliced,  1 tbsp ginger and garlic paste,  1 tsp chaat masala spice mix,  ½ tsp curry powder,  salt and pepper,  1 green chilli, finely chopped,  1 red pepper, seeds removed, finely sliced,  1 yellow pepper, seeds removed, finely sliced,  1 green pepper, seeds removed, finely sliced,  200g\/7oz tinned chickpeas, drained ,  2 vine tomatoes, diced,  1 lemon, juice only,  handful fresh coriander, chopped,  salt and freshly ground black pepper,  4 garlic cloves, crushed,  1 red chilli, finely diced,  75g\/2½oz butter,  ½ -1 tsp curry powder,  salt and pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spiced_garlic_king_26657"}