{"recipe_name":"Spiced poached pears with chocolate pudding","author":"Jun Tanaka","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4 and lightly grease four ramekins. For the chocolate pudding, melt the butter and chocolate in a large heatproof bowl sat above a pan of simmering water (do not allow the bowl to touch the water). Set aside to cool slightly. In a large bowl, whisk the caster sugar, egg yolks, honey and cornflour until pale, fluffy and thickened. Add the melted chocolate to the egg mixture and stir to combine.  In a separate bowl, whisk the egg whites until soft peaks form when you remove the whisk. Gradually add the caster sugar and continue to whisk until stiff peaks form. Fold the eggs whites into the chocolate mixture to combine. Spoon the mixture into the ramekins and bake in the oven for 8-10 minutes. For the poached pears, heat the sugar and 300g\/10½oz water in a saucepan, until the sugar has dissolved and a syrup forms. Add the star anise, saffron, lemon juice and cinnamon stick and infuse by placing over a gentle heat for 10 minutes. Add the pear wedges to the syrup and poach gently for 10-15 minutes, or until softened.  To serve, place a quenelle of crème fraîche on top of the warm chocolate puddings in their ramekins. Arrange a couple of pear wedges on top, drizzle with a spoon of the poaching liquor and dust with icing sugar.  ","ingredients":" 170g\/6oz unsalted butter, plus extra for greasing,  170g\/6oz dark chocolate (minimum 70% cocoa solids),  45g\/1¾oz caster sugar,  75g\/2½oz free-range egg yolks (3-4 yolks),  20g\/¾oz honey,  20g\/¾oz cornflour,  125g\/4½oz free-range egg whites (3-4 egg whites),  60g\/2¼oz caster sugar,  300g\/10½oz caster sugar,  2 star anise,  ½ tsp saffron,  1 lemon, juice only,  1 cinnamon stick,  2 pears, such as Rocha or Williams, peeled, cored and cut into wedges,  crème fraîche,  icing sugar, sifted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spiced_poached_pears_72634"}