{"recipe_name":"Spiced pork pie with cranberries ","author":"Jane Beedle","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Makes 1 large pie","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Grease a 900g\/2lb loaf tin with oil or lard and line with baking paper. For the filling, tip all the ingredients into a large mixing bowl apart from the chicken.  Mix together using your hands until well incorporated. Season generously with salt and pepper. Take a teaspoon of the mixture and fry until cooked. Taste to check the seasoning and add more salt and pepper if necessary.  For the pastry, put 200ml\/7fl oz water and the lard in a saucepan. Heat until the lard is melted, then bring to the boil.  Put the flour and salt in a large mixing bowl, pour in the melted lard mixture and stir well to combine using a wooden spoon. When cool enough to handle, knead in the bowl to form a smooth dough. Set aside a quarter of the dough and wrap in cling film.  Preheat the oven to 190C\/170C Fan\/Gas 5. On a lightly floured work surface, roll out the remaining dough to about 1cm\/½in thick. Use this to line the loaf tin, making sure that any tears or gaps in the pastry are filled. Roll out the reserved pastry to make the pie lid. Fill the tin with alternating layers of the sausagemeat mixture and chicken slices. Cover with the lid and pinch the edges to seal. Cut off any excess pastry and make a hole in the middle of the lid using a sharp knife.  Brush the top of the pie with egg wash and bake for 1 hour 15–20 minutes. The pies are cooked when the centre of the meat filling reaches 74C on a meat thermometer and the pastry is deep, golden-brown. Leave to cool completely in the tin.  ","ingredients":" 1 large onion, finely grated,  knob of butter, melted,  75g\/2½oz fresh white breadcrumbs ,  125g\/4½oz smoked streaky bacon, finely chopped,  340g\/11¾oz sausagemeat with black pepper and nutmeg,  1½ garlic cloves, finely chopped,  60g\/2¼oz dried cranberries, roughly chopped,  3 chicken stock cubes (Jane used OXO), crumbled,  1½ tsp dried thyme,  ½ – 1 tsp allspice ,  ½ unwaxed lemon, zest only,  1 chicken breast, skin removed and cut into 1cm\/½in-thick slices ,  salt and freshly ground black pepper,  200g\/7oz lard,  575g\/1lb 4½oz plain flour,  1½ tsp salt,  oil or lard, for greasing,  1 free-range egg, beaten for egg wash,  fresh bay leaves, to decorate","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spiced_pork_pie_with_00059"}