{"recipe_name":"Spiced pumpkin and beetroot cake with cream cheese frosting","author":"Ed Baines","programme":"Country Show Cook Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 1 cake","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat oven to 180C\/350F\/Gas 4.  Butter and line a 30x20cm\/12x8in rectangular baking tin with baking parchment. Place the flour, sugar, spice, bicarbonate of soda, sultanas and salt into a large bowl and stir to combine.  Beat the eggs with a touch of caster sugar, then beat into the melted butter, stir in the orange zest and juice and golden syrup and then mix with the dry ingredients until combined. Stir in the pumpkin and beetroot. Pour the batter into the tin and bake for 30 minutes, or until golden-brown and springy to the touch. For the frosting, beat together the cream cheese, butter and one-third of the icing sugar until smooth and creamy and set aside.  Place the egg whites and the remaining icing sugar into a bowl suspended over a pan of simmering water, ensuring the bottom of the bowl does not touch the water.  Heat the egg whites, whisking with an electric whisk until thick and glossy. Remove from the heat and continue to whisk until the mixture is cooled and very firm. Then whisk in the cream cheese mixture a little at a time.  When the cake is done, let it cool for five minutes then turn it onto a cooling rack.  Heat the orange juice and golden syrup. Prick the cake all over with a skewer and drizzle with the orange syrup while the cake is still warm, then leave it to cool completely.  Using a palette knife spread the frosting over the top the cake. Decorate with the orange zest, and serve.  ","ingredients":" 300g\/10½oz self-raising flour,  300g\/10½oz light muscovado sugar ,  3 tsp mixed spice,  2 tsp bicarbonate of soda,  175g\/6oz sultanas soaked in 1 tbsp dark rum for 20 minutes, then drained,  ½ tsp sea salt,  4 free-range eggs, beaten,  ½ tsp caster sugar,  200g\/7oz butter, melted and cooled,  1 orange, zest only,  1 tbsp orange juice,  1 tbsp golden syrup,  100g\/3½oz grated beetroot, a mixture of yellow and striped varieties,  400g\/14oz (peeled weight) pumpkin or butternut squash, grated,  200g\/7oz cream cheese, softened,  85g\/3oz butter, softened,  100g\/3½oz icing sugar, sifted,  3 free-range eggs, whites only (use pasteurised egg whites if serving to pregnant women, children or the elderly),  1½ oranges, zest and juice,  2 tbsp golden syrup","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spiced_pumpkin_and_99913"}