{"recipe_name":"Spiced red wine strawberry compôte ","author":"Michel Roux Jr.","programme":"Great British Food Revival","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the compôte, tie the cinnamon stick, cloves, cardamom pods and mace up in a small piece of muslin. Bring all of the ingredients, except the strawberries, to the boil in a saucepan. Boil for 10 minutes, then set aside to cool for 30 minutes.  Strain the liquid into a clean saucepan, add the strawberries and simmer for 2-3 minutes, or until the strawberries are soft. Carefully strain the liquid into a saucepan and set the strawberries aside. Continue to boil the liquid until the volume has reduced by two-thirds. Pour the liquid onto the reserved strawberries, cover and set aside to cool. Chill in the fridge overnight. Meanwhile, for the palmier biscuits, sprinkle sugar onto the work surface (instead of flour) and roll the pastry to a rectangle about 5mm\/¼in thick.  Sprinkle the remaining sugar over the pastry, then roll the two longest sides tightly towards each other until they meet in the middle. Chill in the fridge for 30 minutes. Preheat the oven to 180C\/350F\/Gas 4. Cut the pastry into 5mm\/¼in slices and place, cut-side up onto a baking tray. Bake for 7-8 minutes, or until golden-brown, then use a palette knife to turn the biscuits over and cook for a further 7-8 minutes. Remove from the oven and carefully transfer to a wire rack to cool. To serve, spoon the compôte into glasses or bowls and serve the biscuits alongside. ","ingredients":" 1 cinnamon stick,  2 cloves,  2 cardamom pods, cracked,  2 blades mace,  750ml\/1⅓ pint red wine,  1 tsp cinnamon,  1 vanilla pod, split,  1 dried chilli,  200g\/7oz caster sugar,  1 fresh bay leaf,  1 orange, zest and juice,  500g\/1lb 2oz strawberries, hulled,  100g\/3½oz caster sugar,  300g\/10½oz puff pastry","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spiced_red_wine_79803"}