{"recipe_name":"Spiced rice pudding with prune and Marsala compôte","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p017xxnt.jpg","method":"To prepare the prunes, gently heat the Marsala, brandy, orange juice and sugar in a small saucepan, stirring until the sugar dissolves. Add the prunes and orange zest and bring to a gentle simmer.  Cook for five minutes, or until the liquid has reduced by half, stirring occasionally. Remove from the heat and leave to stand while you prepare the rice. (The compôte can also be made ahead and chilled.) To make the rice pudding, put the rice, 1 litre\/1¾ pints of the milk and the cinnamon stick in a large non-stick saucepan and finely grate the nutmeg over the top. Stir lightly and bring to a very gentle simmer. Cook for 20 minutes, stirring very regularly until the rice is looking thick and creamy. Stir in the sugar, remaining milk and mixed peel. Return to a gentle simmer and cook for a further 35-40 minutes, or until the rice is very tender and creamy. Stir well towards the end of the cooking time as the rice thickens. Taste a little of the rice and if it is still a little hard or chalky in the middle, continue cooking for 5-10 minutes more, adding a little more milk or water if necessary. While the rice is cooking, shake the almonds into a small frying pan and fry-fry over a low heat for 3-4 minutes, turning occasionally until lightly browned. Stir a pinch of flaked sea salt into the rice pudding. Remove the cinnamon stick and pour the rice pudding into a warmed serving dish. Spoon the prunes and their syrup into the centre of the pudding and scatter the toasted almonds on top. Serve with extra double cream for pouring. ","ingredients":" 150ml\/5fl oz Marsala wine,  1 tbsp brandy ,  1 orange, freshly squeezed juice only,  25g\/1oz golden caster sugar,  150g\/5½oz no-soak dried prunes,  1 orange, finely grated zest only,  150g\/5½oz pudding rice,  1.5 litres\/2½ pints full-fat milk,  1 cinnamon stick ,  ½ whole nutmeg,  50g\/1¾oz golden caster sugar,  25g\/1oz cut mixed peel,  20g\/¾oz flaked almonds,  pinch flaked sea salt,  double cream, for pouring, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spiced_rice_pudding_with_32399"}