{"recipe_name":"Spiced roast pheasant with pumpkin, homemade granola and bread sauce","author":"Jason Atherton","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the granola, preheat the oven to 180C\/350F\/Gas 4.  Line a baking tray with baking parchment. Put the nuts into a large bowl and combine with the oats, coconut and cinnamon.  Make a well in the centre of the dry mixture and add the honey, maple syrup and oil.  Mix until thoroughly coated, then spread the mixture on to a lined baking tray.   Bake for about 10 minutes, then give the granola a stir and return to the oven for another 10 minutes, or until it is toasted and golden-brown.   Remove from the oven and stir in the dried fruit, breaking up any large pieces if you wish. Cool completely and store in an airtight container until ready to eat. For the spiced roasted pheasant with pumpkin and bread sauce, preheat the oven to 200C\/400F\/Gas 6. To prepare the pheasant, remove the legs and wings and discard (they can be stored in the fridge and used in a different recipe, or for stock).  In a large pan, poach the remaining crown in the chicken stock with the rosemary, bay leaves and thyme until the pheasant is cooked through (about 10-15 minutes). Remove from the heat and let it cool in the stock.   Lift the pheasant crown from the poaching liquid and drain. When cool enough to handle remove the breasts. Heat a tablespoon of the oil in a frying pan, then add the crushed garlic. Fry the pheasant until golden-brown all over, then set aside to rest in a warm place. Heat the remaining oil in an ovenproof frying pan set over a medium heat.  Season the pumpkin wedges with salt and pepper, then fry them with the ginger for about 4-6 minutes, or until golden-brown on both sides.  Place the pan into the oven, on a lower shelf, and roast for 10-15 minutes, or until the pumpkin is just tender. Meanwhile make the bread sauce. Melt the butter in a pan and add the shallots and a bit of salt and pepper.  Gently fry the shallots for about 6-8 minutes, stirring often, until they are soft. Add the whole garlic cloves, milk and cream. Bring the liquid to a simmer and cook for five minutes.  Add the diced bread and simmer for a few more minutes, or until the bread is soft.  Transfer to a food processor and blend until smooth. Season, to taste, with salt and pepper. Spoon the bread sauce into an espuma\/gas gun and charge. (Alternatively you can serve the sauce as it is.) To serve, carve the pheasant breasts on the diagonal and divide between warmed plates with the roast pumpkin, bread sauce and homemade granola. ","ingredients":" 60g\/2¼oz pecans, roughly chopped,  50g\/1¾oz blanched hazelnuts, roughly chopped,  250g\/9oz rolled oats,  50g\/1¾oz desiccated coconut,  ½ tsp ground cinnamon,  3 tbsp clear honey,  3 tbsp maple syrup,  2 tbsp vegetable or groundnut oil,  50g\/1¾oz golden raisins, roughly chopped,  50g\/1¾oz dried cherries,  50g\/1¾oz dried apricots, roughly chopped,  4 pheasants, cleaned and prepared,  600ml\/20fl oz chicken stock,  2 large sprigs rosemary,  2 bay leaves ,  ¼ bunch fresh thyme,  2 tbsp olive oil ,  3 garlic cloves, 2 peeled and left whole, 1 crushed,  800g\/1lb 12oz pumpkin, peeled, seeds removed and sliced into wedges,  pinch ground ginger or freshly grated root ginger,  salt and pepper,  50g\/1¾oz butter,  1 shallot, sliced,  200ml\/7fl oz whole milk ,  400ml\/14fl oz double cream,  75g\/2½oz sourdough (about 3-4 slices), crusts removed, diced,  75g\/2½oz white bread (about 3-4 slices), crusts removed, diced,  4-6 tbsp homemade granola, see above","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spiced_roast_pheasant_66233"}