{"recipe_name":"Spiced tuna patties with crushed black olives and spring onion flatbread","author":"Chris Fearon","programme":"Great British Budget Menu","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the flatbreads, sieve the flour into a mixing bowl, add a good pinch of salt and pepper, the finely shredded spring onions, one tablespoon olive and enough of the warm water to make a stiff dough. Knead it all together in the bowl and then transfer to a floured work surface and knead for another 2-3 minutes. Cover and leave to rest for 20 minutes while you prepare the rest of the dish. For the tuna patties, mix the tuna, bread, one tablespoon of the olive oil, chilli flakes, English mustard and the spring onions together in a bowl. Add a tablespoon of water to bring together, and mix with your hands, pressing between your hands as you mix. Form into eight small patties and place in the fridge to firm up slightly while you finish the flatbreads. Divide the flatbread mixture into four balls and roll each ball out thinly on a floured work surface. Heat a large frying pan over a medium heat and cook the flatbreads one by one in the dry pan until golden-brown and puffed up slightly on each side (about 2-3 minutes each side). Remove and keep warm while you cook the rest. Once they are all cooked, keep warm. In the pan you cooked the flatbreads add two tablespoons of olive oil and once hot, fry the tuna patties on either side for 3-4 minutes or until browned and hot all the way through. To serve, divide the crushed olive paste and spread it onto the flatbreads. Place two of the tuna patties in each flatbread. Roll up and serve. ","ingredients":" 200g\/7oz plain flour, plus extra for dusting ,  3 spring onions, trimmed and finely sliced,  1tbsp olive oil,  100-125ml\/3½-4fl oz warm water,  salt and pepper,  2 x 185g\/6oz tinned tuna, drained,  200g\/7oz bread, crusts removed, broken into small crumbs,  3 tbsp olive oil,  ½ tsp chilli flakes,  ½ tsp English mustard,  2 spring onions, trimmed and very finely chopped,  185g\/6oz pitted black olives, very finely chopped, and crushed with the side of your knife to a paste","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spiced_tuna_patties_with_48643"}