{"recipe_name":"Spiced chicken dumpling soup","author":"Bill Granger","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dumplings, put the minced chicken, bamboo shoots, ginger, chilli, coriander, fish sauce and cornflour into a large bowl. Season with salt and freshly ground black pepper.  Using clean hands, mix all the ingredients together until well combined. Wet your hands and roll the mixture into small balls; set aside. For the soup, put the chicken stock, coconut milk, kaffir lime leaves (or lime zest) and ginger slices into a large saucepan and bring to a simmer.  Reduce the heat to low, add the dumplings and simmer gently for five minutes, or until just cooked through.  Stir in the fish sauce, lime juice and sugar, to taste.  Add the pak choi and rice noodles, bring back to a simmer and remove from the heat. To serve, ladle the soup into serving bowls, dividing the dumplings evenly. Serve immediately, scattered with the chilli slices, coriander leaves and shredded kaffir lime leaves. ","ingredients":" 350g\/13oz minced chicken ,  60g\/2½oz canned bamboo shoots, drained and finely chopped,  2 tsp freshly grated root ginger,  1 long red chilli, seeds removed, finely chopped,  2 tbsp chopped coriander leaves,  2 tsp fish sauce,  2 tbsp cornflour,  salt and freshly ground black pepper ,  800ml\/1 pint 8¾fl oz chicken stock,  350ml\/12fl oz coconut milk,  2 kaffir lime leaves (or 2 pieces lime zest),  3cm\/1.2in piece fresh root ginger, peeled and thinly sliced,  1 tbsp fish sauce,  1 tbsp lime juice,  ½ tsp caster sugar, or to taste,  4 baby pak choi, halved lengthways,  60g\/2½oz rice noodles, soaked in water for 30 seconds and drained,  2 sliced red chillies,  8 sprigs fresh coriander ,  2 kaffir lime leaves, finely sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicedchickendumplin_91221"}