{"recipe_name":"Spiced duck breast with sweet and sour plums and rainbow rice","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the spiced duck breast, mix together the ginger, cinnamon and salt in a small bowl and rub the mixture into the skin of the duck. Place the duck skin-side down into a small ovenproof frying pan and place over the heat. Sear the duck all over, then add the plum and baby sweetcorn to the pan. Transfer to the oven and roast for 8-10 minutes, or until the duck is cooked to your liking. Remove from the oven and transfer the duck, plums and sweetcorn from the pan to a plate. Cover and set aside to rest in a warm place. Discard some of the fat from the pan and place back on the heat. Pour in the red wine and bring to a simmer, scraping up the bits from the bottom of the pan. Stir in the honey and soy sauce. Stir in the butter and return the plums to the sauce. Meanwhile, for the rainbow rice, place the basmati rice into a small saucepan and cover with cold water. Bring to the boil and simmer for four minutes. Add the chopped carrots, broccoli and sweetcorn to the pan and continue to cook for a further 4-5 minutes, or until the rice is cooked and the vegetables are tender. Drain off any excess liquid, then pack the rice mixture into a deep ramekin and flatten off the top. To serve, turn the rice out onto a serving plate. Slice the duck and arrange it next to the rice. Serve with the roasted sweetcorn and drizzle over the plum sauce from the pan. ","ingredients":" 1 tsp ground ginger,  1 tsp ground cinnamon,  ½ tsp salt,  ½ duck breast, skin scored with a sharp knife,  1 plum, quartered,  4 baby sweetcorn, cut in half lengthways,  75ml\/2½fl oz red wine,  1 tbsp clear honey,  1 tsp soy sauce,  55g\/2oz butter,  100g\/3½oz basmati rice,  3 baby carrots, chopped,  3 florets Tenderstem broccoli, chopped,  4 baby sweetcorn, chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicedduckbreastwith_88560"}