{"recipe_name":"Spiced fish tagine","author":"Tom Kime","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the ras-el-hanout, mix all of the ras-el-hanout ingredients together until well combined. Grind in a spice grinder or coffee grinder to a fine powder. Store in an airtight jar.  For the tagine, heat a terracotta tagine or heavy-based, lidded casserole over a medium to high heat.   Heat the oil in the tagine or casserole, then add the garlic and fry for 3-4 minutes, or until pale golden-brown.  Add the onions and reduce the heat, then cook the onions slowly for 10-12 minutes, or until softened but not coloured. When the onions have softened, push them to one side of the tagine or casserole, then increase the heat slightly and add the cumin seeds, ras-el-hanout and cayenne pepper to the empty side of the casserole. Fry for 1-2 minutes, or until fragrant, then stir the spices into onion mixture until they coat the onions. Add the chopped tomatoes and season, to taste, with salt and freshly ground black pepper. Bring the mixture to a simmer, then cook for 1-2 minutes, stirring well. Add the fish stock or water, then return the mixture to a simmer.   Add the plaice fillets to the tagine or casserole, then spoon over some of the sauce to cover the fish. Cover the tagine or casserole with the lid, then reduce the heat to low and continue to cook for eight minutes, or until the plaice fillets are cooked through. Meanwhile, for the couscous, place the couscous, olive oil and lemon juice into a bowl. Pour over the boiling water, stir once, then cover the bowl tightly with cling film. Set aside for five minutes, or until the couscous has absorbed all of the water, then fluff the couscous grains with a fork. Stir the chopped pistachios, pomegranate seeds and coriander into the couscous until well combined, then season, to taste, with salt and freshly ground black pepper. Just before serving, squeeze the lemon juice over the plaice tagine, then sprinkle over the coriander leaves. To serve, divide the couscous equally among four to six serving plates. Place one plaice fillet on top of each serving, then spoon over the remaining tagine. ","ingredients":" 2 tsp ground cinnamon,  1 tsp ground turmeric,  1 tsp coriander seeds ,  ½ tsp freshly ground black pepper,  ¼ tsp freshly grated nutmeg, or to taste,  ¼ tsp freshly ground cardamom seeds,  ¼ tsp freshly ground cloves,  2-3 tbsp olive oil,  2 garlic cloves, peeled, finely chopped ,  3 onions, peeled, finely sliced ,  1 tsp cumin seeds ,  2 tsp freshly ground ras-el-hanout (see above),  ½ tsp cayenne pepper,  3 ripe tomatoes, seeds removed, roughly chopped,  salt and freshly ground black pepper,  110ml\/4fl oz fish stock or water,  4-6 plaice fillets, skin removed,  200g\/7oz couscous,  1 tbsp olive oil,  ½ lemon, juice only,  250ml\/9fl oz boiling water,  50g\/2oz pistachio nuts, roughly chopped,  4 tbsp pomegranate seeds,  2 tbsp chopped fresh coriander leaves,  salt and freshly ground black pepper,  1 lemon, juice only,  4 fresh coriander sprigs, leaves only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicedfishtaginewith_93037"}