{"recipe_name":"Spiced orange chargrilled tofu with roasted vegetables, rice timbale and citrus dressing","author":"Nick Nairn","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. For the marinated tofu, mix all the marinade ingredients together in a bowl and add the tofu pieces. Allow it to soak up the flavours for 5-10 minutes or longer if possible.  Heat a griddle pan until smoking. Add the tofu and chargrill for 5-8 minutes, turning to ensure all sides are crisp before removing from the pan (you may need to tod this in batches). Heat the oil in a pan and fry the pepper and mushrooms in the oil for 3-4 minutes. Season, to taste, with salt and freshly ground black pepper.  Transfer to a baking tray, then roast in the oven for 4-5 minutes. For the rice, melt the butter into the hot cooked rice and pack into a metal dariole mould. Invert onto a serving plate and remove the mould. For the dressing, combine all the ingredients in a bowl and mix well. Serve the chargrilled marinated tofu on top of the timbale of buttered rice, with the roasted veg arranged around the edge of the plate and the dressing spooned over the top. ","ingredients":" 2 tbsp olive oil,  pinch chilli flakes,  2 garlic cloves, crushed,  salt and freshly ground black pepper,  1 orange, zest only,  1 lime, zest only,  55g\/2oz block tofu, cut into 2.5cm\/1in pieces ,  3 tbsp olive oil,  ¼ red Romero pepper, chopped,  3 chestnut mushrooms,  salt and freshly ground black pepper,  85g\/3oz basmati rice, cooked according to packet instructions,  15g\/½oz butter,  2 tbsp extra virgin olive oil,  ½ lemon, juice only,  1 garlic clove, crushed,  3 tbsp chopped fresh parsley","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicedorangechargril_92510"}