{"recipe_name":"Spiced pork burgers","author":"Tony Tobin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"In a frying pan, heat the olive oil and add the onions, garlic, coriander, cumin, chilli powder and peppercorns. Cook for two minutes on a medium heat. Cool the onion and garlic mixture and transfer to a mixing bowl with the pork mince and fat, sage and eggs. Mix well and season with salt and freshly ground black pepper. Using your hands, shape the mixture into four large patties about 2-3cm (1inch) thick. In a heavy frying pan, cook the patties in a little olive oil on a medium heat for three minutes each side or until the meat is cooked all the way through. While the burgers are cooking, preheat the grill to hot. Grill the pineapple for a minute, and then add two slices of gruyère to each ring. Grill for a further 30 seconds, until the cheese has melted. Slice the hamburger buns in half and toast the four halves on both sides. To construct the burger, place a small amount of rocket on each half bun, followed by slices of tomato, a pork burger and a cheesy pineapple ring. Mix the mayonnaise and the chilli together and drizzle. Serve with onion rings. ","ingredients":" 2 tbsp olive oil, plus extra to fry the burgers,  1 small onion, finely chopped,  2 garlic cloves, crushed,  1 tsp coriander powder,  1 tsp cumin powder,  1 tsp chilli powder,  1 tsp pink peppercorns, crushed,  600g\/1¼lb pork mince,  200g\/6½oz pork fat, minced,  1 tbsp chopped fresh sage,  2 free-range eggs,  salt and freshly ground black pepper,  4 rings fresh pineapple,  8 thin slices gruyère,  2 hamburger buns,  50g\/2oz rocket,  2 vine-ripened tomatoes,  100ml\/3½fl oz mayonnaise,  1 tsp chillies, finely chopped,  onion rings, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicedporkburgers_83919"}