{"recipe_name":"Spiced roast leg lamb with paprika and ginger crust","author":"Roopa Gulati","programme":"Saturday Kitchen","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the the lamb marinade, combine the spices and moisten with wine vinegar. Rub over the lamb. Set aside in a cool place for 3-4 hours. Heat oil in a roasting tin until very hot. Add lamb to the tin with peeled garlic head and baste well with hot oil before and during roasting.  Cook in a preheated oven, 200C\/ 400F\/ Gas 6, for about 1 ½ hours or until the meat juices run faintly pink when pierced. Continue to baste. Remove lamb from the tin and allow to stand whilst making the gravy. For the gravy, ring the brown stock, garlic cloves, green chilli, cinnamon stick and coriander seeds to a simmer. Put in the roasting tin that the lamb was in, over a medium flame. Pour in the  ricard  stirring well to lift any sediment from the bottom of the tin. Strain the brown spice stock. Add the strained spiced stock and bring to a simmer and cook for 10 minutes. Meanwhile, roast fennel seeds on a heavy griddle or  tawa  until they darken and set aside. Strain gravy into a saucepan pressing well to extract maximum flavour from the garlic. Stir the roasted fennel seeds into gravy. Mix the butter and flour together and whisk into the boiling gravy to slightly thicken. Simmer for 3-4 minutes and re-season before serving with the spiced roast lamb. ","ingredients":" 1 x 2kg leg lamb,  1 tsp ginger powder,  1 tsp cracked peppercorns,  1.25ml\/¼tsp mild chilli powder,  1 tsp mustard powder,  3ml\/¾tsp turmeric,  3 tbsp white wine vinegar,  2.5ml\/½ tsp salt,  1 whole head of garlic (unpeeled),  4 tbsp olive oil,  350ml\/12flloz brown stock ,  3 garlic cloves,  1 whole green chilli ,  2.5cm\/1in cinnamon stick,  1.25ml\/2¼tsp whole coriander seeds,  2 tsp whole fennel seeds,  100m\/3.5fl oz ricard,  2 tsp butter,  2 tsp flour,  salt and freshly ground black pepper ,  You will need a large roasting tin for this recipe","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicedroastleglambwi_9977"}