{"recipe_name":"Spiced sea bass fillet with citrus and rocket couscous and caramelised orange vinaigrette","author":"Tony Tobin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the couscous, place the couscous in a large heatproof bowl and add the fruit juices and boiling water and leave to stand while the couscous absorbs the liquid. Once the couscous has absorbed the liquid, add the orange, lime and lemon zests, red onion, rocket and tomatoes and mix well. For the dressing place the orange zest and sugar into a frying pan over a medium heat and cook for 4-5 minutes, until brown and caramelised. Add the orange segments and cook for a further 2-3 minutes, stirring gently, until the orange is beginning to colour.  Add the remaining dressing ingredients, stir well and remove from the heat. For the fish, dust the sea bass with the curry powder, and the skin with a sharp knife.  Heat a large frying pan over a medium heat and add the oil. Add the sea bass fillet to the pan, skin-side down, and fry for two minutes. Turn the fillet over and cook for a further 30 seconds, or until cooked through. To serve, place the couscous mixture onto a dish. Place the sea bass on the pile of couscous, drizzle the dressing over the fillet and sprinkle with chives. ","ingredients":" 100g\/3½oz couscous,  1 orange, juice only,  1 lime, juice only,  1 lemon, juice only,  200ml\/8fl oz boiling water,  1 orange, zest only,  1 lime, zest only,  1 lemon, zest only,  ½ red onion, finely chopped,  1 handful cherry tomatoes, deseeded and finely chopped,  handful rocket, finely chopped,  1 orange, zested and segmented,  2 tbsp sugar,  ½ orange, juice,  1 tbsp white wine vinegar,  3 tbsp olive oil,  170g\/6oz piece of sea bass fillet,  1 tsp curry powder,  1 tbsp oil,  2 tsp finely chopped fresh chives","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicedseabassfilletw_79882"}