{"recipe_name":"Spiced tuna salad Niçoise","author":"James Martin","programme":null,"prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 220C\/400F\/Gas 7. Spread the apricot jam over the tuna pieces. Place the ground cumin and coriander into a bowl and mix to combine, then place the tuna into the spices. Roll to coat and leave to marinate for 20 minutes. Heat an ovenproof frying pan until hot then add the tuna. Cook on each side for 15-20 seconds, just to lightly brown the tuna. Transfer to the oven to roast for 3-4 minutes, until just cooked but still pink in the centre, or until cooked to your liking. Meanwhile, for the dressing, place the garlic, anchovies and egg yolk into a pestle and mortar and pound to a paste. Add the lemon juice and the olive oil, and mix well.  Add the mustard and season, to taste, with salt and freshly ground black pepper. To assemble the salad - place the beans, potatoes, olives and eggs into a bowl, add the dressing and mix well. Transfer onto a serving plate, cut the tuna in half and place on top. Rub the toasted baguette slices with the garlic clove, then top with the tomatoes. Place the tomato toasts around the edge of the salad and serve. ","ingredients":" 4 tbsp apricot jam,  400g\/14oz fresh tuna steak,  2 tsp ground cumin seeds,  2 tsp ground coriander,  ½ clove of garlic,  2 tinned anchovy fillets,  1 free-range egg yolk,  ½ lemon, juice only,  110ml\/4oz olive oil,  1 tsp Dijon mustard,  salt and freshly ground black pepper,  110g\/4oz French beans, blanched, refreshed and cut in half,  8 new potatoes, boiled until tender,  10 black olives,  8 quails eggs, boiled for 2½ minutes, peeled,  1 small baguette, thinly sliced and toasted,  1 garlic clove,  10 cherry tomatoes, roasted for 3-4 minutes","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicedtunasaladnicoi_84425"}