{"recipe_name":"Spicy chicken calabrese with olive oil mash","author":"Francesco Mazzei","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Place the flour in a bowl and season with salt and freshly ground black pepper. Lightly coat the chicken thighs in the seasoned flour.  Heat the oil in a large frying pan over medium heat and add the chicken, cooking until golden brown on all sides.  In a separate ovenproof pan, gently fry the shallots and n’duja for a few minutes.  Add the chopped peppers, passata and the chicken stock.  Bring to the boil before adding the cooked chicken, chilli and chopped herbs. Stir to combine, then remove the pan from the heat. Taste for seasoning and add salt and freshly ground pepper as necessary.  Transfer the pan to the oven and bake for approximately 20 minutes.  For the mash, place the potatoes into a large saucepan and cover with water. Add a pinch of salt and bring to the boil. Continue to cook for 10-15 minutes until tender. Drain well and return the potatoes to the dry pan for a few seconds to steam and dry off a little. Using a potato masher, mash well, gradually adding the olive oil. Season generously with salt and freshly ground black pepper. To serve, place a bed of olive oil mashed potatoes on each serving plate and place a couple of the chicken pieces on top. Serve hot.  ","ingredients":" 2 tbsp plain flour,  salt and freshly ground black pepper,  8 chicken thighs,  10ml\/2 tsp extra virgin olive oil,  20g\/1oz chopped shallots,  100g\/3½oz 'nduja (spreadable spicy pork sausage),  6 peppers, 2 red, 2 yellow, 2 green, all roughly chopped,  100ml\/3½fl oz tomato passata ,  400ml\/14fl oz chicken stock ,  1 large chilli, finely chopped ,  small bunch fresh marjoram, chopped,  small bunch fresh chives, chopped,  small bunch fresh parsley, chopped,  1 kg\/2lb 4oz King Edward potatoes (peeled and cut into chunks) ,  80ml\/5 tbsp extra virgin olive oil ,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicy_chicken_calabrese_32417"}