{"recipe_name":"Spicy chilli con carne with guacamole","author":"Lorraine Pascale","programme":"The Hairy Bikers and Lorraine Pascale: Cooking the Nation's Favourite Food","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/spicy_chilli_con_carne_58238_16x9.jpg","method":"For the chilli con carne, heat the oil in a medium frying pan over a low heat. Add the onion and fry for 4-5 minutes, or until it is beginning to soften. Add the garlic and fry for a further 1-2 minutes, stirring regularly. Stir in the bay leaves, rosemary, cumin, chilli (if using) and chilli powder (to taste) until well combined. Increase the heat to high and add the beef mince, breaking it up with a wooden spoon and frying for 4-5 minutes, or until golden-brown throughout.  Pour in the tinned tomatoes, honey and red wine (or stock), stir well and bring the mixture to the boil. Reduce the heat until the mixture is simmering and simmer for 25-30 minutes, seasoning, to taste, with salt and freshly ground black pepper, halfway through cooking.  Meanwhile, for the avocado salsa, mix the diced avocado, onion and cucumber together in a bowl until well combined. Season, to taste, with salt and freshly ground black pepper and a squeeze of lemon juice. Garnish with the coriander leaves, if using.   Serve the chilli con carne with the salsa and steamed rice. Finish with more chopped coriander, if using. ","ingredients":" drizzle olive oil,  1 large onion, very finely chopped,  2 garlic cloves, very finely chopped,  2 bay leaves,  2 sprigs fresh rosemary, leaves only, very finely chopped,  2 tsp ground cumin,  1 red chilli, chopped (optional),  1-3 tsp chilli powder, to taste,  500g\/1lb 2oz lean beef mince,  1 x 400g tin chopped tomatoes,  1 tbsp clear honey,  250ml\/9fl oz red wine or beef stock,  boiled long-grain rice, to serve,  salt and freshly ground black pepper,  1 ripe avocado, skin and stone removed, finely diced,  ½ red onion, finely diced,  ¼ cucumber, finely diced,  ½ lemon, juice only,  handful roughly chopped fresh coriander leaves (optional), plus extra to serve","vegetarian":true,"calories":393.0,"protein":30.0,"carbs":12.0,"sugars":10.0,"total_fat":23.0,"saturated_fat":7.0,"fiber":4.0,"salt":0.4,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicy_chilli_con_carne_58238"}