{"recipe_name":"Spicy chorizo squash parcels","author":"Andrew Smyth","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 24 canapés","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/spicy_chorizo_squash_37945_16x9.jpg","method":"Preheat the oven to 220C\/200C Fan\/Gas 7. For the filling, put the squash in a large roasting dish. Toss with 2 tablespoons olive oil and a generous pinch of salt and pepper. Toss together until all the cubes are well coated. Add a few sprigs of thyme and bake on the middle shelf for 15–20 minutes, or until the squash is tender and starting to brown at the edges. Stir halfway through cooking.  Heat a tablespoon of olive oil in a large frying pan over a medium heat. Add the onion and garlic and gently fry until the onions are soft and translucent. Pick the leaves from 2 sprigs thyme and add to the pan. Add the white wine and chicken stock and cook for a further 2 minutes until the volume of liquid has reduced by half. Tip the contents of the frying pan into a blender. Add half the butternut squash to the blender and blend to a smooth but thick purée. Season to taste with salt and pepper, place in a bowl and set aside to cool.   In the same frying pan, lightly fry the chorizo until just starting to brown at the edges. Remove from the heat and drain the oil from cooking into the blender. Put the chorizo in a small bowl lined with kitchen paper and set aside.  Preheat the oven to 220C\/200C Fan\/Gas 7. Line 2 baking trays with non-stick baking paper.  Dust a work surface with the cornflour and lay the filo out. Cut the filo into 7cm\/2¾in squares. Take one square, brush both sides with melted butter and place on the baking tray. Place another square on top at a 45 degree angle and apply more butter to the top.  Add about a teaspoon of purée to the middle of the square, followed by 2 chorizo squares and a square of butternut squash. Draw the edges of the filo around the purée to form a neat package and pinch together 1cm\/½in pastry at the top. Repeat to make 24 savoury parcels.  Bake for 10–15 minutes until golden-brown and crisp on the bottom. Swap the trays midway through baking to ensure they cook evenly. Move to a cooling rack and drape a sprig of thyme over each parcel. Serve the parcels garnished with any leftover purée, roasted squash and chorizo.  ","ingredients":" 500g\/1lb 2oz butternut squash, peeled, cored and cut into 15mm\/¾in cubes (450g\/1lb when peeled and cored),  3 tbsp olive oil,  30g\/1oz fresh thyme ,  1 large white onion, finely chopped,  2 garlic cloves, crushed,  50ml\/2fl oz white wine (preferably Sauvignon Blanc),  100ml\/3½fl oz chicken stock (from 1 stock cube),  200g\/7oz cooking chorizo, cut into 15mm\/¾in cubes,  sea salt and freshly ground black pepper,  cornflour, for dusting ,  4 sheets ready-made filo pastry ,  75g\/2½oz unsalted butter, melted","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicy_chorizo_squash_37945"}