{"recipe_name":"Spicy soft shell crab with cucumber and coriander dipping sauces","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the soft shell crab, heat a small frying pan and add the seeds. Cook for 2-3 minutes or until they start to give off their aroma and jump in the pan. Place the seeds in a spice grinder or pestle and mortar along with the turmeric and chilli powder and grind into a powder. Combine the flour, spices, yeast, salt and sugar in a bowl. Add the beer and vinegar and whisk until it forms a thick batter. Set aside to ferment for about 30 minutes. It is ready to use when the mixture starts to bubble.  Heat a deep fat fryer to 190C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Dip the crabs in the batter and place in the deep fat fryer for 3-4 minutes, turning two or three times, until golden-brown and crisp.  Carefully remove the crabs from the hot oil using a slotted spoon, place on a plate lined with kitchen paper and season with salt. For the garlic and coriander dipping sauce, place the garlic and white wine in a pan and cook on a medium heat for 5 minutes, then drain and discard the wine. Place the egg yolks in a small food processor, add the vinegar, dijon mustard and salt. Blend until smooth, then with the motor running, gradually add the oil until the mixture resembles mayonnaise. Add the coriander and garlic and blend to combine. Add lemon juice to taste. For the cucumber and yoghurt dipping sauce, place all the ingredients into a large glass bowl and mix. To serve, place the deep fried spicy soft shell crab onto a serving plate or board, pour the dipping sauces into two small bowls and garnish with red chilli, spring onions, coriander cress and wedges of fresh lime. ","ingredients":" 1 tsp coriander seeds,  1 tsp cumin seeds,  1 tsp nigella seeds,  ½ tsp mustard seeds,  1 tsp turmeric,  ½ tsp red chilli powder,  200g\/7oz plain flour,  15g\/½oz fresh yeast,  pinch salt,  pinch caster sugar,  200ml Indian beer,  1 tbsp cider vinegar,  8 soft shell crabs, cleaned,  vegetable oil, for deep-frying,  6 garlic cloves, halved,  250ml\/9fl oz white wine,  2 free-range egg yolks,  1 tbsp white wine vinegar,  1 tbsp dijon mustard,  salt,  125ml\/4fl oz rapeseed oil,  4 tbsp fresh coriander,  1 lemon, juice only,  250ml\/9fl oz natural yoghurt,  ¼ cucumber, finely diced,  1 small shallot, finely chopped,  2 tbsp finely chopped fresh coriander,  2 tbsp finely chopped fresh mint,  2 garlic cloves, grated,  1 Thai green chilli, stalk removed and finely chopped,  2 tsp salt,  1 tsp sugar,  1 lime, juice only,  1 red chilli, finely chopped,  2 spring onions, finely shopped,  2 tbsp coriander cress,  1 lime, wedged","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicy_soft_shell_crab_29297"}