{"recipe_name":"Spicy haddock with stir-fried broccoli","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the haddock pieces onto a plate and drizzle with the juice of one of the limes and toss to evenly coat. Place the remaining ingredients, except the oil, into a small food processor and blend to a paste. Spread the paste over the haddock pieces. Heat enough vegetable oil to just coat the bottom of a frying pan, add the haddock and fry on all sides for 2-3 minutes, until golden-brown and just cooked through. For the broccoli, heat a wok until hot, then add the vegetable oil and mustard seeds and cook for 30 seconds, or until the seeds start to pop. Add the broccoli, water and garlic and stir-fry for 3-4 minutes, or until the broccoli is tender. Add the chilli oil and season, to taste, with salt and freshly ground black pepper. To serve, place equal portions of the haddock onto each plate and place a spoonful of the broccoli alongside. ","ingredients":" 600g\/1lb 5oz haddock fillet, skin removed, cut into large chunks,  2 limes, juice only,  2 tbsp gram flour (chickpea flour),  1 tsp ground cumin,  1 tsp turmeric,  1 tsp ground fenugreek,  ½ tsp ground coriander,  ¼ tsp ground cardamom,  1 lime, zest only,  4 tbsp coriander leaves, roughly chopped,  2 long red chillies, seeded and roughly chopped,  2 garlic cloves, roughly chopped,  5cm\/2in piece ginger, peeled and roughly chopped,  vegetable oil, for frying,  1 tbsp vegetable oil,  2 tbsp black mustard seeds,  300g\/10½oz broccoli florets,  4 tbsp water,  2 garlic cloves, finely sliced,  3 tbsp chilli oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicyhaddockwithstir_89321"}