{"recipe_name":"Spicy hotpot","author":"Ching-He Huang","programme":"Chinese Food Made Easy","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spicy soup base, heat a 2 litre\/3½ pint capacity wok until smoking and add the groundnut oil. Add the chillies and Sichuan peppercorns and stir fry for a few seconds, or until fragrant.  Stir in the chilli bean sauce and chilli sauce and then pour in the vegetable stock. Add the star anise, Chinese mushrooms, tangerine peel, spring onion, ginger and chillies and bring to the boil, then reduce the heat to low and simmer for 20 minutes. Ten minutes before serving, add the chilli oil, the sliced Chinese cabbage, deep-fried tofu, fresh tofu and fish balls, if using.  For the vinegar, chilli and soy dipping sauce, combine all the dipping sauce ingredients together in a small bowl and set to one side. For the Taiwanese dipping sauce, combine all of the dipping sauce ingredients together in a small bowl and set to one side.  To serve, arrange the lamb, prawns, tofu, mushrooms and fishcakes on separate plates. Transfer the soup base to an electric wok or fondue and set it up in the centre of the table. Let guests help themselves and cook the ingredients in the spicy broth. Serve with the dipping sauces. ","ingredients":" 2 tbsp groundnut oil ,  3-4 long dried Sichuan chillies or long dried chillies ,  50g\/2oz whole Sichuan peppercorns ,  1 tbsp chilli bean sauce (available from Asian grocers),  1 tbsp chilli sauce,  1.7 litres\/3 pints hot vegetable stock,  2 whole star anise,  6 dried Chinese mushrooms,  1 small handful dried tangerine peel (available from Asian grocers, or subtitute with the zest of 1 orange),  1 large spring onion, roughly chopped,  250ml\/9fl oz chilli oil,  2.5cm\/1in piece fresh root ginger, peeled,  2 red chillies, de-seeded, sliced ,  250g\/9oz ready-made fish balls (available from Asian grocers) (optional) ,  1 small handful Chinese cabbage, thickly sliced,  1 small handful deep-fried tofu ,  1 small handful fresh tofu, cut into 2.5cm\/1in chunks,  3 tbsp Chinkiang black rice vinegar or balsamic vinegar,  3 tbsp light soy sauce,  1 red chilli, de-seeded, finely chopped,  1 free-range egg, yolk only,  1 tbsp oriental satay or barbecue sauce (available from Asian grocers),  1 tbsp light soy sauce,  1 tbsp finely chopped fresh coriander,  1 tbsp finely sliced spring onion ,  lamb fillet, thinly sliced ,  raw prawns, shelled and de-veined,  firm tofu, cut into chunks,  enoki mushrooms,  baby sweetcorn, sliced,  250g\/9oz ready-made fishcakes (available from Asian grocers)","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicyhotpot_89291"}