{"recipe_name":"Spicy koftas on herb salad with caramelised lemon and garlic tzatziki","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Soak four wooden skewers in a bowl of cold water for 10-15 minutes, then drain.  For the koftas, place all of the ingredients, except the flour and oil, into a food processor and blend until well combined. With floured hands, shape the meat mixture around the wooden skewers, then rub the oil over the meat.  Heat a griddle pan until smoking and cook the koftas for 3-4 minutes, or until browned on all sides. Transfer to the oven for 6-8 minutes, or until completely cooked through.  For the tzatziki, mix together the yoghurt, garlic and mint in a small bowl and season, to taste, with salt and freshly ground black pepper.  For the caramelised lemon, heat a frying pan until smoking and place the lemon, cut-side down, into the pan. Leave to cook for 4-5 minutes, until the flesh is caramelised and dark brown in colour.  To serve, pile the herb leaves on a serving plate, drizzle over the balsamic vinegar and olive oil and arrange the koftas on top. Serve the tzatziki in a small bowl on the side and garnish the plate with the caramelised lemon. ","ingredients":" 225g\/8oz lamb leg steaks, bones removed,  1 tsp medium curry powder,  ½ tsp chilli flakes,  2 cloves garlic, chopped,  salt and freshly ground black pepper,  100g\/3½oz white breadcrumbs,  1 free-range egg, beaten,  plain flour, for dusting,  1 tbsp olive oil,  4 tbsp Greek-style yoghurt,  1 clove garlic, finely diced,  3 tbsp chopped fresh mint,  salt and freshly ground black pepper,  ½ lemon,  1 handful assorted herb leaves (parsley, coriander, chives, chervil),  1 tbsp balsamic vinegar,  2 tbsp olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicykoftasonherbsal_88918"}