{"recipe_name":"Spicy lamb curry with apricot and herb couscous","author":"Paul Rankin","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb curry, heat the oil in a frying pan over a medium heat and fry the onion until softened. Add the garlic and cook for one minute. Stir in the spices and cook for a further 2-3 minutes, then add the lamb pieces and cook, turning, until browned on all sides. Add enough water to cover the meat and bring to the boil. Reduce the heat and simmer for ten minutes. Add the broccoli pieces and simmer for a further five minutes, or until the broccoli and lamb are tender. Stir in the cream and simmer gently until slightly thickened. For the couscous, squeeze the juice of half the lemon over the chopped onion and set aside. Place the couscous into a large bowl and pour over the hot vegetable stock.  Cover with cling film and leave for 5-6 minutes, or until all the liquid has been absorbed and the couscous is tender. Remove the cling film and separate the grains of couscous with a fork. Add the chopped onion to the bowl along with the lemon juice it was soaked in, the apricots and chopped herbs. Drizzle over the olive oil and the remaining lemon juice, season with salt and freshly ground black pepper and mix well. To serve, sprinkle the chopped coriander over the curry. Place the couscous onto a plate and top with the curry. ","ingredients":" 1 tbsp vegetable oil,  ½ onion, finely chopped,  2 garlic cloves, finely chopped,  1 tsp curry powder,  1 tsp coriander seeds, crushed,  1 tsp cumin seeds, crushed,  110g\/4oz lamb chump, chopped into 2cm\/1in cubes,  water, to cover,  1 stalk purple sprouting broccoli, trimmed and chopped into pieces,  5 tbsp double cream,  handful fresh coriander, chopped, to serve,  1 lemon, juice only,  ½ onion, finely chopped,  100g\/3½oz couscous,  200ml\/7fl oz hot vegetable stock,  small handful dried apricots, chopped,  handful fresh herbs, such as parsley, chives, coriander, chopped,  1 tbsp olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicylambcurrywithap_85245"}