{"recipe_name":"Spicy rack of lamb with aubergine salad","author":"Merrilees Parker","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4.  Place the coriander seeds, cumin seeds and peppercorns into a heavy-based pan and toast for 1-2 minutes until aromatic. Transfer to a pestle and mortar and crush to a powder, then stir in the harissa with a teaspoon of salt until well combined. Lightly score the skin of each rack of lamb into a diamond pattern with the tip of a very sharp knife, taking care that you don't cut through to the meat.  Rub the spiced paste all over the flesh.  Heat a large frying pan.  Add the racks of lamb, fat side down and then seal all over.   Transfer to a small roasting tin.  Roast for 15 minutes, or a little longer, depending on how pink you like your lamb.   Remove from the oven and set aside in a warm place to rest for 10-15 minutes. Place the bulgar wheat in a pan of salted boiling water and bring to the boil, then boil fast for five minutes until tender. Drain well and place in large bowl. Stir in the lemon juice with two tablespoons of the extra virgin olive oil. Heat a large frying pan with two tablespoons of the light olive oil.  Tip in half the aubergine cubes, season generously and sauté for about 10 minutes over a high heat until really crispy and tender. Drain well on kitchen paper. Repeat with remaining light olive oil and aubergine cubes.   Leave to cool slightly, then stir into the bulgar wheat.  To serve, stir the tomatoes and herbs into the bulgar wheat mixture and season to taste. Drizzle with the remaining tablespoon of extra virgin olive oil.  Carve the rested lamb into chops and arrange on warmed plates with the roasted aubergine salad. ","ingredients":" 1 tbsp coriander seeds,  1 tbsp cumin seeds,  2 tsp black peppercorns,  2 tbsp harissa (chilli paste),  1 tsp salt,  2x4-6 bone best ends of lamb, each rack about 225-300g\/8-10oz,  100g\/4oz medium bulgar wheat,  salt,  1 lemon, juice only,  3 tbsp extra virgin olive oil,  4 tbsp light olive oil,  1 large aubergine, cut into small dice,  salt and freshly ground black pepper,  4 ripe vine tomatoes, seeded and finely chopped,  3 tbsp each chopped fresh coriander, flatleaf parsley and mint","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicyrackoflambwitha_75306"}