{"recipe_name":"Spicy Singapore noodles with prawn stuffed courgettes and sweet chilli sauce","author":"Ching-He Huang","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the noodles, heat the vegetable oil in a wok, add the courgette and ground turmeric and fry for 2-3 minutes, or until the courgette is tender. Add the cooked rice noodles and garlic and fry for 2-3 minutes, then stir in the soy sauce, chilli and broccoli and fry for 1-2 minutes. For the stuffed courgettes, scoop the seeds out of the courgette rounds and discard. Place the hollowed out courgette rounds on a baking sheet.  Season the chopped prawns with salt and freshly ground black pepper and soy sauce, mix well and press spoonfuls of the prawn mix into the middle of each courgette round. Drizzle with sesame oil and sprinkle over the sesame seeds, then bake in the oven for 6-8 minutes, or until the prawns are cooked through and the courgette is tender. For the chilli sauce, place all of the chilli sauce ingredients into a small saucepan and simmer gently for five minutes, adding enough water as necessary to make a pouring consistency. To serve, pile the noodles onto two serving plates, place the stuffed courgettes around the sides of the plate and drizzle over the chilli sauce. ","ingredients":" 1 tbsp vegetable oil,  1 green courgette, julienned,  1 tsp ground turmeric,  200g\/7oz rice noodles, cooked according to packet instructions,  1 clove garlic, chopped,  2 tbsp soy sauce,  1 red chilli, chopped,  1 small handful broccoli florets,  1 yellow courgette, cut into three equal thick rounds,  2 king prawns, de-veined, peeled, finely chopped,  salt and freshly ground black pepper ,  1 tbsp soy sauce,  dash sesame oil,  2 tsp sesame seeds,  2 tbsp tomato ketchup,  1 tbsp honey,  1 tsp dried chilli flakes,  1 tsp white wine vinegar,  splash water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicysingaporenoodle_89179"}