{"recipe_name":"Spicy steak and Monterey Jack enchiladas with corn salsa","author":"Gino D'Acampo","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the grill to medium. For the enchiladas, heat a dash of olive oil in a wok, add the sliced onion, red and yellow pepper and fry for 4-5 minutes. Add the Cajun spice, brown sugar, chipotle and a splash of boiling water and cook for 2-3 minutes. Heat a separate pan until smoking hot, add the sliced steak and sear for 30 seconds, or until browned on all sides. Add the steak to the pan with the peppers and stir together. Meanwhile, briefly warm the tortillas under the grill. Place the warmed tortillas onto a baking sheet. Place a line of peppers and steak down the middle of each tortilla and then roll up. Scatter with grated cheese and place under the grill for 4-5 minutes, or until the cheese is bubbling. Remove from the heat and keep warm. For the corn salsa, heat the olive oil in a pan, add the corn kernels and fry for 2-3 minutes. Add the onion and pepper and fry for 2-3 minutes. Add the Cajun spice, salt and freshly ground black pepper and fry for a further minute. To serve, spoon the salsa onto a serving plate and top with the enchiladas. Sprinkle with Cajun spice to garnish. ","ingredients":" dash olive oil,  ½ onion, sliced,  ½ red pepper, sliced,  ½ yellow pepper, sliced,  2 tsp Cajun spice seasoning,  1 tsp soft brown sugar,  2 tsp chopped chipotle chillies,  splash boiling water,  250g\/9oz T-bone steak, bone removed, sliced,  2 flour tortillas,  100g\/3½oz Monterey Jack cheese, grated,  1 tbsp olive oil,  1 corn-on-the-cob, kernels only,  ¼ onion, finely chopped,  ¼ red pepper, finely chopped,  ½ tsp Cajun spice seasoning, plus extra for sprinkling,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicysteakandmontere_88037"}