{"recipe_name":"Spicy tofu and edamame beans","author":"Ching-He Huang","programme":"Chinese Food Made Easy","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/spicytofuandedamameb_89267_16x9.jpg","method":"For the tofu stir fry, heat the groundnut oil in a large frying pan, add the tofu and fry for 2-3 minutes. Add the light soy sauce and cook until the liquid has reduced and the tofu is browned on one side. Using a small palette knife or fork, lift and turn each piece (be careful not to break the tofu) and cook for a further 2-3 minutes to colour the other side. Add the dark soy sauce and black rice vinegar and cook until the liquid has reduced by half. Season, to taste, with the dried chilli flakes. Transfer the tofu to a serving plate and put to one side. For the edamame beans, heat the groundnut oil in a clean frying pan and stir-fry the chilli for a few seconds, then add the edamame beans. Sprinkle over a teaspoon of water to help create steam, then cook for no more than one more minute. Season with the light soy sauce and black rice vinegar and stir in the chopped coriander.  To serve, pour the beans over the tofu and serve immediately. ","ingredients":" 2 tbsp groundnut oil,  400g\/14oz firm fresh tofu, drained and cut into 1cm\/½in thick rectangles ,  3 tbsp light soy sauce,  1 tsp dark soy sauce,  1 tbsp Chinese black rice vinegar or balsamic vinegar,  1 tsp dried chilli flakes ,  1 tbsp groundnut oil,  1 red chilli, de-seeded and finely chopped,  75g\/3oz fresh or frozen edamame (soya) beans, out of their pods (defrosted),  1 tsp light soy sauce,  1 tsp Chinese black rice vinegar or balsamic vinegar,  1 large handful fresh coriander, finely chopped","vegetarian":true,"calories":188.0,"protein":10.5,"carbs":6.0,"sugars":4.0,"total_fat":13.0,"saturated_fat":2.5,"fiber":1.0,"salt":1.9,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicytofuandedamameb_89267"}