{"recipe_name":"Spicy tomato and goats' cheese wontons, smoked aubergine purée and tomato vinaigrette","author":"Tony Tobin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the tomato jam, place all of the tomato jam ingredients into a pan over a medium heat and bring to the boil. Reduce the heat and simmer for 20-30 minutes, until thickened and slightly sticky. Remove from the heat and cool. For the wontons, heat the oil a deep heavy-based pan until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Crumble the goats' cheese into the cooled tomato jam and gently fold through. Spoon a little of the tomato and cheese mixture into the centre of each wonton wrapper.  Brush the edges of each wonton wrapper with the egg white mixture, then fold the wontons over to form a triangle and press the edges to make sure they are sealed. With the apex of each wonton triangle facing away from you, brush the two side points of the triangle and fold them into the centre. The wontons should now resemble tortellini. Place the wantons into the hot oil, a few at a time, and cook for 2-3 minutes, until golden-brown and crisp. Remove from the oil with a slotted spoon and drain onto kitchen paper. Method for aubergine purée, heat a dry frying pan until hot. Add the whole aubergine and cook on each side for 4-5 minutes until blackened and softened. Remove from the heat and cool. Heat a clean frying pan and add the olive oil, shallots and garlic. Cook for 2-3 minutes until softened. Cut the aubergine in half and scoop the flesh into the frying pan with the shallots. Cook for a further five minutes. Transfer to a food processor. Add the tahini and blend to a purée. Pass the purée through a fine sieve into a clean bowl and season, to taste, with salt and freshly ground black pepper. For the vinaigrette dressing, place all of the dressing ingredients into a bowl and whisk together until combined. To serve, place the pea shoots into a small bowl and drizzle with the pesto. Mix to coat well and place in the centre of each plate. Place three wontons on top of each pile of pea shoots. Spoon some aubergine purée to the side and finish with a drizzle of the vinaigrette. ","ingredients":" 6 medium ripe tomatoes, peeled, seeds removed, chopped,  2.5cm\/1in fresh ginger, finely chopped,  ½ small red onion, finely chopped,  1 garlic clove, finely chopped,  ½ small red chilli, finely chopped,  10 fresh mint leaves, roughly chopped ,  10 fresh coriander leaves, roughly chopped,  10 fresh flatleaf parsley leaves, roughly chopped,  10 fresh basil leaves, roughly chopped,  110g\/4oz fruit sugar (fructose),  110ml\/4fl oz cabernet sauvignon vinegar,  300ml\/10½fl oz vegetable oil, for deep-frying,  12 ready-made wonton wrappers (available from Asian supermarkets),  2 small goats cheese crottin or something similar (approximately 100g\/3½oz),  1 free-range egg white, beaten with a pinch of cornflour, for sticking the wontons together,  1 aubergine,  1 tbsp olive oil,  1 shallot, finely chopped,  1 garlic clove, crushed,  1 tsp tahini (sesame seed paste),  1 shallot, finely chopped,  1 tbsp fresh chervil, finely chopped,  1 tbsp fresh chives, finely chopped,  1 tbsp fresh tarragon, finely chopped,  2 tbsp Worcester sauce,  110ml\/4fl oz tomato ketchup,  8 drops Tabasco sauce,  250ml\/9fl oz olive oil,  50ml\/2fl oz white wine vinegar,  2 punnets pea shoots,  1 tbsp ready-made basil pesto, thinned with a little olive oil, for drizzling","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spicytomatoandgoatsc_89322"}