{"recipe_name":"Spinach and shrimp roulade","author":"Valentine Warner","programme":"Country Show Cook Off","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Makes 1 roulade","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the roulade, heat the oven to 190C\/380F\/Gas 5 and line a 23x32cm\/9x13in Swiss roll tin with baking paper. Remove the stalks from the spinach, wild garlic and nettles and wash them thoroughly. In a heavy-based saucepan of boiling water cook for 2-3 minutes, or until the leaves are limp and bright green. Drain the leaves and place in a sieve. Press with the back of a wooden spoon to remove as much liquid as possible, then transfer to a bowl of cold water. Sieve and press again to drain all excess liquid. Set aside. Warm some olive oil in a large frying pan over a medium-high heat.  Add the shallots and gently fry until translucent (approximately two minutes).  Add the marjoram, celery salt and nutmeg. Tip the cooked leaves into a food processor and add the egg yolks, shallot mix and season generously with pepper.  Blend to a purée. In a clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed. Fold into the spinach mixture, then spread in the prepared tin and bake for 10-12 minutes until firm to the touch.    When cooked, turn out onto a clean work surface and carefully peel off the baking paper.  Set aside to cool while you make the mayonnaise filling.  For the mayonnaise, put the egg yolks, lemon juice, Dijon mustard, white wine vinegar and two tablespoons of olive oil in a bowl and whisk.  Very slowly drizzle in the sunflower oil, whisking all the time.  The mayonnaise will thickened slightly, but will not be as thick as commercial mayonnaise. At this stage, add the shrimp and season to taste with salt and freshly ground black pepper. Spread the mayonnaise mixture evenly over the surface of the roulade. Roll up the roulade from the shortest ends, set aside for approximately 30 minutes to help it hold its shape.  To serve, cut into thick slices and scatter with edible flowers. ","ingredients":" 500g\/1lb 2oz fresh baby spinach ,  handful wild garlic,  500g\/1lb 2oz foraged nettles,  olive oil,  2 large shallots, finely chopped ,  pinch of chopped marjoram ,  celery salt and freshly ground black pepper ,  pinch of freshly grated nutmeg,  2 free-range egg yolks ,  4 free-range egg whites,  edible flowers, for decoration,  2 free-range egg yolks,  ½ tsp lemon juice,  1 tsp Dijon mustard,  1 tsp white wine vinegar ,  2 tbsp olive oil ,  6 tbsp sunflower oil,  100g\/3½oz shrimp, shelled","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spinach_and_shrimp_23513"}