{"recipe_name":"Spinach and gorgonzola crêpes","author":"Matt Tebbutt","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crêpe batter, sieve the flour into a bowl and make a well in the middle. Add the eggs, a pinch of salt and a little milk. Mix together to create a thick paste, then slowly incorporate the rest of the milk, stirring constantly, to create a batter. Place into the fridge to chill for 30 minutes.  Heat a non-stick pan over a medium heat and add the oil. Pour in some of the batter and swirl it around the pan. Cook for one minute, then turn the crêpe over. Cook for one more minute, until golden-brown. Remove from the pan and place onto a plate. Repeat with the remaining mixture until the batter is used up. Heat the grill to its highest setting. Lay the crêpes out onto a clean work surface. Place a layer of the spinach down the middle of each crêpe, then a sprinkle of freshly grated nutmeg. Sprinkle the pine nuts over each crêpe. Crumble the gorgonzola down the centre of each crêpe. Fold each crêpe up from the sides to cover the filling and transfer the crêpes to a large baking sheet. Add a few small pieces of butter to each crêpe and sprinkle with parmesan. Place under the grill to cook for 1-2 minutes, until the topping is golden-brown and bubbling. To serve, place each crêpe onto a separate plate and serve with wedge of lemon alongside. ","ingredients":" 115g\/4oz plain flour ,  1 free-range egg,  1 free-range egg yolk,  pinch salt ,  300ml\/10fl oz whole milk,  2 tbsp oil, for frying,  300g\/10½oz spinach, chopped, blanched, refreshed in cold water and squeezed dry,  pinch freshly grated nutmeg,  1 tbsp pine nuts, toasted,  250g\/9oz gorgonzola  (or a similar vegetarian blue cheese),  50g\/2oz salted butter,  50g\/2oz parmesan cheese,  lemon wedges, to serve","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spinachandgorgonzola_89474"}