{"recipe_name":"Spinach tortilla","author":"Allegra McEvedy","programme":"Economy Gastronomy","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Boil the potato in a pan of salted water for 15-20 minutes, or until tender. Drain well, then mash with a potato masher or ricer until smooth. Preheat the oven to 180C\/350F\/Gas 4. Heat the oil in a frying pan over a medium heat. Add one of the chopped garlic cloves and fry for 1-2 minutes, or until softened. Add the chopped spinach and toss until wilted and warmed through. Season, to taste, with salt and freshly ground black pepper, then drizzle over the lemon juice. Beat the eggs in a large bowl, then add the cooked spinach mixture, chopped herbs and spring onions and stir until well combined.  Whisk in the remaining chopped garlic, cardamom seeds and season again, to taste, with salt and freshly ground black pepper. Add the egg mixture to the mashed potato and stir until well combined. Heat the butter in a 25cm\/10in ovenproof frying pan or casserole over a medium heat. When the butter has melted, swirl the pan until the butter has coated the insides. Add the egg and potato mixture, then transfer the pan or casserole to the oven and bake for 20-30 minutes, or until the middle of the tortilla has just set. (NB: The cooking time may vary depending of the depth of the casserole or pan.) Remove the tortilla from the oven and set aside for 10 minutes to cool slightly before serving. Serve in slices with feta cheese, radishes or yoghurt, if using. ","ingredients":" 1 large floury potato, such as King Edward ,  1-2 tbsp olive oil,  2-3 garlic cloves, peeled, roughly chopped,  100g\/3½oz fresh baby spinach leaves, washed, chopped (or 200g\/7oz frozen spinach, defrosted and drained),  salt and freshly ground black pepper,  1 tbsp freshly squeezed lemon juice,  6 free-range eggs, beaten,  60g\/2½oz mixed fresh herbs (such as parsley, coriander, dill and mint), washed, roughly chopped,  4 spring onions, trimmed, finely chopped,  4 cardamom pods, seeds only,  30g\/1¼oz butter,  feta cheese, crumbled (optional),  radishes (optional),  plain yoghurt (optional)","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spinachtortilla_92203"}