{"recipe_name":"Spotted dick with custard and a blackberry sauce","author":"John Burton Race","programme":"Chefs: Put Your Menu Where Your Mouth Is","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the spotted dick, grease six 6cm\/2in pudding moulds with the melted butter. Place the sultanas and currants in a small saucepan and add the rum. Bring to the boil, then turn off the heat and leave to stand for 30 minutes. Meanwhile, place the flour, baking powder, suet, sugar and lemon zest in a large bowl and mix. Add the rum-soaked fruit and the milk and stir until you have a soft dough. Fill each mould three-quarters full. Cut out six squares of aluminium foil large enough to cover the pudding moulds generously. Fold a pleat down the centre of each square (to allow the puddings to rise) and cover the moulds. Secure the foil with cook's string. Place a small heatproof plate in the bottom of a large saucepan and sit the moulds on top. Pour in enough boiling water to reach half way up the sides of the moulds. Place over a medium heat, place a lid on top and cook for an hour. Top up the pan with more boiling water if it looks like it might dry out. Meanwhile, make the custard. Put the cream, milk and vanilla seeds in a large saucepan and warm gently. In a separate bowl, whisk the egg yolks and sugar until light and frothy. Gradually add the warm milk mixture to the bowl, whisking all the time. Once incorporated, pour back into the pan and, stirring all the time, heat until thick enough to coat the back of a spoon. For the blackberry sauce, pour the crème de cassis into a medium saucepan and add the sugar and blackberries. Heat for five minutes then pass through a sieve. Keep the liquid and discard the fruit. To serve, carefully decant the puddings and place in serving bowls. Pour the custard around the pudding and drizzle a little of the blackberry sauce over. ","ingredients":" 25g\/1oz unsalted butter, melted,  60g\/2oz sultanas,  60g\/2oz currants,  150ml\/5fl oz dark rum,  300g\/10½oz plain flour,  2 tsp baking powder,  150g\/5½oz shredded dried suet,  75g\/2½oz caster sugar,  1 lemon, zest only,  200ml\/7fl oz full-fat milk,  200ml\/7fl oz double cream,  200ml\/7fl oz full-fat milk,  1 vanilla pod, seeds removed,  6 free-range egg yolks,  75g\/2½oz caster sugar,  50ml\/1¾fl oz crème de cassis,  75g\/2½oz caster sugar,  250g\/9oz blackberries","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spotted_dick_with_97609"}