{"recipe_name":"Spring leek, lamb’s tongue and sweetbread salad","author":"Tom Kitchin","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the sweetbread fritters, begin by heating a non-stick frying pan. Once hot, add the olive oil and the diced sweetbreads, season with salt and freshly ground black pepper and cook until crisp.  Add the shallots, garlic and parsley to the pan and fry for a minute.  Pour in the lamb gravy and take off the heat. Pour the sweetbreads mixture into ice cube containers and freeze.   For the lamb’s tongue, bring a large pan of water to the boil, add all the ingredients then return to a simmer and cook for 2½ - 3 hours.  Once cooked, remove from the heat and let the lamb’s tongues cool in the stock. Once cooled, remove the tongues from the stock, peel them and cut into strips. Mix the eggs and milk to make an egg wash. Place the flour, egg wash and breadcrumbs into three separate bowls. Once the sweetbread fritters are frozen, turn them out of the moulds and cover them first with the flour, then egg wash, then breadcrumbs. Repeat this process three times on each fritter.  Set the fritters aside to defrost. For the leeks, preheat the oven to 180C\/350F\/Gas 4.  Place the cleaned leeks onto aluminium foil. Add the thyme, bay leaves, garlic and a knob of butter. Season well with salt and freshly ground black pepper and drizzle with olive oil. Wrap up the aluminium foil, to make a parcel, and cook in the oven for 30-35 minutes, or until the leeks are tender. For the gribiche, mix all the ingredients together and set aside. To finish the lamb’s tongues, heat a frying pan until hot, add a splash of oil and the lamb’s tongue strips and fry until crisp and golden-brown.  To finish the sweetbread fritters, heat a deep fat fryer to 190C\/375F. Or alternatively heat vegetable oil in a deep sided, heavy-based pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully drop the sweetbread fritters into the oil and cook for 2-3 minutes until golden-brown, crisp, and hot through. Remove the fritters from the hot oil with a slotted spoon, and drain onto kitchen paper. Season with a little salt and freshly ground black pepper. To serve, cut the leek down the centre and place one half on each serving plate. Spoon some gribiche on top of the leek. Place the fritter and lamb’s tongue on top of the gribiche. Garnish with sliced baby carrots, broad beans, parsley leaf, radishes and shallot rings. ","ingredients":" 6 lamb’s sweetbreads, blanched and diced,  1 tbsp chopped shallots,  1 tbsp chopped garlic,  1 tbsp chopped parsley,  50ml\/2fl oz lamb gravy,  2 free-range eggs,  50ml\/2fl oz milk,  115g\/4oz flour,  115g\/4oz dried breadcrumbs,  4 lamb’s tongues,  2 carrots, chopped,  1 onion, chopped,  1 bouquet garni,  6 peppercorns,  1 garlic clove,  2 leeks, kept whole, cleaned,  1 sprig thyme,  1 bay leaf,  1 garlic clove, crushed,  25g\/1oz butter,  2 tbsp olive oil,  125ml\/4fl oz mayonnaise,  50g\/2oz gherkins, chopped,  50g\/2oz capers, chopped,  2 tbsp chopped flatleaf parsley,  2 hard boiled eggs, chopped,  2 baby carrots, sliced,  1 tbsp broad beans, peeled,  1 tbsp picked parsley leaves,  2 radishes, with leaves,  1 shallot, cut into rings","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spring_leek_lambs_tongue_16379"}