{"recipe_name":"Spring rolls with crisp oyster mushrooms and dipping sauce","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Makes 10","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/spring_rolls_with_crisp_87626_16x9.jpg","method":"Heat a wok until smoking and add the vegetable oil. Then add the spring onions, carrots, garlic, ginger, beansprouts and chilli flakes and stir-fry for one minute. Add the apple and coriander stems and cook for one minute, then add the soy sauce. Transfer the vegetables to a plate and allow to cool.  To assemble the spring rolls, lay two wrappers one on top of the other (the extra thickness will prevent the skin from breaking) and with a corner toward you (the wrapper makes a diamond shape). Spoon two tablespoons of the filling into the centre of the wrapper. Brush each corner of the wrapper with water. Bring the two opposite corners at the side together so they overlap and, keeping your finger on those edges, bring the bottom corner towards the middle and then roll the pastry up tightly towards the top corner. Tuck the top edge in and seal it with a little more water. Repeat with the remaining spring roll wrappers and filling. Heat the wok over a high heat and fill the wok to a quarter of its depth with groundnut oil. Heat until a cube of bread dropped in sizzles and turns golden-brown in 15 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Carefully lower the spring into the oil and deep-fry for 2-3 minutes, or until golden-brown. You will need to do this in small batches. Remove with a slotted spoon and drain on kitchen paper.  Meanwhile for the mushrooms, combine the flour and five-spice powder. Toss the mushrooms in the mix before deep frying in the wok for about two minutes. Remove with a slotted spoon and drain on kitchen paper.  Season with salt, to taste. For dipping sauce combine the plum sauce and the chilli sauce.  Serve the spring rolls with the crisp mushrooms sprinkled on top and the dipping sauce on the side. ","ingredients":" 1 tbsp vegetable oil,  12 spring onions, finely chopped ,  2 carrots, julienned,  2 cloves garlic, sliced,  5cm\/2in piece of ginger, cut into matchsticks,  handful beansprouts,  1 tsp chilli flakes,  2 apples, peeled and cut into matchsticks,  1 tbsp coriander stems, chopped,  50ml\/2fl oz thick soy sauce,  20 spring roll wrappers,  groundnut oil to deep fry,  50g\/2oz plain flour,  50g\/2oz five-spice powder,  100g\/3½oz oyster mushrooms, torn into strips,  salt to season ,  100ml\/3½fl oz Chinese plum sauce ,  1 tbsp hot chilli sauce","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spring_rolls_with_crisp_87626"}