{"recipe_name":"Spring vegetable quiche","author":"Janet Basu","programme":"The Great British Bake Off","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Sift the flour into a large bowl and rub in the butter until the mixture resembles breadcrumbs.  Mix in the cheese and just enough chilled water to bind the mixture together. Wrap the dough in cling film and place in the fridge for 15 minutes. Roll out the pastry on a floured work surface and use it to line a greased 25cm\/10in tart tin. Chill in the fridge for 30 minutes. Preheat the oven to 190C\/375F\/Gas 5.  Meanwhile, steam or boil the peas, broad beans, asparagus and green beans until al dente then drain. Refresh the vegetables in iced water and drain well. Line the chilled pastry case with aluminium foil and baking beans and bake for 15 minutes. Beat the eggs, cream and milk in a bowl, then add the parsley and season with salt and freshly ground black pepper. Remove the tart tin from the oven, discard the aluminium foil and baking beans and reduce the oven to 180C\/350F\/Gas 4. Place the tart tin on a baking tray, arrange the blanched vegetables, watercress and tomatoes over the base of the pastry case and pour over the egg mixture. Bake for 30-40 minutes or until the filling is set, then remove the quiche from the oven and set aside to cool slightly before removing from the tin.  ","ingredients":" 225g\/8oz plain flour,  140g\/5oz butter, chilled, diced,  115g\/4oz mature Cheddar, grated,  115g\/4oz peas,  115g\/4oz baby broad beans,  115g\/4oz asparagus spears, chopped,  115g\/4oz green beans, chopped,  4 free-range eggs,  200ml\/7fl oz double cream,  100ml\/3½fl oz whole milk,  small bunch flat leaf parsley, chopped,  sea salt and freshly ground black pepper,  1 bunch watercress, roughly chopped,  5 baby plum tomatoes, chopped","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/spring_vegetable_quiche_60576"}