{"recipe_name":"Spring lamb with spinach and feta rolls","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Season the lamb chops well with salt and freshly ground black pepper and brush with a little oil. Heat a griddle pan until smoking then add the lamb and griddle for 3-4 minutes each side, or until cooked to your liking. For the spinach and feta rolls, place the feta, spinach, cinnamon and egg into a bowl. Season well with salt and freshly ground black pepper and mix well. Lay out a filo sheet, brush with melted butter, then top with a second sheet of filo. Brush with butter, then add a final layer of filo. Brush the edge of the top sheet with melted butter. Place some of the feta and spinach mixture into the middle of the filo, then roll up tightly, like a cigar, and tuck in the edge to seal. Repeat with the remaining filo sheets and feta mixture to make eight rolls. Place into the fridge to chill for 30 minutes before cooking (this helps prevent the filo rolls exploding during baking). Brush the rolls with more melted butter and place onto a baking sheet. Transfer to the oven and bake for 25 minutes, or until crisp and golden. To serve, place the rolls onto plates with three lamb cutlets alongside. Add a dollop of yoghurt sprinkled with chopped rosemary. ","ingredients":" 12 lamb chops, French trimmed,  salt and freshly ground black pepper,  olive oil, for brushing,  400g\/14oz feta, crumbled ,  400g\/14oz baby spinach,  ½ tsp ground cinnamon,  1 free-range egg, beaten,  salt and freshly ground black pepper,  200g\/7oz filo pastry, sheets cut into 24 equally sized squares,  150g\/5oz butter, melted ,  1 tbsp chopped fresh rosemary, to garnish,  Greek yoghurt, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/springlambwithspinac_86370"}