{"recipe_name":"Squid ink pasta with crab and chilli","author":"Angela Hartnett","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the squid ink pasta, whisk the egg yolks, whole eggs and squid ink in a bowl to combine. Place the flour in a food processor and, with the motor running, add the liquid until it forms a dough. Remove from the processor and knead gently to bring the dough together. Wrap the dough in cling film and set aside in the fridge for 30 minutes. Roll out the rested pasta dough through a pasta machine, gradually reducing the thickness until it is rolled to the thinnest setting. Then cut into the shape of your choice (linguine and spaghetti work well). For the crab and chilli topping, heat a frying pan over a medium heat and add the oil. Once hot, add the garlic, spring onions, chilli and ginger and gently fry for about a minute, without browning. Add the crab and heat through. Add the white wine and simmer until the volume of the liquid is reduced by half. Bring a large saucepan of salted water to the boil and drop in the pasta. Cook for 1-2 minutes, then drain and add to the crab mixture. Season, to taste, with salt and freshly ground black pepper. Serve immediately in shallow pasta bowls, topped with the chopped parsley and basil.  ","ingredients":" 3 free-range egg yolks,  2 free-range eggs,  3 sachets squid ink,  250g\/9oz ‘00’ flour,  2 tbsp olive oil,  1 garlic clove, finely chopped,  4 spring onions, finely sliced,  1 red chilli, seeds removed, finely chopped,  2cm\/1in fresh ginger, finely chopped,  200g\/7oz white crab meat,  25ml\/1fl oz white wine,  1 tbsp chopped flatleaf parsley,  1 tbsp chopped fresh basil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/squid_ink_pasta_with_03760"}