{"recipe_name":"Squid with chilli and garlic dipping sauce","author":"The Hairy Bikers","programme":"Hairy Bikers' Best of British","prep_time":"less than 30 mins","cooking_time":"less than 10 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the dipping sauce, put the sugar, 50ml\/2fl oz water and one tablespoon of the vinegar in a small saucepan and gently heat until the sugar dissolves, stirring constantly. Bring to the boil and cook for one minute. Add the chilli, garlic and ginger and cook for a further minute, stirring occasionally. Remove from the heat, stir in the remaining vinegar and leave to cool. Cut the squid pieces along one side and open out. Score the inside of the cone in a criss-cross pattern with the tip of a knife, working diagonally across the flesh. Cut the tentacles into quarters. Set aside.  Put the peppercorns, chilli flakes and salt in a small pan and heat gently until you can smell the peppery aromas. Tip into a pestle and mortar and pound hard until the texture of freshly ground black pepper. Transfer to a bowl and stir in the self-raising flour and cornflour.   Place the squid into the bowl and mix together until the squid is well coated with the spiced flour. Set aside while the oil is heating. Stir the coriander into the cooled dipping sauce and pour into a small bowl set on a large plate or small serving platter. Pour 2cm\/¼ion oil into a saucepan and place over a medium heat. Put a cooking thermometer in the pan and heat the oil to 180C\/350F. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, use an electric deep fat fryer to cook the squid. When the oil reaches the right temperature, use tongs to drop a few pieces of the squid into the pan. You will need to cook it in three or four batches. Add the squid a piece at a time, so it doesn’t immediately clump together, and fry for 1-2 minutes until pale golden-brown and crisp.  As soon as one batch is cooked, wait for the oil to get back to the right temperature and cook the next. When all the squid is fried, transfer to the platter with the dipping sauce and serve immediately. ","ingredients":" 100g\/3½oz caster sugar,  2 tbsp white wine vinegar,  1 long red chilli, finely chopped,  2 garlic cloves, peeled and finely chopped,  15g\/½oz piece fresh root ginger, peeled and finely chopped,  1 tbsp chopped fresh coriander,  2 x 175g-200g\/6oz-7oz whole prepared squid,  2 heaped tsp Sichuan peppercorns ,  2 heaped tsp black peppercorns,  ½ tsp dried chilli flakes,  1 tbsp sea salt  flakes,  5 tbsp self-raising flour,  5 tbsp cornflour,  vegetable oil, for shallow frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/squid_with_chilli_and_70821"}