{"recipe_name":"Squid and brown shrimps with salt cod croquettes","author":"James Martin","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salt cod and potato cakes, place the cod into a saucepan with the milk and bay leaves. Bring to the boil over a medium heat. Reduce the heat until the mixture is simmering and simmer for 10 minutes, or until the fish is just cooked through. Drain the fish and flake it into a bowl, removing any skin or bones. Meanwhile, place the potatoes into a pan of salted water, bring to the boil and simmer for 15-18 minutes, or until tender. Drain the potatoes, return to the pan and return to the heat to drive off any excess moisture. Pass the potatoes through a potato ricer or mash well until smooth. Add the mashed potato to the flaked salt cod, season, to taste, with freshly ground black pepper and stir in the flatleaf parsley. Stir the mixture until well combined, then shape the mixture into 12 small cylinders using your hands. Sprinkle the flour and breadcrumbs onto separate plates. Beat the eggs in bowl. Dredge each cylinder first in the flour, then dip into the beaten egg and then roll it the breadcrumbs, shaking off any excess. Heat the olive oil a non-reactive frying pan and fry the croquettes for 4-5 minutes, or until golden-brown on the outside and hot throughout. Keep warm. For the squid and brown shrimps, heat one tablespoon of the oil in a frying pan and fry the squid for 1-2 minutes, or until just cooked, then remove from the pan and set aside. Roughly chop three-quarters of the squid body and set aside the remaining squid and tentacles. Add the brown shrimps to the pan the shrimps were cooked in and cook for 1-2 minutes to heat through. Add the vinegar, lime juice and the remaining olive oil and fry until heated through. Add the lime zest, dill and cooked chopped squid and stir until well combined, then season, to taste, with salt and freshly ground black pepper. To serve, place 3 croquettes into the centre of each plate and spoon over the squid and brown shrimps. ","ingredients":" 500g\/1lb 2oz salt cod, soaked overnight and rinsed thoroughly several times in fresh changes of water,  500ml\/17½fl oz full-fat milk,  2 fresh bay leaves,  400g\/14oz floury potatoes, peeled, cut into chunks,  freshly ground black pepper,  2 tbsp chopped fresh flatleaf parsley,  50g\/2oz plain flour,  110g\/4oz breadcrumbs,  2 free-range eggs, beaten,  2 tbsp olive oil,  4 tbsp olive oil,  300g\/10oz baby squid, cleaned,  175g\/6oz cooked brown shrimps,  1 tbsp white wine vinegar,  1 lime, zest and juice,  3 tbsp chopped fresh dill","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/squidandchorizowiths_93208"}