{"recipe_name":"Banana leaf-baked sea bass","author":"Bobby Ananta","programme":"Nigel Slater: Eating Together","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/180C fan\/Gas 6. For the spice paste, dry-fry the white pepper, black pepper, nutmeg, tailed pepper, cumin seeds, aniseed, long pepper and coriander seeds in a frying pan over a medium heat for 4-5 minutes, or until toasted and fragrant.  Grind the toasted spices to a fine powder in a large pestle and mortar or spice grinder. Add the remaining spice paste ingredients and continue to pound the ingredients to a rough paste. Set aside. For the baked sea bass, rub the sea bass all over with the lime juice and set aside for 5 minutes.  Spread the spice paste all over the fish until coated. Season with salt, then stuff the cavity with the lemon-basil leaves and bay leaves. Put the fish in the centre of the banana leaf (use several leaves if you cannot find one that's big enough). Fold the edges of the banana leaf over the fish to create a tight parcel. Secure with wooden skewers or cocktail sticks. Bake the sea bass in the oven for 40-50 minutes, or until the fish is cooked through. Unwrap the fish and remove the meat from the bones, keeping the skin as intact as possible. Serve with turmeric-cooked vegetables. ","ingredients":" ¼ tsp ground white pepper,  ¼ tsp ground black pepper,  ¼ nutmeg, finely grated,  ¼ tsp ground tailed pepper (also known as cubeb berries) ,  ¼ tsp cumin seeds ,  ¼ tsp aniseed,  1 dried long pepper ,  ½ tsp coriander seeds,  3 garlic cloves, finely chopped,  7 shallots, finely chopped,  3 red chillies, de-seeded, finely chopped,  2cm\/¾in piece fresh root ginger, peeled, finely chopped,  1cm\/½in piece fresh galangal, peeled, finely chopped,  2cm\/¾in piece fresh turmeric, fried until golden-brown,  ½ tsp ready-made tamarind paste,  4 candle nuts,  1 lemongrass stalk, tough outer leaves removed, soft inner stem chopped ,  1 tsp coconut sugar,  1 large whole sea bass (approximately 2kg\/4lb 8oz), de-scaled, gutted, rinsed inside and out under cold water,  2 limes, juice only ,  salt, to taste,  small bunch lemon-basil leaves,  3 bay leaves,  1 x 70x40cm\/28x16in banana leaf, to wrap the fish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bobbys_banana_leaf-baked_35050"}