{"recipe_name":"Steak with chimichurri salsa and onion rings","author":"The Hairy Bikers","programme":"The Hairy Bikers' Cook Off","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p02bzy2v.jpg","method":"For the chimichurri salsa, mix all of the salsa ingredients together in a bowl. Season, to taste, with sea salt and freshly ground black pepper and set aside. For the onion rings, soak the separated onion rings in the milk. Sift the flour, cornflour and paprika together into a bowl and season with sea salt and freshly ground black pepper. Fill a heavy-based deep-sided frying pan 1cm\/½in deep with vegetable oil and heat until a cube of bread dropped in sizzles and turns golden-brown in 30 seconds (CAUTION: hot oil can be dangerous. Do not leave unattended).  Drain the onions and dredge them in the flour mixture until well coated, shaking off any excess. Fry the onions rings in the hot oil in batches for 1-2 minutes or until lightly golden. Remove with a slotted spoon, drain on kitchen paper and sprinkle with sea salt. Repeat the process as necessary. For the steak, heat a heavy-based frying pan over a medium-high heat. Rub the oil into the steaks and season with sea salt and freshly ground black pepper. Place the steaks into the hot pan and cook for 2-3 minutes on each side (for medium-rare) or until cooked to your liking. Remove from the pan and set aside to rest for 2-3 minutes before serving. For the salad, toss the leaves in a little olive oil and lime juice. Season with sea salt and freshly ground black pepper. To serve, place the steaks onto serving plates with the onion rings alongside. Spoon over the chimichurri salsa and serve the salad on the side. ","ingredients":" 1 garlic clove, finely chopped,  ½ red onion, finely chopped ,  handful parsley leaves, finely chopped,  handful coriander leaves, finely chopped,  3 tbsp olive oil,  1 tbsp red wine vinegar ,  1 lime, juice only,  pinch dried red chilli flakes,  sea salt and freshly ground black pepper,  1 large Spanish onion, sliced into rings ,  100ml\/3½fl oz milk ,  50g\/2oz plain flour ,  1 tbsp cornflour ,  pinch paprika,  vegetable oil, for shallow frying  ,  2 rib-eye steaks (about 225g\/8oz each),  1 tbsp olive oil,  mixed salad leaves,  1-2 tsp olive oil,  ½ lime, juice only","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steak_with_chimichurri_83801"}