{"recipe_name":"Steak and kidney pudding","author":"Antony Worrall Thompson","programme":"Food and Drink","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the steak and kidney into a large bowl. Stir in the onion, celery salt, pepper, salt and thyme leaves. Toss together lightly and set to one side. To make the suet pastry, sift the flour and the salt into a large bowl. Add the suet, salt and pepper. Lightly mix and add the water a little at a time.   Cut through the dough using a round bladed knife as if you were making scones. Using your hands mix to form a soft dough. On a lightly floured work surface roll out the pastry into a round disc approximately 0.5-1cm\/¼-½in) thick. Cut out about a quarter of the pastry mixture for the lid and set aside. Use the remainder of the pastry to line a well buttered 1.75l\/3pt pudding basin, leaving at least 1cm½in of the pastry hanging over the edge. Add the flour to the steak and kidney mixture and stir gently. Place the batches of the meat mixture into a sieve (with a glass bowl underneath) and shake to remove any excess flour. Spoon into the pudding basin lined with the pastry. Do not push the meat filling into the basin and add the fresh beef stock nearly 2\/3rds to the top not covering the meat completely. Place the pastry lid over the filling and fold the border over.  Press the pastry together securely to seal. Cover the pudding with a double piece of buttered foil, pleated in the middle. Tie in place with string. Steam the pudding on an upturned plate in a large saucepan filled with hot water for 5 hours, topping up with water occasionally so as not to boil the water in the saucepan dry. To serve, turn out the pudding onto a large warm plate. Cut a wedge of the pudding and place on a serving plate with mashed potatoes and a spoonful of peas. ","ingredients":" 675g\/1½lb chuck steak, cut into 2.5cm\/1in cubes,  225g\/8oz ox kidney, cut into 2.5cm1in cubes,  1 small onion, peeled and finely chopped,  large pinch celery salt ,  salt and freshly ground black pepper,  1 tsp fresh thyme leaves,  2 tbsp plain flour,  150ml\/¼pt fresh beef stock,  400g\/14oz self-raising flour,  200g\/7oz beef or vegetarian suet,  ½ tsp salt,  freshly ground black pepper,  290ml\/½ pint cold water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steakandkidneypuddin_4410"}