{"recipe_name":"Steak Diane with cheesy mash and swede and orange purée","author":"Brian Turner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the steak, heat the oil in a small frying pan, add the onion and fry for 2-3 minutes until softened. Add the steak to the pan and fry for 1-2 minutes, then turn it over and cook for another minute on the other side.  Add the Worcestershire sauce and cream to the pan and simmer for 2-3 minutes.  For the cheesy mash, place the potato into a saucepan of boiling water and cook for 6-8 minutes, or until tender.  Drain the potatoes, return to the pan and add the egg yolk and cream. Mash the potatoes with a potato masher.  Butter a 14cm\/6in pie dish and preheat the grill to medium. Spoon the mash into the dish, sprinkle over the grated cheese and season well with salt and freshly ground black pepper. Transfer the dish to the grill to cook for 4-5 minutes, or until the cheese has melted and is bubbling. Meanwhile, to make the swede and orange purée, heat the butter in a frying pan, place the swede into the pan and cook gently for 4-5 minutes, or until tender. Add most of the oranges segments and all of the orange juice to the pan and cook for a further minute. Blend the orange and swede mixture using a hand blender and season to taste with salt and freshly ground black pepper. To serve, place the steak Diane onto a serving plate, along with the cheesy mash and swede purée. ","ingredients":" 1 tbsp olive oil,  ½ onion, chopped,  1 x 140g\/5oz rump steak, bashed flat,  2 tsp Worcestershire sauce,  3 tbsp double cream,  1 small potato, peeled, chopped,  1 free-range egg yolk,  1 tbsp double cream,  butter, for greasing,  100g\/3½oz Cheshire cheese, grated,  salt and freshly ground black pepper,  25g\/1oz butter,  150g\/5½oz swede, peeled, chopped,  1 orange,½ segmented,½ juiced ,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steakdianewithcheesy_84730"}