{"recipe_name":"Steak Maman Blanc with sautéed potatoes","author":"Raymond Blanc","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/steakmamanblancwiths_85136_16x9.jpg","method":"For the steak, season the steaks with the salt and pepper, pressing it firmly into the steaks on each side. Heat a large frying pan, add the oil and butter and heat until the butter is foaming, light brown and smells nutty. Place the steaks into the foaming butter and cook for 1-2 minutes on each side for rare, three minutes for medium rare, or four minutes for medium. Remove the steaks from the pan and place onto a warm plate. Pour the water into the frying pan and scrape the base of the pan with a wooden spoon to release the caramelised residue on the bottom of the pan, which will give taste and colour to this succulent juice. Simmer the sauce for a minute, stirring occasionally to emulsify the liquid. Pour the sauce onto the steaks and serve immediately with the potatoes. Meanwhile, for the potatoes, the potatoes, heat a separate frying pan until hot, then add the olive oil and potatoes. Sauté the potatoes over a medium heat for 4-5 minutes, or until golden-brown all over and tender. Season, to taste, with salt and freshly ground black pepper. Reduce the heat and add the butter, parsley and shallot and stir well. Allow the butter to melt and glaze the potatoes and the shallots to warm through. To serve, place the steaks onto plates and serve the potatoes alongside. ","ingredients":" 2 x 225g\/8oz sirloin steaks (preferably organic), 2cm\/¾in thick ,  salt and freshly ground black pepper,  1 tsp olive oil,  20g\/¾oz unsalted butter,  110ml\/4fl oz water,  2 medium King Edward potatoes, cut into 2cm\/¾in cubes,  1 tbsp olive oil,  salt and freshly ground black pepper,  10g\/½oz unsalted butter,  1 handful fresh flatleaf parsley, roughly chopped,  ½ banana shallot, finely chopped","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steakmamanblancwiths_85136"}