{"recipe_name":"Boeuf bourguignon with baguette dumplings","author":"Rachel Khoo","programme":"The Little Paris Kitchen: Cooking with Rachel Khoo","prep_time":"30 mins to 1 hour","cooking_time":"over 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/boeuf_bourguignon_with_17690_16x9.jpg","method":"Preheat the oven to 150C\/300F\/Gas 2.  Dust each piece of meat with flour. Heat the oil in a large casserole over a high heat and fry the meat in batches until browned. Remove each batch, keeping the oil, then fry the lardons, onions and garlic in the same pan until golden brown. Add in the herbs and spices and return the meat to the pan. Add 300ml\/10fl oz water, the wine, tomato paste, sugar and salt. Scrape up the caramelized bits as they will add flavour. Cover, place in the oven and cook for three hours or until the meat is tender and almost falling apart. Cut the baguette into small cubes and place in a bowl. Add the parsley. Bring the milk to a boil and pour over. Stir so that the milk is absorbed evenly, then cover and leave for 15 minutes.  Season with nutmeg, salt and pepper, stir in the egg, and mix in one tablespoon flour. If the mix is too wet (it should be moist and only slightly sticky), add a second spoon of flour. Wet your hands a little to help stop the dough sticking to them, then make 12-14 dumplings (smaller than a golf ball). About 20 minutes before the stew is ready, add the mushrooms into the stew and season with salt to taste.  Meanwhile, heat a knob of butter in a large frying pan and fry the dumplings on a medium heat for five minutes or until golden-brown and crisp, then drain.  Garnish the stew with parsley and serve with the dumplings. ","ingredients":" 900g\/2lb beef shin or stewing beef, cut into 6 large chunks,  2 tbsp plain flour,  2 tbsp vegetable oil,  150g\/5½oz lardons or cubes of smoked bacon,  10 button onions or shallots, peeled,  2 cloves garlic, crushed flat,  1 bay leaf,  bunch parsley, stalks only,  sprig of thyme ,  sprig of rosemary ,  3 cloves,  10 peppercorns, crushed,  500ml\/18fl oz red wine,  1 tbsp tomato purée,  1 tsp sugar,  1 tsp salt,  10 chestnut mushrooms,  parsley leaves, chopped, to garnish,  200g\/7oz stale baguette or other bread (crust included),  handful chopped parsley,  250ml\/9oz milk,  pinch of nutmeg,  salt and freshly ground black pepper,  1 free-range egg,  1 tbsp plain flour,  butter, for frying","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/boeuf_bourguignon_with_17690"}