{"recipe_name":"Steamed brill with wild garlic, ginger and chilli broth","author":"Ashley Palmer Watts","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the broth, place the vegetable stock, coconut water and slice of ginger in a pan and bring to the boil. Reduce the heat, add the Jerusalem artichokes and simmer until tender, around 10 minutes.  Meanwhile, crush the garlic, dried chilli and salt in a pestle and mortar to a paste. For the fish, mix the parsley with the lime zest and a small amount of olive oil to combine and use to coat one side of the brill fillets. Place the fish on a piece of parchment paper in a steaming basket and set to one side.  Pour 500ml water into a separate pan that your steaming basket fits on top of and add the bonito flakes, half a lime, the garlic clove, wild garlic and ginger, then bring to the boil. Place the steaming basket over the pan and steam for 5-7 minutes, until just cooked through.  When the Jerusalem artichokes are tender, add the sea beet leaves, sea kale, wild garlic and white soy to the broth and simmer for a further minute. Stir in the chilli paste to taste.  To serve, spoon some of the broth into a bowl and place the brill on top and season with salt and pepper. Spoon some of the sea vegetables on top of the fish and around the bowl, sprinkle with coriander and chilli and eat straight away.  ","ingredients":" 450ml\/¾ pint vegetable stock,  100ml\/3½fl oz coconut water,  1 slice ginger,  3 Jerusalem artichokes, peeled and cut into 1.5cm\/0.5in pieces,  1 large handful sea beet leaves,  10 stems sea kale,  10 wild garlic leaves,  35ml\/1fl oz white soy,  2 small cloves garlic,  5 dried chillies,  sea salt,  5g flat leaf parsley, chopped ,  ½ lime, zest only,  olive oil, to bind,  2 pinches bonito flakes,  ½ lime, kept whole,  1 clove garlic,  5 wild garlic leaves,  2 slices ginger,  2 brill fillets (100-110g each),  sea salt and freshly ground black pepper,  4 sprigs fresh coriander, chopped,  2 fresh red chillies, sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamed_brill_with_wild_48670"}