{"recipe_name":"Steamed chocolate and clementine sponge with orange sauce","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/ichef.bbci.co.uk\/images\/ic\/448x252\/p01sdkbf.jpg","method":"For the sponge, butter a 1.2 litre\/2 pint heatproof bowl. Carefully cut the skin off the clementines and cut the flesh into thick slices. Lay the clementine slices in the buttered bowl – with one in the centre then five around it, repeating all the way up the side of the bowl.  Place the butter, sugar, eggs, flour, cocoa, baking powder and pinch of salt into a bowl and whisk until light and fluffy. Spoon carefully into the clementine-lined bowl. Lay a sheet of greaseproof paper onto a sheet of foil, then fold a pleat down the middle. Place on top of the pudding bowl and secure with string. Take a long piece of foil and fold to make a long strip which will form a handle. Place the foil strip under the bowl and wrap over the top.  Place an upside down saucer or small plate on a cloth into the bottom of a large saucepan and fill half way up with water. Place the foil-covered bowl into the saucepan. Cover with a lid and bring to a boil, then reduce the heat and simmer for 1½-2 hours. For the sauce, heat a sauté pan or large frying pan until hot. Add the caster sugar and vanilla seeds and heat until the sugar has melted and formed a light golden-brown caramel. Add the orange liqueur and flambé by carefully tipping the pan towards the flame or lighting with cooks’ matches. Add the orange juice and clementine juice and cook for 2-3 minutes, or until it all comes together into a thin sauce. Add the butter and swirl to combine and thicken.  To serve, lift the pudding from the saucepan using the foil strip to help you. Discard the foil and baking parchment. Place a plate on top and turn over, tipping the pudding onto the plate. Pour the sauce over the top, spoon some crème fraîche over and then dig in!  ","ingredients":" 8 clementines,  175g\/6oz butter, softened, plus extra for greasing,  175g\/6oz golden caster sugar,  3 medium free-range eggs,  125g\/4½oz self-raising flour,  50g\/1¾oz cocoa powder,  1 tsp baking powder,  pinch salt,  75g\/2¾oz caster sugar,  ½ vanilla pod, split in half lengthways and seeds scraped out,  50ml\/2fl oz orange liqueur,  100ml\/3½fl oz orange juice,  1 clementine, juice only,  40g\/1½oz butter,  200g\/7oz crème fraîche","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamed_chocolate_and_85693"}