{"recipe_name":"Steamed clams with a fennel, wild garlic and chive sauce and sautéed samphire","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a saucepan until hot, add the clams and white wine and cover with a lid. Steam the clams for 60 seconds, or until they have opened.  Pour the clams into a colander and drain, keeping the liquor. Discard any clams that haven’t opened, then pull them from their shells and remove the dark grey part of the razor clams. Reserve half the razor clam shells and a few of the round shells. Rinse the clams to remove any grit, then roughly chop the flesh.  Heat a medium sauté pan and add the olive oil, once hot add the garlic and shallots and cook for 2-3 minutes. Add the diced fennel and cook for a further 1-2 minutes. Add the reserved liquor and cream and cook until reduced in volume by half. Add the clam meat, chives, garlic and tomatoes and pour the mixture back into the reserved shells to serve. Bring a large saucepan of salted water to the boil, add the samphire and cook for 2-3 minutes. Drain and place the samphire back in the pan with the butter and cook for a further 2 minutes over a medium heat. To serve, place the samphire in the centre of each plate with the filled razor clam shells on top and pour excess sauce over. Garnish with the round clam shells, shaved raw fennel and fennel tops. ","ingredients":" 12 razor clams, scrubbed (discard any clams that do not close tightly when tapped) ,  500g\/1lb 2oz clams, scrubbed (discard any clams that do not close tightly when tapped),  150ml\/5fl oz white wine,  2 tbsp olive oil,  1 garlic clove, chopped,  2 shallots, finely chopped,  1 bulb fennel, 1\/3 finely diced and 2\/3 shaved on a mandolin or finely sliced and placed in iced water,  150ml\/5fl oz double cream,  1 tsp chopped chives,  25g\/1oz wild garlic, chopped,  2 plum tomatoes, skin and seeds removed and finely diced,  500g\/1lb 2oz samphire,  50g\/2oz unsalted butter,  fennel tops, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamed_clams_with_a_73812"}