{"recipe_name":"Steamed cod and mussels with carrot and orange butter","author":"Claude Bosi","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the carrot and orange butter, place the carrot and orange juice in a large saucepan. Boil until the volume of liquid has reduced to around 60ml\/2¼fl oz. Add the reduced juice to the butter and mix in the orange zest. Add salt and pepper, to taste.  For the steamed cod and mussels, lightly salt the cod fillet and set aside for three minutes, then wash off the salt and pat the fish dry. If any mussels are open, tap them lightly on a hard surface. If they don't close, discard them. Heat a saucepan [with some liquid?]and place the mussels in the pan and place a lid on top. Cook them until they are open. Discard any that do not open after cooking. Drain them and remove the mussels from the shells.   Chop the mussels up and season with the lime zest.  To steam the cod, put a steamer over a saucepan of boiling water and steam the fish for eight minutes. Just before serving, brush with a little melted butter. Heat a deep fat fryer to 190C\/375F, or heat the vegetable oil in a deep heavy-based saucepan, until a breadcrumb sizzles and browns when dropped in it. (Caution: hot oil can be dangerous. Do not leave unattended.) In a bowl, whisk together the yeast and beer. Add the plain flour and whisk to a smooth batter. Set aside for five minutes. Drop small amounts of the batter into the hot oil and let it fry until crisp. Remove with a slotted spoon and leave to drain on kitchen paper. Blanch the broccoli in a large pan of boiling water, then refresh it in cold water to keep the colour. Heat the butter in a clean frying pan and cook the broccoli gently for a couple of minutes. To serve, spoon some of the carrot and orange butter onto the plate and add a tablespoon of the mussels on top. Place the cod on top of the mussels and add broccoli and a sprinkling of the batter. ","ingredients":" 500ml\/18fl oz carrot juice ,  250ml\/9fl oz orange juice (or blood orange juice) ,  150g\/5½oz salted butter, diced  ,  1 orange, zest only,  salt and freshly ground black pepper,  1 portion of cod loin (about 120g\/4½oz) ,  salt,  300g\/10½oz mussels ,  1 kaffir lime, or normal lime, zest only ,  50g\/1¾oz unsalted butter, melted,  vegetable oil, for deep frying,  1 tsp dried yeast,  300ml\/10½fl oz beer,  200g\/7oz plain flour,  100g\/3½oz purple sprouting broccoli ,  50g\/1¾oz unsalted butter","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamed_cod_and_mussels_41302"}