{"recipe_name":"Steamed plaice in a creamy white wine sauce with broccoli, asparagus and mushrooms ","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the steamed plaice, skin the fillets and season with salt and pepper. Roll up each fillet lengthways and secure with cocktail sticks.  Place a steamer filled with boiling water on the hob. Bring to a simmer, then place the fish near the edge and steam for 6-8 minutes. For the vegetables and white wine sauce, fill another steamer with boiling water and add the broccoli and asparagus. Steam for 4-6 minutes then remove from the heat. In a frying pan, add half the butter and, once melted, add the shallots and cook for 2-3 minutes until soft and translucent. Add the garlic and fish bones and cook for 2-3 minutes. Add the wine and simmer until the volume of liquid has reduced by half. Add the stock and reduce again by half. Pass through a sieve and stir in the cream. Season to taste with salt and freshly ground black pepper, and keep warm until ready to serve. Heat another frying pan and add the remaining butter. Once melted, add the mushrooms and fry gently for two minutes. To serve, place the broccoli and asparagus in the centre of serving plates with a plaice fillet sitting in the middle. Pour the white wine sauce over and around the plate and top with the mushrooms. Sprinkle with coriander cress. ","ingredients":" 2 whole plaice, filleted, bones reserved,  salt and freshly ground black pepper,  4 cocktail sticks, soaked in water,  1 head of broccoli, florets removed,  12 spears of asparagus, trimmed,  100g\/3½oz unsalted butter,  2 shallots, finely chopped,  1 garlic clove, finely chopped,  fish bones, reserved from filleting the plaice,  200ml\/7fl oz white wine,  200ml\/7fl oz fish stock,  200ml\/7fl oz double cream,  300g\/10oz mushrooms,  2 tbsp chopped flatfleaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamed_plaice_in_a_89103"}