{"recipe_name":"Steamed scallops with stir-fried corn and chilli, and pineapple rice","author":"Ken Hom","programme":"2007-16","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the pineapple rice, cook the rice according to packet instructions and allow it to cool thoroughly. The rice must be cold before you cook this recipe.   Heat a wok over high heat until it is hot. Add the oil, and when it is very hot and slightly smoking, add the pork and stir-fry for two minutes.  Add the soy sauce, salt, pepper, ginger, and spring onions and continue to stir-fry for two minutes.   Add the rice, mix well and continue to stir-fry the mixture for another five minutes until the rice is heated through and well mixed.  Stir in the sesame oil and add the pineapple pieces. Continue to stir-fry until the pineapple is warmed through but not cooked.  Keep warm until ready to serve. For the stir-fried corn and chilli, if the corn is fresh, cut the kernels off the cob.  Blanch frozen corn for five seconds in boiling water and drain. Heat a wok or large sauté pan until it is hot. Add the oil, salt, corn, and chilies and stir-fry for one minute.  Put in the pepper, sugar, and chicken stock, and continue to cook for three minutes. Set aside until ready to serve. For the steamed scallops, put the scallops on a heatproof plate. Next, set up a steamer or put a rack into a wok or deep pan and fill it with 5cm\/2in of water. Bring the water to the boil over a high heat.   Put the scallops on the plate into the steamer or onto the rack.  Turn the heat to low and cover the wok or pan tightly then steam gently for five minutes.  Meanwhile, in a heatproof bow, combine all the remaining ingredients except the oil and coriander sprigs to make a sauce.  Heat a wok or large frying-pan over high heat until it is hot.  Add the oil, and when it is very hot and slightly smoking, pour this hot oil over the sauce ingredients.  Remove the scallops from the steamer and place onto serving plates, then give the sauce several good stirs.   To serve, pour the sauce over the scallops, garnish with the fresh coriander and serve at once with the stir-fried corn and chilli, and pineapple rice. ","ingredients":" long-grain rice measured to the 400ml\/14fl oz  level in a measuring jug,  2 tbsp groundnut or peanut oil,  225g\/8oz minced pork,  2 tbsp soy sauce,  salt and freshly ground black pepper, to taste,  2 tbsp fresh ginger, finely chopped ,  3 tbsp spring onions, finely chopped ,  1 tbsp sesame oil,  1 small pineapple, about 225g\/8oz, peeled, cored and cut into 1cm\/½in cubes,  275g\/10oz fresh, or frozen sweetcorn (about two cobs),  1½ tbsp groundnut or vegetable oil,  salt and freshly ground white pepper, to taste,  2 large red chilies, de-seeded and finely chopped,  1 tsp sugar,  50ml\/2fl oz vegetable or chicken stock,  450g\/1lb fresh scallops,  1 tbsp fresh ginger, finely chopped ,  1 tbsp Shaoxing rice wine or dry sherry,  2 tbsp soy sauce,  1 large fresh red mild chillies, de-seeded and chopped,  3 tbsp spring onions, finely shredded,  3 tbsp groundnut or vegetable oil,  4 fresh coriander sprigs","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamed_scallops_with_23080"}