{"recipe_name":"Steamed sea bass with chilli on roasted garlic sweet potato with leek and lemon butter sauce","author":"Richard Phillips","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Bring a pan of salted water to the boil. For the sea bass, place the fish onto a sheet of aluminium foil and dot small pieces of the butter on top.  Pour the white wine over the fish, place the lemon slices on top of it, and sprinkle over the chilli. Draw the edges of the aluminium sheet together and fold into a sealed parcel.  Place the wrapped fish parcel into a steamer basket over the pan of boiling water. Add the broccoli pieces to the basket, placing them around the edge of the parcel. Steam for 6-8 minutes, or until cooked through. For the roasted garlic sweet potato, heat the butter and sesame oil in an ovenproof frying pan over a medium heat. Add the sweet potato wedges and garlic cloves and fry for 3-4 minutes, or until they start to colour.  Add the rosemary, season to taste with salt and freshly ground black pepper, and transfer to the oven for 8-10 minutes, or until cooked through. For the leek and lemon butter sauce, heat the butter in a separate frying pan over a medium heat, add the leeks and fry for 5-6 minutes, or until coloured. Add the lemon zest and juice, season to taste with salt and freshly ground black pepper, and cook until the leeks are tender and the sauce has reduced slightly.  To serve, arrange the steamed bass, broccoli, sweet potato wedges and garlic on a serving plate. Spoon the leek and lemon butter sauce around the edge of the plate. ","ingredients":" 1 fillet sea bass, skin scored,  25g\/1oz butter,  3 tbsp white wine,  ½ lemon, sliced,  1 red chilli, chopped,  55g\/2oz broccoli florets,  25g\/1oz butter,  1 tsp sesame oil,  ½ sweet potato, cut into wedges,  2 garlic cloves, left whole in their skins, crushed,  1 tbsp chopped fresh rosemary,  salt and freshly ground black pepper,  25g\/1oz butter,  ½ leek, sliced into rings,  ½ lemon, zest and juice only,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamedseabasswithch_89398"}