{"recipe_name":"Steamed sole with garlic, spring onions and ginger","author":"Ken Hom","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Pat the fish or fish fillets dry with kitchen paper. Rub with the salt on both sides, and let them sit for 30 minutes. (This helps the fish to firm up and draws out any excess moisture.) Set up a steamer or put a rack into a wok or deep pan and fill it with 5cm\/2in of water. Bring the water to the boil over a high heat.  Put the fish on a heatproof plate and scatter the ginger evenly over the top. Put the plate of fish into the steamer or on to the rack. Cover the pan tightly and gently steam the fish until it is just cooked. (Flat fish will take about five minutes to cook. Thicker fish or fillets will take 12-14 minutes.) Remove the plate of cooked fish and sprinkle on the spring onions and light and dark soy sauces.  Heat the groundnut and sesame oils together in a small saucepan.  When they are hot, add the garlic slices and brown them.  Pour the garlic-oil mixture over the top of the fish and serve at once. For the stir-fried rice noodles with vegetables, soak the rice noodles in a bowl of warm water for 25 minutes. Then drain them in a colander or sieve. Trim the bean sprouts at both ends. Finely shred the chillies and the water chestnuts. Heat a wok or large frying pan until it is very hot. Add the oil and when it is very hot and slightly smoking, add the garlic, ginger and spring onions and stir-fry for 15 seconds.  Then add the bean sprouts, shredded chillies and shredded water chestnuts and stir-fry for about one minute.  Add the rest of the ingredients and the drained noodles and stir fry for about three minutes until it is well mixed and heated through.  Serve at once. ","ingredients":" 4 fillets of sole (about 450g\/16oz),  1 tsp coarse sea salt or plain salt,  1½ tbsp finely shredded fresh ginger,  3 tbsp finely shredded spring onions,  1 tbsp light soy sauce,  2 tsp dark soy sauce,  1 tbsp groundnut (peanut) oil,  2 tsp sesame oil,  2 cloves garlic, thinly sliced,  225g\/8oz rice noodles, rice vermicelli, or rice sticks,  225g\/8oz fresh bean sprouts,  100g\/4oz red or green chillies,  225g\/8oz water chestnuts, peeled if fresh or rinsed if canned,  2 tbsp groundnut (peanut) oil,  1½ tbsp finely chopped garlic,  2 tsp finely chopped fresh ginger,  6 spring onions, shredded,  1 tsp salt,  ½ tsp freshly ground white pepper,  2 tbsp light soy sauce,  1 tbsp dark soy sauce,  2 tsp whole yellow bean sauce,  2 tbsp Shaoxing rice wine or dry sherry,  5 tbsp Chicken Stock or water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamedsolewithgarli_71356"}