{"recipe_name":"Steamed treacle sponge pudding with clotted cream ice cream","author":"Galton Blackiston","programme":"Great British Menu","prep_time":"over 2 hours","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"First make the ice cream. Place the cream and milk in a saucepan and heat gently until on the verge of boiling.  Meanwhile, whisk the egg yolks with the sugar in a large bowl until well combined. Slowly add the hot cream mixture, continuing to whisk as you do so.  Pour the mixture back into the saucepan and cook over a low heat, stirring constantly, until thick enough to coat the back of a wooden spoon. Be careful not to let the mixture get too hot or it might split.  Pass through a fine sieve and allow to cool completely. Churn in an ice-cream machine to a soft consistency. Transfer to an airtight container and put into the freezer for at least two hours. Butter the inside of a 1 litre\/1¾ pint pudding basin. Combine the golden syrup with the orange zest and juice, then pour this into the bottom of the basin. Set aside.  Beat the butter and sugar together until the mixture is pale, then slowly add the beaten eggs, beating well after each addition. Add the black treacle, followed by the flour, again beating well.   Spoon this mixture into the pudding basin and cover with greaseproof paper and kitchen foil, pleated across the middle. Tie on with string and trim off any excess.  Steam the pudding in a deep pot with a tight-fitting lid, with water that comes halfway up the side of the basin, for two hours, checking the water level at regular intervals and topping up if necessary.   To serve, run a knife around the rim of the basin and ease out the pudding onto a large serving plate. Serve each portion with a good spoonful of ice cream. ","ingredients":" 300ml\/10fl oz clotted cream,  150ml\/5fl oz milk,  5 free-range eggs yolks,  115g\/4oz caster sugar,  175g\/6oz unsalted butter, softened, plus extra for greasing,  4 tbsp golden syrup,  1 orange, zest and juice,  175g\/6oz light soft brown sugar,  3 free-range eggs, beaten,  1 tsp black treacle,  175g\/6oz self-raising flour","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/steamedtreaclesponge_81747"}