{"recipe_name":"Sticky belly pork and rice wrapped in lotus leaves","author":"Ching-He Huang","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 2-4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the glutinous rice, rinse the rice in bowls of water until the water runs clear (to remove the excess starch). Place in a pan with 600ml\/1 pint water. Bring to the boil, then reduce the heat, cover and simmer for 15 minutes. Ensure all the water has evaporated before using.  For the lotus leaf parcels, heat a wok over high heat until it begins to smoke, then add the peanut oil.  Add the ginger, shallots, chopped shrimps and mushrooms and stir-fry for one minute.  Add the pork belly and stir-fry to break it up. When the pork begins to brown, stir in the five-spice and rice wine (or sherry). When the wine has almost evaporated, stir in the cooked rice.  Once the rice is incorporated, season with the soy sauce, the sesame oil, salt and white pepper and mix well. Remove from the heat. Pat the lotus leaves dry using kitchen paper.  Spoon half of the sticky rice mixture into the centre of one lotus leaf.  Fold in the sides (snug, but not tight), fold up the bottom and roll up, then secure with cooks' string.  Repeat with the remaining lotus leaf and rice.  Place in a bamboo steamer and steam for 10 minutes until the fragrance has infused. Remove from the steamer and untie the parcels For the pak choi stir fry, heat a wok until hot, then add the garlic, ginger and chilli and stir fry for one minute. Add the pak choi and stir fry for another minute then add the remaining ingredients and stir fry for 1-2 minutes until the pak choi has just wilted and is hot. To serve, place the parcels on a serving plate with pak choi alongside and garnish with the sliced spring onions.  ","ingredients":" 300g\/10½oz glutinous rice,  1 tbsp peanut oil,  2.5cm\/1in piece fresh root ginger, peeled and grated,  2 small shallots, finely chopped,  small handful of dried shrimps, soaked in hot water for 20 mins, then drained and finely chopped,  5 small, dried shiitake mushrooms, soaked in hot water for 20 mins, then drained and finely chopped,  300g\/10½oz pork belly, cut into 0.5cm\/¼in square cubes,  1 tsp Chinese five-spice powder,  1 tbsp Shoaxing rice wine (or dry sherry),  600g\/1lb 5oz cooked glutinous rice (from above),  2 tbsp light soy sauce,  1 tsp toasted sesame oil,  pinch sea salt,  freshly ground white pepper,  2 dried lotus leaves, soaked in hot water for 20 mins, then drained,  2 garlic cloves, finely chopped,  1 knob ginger, finely grated,  1 red chilli, de-seeded and finely chopped,  150-200g\/5-7oz baby pak choi leaves, washed and halved,  1 tbsp shaoxing rice wine or water,  1 tbsp low sodium light soy sauce,  1 tbsp toasted sesame oil,  1 tbsp black rice vinegar or clear rice vinegar,  1-2 spring onions, sliced into long strips, then placed in iced water and drained, to make curls","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sticky_belly_pork_rice_88835"}