{"recipe_name":"Sticky lamb chops with roasted stuffed peppers","author":"James Martin","programme":"2007-16","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb chops, place the lamb chops into a large bowl. Drizzle over the olive oil and sprinkle over the fennel seeds and lemon juice. Turn the lamb chops until thoroughly coated in the mixture, then cover the bowl and chill in the fridge for one hour, to marinate. Meanwhile, for the roasted stuffed peppers, preheat the oven to 180C\/350\/Gas 4. Place the peppers, cut-sides facing upwards, into a roasting tray. Add an onion quarter and a tomato quarter and a sprig of rosemary to each pepper. Season, to taste, with salt and freshly ground black pepper, then drizzle over the olive oil. Transfer the peppers to the oven and roast for 30 minutes, or until the peppers are tender and slightly blackened.  Meanwhile, for the sticky lamb sauce, heat the olive oil in a frying pan over a medium heat. Add the shallot, garlic and chilli and fry for 2-3 minutes, or until softened. Add the star anise and ground fennel and cook for a further minute, or until the spices are fragrant. Add the muscovado sugar, soy sauce and tomato ketchup, stir well, then bring the mixture to the boil. Reduce the heat until the mixture is simmering, then continue to simmer for 4-5 minutes, or until the sauce has thickened. Set aside. When the lamb chops have marinated, remove them from the marinade and scrape off any fennel seeds. Heat a griddle pan over a medium heat until hot. Add the marinated lamb and cook for 3-4 minutes, or until golden-brown on one side.  Brush the tops of the lamb chops with some of the sticky lamb sauce, then turn the chops over and brush with more of the sauce. Continue to cook for a further 2-3 minutes (for medium), or until cooked to your liking. Remove from the heat and set aside on a warm plate to rest. To serve, place one stuffed red pepper half and one stuffed orange pepper half onto each of four serving plates. Place two sticky lamb chops alongside and drizzle over the remaining spiced sauce. ","ingredients":" 8 medium-sized lamb chops,  3 tbsp olive oil,  1 tbsp whole fennel seeds,  ½ lemon, juice only,  2 red peppers, cut in half, seeds removed,  2 orange peppers, cut in half, seeds removed,  1 red onion, peeled, cut into quarters,  1 tomato, cut into quarters,  4 small sprigs fresh rosemary,  2 tbsp extra virgin olive oil,  1 tbsp olive oil,  1 shallot, finely chopped,  2 garlic cloves, finely chopped,  1 red chilli, finely chopped,  2 star anise,  1 tsp ground fennel seeds,  50g\/2oz dark muscovado sugar,  50ml\/2fl oz soy sauce,  300ml\/11fl oz tomato ketchup","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stickylambchopswithr_91725"}