{"recipe_name":"Sticky pork patties with stir-fried greens and onion rings","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the sticky pork patties, remove the sausagemeat from the skin and shape into three patties using your hands. Dust in the flour. Heat the oil in an ovenproof frying pan and fry the patties for 2-3 minutes on each side, until they start to turn golden-brown. Transfer to the oven and bake for 8-10 minutes, or until cooked through. Remove the pan from the oven and set the patties aside on a plate. Pour the soy sauce and honey into the pan and place over a medium heat. Bring to a simmer and scrape up any brown bits at the bottom of the pan with a wooden spoon. For the stir-fried greens and toasted walnuts, place the walnuts on a baking sheet and place in the oven to toast for 2-3 minutes, being careful not to let them burn. Heat the butter in a frying pan and add the shredded greens and boiling water. Place a tightly fitting lid over the pan and cook until tender, about 4-5 minutes. Remove the lid and stir in the toasted walnuts. For the onion rings, place the vegetable oil into a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Soak the slices of onion in the milk and then dust in the flour. Place into the hot oil and deep fry until golden-brown and crisp, about 5-6 minutes. Remove from the pan with a slotted spoon and drain on kitchen paper. To serve, place the walnuts and greens on a serving plate and arrange the patties on top. Pour over the soy and honey sauce from the pan and place the onion rings around the outside. ","ingredients":" 3 good quality pork sausages,  2 tbsp plain flour,  2 tbsp olive oil,  1 tbsp soy sauce,  1 tbsp honey,  55g\/2oz walnuts, chopped,  25g\/1oz butter,  100g\/3½oz spring greens, shredded,  2 tbsp boiling water,  300ml\/½ pint vegetable oil, for deep frying,  ½ red onion, cut into thick rings,  100ml\/3½fl oz milk,  3 tbsp plain flour","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stickyporkandbananap_88631"}