{"recipe_name":"Sticky toffee prune pudding with toffee sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 190C\/375F\/Gas 5.  Line a 20cm\/8in square cake tin with baking parchment.  Place the prunes and water into a saucepan and bring to the boil. Simmer for 2-3 minutes. Stir the vanilla extract into the prune mixture.  Blend with a stick blender until thick and soupy.  Put the butter and sugar into a large bowl and beat together until smooth. Stir in the golden syrup and treacle before stirring in the flour and mixing well.  Break the eggs one by one into the bowl with the butter and sugar, stirring well after each addition.  Add the bicarbonate of soda to the prune mix, then pour this mixture into the flour mixture and beat well with a wooden spoon to blend.  Pour the pudding mixture into the prepared tin.  Transfer to the oven and bake for 1-1½ hours, or until well-risen and springy to the touch.  To make the sauce, put the cream in a saucepan and heat gently. Add the sugar and butter and whisk until dissolved.  Whisk in the syrup and treacle.  Serve the pudding hot in bowls with the sauce poured over the top and a dollop of vanilla ice cream each. ","ingredients":" 400g\/14oz Agen prunes, pits removed,  500ml\/18fl oz water,  1 tsp vanilla extract,  110g\/4oz butter, softened,  350g\/12oz dark muscovado sugar,  1 tbsp golden syrup ,  1 tbsp treacle,  4 free-range eggs,  1 tbsp bicarbonate of soda,  400g\/14oz self-raising flour,  vanilla ice cream, to serve,  500ml\/18fl oz double cream,  175g\/6oz demerara sugar,  175g\/6oz butter,  1 tbsp golden syrup,  1 tbsp black treacle","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stickytoffeeprunepud_85027"}