{"recipe_name":"Sticky toffee pudding and custard","author":"James Tanner","programme":"Put Your Money Where Your Mouth Is","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. Line a loaf tin with greaseproof paper. In a food processor, blend the brown sugar and butter together until the mixture is fluffy. Gradually add the eggs, one at a time, waiting until each addition has been fully incorporated into the mixture before adding the next. In a pan, cover the dates with water. Bring the water to a simmer over a medium heat and cook for 6-8 minutes, or until the dates have broken down and most of the water has evaporated. Add the bicarbonate of soda and stir until dissolved. Remove the pan from the heat and set aside to cool slightly. Add the date mixture to the cake batter in the food processor and blend to a purée.  Transfer the cake batter to a mixing bowl and carefully fold in the flour until well combined.  Pour the cake batter into the prepared loaf tin and bake in the oven for 30-40 minutes, or until the sponge has risen and a skewer inserted into the cake comes out clean. Once cooked allow to cool in the tin. Meanwhile, for the custard, bring the cream, milk and vanilla pod and seeds to the boil in a separate saucepan. Remove from the heat and set aside for 15 minutes to allow the flavour of the vanilla to infuse.   In a bowl, beat the egg yolks and sugar together until pale and fluffy. Pour the warm milk and cream mixture over the egg and sugar mixture, stirring continuously, until well combined.  Strain the mixture through a sieve into a clean pan. Return the pan to a low heat and heat the custard, stirring continuously, until it has thickened. Remove from the heat and cover with cling film to prevent a skin forming on the surface of the custard. For the sticky toffee sauce, bring all of the sticky toffee sauce ingredients to the boil in a pan, stirring continuously, until smooth and well combined. Keep warm. To serve, slice the sticky toffee pudding into eight pieces. Pour over the sticky toffee sauce and set aside for 4-5 minutes to soak. Place one of the sticky toffee pudding slices into the centre of each serving plate and drizzle over the custard. ","ingredients":" 125g\/4¼oz soft brown sugar,  75g\/2½oz unsalted butter,  2 free-range eggs,  275g\/9¾oz dried dates, stones removed, chopped,  1 tsp bicarbonate of soda,  200g\/7¼oz self-raising flour,  200ml\/7¼fl oz double cream,  150ml\/5¼fl oz full-fat milk,  1 vanilla pod, split, seeds scraped out,  5 free-range egg yolks,  50g\/1¾oz caster sugar,  100g\/3½oz soft dark brown sugar,  25g\/1oz demerara sugar,  300ml\/10½fl oz double cream","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stickytoffeepuddinga_91076"}