{"recipe_name":"Bombay potato cakes with coriander and mint","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4.  For the potato cakes, heat half of the oil in a casserole in the oven. When the oil is smoking, add the raw potato cubes and turn them until coated in the oil on all sides.  Stir in the spices, garlic and chilli to coat the potatoes, then season, to taste, with salt and freshly ground black pepper. Roast the potatoes in the oven for 20-25 minutes, or until crisp and golden-brown but tender inside. Remove the potatoes from the casserole using a slotted spoon and set aside on kitchen paper to drain and cool slightly, then mix into the mashed potatoes.  Shape the mashed potato mixture into twenty to twenty-four 5cm\/2in patties, using your hands. Sprinkle the flour onto a plate and season, to taste, with salt and freshly ground black pepper. Roll each patty in the seasoned flour. Heat the remaining oil in a frying pan over a medium heat. Add the patties, in batches, and fry in the oil for 2-3 minutes on each side, or until crisp and golden-brown on both sides and heated through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining patties. Meanwhile, for the sauce, blend the herbs, salt and vinegar in a food processor until well combined. Stir in the yoghurt. To serve, divide the Bombay potato cakes equally among six to eight serving plates. Place dipping bowls of the sauce alongside each. ","ingredients":" 200g\/7oz vegetable oil,  450g\/1lb raw potatoes, peeled, cut into cubes,  1 tbsp coriander seeds, toasted in a dry frying pan, crushed to a powder,  1 tbsp cumin seeds, toasted in a dry frying pan, crushed to a powder,  1 tbsp garam masala,  1 tsp ground ginger,  2 garlic cloves, peeled, crushed to a paste with the edge of a knife,  3 red chillies, finely chopped ,  salt and freshly ground black pepper,  200g\/7oz boiled potatoes, mashed until smooth,  100g\/3½oz plain flour,  small bunch fresh coriander,  small bunch fresh mint leaves,  1 tsp sea salt,  75ml\/2¾fl oz white wine vinegar,  200ml\/7fl oz plain yoghurt","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bombaypotatocakeswit_92717"}