{"recipe_name":"Stir-fried beef with egg-fried rice","author":"Ken Hom","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rice, put the rice into a large bowl and wash it in several changes of water until the water becomes clear.  Drain the rice and put it into a heavy pot with enough water so that the level of water is about 2.5cm\/1in above the top of the rice. Boil until most of the surface liquid has evaporated.  This should take about 15 minutes.  The surface of the rice should have small indentations like a pitted crater.  At this point, cover the pot with a very tight-fitting lid, turn the heat as low as possible and let the rice cook undisturbed for 15 minutes.  Spread the cooked rice on a baking sheet, and when it is cool, transfer to the fridge until it is cold. Put the beef into a bowl together with the soy sauce, Shaoxing rice wine, ginger, cornflour and sesame oil. Mix well, and then let the mixture marinade for about 20 minutes. When you are ready to cook the rice, combine the egg, sesame oil and half the salt in a small bowl and set aside. Heat a wok or large frying-pan over high heat until it is hot. Add the groundnut oil, and when it is very hot and slightly smoking, add the cooked rice and stir-fry it for 3 minutes or until it is thoroughly warm through. Next drizzle in the egg mixture and continue to stir-fry for 2-3 minutes or until the eggs have set and the mixture has dried. Now add the remaining salt and pepper and continue to stir-fry for 2 minutes, toss in the spring onions. Stir several times, turn onto a serving platter. To cook the beef heat a wok or large frying-pan over high heat until it is very hot. Add the groundnut oil, and when it is very hot and slightly steaming, remove the beef from the marinade with a slotted spoon. Add it to the pan and stir-fry it for 2 minutes until it browns.  Remove it and leave to drain in a colander or sieve. Pour off most of the oil, leaving about 2 teaspoons.   Reheat the wok or pan over a high heat and then add the dried chillies. Stir-fry them for 10 seconds. Then return the beef to the pan, and add the rest of the remaining ingredients and stir-fry for 4 minutes, mixing well.  Serve the dish at once with the rice. ","ingredients":" long-grain rice measured to the 400ml\/14fl oz level in a measuring jug ,  2 large free-range eggs, beaten,  2 tsp sesame oil,  1 tsp salt,  2 tbsp groundnut or vegetable oil,  ¼ tsp freshly ground black pepper,  2 tbsp spring onions, finely chopped,  450g\/1lb beef fillet, cut into thick slices 5cm\/2in long, cut against the grain,  1 tbsp light soy sauce,  1 tbsp Shaoxing rice wine or dry sherry,  1½ tsp fresh ginger, finely chopped,  2 tsp cornflour,  2 tsp sesame oil,  4 tbsp groundnut or vegetable oil,  2 dried red chillies, cut in half lengthways,  1 tbsp dried citrus peel, soaked and coarsely chopped,  2 tsp roasted Sichuan peppercorns, finely ground (optional),  1 tbsp dark soy sauce,  ½ tsp salt,  ½ tsp freshly ground black pepper,  1½ tsp sugar,  2 tsp sesame oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stir-fried_beef_with_53013"}