{"recipe_name":"Stir-fried squid with apple salad","author":"Atul Kochhar","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the salad, place the mint, micro cress, salad leaves, apple and peanuts into a bowl and mix until well combined. Blend the lemongrass, galangal, lime juice, sweet chilli sauce, fish sauce and palm sugar to a purée in a food processor. Pour the dressing over the salad and mix until well combined. Set aside. For the squid, mix the soy sauce, chilli sauce, honey, vinegar, and oyster sauce together in a bowl until well combined. Set aside. Heat the vegetable oil in a wok over a high heat until smoking. Add the ginger, garlic and squid and stir-fry for 2-3 minutes. Stir in one tablespoon of water. Add the soy sauce mixture to the wok and stir until well combined. Stir in the onion, dried chillies, cashew nuts and spring onions and cook for a further 2-3 minutes. To serve, spoon the salad onto serving plates and top with the squid. Garnish with the extra spring onions and cashew nuts. ","ingredients":" 6 fresh mint leaves, julienned,  3-4 tbsp micro cress leaves,  handful seasonal salad leaves ,  2 Granny Smith apples, cores removed, julienned,  2 tbsp roasted salted peanuts, crushed,  1 stalk lemongrass, soft white inner core only, finely sliced,  ½ tbsp chopped fresh galangal,  1 tbsp lime juice,  3 tbsp sweet chilli sauce,  1 tbsp fish sauce,  1 tbsp palm sugar,  salt, to taste,  1 tbsp soy sauce,  1 tsp chilli sauce,  1 tsp honey,  1 tsp malt vinegar,  1 tsp oyster sauce,  1½ tbsp vegetable oil,  25g\/1oz fresh root ginger, finely sliced,  3 garlic cloves, finely sliced,  200g\/7oz squid, quills, beaks and membranes removed, rinsed, sliced into rings,  100g\/3½oz onion, diced,  2-3 dried chillies, to taste, finely sliced,  50g\/2oz cashew nuts, plus extra to garnish,  2-3 spring onions, finely sliced, plus extra to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stir-fried_squid_with_98011"}