{"recipe_name":"Stir-fried lobster with black bean sauce","author":"James Martin","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Heat a heavy-based wok over a high heat until smoking. Add enough vegetable oil to reach 6cm\/2½in up the sides of the wok and heat until a breadcrumb sizzles and turns brown after 30 seconds when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Alternatively, heat a deep fat fryer to 180C. Place the cooked lobster pieces into a bowl. Add the ginger wine or dry sherry, cornflour and black pepper and mix well to coat the lobster. Carefully lower the lobster pieces into the hot oil, in batches if necessary, and fry for 1-2 minutes, or until the coating is crisp and golden-brown and the lobster meat is warmed through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm. Repeat the process with the remaining pieces of lobster. Discard most of the oil in the wok to leave about three tablespoons. Heat the remaining oil in the wok until smoking, add the garlic and ginger and stir fry for 30-45 seconds, taking care not to burn the garlic.  Add the black bean paste, peppers and red chillies and stir fry for a further 1-2 minutes. Add the deep-fried lobster, rice wine and stock, stir well and bring the mixture to the boil. Add the caster sugar and soy sauce, then stir well and reduce the heat until the mixture is simmering. Cover the wok with the lid and simmer for 1-2 minutes. Add the spring onions and continue to simmer for a further minute. Serve immediately in serving bowls. ","ingredients":" vegetable oil, for deep frying,  2 x 1kg\/2lb 2oz cooked lobsters, shells removed, cut into large serving pieces,  1 tbsp ginger wine or dry sherry,  1 tbsp cornflour,  ½ tsp freshly cracked black pepper,  2 garlic cloves, peeled, finely chopped,  1 tsp finely chopped ginger,  2 tbsp ready-made black bean paste,  2 green peppers, core and seeds removed, cut into small cubes,  2-3 red chillies, seeds removed, chopped,  1 tsp rice wine,  125ml\/4½fl oz chicken or fish stock ,  1 large tsp caster sugar,  3 tbsp soy sauce,  6 spring onions, dark green part removed, trimmed, sliced","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stirfriedlobsterwith_92344"}