{"recipe_name":"Bone marrow with sirloin steak, bordelaise sauce and sautéed sprouts with chestnuts","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/160C Fan\/Gas 4. Heat 4 tablespoons of oil in a frying pan, add the shallots and fry until golden. Transfer to a roasting tray  and roast for 15-20 minutes. Add the bone marrow to the roasting tray and return to the oven for 6 minutes, or until the marrow is just cooked, loose but not completely melted. Leave to rest in a warm place.  Heat the remaining oil in the frying pan. Add the steaks and cook each side for 2-3 minutes, depending on the thickness of the steak and how you like it cooked. Leave to rest. For the bordelaise sauce, melt the butter in a saucepan over a medium heat. Add the shallot and cook for 2-3 minutes. Add the thyme, bay leaf and peppercorns and cook for 3 minutes. Add the wine and cook until the volume of liquid has reduced by half. Pour in the stock and reduce by half again. Season with a little sugar, to taste. Add the bone marrow from one of the roasted pieces, whisk and set aside. Keep warm.  For the saute sprouts, heat a sauté pan. Add the sprouts and cook for 1-2 minutes. Add the chestnuts and parsley and cook for a further 2 minutes. Serve the steak with the roasted shallots and bone marrow and the sprouts, with the sauce poured over.  ","ingredients":" 6 tbsp olive oil,  4 shallots, halved and skin left on,  5 x 2.5cm\/1in cut bone marrow, cleaned,  4 sirloin steaks,  50g\/1¾oz unsalted butter,  1 shallot, finely chopped,  2 sprigs thyme, leaves picked,  1 bay leaf,  5 black peppercorns,  200ml\/7fl oz red wine,  300ml\/10fl oz veal or beef stock, warmed,  pinch sugar,  50g\/1¾oz unsalted butter,  250g\/9oz Brussels sprouts, thinly sliced,  70g\/2½oz cooked chestnuts, chopped,  2 tbsp chopped fresh flat-leaf parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bone_marrow_with_sirloin_04518"}