{"recipe_name":"Stir-fried Sichuan-style green pepper and squid with green pepper pilau","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the green pepper pilau, heat the oil in a pan over a medium heat, add the shallot, garlic and green pepper and fry for 2-3 minutes, or until softened. Add the rice and stir well to combine, then pour over the stock and bring the mixture to the boil, stirring well. Reduce the heat until the mixture is simmering gently, then cover the pan with a lid and simmer for 12-15 minutes, or until the rice has absorbed all of the stock and is tender. Season, to taste, with salt and freshly ground black pepper. Meanwhile, for the green pepper and squid, crush the Sichuan peppercorns, garlic and sugar using a pestle and mortar. Add the rice wine vinegar and mix to a smooth paste. Heat the oil in a wok over a high heat. When the oil is smoking, add the green peppers and stir-fry for 1-2 minutes. Add the spring onions and squid and continue to stir-fry for 1-2 minutes, or until the squid has just turned opaque.  Add the Sichuan peppercorn paste and mix well to coat the stir-fried ingredients, then add the water and stir-fry for a further minute, or until most of the liquid has evaporated. Season, to taste, with salt, if necessary. To serve, place a chefs' ring into the centre of a serving plate. Fill it with the green pepper pilau, then carefully remove the chefs' ring. Repeat the process with the remaining three serving plates. Spoon the stir-fried Sichuan-style green pepper and squid mixture on top of the portions of rice. Drizzle over the wok juices. ","ingredients":" 1 tbsp olive oil,  1 shallot, finely chopped,  1 garlic clove, finely chopped,  1 green pepper, finely chopped,  300g\/11oz basmati rice,  450ml\/16fl oz chicken stock,  2 tbsp Sichuan peppercorns,  1 garlic clove, crushed to a paste with the edge of a knife,  1 tbsp caster sugar,  3 tbsp rice wine vinegar,  1 tbsp vegetable oil,  2 green peppers, finely sliced ,  4 spring onions, trimmed, finely sliced,  400g\/14oz squid, quills and beaks removed, flesh sliced into strips,  50ml\/2fl oz water","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stirfriedszechuangre_91724"}