{"recipe_name":"Stollen","author":"Paul Hollywood","programme":"The Great British Bake Off","prep_time":"over 2 hours","cooking_time":"1 to 2 hours","serves":"Serves 10-12","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/stollen_27553_16x9.jpg","method":"Put the flour and sugar in a large bowl. Add the yeast on one side of the bowl and the salt on the other. Add the softened butter and 200ml\/7fl oz of the milk and stir together.  Add the remaining milk and bring the mixture together to form a soft dough. Transfer to a generously floured work surface and knead for 6-7 minutes, or until smooth and pliable. Mix the nutmeg, cloves, vanilla and almond extract, almonds, dried fruit and mixed peel together in a large bowl. Put the dough on top and knead from the outside into the centre incorporating the dried fruit and spices as you go. When everything has been fully incorporated, cover the bowl with cling film and leave to rise for 1-2 hours in a warm place, or until doubled in size. Flatten the dough and roll out on a lightly floured work surface to a rectangle about 45x35cm\/18x14in (or so the short side of the dough matches the longest side of your baking tray). Brush with the melted butter.  Roll out the marzipan to about 35x15cm\/14x6in (the long side should approximately match the width of the dough). Place on top of the dough in the middle. Roll the dough up to enclose the marzipan and transfer to a baking tray lined with baking parchment. Cover and leave to rise for about an hour, or until risen and doubled in size. Preheat the oven to 190C\/375F\/Gas 5 (fan 170C). When the dough is risen, bake for an hour. Remove from the oven, brush with melted butter, and dust with icing sugar. Serve cold. ","ingredients":" 500g\/1lb 2oz strong white flour, plus extra for flouring,  100g\/3½oz caster sugar,  10g fast action yeast,  10g salt,  150g\/5½oz unsalted butter, softened,  250ml\/9fl oz full-fat milk,  pinch ground nutmeg,  pinch ground cloves,  ½ tsp vanilla extract,  2 drops almond extract,  55g\/2oz blanched almonds, finely chopped ,  200g\/7oz raisins,  100g\/3½oz currants,  125g\/4oz mixed peel,  25g\/1oz butter, melted,  225g\/8oz marzipan,  25g\/1oz butter, melted,  2 tbsp icing sugar","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stollen_27553"}