{"recipe_name":"Strawberry and cream meringue nest petits fours","author":"Holly Bell","programme":"The Great British Bake Off","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Makes 24","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to the lowest temperature and put the shelf at the bottom of the oven. Line two baking trays with greaseproof paper and draw 12 x  5cm\/2in circles onto the paper, leaving at least 2cm\/¾in between them. For the meringue, whisk the egg whites and lemon juice in a bowl until soft peaks form. Gradually whisk in the sugar until fully incorporated, then continue to whisk until stiff peaks form when the whisk is removed. Spoon the meringue into a piping bag fitted with a small star nozzle and pipe nests onto the baking trays using the circles to guide you. Bake for 1½-2 hours or until the meringues lift off the greaseproof paper easily; they should not be coloured. Set aside to cool on a wire rack.  Meanwhile, for the mousse,  whisk the egg whites until stiff peaks form when the whisk is removed. In a separate bowl, whisk the double cream to stiff peaks and fold in the icing sugar.  Blend the strawberries in a food processor and pass through a fine sieve.  Squeeze out the gelatine leaves and place in a small pan with four tablespoons of the strawberry purée. Heat gently, stirring until the gelatine has dissolved. Leave to cool a little then mix in the remaining strawberry purée and fold into the double cream. Fold this mixture into the egg whites, then cover with cling film and chill in the fridge. To assemble, spoon the mousse in a piping bag fitted with a small plain nozzle. Pipe the mousse into the meringue nests and top with a halved strawberry, cut-side up. ","ingredients":" 3 free-range eggs, whites only,  1 tsp lemon juice,  150g\/5½oz caster sugar,  2 sheets leaf gelatine,  3 free-range eggs, whites only,  142ml\/¼ pint double cream,  50g\/1¾oz icing sugar,  300g\/10½oz strawberries,  6 very small strawberries, cut in half","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/strawberry_and_cream_55490"}