{"recipe_name":"Strawberry and coconut trifle","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the coconut custard, whisk the egg yolks and sugar together in a bowl until pale and thickened. Add the flour and mix well. Place the coconut milk and vanilla seeds into a saucepan over a low heat and slowly bring to the boil, then remove from the heat. Add the coconut milk mixture to the egg mixture gradually, whisking well, then, once completely combined, return the mixture to the saucepan. Place over a medium heat and bring back to the boil, then reduce the heat and simmer for five minutes, stirring constantly. Remove from the heat and pour into a clean bowl, cover with cling film and chill. When the coconut custard is cold add the whipped cream and fold into the custard.  Meanwhile for the trifle base, place the strawberries into a bowl, cover with icing sugar and orange liqueur and place into the fridge to marinate and chill for one hour. Break the cake up into chunks and place into the bottom of a large glass serving bowl (or divide into six glasses or little bowls for individual portions). Drizzle some orange liqueur onto the cake. Place the marinated strawberries on top of the cake pieces, then add the kiwi slices. Place the jam into a bowl and add a little hot water to soften it, then pour it over the cake and fruit. Spoon all of the chilled coconut custard mixture onto the trifle base. Return the bowl to the fridge to set for at least two hours - preferably overnight. For the topping, whip cream the cream until stiff peaks form when the whisk is removed. Add the mascarpone and mix together gently, then spoon the mixture over the custard in the bowl. Finally, sprinkle the toasted coconut over the top and serve. ","ingredients":" 6 free-range egg yolks,  125g\/4½oz caster sugar,  40g\/1½oz plain flour,  400ml\/14fl oz can of coconut milk,  1 vanilla pod, split, seeds scraped out,  200ml\/7fl oz double cream, whipped until soft peaks form when the whisk is removed,  400g\/14oz strawberries, hulled and chopped into large chunks,  50g\/2oz icing sugar,  55ml\/2fl oz orange liqueur, plus extra for drizzling,  250g\/9oz ready-made sponge cake (madeira cake, swiss roll or muffins),  2 kiwi fruit, peeled and sliced,  250g\/9oz strawberry jam,  100ml\/3½fl oz whipping cream,  100g\/3½oz mascarpone cheese,  50g\/2oz desiccated coconut, toasted","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/strawberryandcoconut_84544"}