{"recipe_name":"Strawberry and cream cake","author":"James Martin","programme":"Sweet Baby James","prep_time":"30 mins to 1 hour","cooking_time":"less than 10 mins","serves":"Serves 6-8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Using a 20-25cm\/8-10in stainless steel cake ring, cut out the centre of the flan case. With a sharp bread knife, carefully cut the disc in half through the middle to make two thin discs. Place the ring onto a large serving plate and place one of the flan discs inside to line the base.   In a large clean bowl, whip the double cream with 25g\/1oz of the caster sugar and the orange liqueur until the mixture holds soft peaks. Fold in the custard, then place into the fridge to chill. Line the ring with the largest strawberry halves, cut-side facing outwards against the ring. Place the remaining strawberry halves in the centre of the ring, then top with the cream mixture and smooth the top with a palette knife. Place the remaining flan disc on top of the cream and dust heavily with the icing sugar. Carefully remove the cake ring by warming the edges with a hot cloth or a mini-blowtorch and lifting it off. Place the remaining 75g\/2½oz caster sugar into a very clean pan and heat gently until it caramelises, then remove from the heat and allow to cool slightly.   While the caramel is cooling, carefully heat a metal skewer until red hot by holding it over a hot hob, then use the hot skewer to score the top of the cake in lines to create a diamond pattern. Lightly oil a metal steel and shake spoonfuls of the caramel back and forth over the steel to make thin strands of caramel. Gather them up to make a loose ball. To serve, top the cake with the reserved small strawberries and the mixed berries. Garnish with mint sprigs and top with the spun sugar. ","ingredients":" 1 large ready-made sponge flan case,  750ml\/1¼ pints double cream,  100g\/3½oz caster sugar,  1 shot of orange liqueur,  200ml\/7fl oz ready-made custard,  2-3 punnets strawberries, hulled and halved lengthways; leave about ten small ones whole, to garnish,  50g\/2oz icing sugar,  oil, for greasing,  large handful mixed berries, such as redcurrants, blueberries and blackberries,  few sprigs fresh mint","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/strawberryandcreamca_86368"}