{"recipe_name":"Strawberry Danish","author":"Paul Hollywood","programme":"Saturday Kitchen","prep_time":"overnight","cooking_time":"10 to 30 mins","serves":"Makes 8","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the flour, salt, sugar and diluted yeast in a large mixing bowl then, using a wooden spoon, slowly mix in a little water until the dough becomes pliable. Place the dough on a floured surface and knead well until it feels elastic. Replace the dough in the bowl and leave in the fridge for 1 hour. Return the chilled dough to your floured work surface and roll it into a rectangular shape 60x30cm\/24x12in. Now flatten the refrigerated butter into a rectangle about 1cm\/½in thick and lay it over two-thirds of the dough. Bringing the uncovered one-third of the dough into the centre and repeat the process with the covered one-third of the dough, so that now your dough is in 3 layers. Return the dough to the fridge to chill for a further hour. Scatter some more flour over your table and roll out the dough to the same sized rectangle as before. Repeat the folding process, one side on top of the other, and place the dough back in the fridge for another hour. You will need to repeat this process another 2 times before leaving the dough to rest, wrapped in cling film, overnight. Now your Danish dough is ready to use. Roll out the Danish pastry to 4mm thick and cut into 30cm\/12in long by 12cm\/4in wide pieces. If you find that you don't have enough for these lengths do not worry make the lengths 20cm\/8in or 15cm\/6in long.  Chop the strawberries into quarters and add to the extra thick yoghurt, fold in the thick custard. Put this mixture down the middle of each of the long rectangles and fold one side on top of the other lengthways. With a knife cut lines into the dough width ways about 10cm\/4in apart all the way along. Brush with egg wash and sprinkle flaked almonds all over the top. Place the dough onto a baking paper on a tray and leave to rise for 1 hour, bake at 200C\/400F\/Gas 6 for 20minutes until golden brown. Cool on a wire and cut into fingers along the width. Put 1½ tbsp of apricot jam in a small saucepan with a splash of water and bring up to boil. Brush this onto the Danish pastries and serve. ","ingredients":" 625g\/1lb 6oz white strong flour,  1 tbsp salt,  85g\/3oz sugar,  30g\/1oz fresh yeast,  water, to mix,  500g\/1lb 2oz butter,  refrigerated ,  1x425g can thick custard,  1x125ml tub extra thick strawberry yoghurt,  punnet of strawberries,  1x100g packet flaked almonds ,  1½ tbsp apricot jam","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/strawberrydanish_67854"}