{"recipe_name":"Stuffed chicken thighs with lemon sauce","author":"Mary Berry","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the chicken, preheat the oven to 200C\/180C Fan\/Gas 6. Line a roasting tin with baking paper. Put the sausage meat into a bowl, add the herbs, lemon zest and Parmesan, season with salt and pepper and mix well to combine. Shape into 8 short sausages (no longer than the chicken thighs). Place the chicken thighs skinned side down, on a plate or board and open them out. Season with salt and pepper, then place a sausage in the centre of each thigh (where the bone was) and fold the chicken around it. Using the flat of a large knife, stretch the bacon rashers out on a board and wrap around the chicken thighs – 1 rasher per thigh with the seam under the chicken. Arrange the chicken in the prepared tin, seam down, and drizzle over the honey. Roast for about 35 minutes or until cooked through, golden-brown and crispy. Set aside to rest for 10 minutes. While the chicken is roasting, make the lemon sauce. Melt the butter in a wide-based saucepan, add the onion and fry over a medium-high heat, stirring regularly, for about 10 minutes until soft and translucent. Sprinkle in the flour and stir for a minute. Pour in the hot stock, whisk until it comes to the boil, then simmer on a medium-high heat, stirring occasionally, until smooth and thickened and the sauce is clear. Pour in the cream and lemon juice with the cooking juices from the meat and season with salt and pepper. Add the chopped parsley and serve hot with the stuffed chicken thighs. ","ingredients":" 350g\/12oz pork sausage meat,  4 tbsp chopped parsley,  2 tsp chopped thyme leaves,  ½ large lemon, grated zest only,  50g\/1¾oz Parmesan cheese, grated,  8 skinless and boneless chicken thighs,  8 rashers of smoked streaky bacon,  2 tsp runny honey,  salt and freshly ground black pepper,  50g\/1¾oz butter,  1 onion, finely chopped,  40g\/1½oz plain flour,  450ml\/16fl oz hot chicken stock,  4 tbsp double cream,  ½ large lemon, juice only,  1 tbsp chopped parsley","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffed_chicken_thighs_31393"}