{"recipe_name":"Stuffed courgette flowers with raspberry and Grand Marnier syrup","author":"John Torode","programme":"MasterChef","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 2","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the crème pâtissière, fry the saffron in a dry saucepan for a few seconds then add the milk and vanilla pod. Heat the milk to scalding. Whisk the egg yolks with the caster sugar, plain flour and cornflour. Pour over the scalded milk whisking all the time. Return to the saucepan and heat until thickened. Allow to cool. For the sauce, combine 50ml\/2fl oz water with the sugar in a saucepan and cook until the sugar has dissolved. Add the pomegranate seeds and juice, Grand Marnier and rosewater. Cook until the liquid has reduced and is syrupy. Remove from the heat and add the whole raspberries. Allow to cool. Fill a piping bag with the crème pâtissière and half-fill each courgette flower. Spoon in some pistachios and pipe in more mixture to fill the flower. Twist the end to seal. To make the batter, put the dry ingredients into a bowl, whisk in the egg followed by the sparkling water. Heat the vegetable oil in a heavy-based saucepan or deep-fat fryer until a breadcrumb dropped into the hot oil turns brown. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Dip each flower into the batter and deep-fry until golden-brown. Roll in the sugared cinnamon and serve with the sauce. ","ingredients":" 1 pinch saffron,  250ml\/9fl oz full-fat milk,  ½ vanilla pod, split,  4 free-range egg yolks,  60g\/2¼oz caster sugar,  20g\/¾oz plain flour,  20g\/¾oz cornflour,  2 courgette flowers,  25g\/1oz shelled pistachios, toasted,  ground cinnamon and caster sugar mixed together, for dusting,  100g\/3½oz caster sugar,  ½ pomegranate, seeds and juice,  50ml\/2fl oz Grand Marnier,  1 tsp rosewater,  75g\/2½oz raspberries,  pinch of salt,  20g\/¾oz caster sugar,  50g\/1¾oz plain flour,  2 tsp bicarbonate of soda,  50g\/1¾oz cornflour,  1 free-range egg,  150ml\/5fl oz sparkling water,  vegetable oil, for deep-fat frying","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffed_courgette_35525"}