{"recipe_name":"Stuffed shoulder of lamb","author":"Mary Berry","programme":"The Mary Berry Story","prep_time":"less than 30 mins","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the stuffing, fry the onion in a frying pan in the butter until softened. Add the lamb’s liver and cook for a few minutes. Remove from the heat and cool before adding the remaining stuffing ingredients. Spread the stuffing across the length of the boned lamb, tie it into a roll with kitchen string. This can be done the day before and refrigerated overnight.  Preheat the oven to 180C\/350F\/Gas 4.  Put the lamb on a roasting tray, cover with foil and roast for 2¼ hours. Remove the foil for the final half hour of cooking. Place the lamb in a warm place to rest. For the gravy, heat the dripping in a pan and fry the onion until softened. Add the flour and stir until all the flour is absorbed. Pour in the port and cook until the volume of liquid has reduced by half. Pour in the stock and cook again until the volume of liquid has reduced by half again. Add the redcurrant jelly, salt, freshly ground pepper, nutmeg and gravy browning to taste. ","ingredients":" 1 small onion,  knob of butter,  140g\/5oz lamb’s liver, chopped,  450g\/1lb pork sausage meat,  85g\/3oz breadcrumbs ,  1 small lemon, zest only,  1 tsp dried or fresh thyme ,  1 free-range egg,  1 tbsp chopped fresh parsley (optional),  salt and freshly ground black pepper,  1.6kg\/3.5lb boned shoulder of lamb,  buttered peas, to serve,  scalloped potatoes, to serve,  28g\/1oz dripping,  ½ onion, chopped,  28g\/1oz plain flour,  75ml\/2½fl oz port,  150ml\/¼ pint stock ,  1 tsp redcurrant jelly,  salt and freshly ground black pepper ,  pinch of nutmeg,  dash gravy browning","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffed_shoulder_of_lamb_53789"}