{"recipe_name":"Stuffed tulips","author":"Pascal Aussignac","programme":"Saturday Kitchen Best Bites","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the stuffing that will fill the tulips, preheat the oven to 200\/400F\/Gas 6. On a baking tray roast the butternut squash with the olive oil, sugar, thyme and a little salt, for 20-25 minutes, until it starts to caramelise. When cooked, allow to cool slightly and then mix it all together in a food processor to get a silky pulp. Cook the quinoa in a pan of boiling water for 10 minutes and then rinse.  Put the cooked quinoa, the butternut squash mix pulp, the samphire, parmesan, crushed garlic and truffle oil in a pan and warm through. Check the seasoning and add salt and pepper if necessary - this mixture will stuff the tulip. For the sauce, put the maple syrup, verjuice, lemon juice and beetroot in a pan. Heat to reduce in volume until it makes a glaze. Add seasoning, then strain the liquid into a clean pan. Lay the shallot wheels in the warm sauce and set aside. For the garnish, crush together the seeds,  puffed rice cereal and pistachios. Put the sugar in a hot pan and when it dissolves, add the fresh grapes and the seeds mixture. Stir it quickly to coat the grapes then set aside. Peel the nashi pear and use a mellon baller to make little pearls.  Stuff the tulips with the butternut squash mixture. In a steamer, cook the stuffed tulips for three minutes. To serve, place a stuffed tulip on each plate and use the glaciale leaves (or nasturtium leaves) as the ''foliage'' with the crunchy grapes as ''berries\". Arrange the nashi pear pearls around the plate and drizzle around a little olive oil, a few drops of the sauce and top the flower with the pearls of finger lime to cut through the sweetness. ","ingredients":" 1 butternut squash, peeled and diced,  100g\/3½oz olive oil,  50g\/1¾oz sugar,  sprig of thyme,  100g\/3½oz black quinoa,  50g\/1¾oz samphire,  80g\/3oz parmesan, grated,  1 garlic clove, peeled and crushed,  few drops truffle oil,  4 edible tulips, pale colour, stamens removed,  100g\/3½oz maple syrup,  300g\/11oz verjuice ,  2 lemons, juice only,  salt ,  100g raw beetroot, diced ,  2 long shallots, peeled and sliced into wheels,  10g black sesame seeds,  10g fennel seeds,  10g wasabi peas,  10g sunflower seeds,  20g puffed rice cereal,  10g shelled pistachios,  50g\/1¾oz sugar,  200g\/7oz seedless grapes,  1 nashi pear,  50g\/1¾oz glaciale leaves or nasturtium leaves,  1 finger lime, flesh separated into tiny pearls","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffed_tulip_23658"}