{"recipe_name":"Stuffed aubergine rolls","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/stuffedaubergineroll_85751_16x9.jpg","method":"Preheat the oven to 180C\/355F\/Gas 4. Season the aubergine slices well with salt and freshly ground black pepper and brush with oil. Griddle for a couple of minutes on each side in a hot griddle pan, or until golden-brown grill marks are formed. Remove from the pan and drain on kitchen paper. For the filling, mix the ricotta, mozzarella, nutmeg and spring onions together in a bowl. Lay out all of the slices of aubergine onto a clean surface. Place about one teaspoon of filling at the bottom edge of each one. Roll up the aubergine slices, like a cigar, around the filling, then rest them seam-side down on a plate. For the sauce, heat the olive oil in a pan and add the cherry tomatoes. Simmer for 8-10 minutes until the tomatoes begin to break down. Remove from the heat and stir in the garlic and sugar. Season, to taste, with salt and freshly ground black pepper. Spoon some of the sauce into the bottom of an ovenproof dish. Carefully place the aubergine rolls, seam-side down onto the sauce, and spoon over the rest of the sauce. Transfer to the oven and bake for 12-15 minutes, until the cheese begins to melt. To serve, spoon the rolls onto plates. ","ingredients":" 2 aubergines, cut lengthways into 0.5cm\/¼ in thick strips,  salt and freshly ground black pepper,  olive oil, for brushing,  150g\/5oz ricotta,  150g\/5oz buffalo mozzarella,  pinch freshly grated nutmeg,  2 spring onions, finely chopped,  250ml\/8fl oz extra virgin olive oil,  450g\/1lb cherry tomatoes, halved,  1 garlic clove, crushed,  pinch sugar,  salt and freshly ground black pepper","vegetarian":true,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffedaubergineroll_85751"}