{"recipe_name":"Stuffed cabbage leaves","author":"Antony Worrall Thompson","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4-6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Remove six outer leaves from each of the cabbages. Place the leaves in a pan of boiling salted water and cook for four minutes, then remove with a slotted spoon and place in a bowl of cold water. Remove from the water, cut out and discard the central ribs of the leaves and set aside. Shred the remaining cabbage and cook in the cabbage water for eight minutes. Drain and cool then set aside. In a frying pan over a high heat, cook the bacon with 25g\/1oz of the butter until the bacon is golden. Add another 25g\/1oz of the butter to the pan, then the onion, garlic and thyme. Cook over a medium heat until the onion has softened. Add the cooked shredded cabbage and stir to combine. Tip this mixture into a clean bowl and add the crumbled Roquefort, mascarpone and the pine nuts. Fold the mixture to combine and season, to taste, with salt and freshly ground black pepper. Divide the mixture into 12 even portions.   Lay out the blanched cabbage leaves and line the inside of each of them with a slice of ham. Put one portion of the stuffing onto the ham and fold up the cabbage into a parcel in the sides. Roll each package in seasoned flour. Heat the remaining 25g\/1oz butter in a large frying pan. Add the floured cabbage parcels in batches and fry until golden on all sides. Serve warm. ","ingredients":" 2 savoy cabbages,  salt and freshly ground black pepper,  115g\/4oz streaky bacon, cut into 1cm\/½in cubes,  85g\/3oz unsalted butter,  1 onion, finely chopped,  1 garlic clove, finely chopped,  1 tsp fresh thyme leaves,  85g\/3oz Roquefort or other blue cheese,  3 tbsp mascarpone cheese,  2 tbsp pine nuts,  12 slices Parma ham,  plain flour, seasoned with salt and freshly ground black pepper, for coating","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffedcabbageleaves_79507"}