{"recipe_name":"Stuffed chicken breast with roasted courgette salad and lemon dressing","author":"Lesley Waters","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. To make the chicken, use a sharp knife to cut a pocket into the chicken breast. Fill the chicken breast with the Manchego and chives, rub all over with olive oil, then season with salt and freshly ground black pepper. Heat a griddle pan until smoking, then chargrill the chicken for two minutes on each side, until brown griddle marks appear. Transfer to the oven and roast for 15-20 minutes, or until completely cooked through (the juices should run clear when the breast is pierced with a skewer). To make the salad, mix all the salad ingredients in a bowl, then season with salt and freshly ground black pepper. Place onto a baking sheet and roast in the oven for 12 minutes, or until the courgettes are cooked through. To make the dressing, place the oil, lemon juice and basil into a food processor and blend until smooth, then season to taste with salt and freshly ground black pepper. To serve, place the roasted courgettes in the middle of a warm plate. Place the chicken breast on top and spoon the dressing around. ","ingredients":" 100g\/3½oz chicken breast,  75g\/2¾oz Manchego cheese, thinly sliced,  1 tbsp finely chopped chives ,  1 tbsp olive oil,  salt and freshly ground black pepper ,  4 baby courgettes,  ½ lemon, juice only,  ½ lime, juice only,  1 clove garlic, crushed to a paste,  1 tbsp chopped fresh mint,  salt and freshly ground black pepper ,  2 tbsp olive oil,  ½ lemon, juice only,  2 handfuls fresh basil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffedchickenbreast_83620"}