{"recipe_name":"Stuffed chicken cooked in a foil bag","author":"Mike Robinson","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 275C\/530F\/Gas 6. Heat a drizzle of olive oil in a pan and add the chopped garlic, celery, onions, potatoes and carrot. Add half the thyme. Sweat the vegetables until they are soft, about 10 minutes.  Chop up the fat or lard and chop the chicken livers. Mix together with the wine. Use this mixture to stuff each of the chickens. Stitch up the opening in the chickens and rub them with olive oil, salt and pepper.  Sprinkle the chickens with the rest of the thyme, and wrap each one in five layers of foil. Place the chickens on baking trays and cook in the oven for 30 minutes. You can also cook the chicken on a fire or barbecue. To do this, let your fire or barbecue burn down to embers, bury the foil-wrapped chickens in the embers and cook for 45 minutes. Remove from the embers with tongs and blow off the ash. Once cooked, snip open the foil carefully. Pour any juices in to a bowl and put to one side. Cut each chicken in half with poultry shears and scoop out the stuffing.  Serve the chickens on top of the stuffing and pour over the juices. Drizzle some olive oil and thyme around the outside for effect. ","ingredients":" 4 small free range, corn-fed chickens (weighing approx 450g - 680g\/1 - 1½ lb each),  2 cloves of garlic, chopped,  2 stalks of celery, chopped,  2 onions, chopped,  500g\/1lb 1oz potatoes, cut into cubes,  2 carrots, chopped,  handful of fresh thyme,  olive oil,  100g\/3½oz pancetta-fat or lard ,  4 chicken livers,  1 glass of white wine,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffedchickencooked_73657"}