{"recipe_name":"Stuffed pork chops with prunes and apricots","author":"Simon Rimmer","programme":"Something for the Weekend","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. Cut a pocket into the side of each of the pork chops, three-quarters deep into the chop, running the length of the chops.  Mix the prunes and apricots together in a bowl. Stuff each pocket in the chops with the prunes and apricots and secure with a cocktail stick which has been soaked in water for ten minutes. Season with salt and freshly ground black pepper.  Heat an ovenproof griddle pan until smoking. Place the stuffed chops onto the griddle and cook for three minutes, or until golden-brown on both sides.  Transfer to the oven to cook for 5-6 minutes, or until completely cooked through. For the sauce, heat the oil in a pan and gently fry the shallots and garlic until soft.  Add stock and boil to reduce to almost nothing.  Add the cider and boil to reduce the volume by half, then stir in the mustard and simmer for five minutes.  Season, to taste, with salt and freshly ground black pepper, then add the cream and stir to combine.  To serve, place two chops onto each plate and place a spoonful of rice alongside. Drizzle over the sauce. ","ingredients":" 8 pork chops ,  16 prunes, stones removed, chopped ,  12 apricots, stones removed, chopped,  salt and freshly ground black pepper,  1 tbsp olive oil ,  2 shallots, finely chopped ,  1 garlic clove, crushed,  100ml\/3½fl oz chicken stock ,  100ml\/3½fl oz cider,  3 tbsp wholegrain mustard ,  salt and freshly ground black pepper,  50ml\/2fl oz double cream ,  basmati rice, cooked according to packet instructions","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffedporkchopswith_86547"}