{"recipe_name":"Bouillabaisse with seared squid","author":"James Martin","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the bouillabaisse, heat a large frying pan until medium hot, add two tablespoons of the olive oil, plus the onion and garlic and fry gently for a couple of minutes, or until just softened. Add the fennel seeds and cayenne pepper and fry for a minute. Add the saffron, prawns and half the hake and stir fry for two minutes. Add the anise-flavoured liqueur and flambé to burn off the alcohol (CAUTION: keep your face and hair away from the flames. Do not leave unattended). Add the white wine and cook until the volume of the liquid reduced by half. Add the tinned tomatoes and fish stock, bring to the boil then reduce to a simmer and cook for eight minutes, or until the fish is cooked through. Place the mixture into a food blender and blend to a fine purée then strain through a sieve back into a clean frying pan. Return to a simmer, add the remaining hake, the mussels and clams and cook until all the shells have opened and the hake is just cooked through. Season to taste with salt and freshly ground black pepper. Meanwhile, heat a griddle pan until searing hot and lightly oil the squid with the remaining olive oil. Place the squid on the griddle and sear on each side for 30 seconds until just cooked through. Remove and season with salt and freshly ground black pepper. For the garnish, heat the grill to high. Toast the bread on each side until light golden-brown. Place the egg yolks, garlic, cayenne and saffron into a food processor and blend to a purée. Keep the processor running and very gradually add the olive oil until a thick, bright-yellow mayonnaise is formed. Then season to taste with salt and freshly ground black pepper. To serve, ladle the bouillabaisse into each soup plate and top with pieces of the seared squid. Pile the toast onto a board and serve the Gruyère and mayonnaise in bowls alongside. ","ingredients":" 3 tbsp olive oil,  1 onion, roughly chopped,  2 garlic cloves, roughly chopped,  1 tsp fennel seeds,  ½ tsp cayenne pepper,  ½ tsp saffron threads, soaked in 1 tbsp hot water,  4 shell-on tiger prawns, roughly chopped,  400g\/14oz hake, boneless and skinless, cut into chunks,  50ml\/2fl oz anise-flavoured liqueur (such as Pernod),  110ml\/4fl oz white wine,  1 x 400g\/14oz tinned tomatoes,  500ml\/18fl oz fish stock,  1kg\/2lb 4oz mussels, cleaned,  1kg\/2lb 4oz clams, cleaned,  salt and freshly ground black pepper,  4 baby squid, cleaned and cut into triangles,  1 baguette, cut on the diagonal into 5mm\/¼in thick slices,  2 free-range egg yolks,  2 garlic cloves, crushed,  ¼ tsp cayenne pepper,  ½ tsp saffron threads, soaked in 1 tbsp hot water,  ¼ lemon, juice only,  125ml\/4½fl oz light olive oil,  200g\/7oz Gruyère, finely grated","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bouillabaisse_with_26852"}