{"recipe_name":"Stuffed veal with potato cake, roasted leeks and mushroom cream sauce","author":"James Tanner","programme":"Ready Steady Cook","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 1","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 200C\/400F\/Gas 6. To make the veal, dredge the veal in the seasoned flour and pat off any excess.  Place the leeks and cheese in the centre of the veal escalope. Fold over the sides of the veal to create a sandwich and skewer with tooth picks to hold in place.  Place the herbs and breadcrumbs into a food processor and blend together, then place into a bowl. Dip the veal in the beaten egg until coated all over, then dip into the herbed breadcrumbs to coat the veal. Repeat the egg and herb breadcrumb coating process. Heat the oil in a medium ovenproof frying pan over a medium heat. Add the coated veal and fry for two minutes on each side, to brown all over. Transfer to the oven and roast for ten minutes, or until the veal is cooked through. To make the potato cake, place the potatoes, butter and thyme into a bowl and mash together, seasoning, to taste, with salt and freshly ground black pepper. On a flat surface, shape the potato into a cake or burger shape. Heat the oil in a small frying pan and add the potato cake. Fry for two minutes on each side, until golden on both sides. To make the leeks, heat a griddle pan until smoking. Place the leeks and the olive oil into a large bowl and toss together, seasoning, to taste, with salt and freshly ground black pepper. Place the leeks onto the hot griddle pan to cook for two minutes on each side, then transfer to the oven to roast for five minutes. To make the sauce, heat the olive oil in a frying pan over a medium heat. Add the garlic and leeks and fry for two minutes, until the leeks are softened.  Add the mushrooms and cook for a further three minutes, until the mushrooms are softened. Add the cream and basil and heat to simmer for five minutes, seasoning with salt and freshly ground black pepper. To serve, place the potato cake in the centre of a warm plate, serve the roasted leeks in a square around the potato cake. Top with the stuffed veal and spoon over the sauce. ","ingredients":" 150g\/5½oz veal escalope,  100g\/3½oz flour seasoned with salt and freshly ground black pepper,  4 baby leeks, cleaned,  50g\/1¾oz cheddar cheese,  1 tbsp finely chopped fresh parsley ,  1 tbsp finely chopped fresh chives ,  100g\/3½oz breadcrumbs,  2 free-range eggs, beaten,  1 tbsp olive oil,  100g\/3½oz new potatoes, cooked,  25g\/1oz unsalted butter,  ½ tsp thyme leaves,  salt and freshly ground black pepper,  1 tbsp olive oil,  10 baby leeks, cleaned,  1 tbsp olive oil,  1 tbsp olive oil,  1 garlic clove, finely chopped,  1 leek, cleaned and finely sliced,  25g\/1oz chestnut mushrooms, chopped,  100ml\/3½fl oz double cream,  1 tbsp chopped fresh basil leaves,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/stuffedvealwithpotat_80187"}