{"recipe_name":"Suckling lamb with borlotti beans ","author":"Marcus Wareing","programme":"2007-16","prep_time":"overnight","cooking_time":"over 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the lamb, place 10 litres\/17½ pints water and the salt into a large saucepan and bring to the boil. Heat until all the salt has dissolved. Remove from the heat and set aside to cool completely.  When the salted water is cold, place the legs and neck fillet into the pan and transfer to the fridge to marinate for two hours. In a pan, put in the cream, one sprig of rosemary, the oregano and garlic and bring to a simmer. Cook over a gentle heat until it has reduced to 150ml\/5fl oz (approximately a third). Strain through a fine sieve and set aside to cool. Place the chops in a bowl with the remaining rosemary sprig, the thyme and two tablespoons of the olive oil. Mix well and transfer to the fridge for two hours to marinate. For the borlotti beans, strain the beans then place in a large saucepan covered with clean water and bring to the boil. Once boiling, skim the liquid, strain and discard the water. Return the beans to the saucepan and cover with chicken stock. Wrap the carrot, celery, onion, bay leaves, thyme, garlic and peppercorns in a muslin cloth and tie securely. Slowly bring the beans to a simmer and add the muslin containing the vegetables. Allow the beans to cook very slowly with the stock barely moving, add more liquid if necessary to prevent the beans drying out. Once tender and evenly cooked, remove from heat, pour into a container and allow to cool in the cooking liquid. Set a water bath to 64C\/174F. Remove the legs and neck from the salted water, rinse and pat dry. Place the legs into a vac pack bag with the lamb stock then seal. Place the neck into a vac pack bag with the reduced cream then seal. Place the neck into the water bath and cook for 10 minutes, then add the legs and cook both for a further 30 minutes. Remove all the lamb from the water bath and take from the vac pack bags. Pat dry then heat a frying pan until hot, add a little olive oil and butter and heat until foaming. Add the marinated chop and fry on each side for two minutes, then remove and allow to rest. Heat a griddle pan until searing hot, add the leg and neck and sear on each side until browned. Remove and rest for a couple of minutes. For the garnish, heat a frying pan until hot, add two tablespoons of the olive oil, the courgettes and garlic clove and cook over a high heat until golden brown, then season with salt and freshly ground black pepper. Reduce the heat, add the diced shallot and cook until soft and translucent. Add the cooked borlotti beans, the crumbled half of the cheese and stock. Cook until the cheese has melted - this will form the sauce. Toss the Little Gem quarters with the last tablespoon of olive oil and season with salt and freshly ground black pepper. Heat a griddle pan until hot, add the Little Gem and char lightly on each side. To serve, spoon the bean mixture onto a large plate. Carve the lamb into thick slices and place a few of each on top of the beans. Place the griddled Little Gem quarters around the edge of the lamb. Scatter over the remaining diced cheese, olive slices, oregano, mint, white wine vinegar and extra virgin olive oil and serve immediately. ","ingredients":" 700g\/1lb 9oz fine salt,  11kg\/24lb 12oz suckling lamb, cut into four legs, neck fillet and chops,  400ml\/14fl oz double cream,  2 sprigs rosemary,  1 sprig oregano,  1 garlic clove, crushed,  1 sprig thyme,  3 tbsp olive oil,  200ml\/7fl oz lamb stock,  50g\/2oz butter,  500g\/1lb2oz borlotti beans, soaked overnight in cold water,  3 litres\/5¼ pints chicken stock,  1 carrot, peeled,  2 sticks celery,  1 onion, peeled and halved,  2 bay leaves,  ½ bunch thyme,  ½ bulb garlic,  1 tsp white peppercorns,  3 tbsp olive oil,  2 courgettes, diced into 5mm cubes,  1 garlic clove, lightly crushed,  salt and freshly ground black pepper,  1 shallot, finely diced,  110g\/4oz Flower Marie (ewes' milk cheese), half crumbled and half very finely diced,  110ml\/4fl oz lamb or chicken stock,  4 Little Gem, cut into quarters with the stem trimmed,  1 tbsp sliced olives, de-stoned and sliced into thin strips,  1 tbsp oregano leaves,  1 tbsp mint leaves, finely shredded,  1 tbsp white wine vinegar,  2 tbsp extra virgin olive oil","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/suckling_lamb_and_25467"}