{"recipe_name":"Sultan's delight with creamed aubergine","author":"The Hairy Bikers","programme":"The Hairy Bikers","prep_time":"less than 30 mins","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4. For the lamb, heat the butter and oil in a heavy pan and brown the lamb for about 5 minutes, stirring frequently.  Add the onion and garlic and sweat for a couple of minutes. Add the tomato paste, thyme, oregano, cloves, allspice, cumin, stock and salt and freshly ground black pepper. Bring to the boil and simmer with the lid off for about an hour until the stew is thick and the meat tender. For the aubergine, bake the aubergines in the oven for about 40 minutes or until blistered and softened. Leave to cool slightly. Peel the aubergines, and set the pulp to one side.  In a saucepan warm the milk and cream. In another pan melt the butter, then work in the flour. Slowly add the warm milk and cream to the butter and flour and stir to make a thick white sauce.  Add the aubergine purée, the cheese, chilli flakes, salt and freshly ground black pepper. Cook for about 5 minutes.  Put a mound of aubergine purée in the middle of the plate and surround with the lamb. Garnish with parsley. ","ingredients":" 55g\/2oz butter,  3 tbsp olive oil,  1.8kg\/4lb lamb shoulder or leg, trimmed, cut into 2.5cm\/1in cubes,  1 onion,  5 cloves garlic, crushed,  2 tbsp tomato paste,  ½ tsp dried thyme,  1 tsp dried oregano,  ¼ tsp cloves,  ½ tsp allspice,  1 tsp ground cumin ,  285ml\/10fl oz lamb stock,  salt and freshly ground black pepper,  flatleaf parsley, to garnish,  4 large aubergines,  250ml\/9fl oz milk,  2 tbsp double cream,  55g\/2oz butter,  1 tbsp plain flour,  110g\/4oz Kasseri cheese (cheddar will do), grated,  1 tsp dried chilli flakes,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sultansdelightwithcr_81428"}