{"recipe_name":"Bourbon glazed spare ribs with smoked corn salad","author":"Yotam Ottolenghi","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"over 2 hours","serves":"Serves 6","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Place the ribs in a large bowl with the salt. Rub it all over the meat and set aside for 1 hour. Rinse the ribs well under cold water, gently rubbing off all the salt and pat dry. Put them into a large lidded saucepan. Add the ginger, onion, garlic, star anise, cinnamon and peppercorns. Pour over the stock, rice wine and rice vinegar. Bring to the boil, then reduce the heat to medium-low and simmer gently, covered, for 1 hour. Lift out the ribs and set aside. If you are not serving them in the next couple of hours, let the ribs cool and store them in the fridge, covered, until ready to use. If you do this, make sure you bring them back to room temperature before you coat them in the glaze before serving. Strain the liquid, discarding the onion, garlic and spices, and return it to the pan. Place on a high heat and cook for 30-35 minutes, until the liquid has reduced to about 200ml\/7fl oz. Remove from the heat and set aside. Chill if you are not serving the ribs in the next 2 hours. For the smoked corn salad, remove the husks from the corn and use them to line the base of a large lidded saucepan or wok which is deep enough to fit a colander or metal steaming basket inside. Add the lemon thyme and place the pan over a high heat. Once the husks and thyme begin to smoke (about 6 minutes) place the colander in the pan and place the corn cobs inside it. Use a lid to seal the pan and smoke for 5 minutes. Remove from the heat and set aside, covered, for another 5 minutes. Remove the lid and set aside to cool. Stand each corn cob on a chopping board and use a large sharp knife to shave off rows of kernels, cutting from top to bottom. Cut deep enough into the cob so that some of the kernels remain in clusters, this isn’t essential, it just looks good. Set the corn kernels aside and discard the cobs. Make the glaze about 45 minutes before you are ready to serve, place all the ingredients for the glaze, along with 100ml\/3½fl oz of the stock reduction, in a large pan. Bring to the boil, then simmer on a medium-high heat for 20-25 minutes, until the liquid has reduced to about 200ml\/7fl oz and has the consistency of syrup. Return the pork ribs to the sauce and stir gently so they all get coated. Cook for about 7 more minutes on a medium heat, stirring once or twice until the ribs are warmed through and sticky. Just before serving, finish the salad by placing the lime juice, maple syrup, olive oil and chilli in a large bowl with 1 teaspoon sea salt. Whisk to combine, then mix in the corn kernels, herbs and spring onion. Place two small racks of ribs on each plate – one leaning against the other – and serve with the corn salad alongside. ","ingredients":" 1kg\/2lb 4oz pork baby back ribs, cut into 12 equal small racks (2 or 3 ribs per rack),  80g\/2¾oz coarse sea salt,  4cm\/1½in piece of ginger, peeled and cut into small strips,  1 medium onion, roughly chopped ,  6 garlic cloves, crushed,  8 whole star anise,  1 cinnamon stick,  1 tsp whole black peppercorns,  1½ litres\/2½ pints chicken stock,  100ml\/3½fl oz Shaoxing rice wine,  100ml\/3½fl oz rice vinegar,  4 large corn cobs in their husks,  15 sprigs of lemon thyme,  3 tbsp lime juice,  2 tsp maple syrup,  4 tbsp olive oil,  1 green chilli, seeds removed and thinly sliced,  20g\/¾oz coriander leaves,  20g\/¾oz mint leaves,  20g\/¾oz parsley leaves,  4 spring onions, thinly sliced ,  coarse sea salt,  3 banana shallots, peeled and thinly sliced ,  350ml\/12fl oz bourbon,  4 tbsp maple syrup,  2 tsp Szechuan peppercorns,  1½ tbsp lemon juice,  2 tbsp sesame oil,  3 tbsp tomato ketchup,  1½ tbsp rice vinegar,  2 dried red chillies,  2 garlic cloves, lightly crushed","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bourbon_glazed_spare_56802"}