{"recipe_name":"Summer vegetable soup with mussels","author":"James Martin","programme":"James Martin: Home Comforts","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/ichef.bbci.co.uk\/food\/ic\/food_16x9_608\/recipes\/summer_vegetable_soup_45439_16x9.jpg","method":"For the soup, melt the butter in a heavy-based, lidded saucepan over a low to medium heat. Add all of the vegetables and fry gently for 4-5 minutes, or until just softened. Add the mussels, wine and stock and bring the mixture to the boil. Cover the pan with the lid and reduce the heat until the mixture is simmering. Simmer for 2-3 minutes, or until the mussels have opened. (Discard any mussels that do not open during cooking.) For the salsa verde, put all the herbs in a food processor and pulse until roughly chopped. Add the shallot, anchovies, capers, lemon juice, mustard and oil and blend to a rough purée. Season, to taste, with salt and freshly ground black pepper. Remove the soup from the heat and stir in 2-3 tablespoons of the salsa verde. Serve immediately, with an extra dollop of salsa verde on top of each portion. (Any remaining salsa verde can be decanted into an airtight container and covered with a thin layer of olive oil. It can be kept in the fridge for up to four days.) ","ingredients":" 50g\/1¾oz unsalted butter,  1 banana shallot, finely chopped,  150g\/5oz courgettes, trimmed, cut into 1cm\/½in cubes,  1 fennel bulb, cut into 1cm\/½in cubes, leafy fronds reserved,  150g\/5oz carrots, peeled, cut into 1cm\/½in cubes,  100g\/3½oz celery stems, trimmed, cut into 1cm\/½in cubes,  8 radishes, trimmed, cut in half from top to base,  500g\/1lb 2oz mussels, rinsed, scrubbed, beards removed (discard any mussels that do not close tightly when firmly tapped),  150ml\/5fl oz white wine,  750ml\/1¼ pints vegetable stock,  2 tbsp chopped fresh mint leaves, stalks reserved,  2 tbsp chopped fresh dill fronds, stalks reserved,  2 tbsp chopped fresh tarragon leaves, stalks reserved,  2 tbsp chopped fresh flatleaf parsley leaves, stalks reserved,  2 tbsp chopped fresh watercress leaves, stalks reserved,  2 tbsp chopped fresh basil leaves,  1 large shallot, roughly chopped,  6 anchovies, drained, roughly chopped,  2 tbsp capers, drained and rinsed,  ½ lemon, juice only,  1 tsp Dijon mustard,  4 tbsp extra virgin olive oil,  salt and freshly ground black pepper","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/summer_vegetable_soup_45439"}