{"recipe_name":"Bourride of pollock and mussels with garlic and thyme croûtons","author":"Jason Atherton","programme":"Saturday Kitchen","prep_time":"less than 30 mins","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the aïoli, whisk the egg yolks in a mixing bowl with the garlic, lemon juice and salt. Whisk in the olive oil drop by drop, until you have a glistening sauce with the consistency of soft butter. (You can also use a food processor for this.) For the bourride, discard any mussels that are damaged or open and do not close when sharply tapped. Rinse the pollock fillet, pat dry with kitchen paper and cut into 5cm\/2in pieces. Set aside with mussels. Heat the vegetable oil in a large lidded pan over a low heat. Add the shallots, red pepper and celery and fry gently for 5 minutes or until softened. Add the saffron, chilli and orange zest and cook for a further 3 minutes. Pour in the chicken stock and bring to boil then reduce the heat and simmer for 3 minutes. Add the mussels, put the lid on pan and cook for 3-4 minutes, just until the shells open. Now add the pollock pieces and cook for 3-4 minutes, or until just cooked through. Take the pan off heat and transfer the mussels and pollock to a warm bowl, using a slotted spoon. (Discard any unopened mussels.) Set aside to keep warm. Pour the cooking liquid into a blender and blend until smooth then with the motor running, slowly add 5 tablespoons of the aïoli through the funnel. When the mixture begins to thicken, stop blending and pour back into the saucepan. Warm the bourride gently and whisk with a balloon whisk or a hand held stick blender until foamy. Add the fish and mussels. Season, to taste, with salt and freshly ground black pepper and keep warm. Using a 4cm\/1½in pastry cutter, cut 8 rounds from the bread slices. Melt the butter in a non-stick frying pan and add the thyme and garlic. Add the bread rounds and cook until dark golden-brown and crisp on both sides. Remove from the pan and drain on kitchen paper. Divide the bourride among four serving bowls. Spread the croûtons with a little of the remaining aïoli and place two on top of each bowl. Season with black pepper and garnish with coriander. ","ingredients":" 2 large free-range egg yolks (at room temperature),  1 small garlic clove, finely chopped or crushed to a paste,  1 tsp lemon juice,  ¼ tsp fine sea salt,  150ml\/5fl oz extra virgin olive oil,  12-16 large mussels, scrubbed well and beards removed ,  600g\/1lb 5oz skinless pollock fillet,  1 tbsp vegetable oil,  2 shallots, finely chopped,  ¼ red pepper, thinly sliced,  1 tbsp finely chopped celery,  2 pinches saffron strands,  1 red bird’s-eye chilli, seeds removed and finely chopped,  ½ orange, finely grated zest only ,  500ml\/18fl oz chicken stock,  5 tbsp aïoli (from above),  4 thick slices white bread,  30g\/1oz butter,  1 sprig fresh thyme,  1 garlic clove, ,  sea salt and freshly ground black pepper,  coriander leaves, to garnish","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/bourride_of_pollock_and_91840"}