{"recipe_name":"Summer roast lamb with crunched spiced potatoes, goats' cheese and spinach","author":"Ed Baines","programme":"Saturday Kitchen","prep_time":"30 mins to 1 hour","cooking_time":"1 to 2 hours","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat oven 170C\/338F\/Gas 3. Rub the lamb with the olive oil and place on a roasting tray. Sprinkle over the chopped rosemary, salt, chopped anchovy fillets, lemon juice and zest and sugar. Turn the lamb, massaging the ingredients into the meat. Place in the oven, skin side up, and roast for one-and-a-half hours. Meanwhile, for the crunched, spiced potatoes, blanch the new potatoes for five minutes in boiling salted water. Combine the semolina in a large bowl with all the remaining ingredients. When cooked, strain the potatoes and, while still hot, transfer them into the bowl with the semolina. Toss well and shake off any excess through a colander. Transfer the potatoes to a well-oiled tray for the last half an hour of the lamb's cooking time. If you have a large enough oven and a large enough roasting tray, you can arrange the potatoes around the lamb to cook. Meanwhile, mix together the spinach, mint and pieces of goats' cheese in a large bowl. Remove the lamb from the oven when it's cooked and allow to rest for a few minutes before carving into slices. Add the potatoes to the spinach and goats' cheese. Add the red wine vinegar and toss thoroughly.   Transfer the potato and spinach mixture onto a large platter and place slices of lamb over the top. Spoon over the cooking juices from the lamb and serve. ","ingredients":" 1 shoulder lamb, boned and butterflied,  4 tsp olive oil,  2 sprigs rosemary, finely chopped ,  ½ tsp rock salt,  1 small tin anchovy fillets, finely chopped ,  1 lemon, zest and juice only,  ½ tsp demerara sugar,  500g\/17oz new potatoes, quartered,  200g\/7oz semolina ,  1 tbsp chilli powder,  ½ tbsp garlic salt ,  ½ tbsp cumin ,  ½ tbsp dried oregano ,  freshly ground black pepper,  2 bags pre-packed baby spinach, washed and drained ,  1 bunch fresh mint, finely chopped,  300g\/10½oz goats' cheese, crumbled into pieces ,  1 tbsp red wine vinegar","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/summerroastlambwithc_74877"}