{"recipe_name":"Summery fish pie","author":null,"programme":null,"prep_time":"30 mins to 1 hour","cooking_time":"30 mins to 1 hour","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"Preheat the oven to 180C\/350F\/Gas 4.  For the fish, place the fish and prawns into a bowl, add the lemon juice and zest and season with salt and freshly ground black pepper. Sprinkle over the chives, stir well and set aside to marinate in the fridge for at least 30 minutes. Meanwhile, for the sauce, melt the butter in a frying pan and fry the onion for 1-2 minutes, or until softened. Stir in the lemon zest and flour and mix well to form a roux. Cook for 2-3 minutes, stirring constantly, then slowly stir in the milk, cream and white wine and cook for a further 2-3 minutes, or until the sauce has thickened. Stir in the crème fraîche and season to taste, with salt and freshly ground black pepper.  Pour the sauce over the fish and stir gently until well combined.  Spoon half of the fish into a large ovenproof dish, add the quails’ eggs, asparagus and peas, then top with the remaining fish mixture. for the pastry, roll the puff pastry out thinly on a floured work surface until large enough to cover the pie dish. Brush a little beaten egg around the rim of the pie dish. Place the pastry on top of the dish, crimp the edges with a fork and trim off any excess pastry. (Use the excess pastry to cut out fish shapes or letters.) Brush the tpastry with beaten egg. Stick the fish shapes and letters onto the pie with a little more beaten egg.   Cut a steam hole in the top of the pie and cook for 10 minutes. Reduce the oven to 170C\/325F\/Gas 3 and bake for a further 20 minutes, or until the pastry is risen and golden-brown and the pie filling is bubbling. ","ingredients":" 300g\/10½oz cod loin, skin removed, cut into chunks,  200g\/7oz salmon steak, preferably organic, cut into chunks,  200g\/7oz raw king prawns, heads and shell removed,  1 lemon, juice, zest of ½ lemon ,  salt and freshly ground black pepper,  3 tbsp chopped fresh chives,  50g\/2oz butter,  1 onion, chopped,  ½ lemon, zest only,  3 tbsp plain flour,  175ml\/6fl oz  milk,  125ml\/4fl oz double cream,  175ml\/6fl oz dry white wine,  2 tbsp crème fraîche,  12 boiled quails’ eggs, peeled, halved,  100g\/3½oz asparagus spears, woody ends trimmed, cut into 5cm\/2in lengths,  75g\/3oz podded fresh peas,  500g\/1lb 1oz ready-made puff pastry,  1 egg, beaten","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/summery_fish_pie_19121"}