{"recipe_name":"Sun-dried tomato, emmental cheese and pesto puff pastry tarts","author":"James Martin","programme":"Saturday Kitchen","prep_time":"1-2 hours","cooking_time":"10 to 30 mins","serves":"Serves 4","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the rough puff pastry, place the flour in a mound on a clean work surface and make a deep well in the centre using your fingers. Place the butter cubes and salt into the well and, using the fingertips of one hand, work the ingredients together, gradually drawing more flour into the well with the other hand. Work in the flour until the mixture is loosely but well combined and still with lumps of butter visible. Gradually add the iced water and mix until you have a rough dough. (You may not need all of the water. Take care not to overwork the mixture.) Roll the dough into a ball, wrap in cling film and chill for 20 minutes in the fridge. When the dough has chilled, roll it out on a lightly-floured work surface into a 40x20cm\/16x8in rectangle. Fold the rectangle into three and give it a quarter turn. Repeat the process, giving the folded pastry another quarter turn. Wrap the pastry in cling film and chill for a further 30 minutes. Once chilled, repeat the process of rolling, folding and turning two more times, making a total of four turns. Wrap the pastry in cling film and place in the fridge for at least 30 minutes. For the pesto, place the basil, pine nuts, Parmesan and garlic in a pestle and mortar and grind, while gradually adding the extra virgin olive oil until a paste is formed.  For the tarts, preheat the oven to 200C\/180C Fan\/Gas 6.  Roll the pastry out on a lightly-floured surface to a 2mm\/1\/8in thickness. Cut out six discs using a 12cm\/5in pastry cutter. Score around the edge of the circle about 2cm from the edge. Line a baking tray with baking parchment and brush with a little cold water. Transfer each of the pastry discs onto the tray using a palette knife. Brush the inside ring of the tarts with the mustard, sprinkle over the cheese and top with the two types of tomatoes. Drizzle with olive oil and brush the pastry with egg yolk around the edges. Bake in the oven for 12-15 minutes, or until the pastry is golden-brown.  To serve, garnish the tarts with the pesto and some fresh rocket. ","ingredients":" 250g\/9oz plain flour, plus extra for dusting,  250g\/9oz very cold butter, cut into small cubes,  ½ tsp salt,  125ml\/4fl oz ice cold water,  60g\/2¼oz fresh basil leaves,  50g\/2oz pine nuts, toasted,  50g\/2oz Parmesan, grated,  2 cloves garlic, peeled,  125-175ml\/4-6fl oz extra virgin olive oil,  275g\/10oz puff pastry (from above),  2 tbsp wholegrain mustard,  200g\/7oz emmental cheese, grated,  100g\/4oz fresh tomatoes, sliced,  75g\/2¾oz sun-dried tomatoes, diced,  2 tbsp olive oil,  1 egg yolk, beaten,  handful rocket leaves, to serve","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sun-dried_tomato_04502"}