{"recipe_name":"Sun-dried tomato cheese biscuit box with Parmesan ‘sandwich’ biscuits","author":"Sandy Docherty","programme":"The Great British Bake Off","prep_time":"1-2 hours","cooking_time":"30 mins to 1 hour","serves":"Makes 1 biscuit box, filled with 36 mini biscuits","pic_url":"http:\/\/www.ballesteros.me\/amd\/unknown.png","method":"For the biscuit box, put the flour, salt and pepper in a food processor and blend until ‘rubbed’ in. In a bowl, beat the eggs with the tomato purée and oregano. Turn the processor onto a slow speed and pour in the egg mixture until combined to a dough. Turn the mixture out and knead to bring together. Wrap in cling film and place in the fridge to chill for 20 minutes. For the Parmesan crisp ‘sandwiches’, blend the flour, butter and cheese together in a food processor until it forms a soft ball. Wrap in cling film and leave to chill in the fridge for 20 minutes. Preheat the oven to 200C\/180C Fan\/Gas 6.  Roll out the Parmesan mixture to 3mm thick and cut out 72 discs using a 4cm\/1½in cutter.  Line enough trays to fit all the biscuits with baking parchment. Place the discs on the lined trays, brush 36 of the discs with paprika and bake for 8 minutes, or until just turning light golden-brown. Remove from the oven. Leave for a few minutes and then transfer to a wire rack to cool. Leave the oven at the same temperature. For the filling, beat the cream cheese with the pepper and chives in a bowl. Put the filling into a piping bag fitted with a rosette nozzle. Pipe the cream cheese onto the biscuits not dusted with paprika and top with a paprika-dusted biscuit. To construct the biscuit box, using the template, cut out four sides and two 20cm\/8in squares (for the base and lid). Place on a lined baking tray. Gently crimp all the edges of the shapes and brush with beaten egg. On the lid of the box, cut a small circle in the centre before baking (about 4cm\/1½in wide). Bake all the box pieces for 20-30 minutes, or until golden-brown and shiny. If the biscuit shapes start to puff up, put on a sheet of parchment paper in top, followed by another baking tray to weigh down the biscuits. Remove the biscuits and cool slightly before putting on a wire rack to cool completely. Trim the slots using a sharp knife while the biscuits are still warm. Fit the box parts together using the edible glue and stand the box on a base or serving plate. Fill the box with the cheese sandwich biscuits - there should be 4 rows of 9 biscuits. Place the lid on the top and put a bunch of parsley and chives in the hole on the lid. ","ingredients":" 750g\/1lb 10oz plain flour, plus extra for rolling out,  3 tsp flaked sea salt ,  3 tsp ground black pepper,  4 large free-range eggs ,  2 x 80g\/3oz tube sun-dried tomato purée ,  2 tsp dried oregano,  1 medium free-range egg, beaten (for egg wash),  300g\/10½oz self-raising flour,  240g\/9oz soft slightly salted butter,  220g\/8oz Parmesan cheese, grated ,  2 tsp ground paprika ,  300g\/10½oz full-fat cream cheese ,  freshly ground black pepper ,  bunch fresh chives, mostly snipped, reserving a few for the box lid ,  bunch fresh parsley,  1 bottle edible glue ","vegetarian":false,"calories":null,"protein":null,"carbs":null,"sugars":null,"total_fat":null,"saturated_fat":null,"fiber":null,"salt":null,"link":"http:\/\/www.bbc.co.uk\/food\/recipes\/sun-dried_tomato_cheese_45263"}